{"basic_instinct":"Theatrical release poster","country":"United States|France|","distributed_by":"TriStar Pictures","Plot":"A retired rock star, Johnny Boz, is stabbed to death with an ice pick during sex by a mysterious blonde woman at his apartment. Homicide detective Nick Curran investigates, and the only suspect is Catherine Tramell, Boz's bisexual girlfriend and a crime novelist who has written a novel that mirrors the crime. It is concluded that either Catherine herself did it or someone trying to frame her out of spite. Tramell is uncooperative and taunting in the investigation, smoking in the interrogation room and exposing her bare genitalia in front of the officers. She presents alibis and passes a lie detector test. Nick discovers that Catherine has a habit of befriending murderers, including her girlfriend Roxy, who is later shown to have murdered several young boys on impulse, and Hazel Dobkins, who murdered her family.Nick, who accidentally shot two tourists while high on cocaine, attends counseling sessions with police psychologist Dr. Beth Garner, with whom he has had an affair. Nick discovers that Catherine plans on using him as a fictional detective in her latest book, wherein his character is murdered after falling for the wrong woman. Catherine becomes aware of Nick's past after paying Lt. Nielsen to look into Nick's psychiatric file; Beth gives it to him after Nielsen recommends Nick's termination. Nick publicly assaults Nielsen in his office and later becomes a prime suspect after Nielsen is killed. Nick suspects Catherine, and when he joins in her behavior in front of his co-workers, he is put on leave.A torrid affair between Nick and Catherine begins with the air of a cat-and-mouse game. Nick shows up at a club and witness her sniffing coke in a bathroom stall along with Roxy and another man. Nick and Catherine begins to dance and make out at a club. Later observed by Roxy, had sex in a bed. Roxy, jealous of Nick, attempts to run him over with Catherine's car but dies in a crash when the car went off the edge of the road. Catherine is saddened by Roxy's death and reveals to Nick that a previous lesbian encounter at college went awry when the girl, Lisa Hoberman, became obsessed with her, causing him to believe that she may not have killed Boz. Nick identifies the girl as Beth Garner, who acknowledges the encounter but claims Catherine became obsessed.Nick discovers the final pages of Catherine's new book in which the fictional detective finds his partner lying dead with his legs protruding between the doors of an elevator. Catherine breaks off their affair; Nick becomes upset and suspicious. Nick later meets his partner Gus, who has arranged to meet with Catherine's college roommate at an office building to find out what really went on between Catherine and Beth. As Nick waits in the car, Gus is then stabbed to death with an ice pick. Nick runs into the building but is too late; he finds Gus' legs protruding from the doors of the elevator. Beth, standing in the hallway, explains she received a message to meet Gus. Nick suspects she murdered Gus and when he believes she is reaching for a gun, he shoots her only to find that Beth was only fingering an ornament on her key chain.A search of the scene and Beth's apartment turns up the evidence needed to identify her as the killer. Despite knowing Catherine's foreknowledge of Gus' death, that she must actually have been the killer, and that she must have set Beth up but Nick tells no one. He returns to his apartment where Catherine meets him. She explains her reluctance to commit to him and the two had sex. As they discuss their future, an ice pick is revealed to be under the bed.","language":"English","Reception":"Basic Instinct opened in theaters in the United States and was one of the highest grossing films of 1992, after its March 29 release. In its opening weekend, the film grossed $15 million. It was the fourth highest-grossing film of 1992, grossing $352,927,224 worldwide.[22]The film's critical reaction was mixed. On Rotten Tomatoes, the film holds a score of 54% based on 59 reviews with the consensus: \"Unevenly echoing the work of Alfred Hitchcock, Basic Instinct contains a star-making performance from Sharon Stone, but is ultimately undone by its problematic, overly lurid plot.\"[23] On Metacritic the film holds a score of 41 based on 28 critics, indicating \"mixed or average\" reviews.[24]Janet Maslin of The New York Times praised the film, saying \"Basic Instinct transfers Mr. Verhoeven's flair for action-oriented material to the realm of Hitchcockian intrigue, and the results are viscerally effective even when they don't make sense.\"[25] Peter Travers of Rolling Stone also praised the film, saying it was a guilty pleasure film; he also expressed admiration for Verhoeven's direction, saying \"[his] cinematic wet dream delivers the goods, especially when Sharon Stone struts on with enough come-on carnality to singe the screen,\" and praised Stone's performance: \"Stone, a former model, is a knockout; she even got a rise out of Ah-nold in Verhoeven's Total Recall. But being the bright spot in too many dull movies (He Said, She Said; Irreconcilable Differences) stalled her career. Though Basic Instinct establishes Stone as a bombshell for the Nineties, it also shows she can nail a laugh or shade an emotion with equal aplomb.\"[26]The international critical reception was favorable, with Australian critic Shannon J. Harvey of the Sunday Times calling it one of the \"1990s['] finest productions, doing more for female empowerment than any feminist rally. Stone – in her star-making performance – is as hot and sexy as she is ice-pick cold.\"[27]The film was not without its detractors.[28] Roger Ebert of the Chicago Sun-Times dismissed the film, giving it two out of four stars, stating that the film is well crafted, yet dies down in the last half hour: \"The film is like a crossword puzzle. It keeps your interest until you solve it. Then it's just a worthless scrap with the spaces filled in.\"[29] Dave Kehr of the Chicago Tribune also gave a negative review, calling it psychologically empty: \"Verhoeven does not explore the dark side, but merely exploits it, and that makes all the difference in the world.\" [30]The film was nominated for two Academy Awards and two Golden Globes. Jerry Goldsmith, the composer, was nominated for both awards for his original score. It was also nominated for an Edgar Award.[28] Frank Urioste was nominated for an Academy Award for film editing and Sharon Stone was nominated for a Golden Globe as Best Actress for her performance as Tramell. It was also nominated for three Razzie Awards including Worst Actor (Douglas), Worst Supporting Actress (Tripplehorn) and Worst New Star (Sharon Stone's \"Tribute to Theodore Cleaver\", AKA her pubic hair).[citation needed]American Film Institute recognitionThe film generated controversy due to its overt sexuality and graphic depiction of violence. During principal photography, the film was protested by gay rights activists who felt that the film followed a pattern of negative depiction of homosexuals in film.[34] Members of the lesbian and bisexual activist group LABIA protested against the film on its opening night. Others also picketed theatres to dissuade people from attending screenings, carrying signs saying \"Kiss My Ice Pick\", \"Hollywood Promotes Anti-Gay Violence\" and \"Catherine Did It!\"/\"Save Your Money—The Bisexual Did It\".[35] Verhoeven himself defended the groups' right to protest, however he criticized the disruptions they caused, saying \"Fascism is not in raising your voice; the fascism is in not accepting the no.\"[36]Film critic Roger Ebert mentioned the controversy in his review, saying \"As for the allegedly offensive homosexual characters: The movie's protesters might take note of the fact that this film's heterosexuals, starting with Douglas, are equally offensive. Still, there is a point to be made about Hollywood's unremitting insistence on typecasting homosexuals—particularly lesbians—as twisted and evil.\"[37] Camille Paglia denounced gay activist and feminist protests against Basic Instinct, and called Sharon Stone's performance \"one of the great performances by a woman in screen history\".[38]The film was also widely criticized for glamorizing cigarette smoking. Screenwriter Joe Eszterhas was later diagnosed with throat cancer and publicly apologized for glamorizing smoking in his films.[39]","box_office":"$352.9 million[2]","cinematography":"Jan de Bont","production_company":"Carolco Pictures StudioCanal","directed_by":"Paul Verhoeven","Soundtrack":"The film score to Basic Instinct was composed by Jerry Goldsmith. The score to Basic Instinct garnered Goldsmith nominations for an Academy Award and a Golden Globe Award.[19] Goldsmith described it as one of his most challenging efforts, later stating, \"Basic Instinct was probably the most difficult I've ever done. It's a very convoluted story with very unorthodox characters. It's a murder mystery, but it isn't really a murder mystery. The director, Paul Verhoeven, had a very clear idea of how the woman should be, and I had a hard time getting it. Because of Paul pushing me, I think it's one of the best scores I've ever written. It was a true collaboration.\"[20]Apart from the score, professionally released music did not play a major part in the film. The scene in which source music plays a prominent role occurs during the club scene; Curran, Tramell, and Roxy are seen at in Downtown San Francisco. It features \"Blue\" by Chicago singer LaTour and \"Rave the Rhythm\" by the group Channel X. It also features \"Movin' on Up\" by Jeff Barry and Janet DuBois.The soundtrack was released on March 17, 1992. A considerably expanded release of Jerry Goldsmith's score, featuring previously omitted sections and alternative compositions of certain elements, was issued by Prometheus Records in 2004.Original Motion Picture SoundtrackThe Complete Original Motion Picture Soundtrack","release_dates":"March 20, 1992 (1992-03-20) (US)|May 8, 1992 (1992-05-08) (UK)||||","Production":"The screenplay, written in the 1980s, was popular enough to prompt a bidding war; it was eventually purchased by Carolco Pictures, for a reported US$3 million.[10][11] Eszterhas, who wrote the film in 13 days,[12] and who had been the creative source for several other blockbusters, including Flashdance (1983) and Jagged Edge (1985), was replaced by Gary Goldman as the writer.[citation needed] Adjusted for inflation, the budget of the film was an estimated US$49,000,000.[citation needed]Al Pacino, Harrison Ford, Wesley Snipes, Robert De Niro, Mel Gibson, Bruce Willis, Sylvester Stallone, Christopher Lloyd, Jack Nicholson, Charlie Sheen, Richard Gere, John Travolta, Nicolas Cage, Denzel Washington, and Kevin Costner were considered for the role of Nick Curran.[citation needed] In preparation for the car chase scene, Douglas reportedly drove up the steps on Kearny Street in San Francisco for four nights by himself. Douglas recommended Kim Basinger for the role of Catherine Tramell, but Basinger declined.[13] He had also proposed Julia Roberts.[14] Greta Scacchi[15] and Meg Ryan,[16] but they also turned down the role, as did Michelle Pfeiffer, Geena Davis, Kathleen Turner, Ellen Barkin, and Mariel Hemingway.[10] Verhoeven considered Demi Moore.[17] Stone, who was eventually selected for the role, was a relative unknown until the success of this movie; she was paid a minimal amount of $500,000, considering the film's extensive production budget.[citation needed]Filming in San Francisco was attended by gay and lesbian rights activists and demonstrators,[18] and San Francisco Police Department riot police were present at every location daily to deal with the crowds.The scene where Douglas has sex with Tripplehorn was filmed unbeknownst to the actors, who were simply rehearsing the scene[citation needed]. Things heated up quickly, as evidenced by the footage in the final film, and Verhoeven liked the performances so much that he included it in the final film[citation needed]. Verhoeven initially fought during the production for a lesbian love scene to be added to the script over the objection of Eszterhas, who thought such a scene would be gratuitous. Verhoeven eventually agreed with Eszterhas and apologized to him for forcing the issue[citation needed]. Following the success of Basic Instinct, Eszterhas and Verhoeven went on to collaborate on Showgirls.In a 2006 interview, Stone alleged that the infamous leg-crossing scene in which her vulva was exposed was filmed without her knowledge; Stone had been wearing thin underwear for the scene which Verhoeven said reflected light on the camera lens; and it was not until Stone saw the film in a screening room with a test audience that she became aware of it, leading her to slap Verhoeven in the face and leave the screening.[5]","Distribution":"The film was entered into the 1992 Cannes Film Festival.[21]Basic Instinct is rated R for \"strong violence and sensuality, and for drug use and language\". It was initially given an NC-17 rating by the MPAA, but under pressure from TriStar, Verhoeven cut 35–40 seconds to gain an R rating.[10] Verhoeven described the changes in a March 1992 article in The New York Times:Actually, I didn't have to cut many things, but I replaced things from different angles, made it a little more elliptical, a bit less direct.[10]The film was subsequently re-released in its uncut format on video and later on DVD.Following the theatrical version, the film was first released in its uncut format in an unrated version onto video in 1992, running at 129 minutes. This was followed by a DVD release in 1997, in a \"barebones\" format that contained the R-rated version. A Collector's Edition was released on DVD in 2001, containing the uncut version of the film with a commentary by Camille Paglia and an ice-pick pen (the villain's weapon of choice). This version of the film, running 127 minutes, was re-released twice: in 2003 and 2006.[verification needed]In March 2006, the unrated version (also known as the Director's Cut) was re-released on DVD and labeled as the Ultimate Edition. In 2007, the film was released on Blu-ray with the Director's Cut label.The film was cut by 35–40 seconds to avoid an NC-17 rating on its theatrical release in 1992,[10] with some violence and sexuality explicit content removed. The missing or censored material (later released on video and DVD unrated as the director's cut) included:","produced_by":"Alan Marshall","starring":"Michael Douglas|Sharon Stone|George Dzundza|Jeanne Tripplehorn|","running_time":"128 minutes[1]","music_by":"Jerry Goldsmith","edited_by":"Frank J. Urioste","written_by":"Joe Eszterhas","budget":"$49 million"}