{"country":"United States","distributed_by":"Red Flag Releasing Wolfe Video (DVD)","language":"English","Reception":"Based on 34 reviews collected by the film review aggregator Rotten Tomatoes, 65% of critics gave 8: The Mormon Proposition a positive review, with an average rating of 6.2/10.[5]The Los Angeles Times says the film is \"An outstanding and urgent example of the investigative documentary\" that \"is all the scarier for its straightforward presentation of how the LDS Church succeeded in getting California's Proposition 8 on the ballot in 2008 and then getting it passed. As an exposé, there could hardly be a stronger case for ensuring and strengthening the separation of church and state\".[6]Variety says \"\"8\" seems determined to reach the next generation of confused Mormon teens, touching on everything from sexual identity-related suicides and homelessness to punishing attempts at curing homosexual urges. Instead of stooping to the level of Focus on the Family's misleading Prop. 8 ads, the pic damns the LDS Church not with lies, but with their own words.\"[7]The New York Times calls the film \"highly emotional\" it also states \"The documentary is really two films roughly stitched together. The first two-thirds tells the history of Proposition 8; the final third is a wrenching exploration of the effects on gay Mormons of the church’s strict taboo on homosexuality.\" it concludes \"The movie shows the depth of religion-based loathing of homosexuality, like that of abortion, to be primal.\"[8]The Village Voice noted \"Diving into the grim irony of one group of Americans denying another group its rights under the guise of upholding American freedoms and ideals, director Reed Cowan locks on his goals of illustrating how the Mormon church played California politics like a fiddle, and how the church's homophobia has ruined the lives of its queer faithful. Cowan strikes a potent balance between heart and head, juxtaposing emotionally wrenching moments (a segment in which queer Mormons delineate past suicide attempts is especially painful) with self-damning portraits of Mormon politicians and church officials, and hard-nosed journalism from reporter Fred Karger, who exhaustively outlines the church's role in conceiving and bankrolling Prop. 8. The film, whose low budget is underscored in cheesy dramatic re-enactments, might have been strengthened had Cowan connected dots between the fact that at the same time that California passed Prop. 8, Arizona and Florida also passed initiatives banning gay marriage...\" but then went on to say that \"the flaws pale against what's illustrated, which is not just how Prop. 8 passed, but the sordid, cynical workings of our political machine.\"[9]Michelle Orange of Movieline said \"Scheduled to be released on the second anniversary of California's legislation of gay marriage, 8: The Mormon Proposition marks the occasion with a furious requiem. Mournful and righteous in its retracing of the months between the bill's passage and election night in November 2008, the film assembles a damning case against the Church of Jesus Christ of Latter Day Saints (LDS), which spearheaded a massive campaign to revoke gay marriage rights.\" she concluded \"But it was the Californians -- not the Mormons or their Utah constituents -- who voted in Prop 8, notably 70 percent of the state's black voters; what were they thinking? Although there is plenty of illuminating and indicting information about the run-up to the vote, you won't find the answer to that question here.\"[10]Newsweek called the film \"a messy and sometimes downright cheesy look at how the Mormon Church influenced the 2008 California ballot initiative outlawing gay marriage.\", it goes on to say \"The funny thing is that in its last 20 minutes The Mormon Proposition turns into a lacerating, shocking, and sadly overpowering film—the kind of film that might make even fundamentalists reconsider gay rights. This is the section where the movie essentially stops talking about Prop 8 and starts talking about how the Mormon church's attitude toward homosexuality in general.\" it concludes \"at its best, which is only at the end, The Mormon Proposition reminds us—no, insists that we remember—that demonizing a group doesn’t make the world a better place.\"[11]The Wall Street Journal noted that \"as a spotlight on the suffering of same-sex couples and individuals who are rejected by family and church leaders, the film succeeds. Its critique of the church's recent political activism, however, is as ham-fisted as many of the mid-19th century allegations against the church.\" it goes on to say \"The film's basic narrative also is compelling. It describes how, with Proposition 8 lagging in the polls, the church's hierarchy in Utah determined that other religious conservatives were not pulling their weight. Thus, the church ordered its members to become a \"mighty army,\" as one top leader put it in a video broadcast obtained by the filmmakers.\" and \"A church infamous for its defense of polygamy in the late 19th century had become the backbone of the 21st century campaign against gay marriage.\" The reviewer also states that, \"The specter of Mormon money raised in the film seems like a latter-day version of older fears about Jewish financiers controlling the American economy and government. The Mormon effort made a difference only because Californians are roughly evenly divided on the issue of same-sex marriage.\"[12]Sean Gandert of Paste Magazine says \"The documentary attempts to show how the church quietly rallied its members around this cause for what was initially an unpopular provision, and boasts an impressive level of research and relatively slick approach.\" He also notes that 8 \"spends more time than it should on the faith’s general treatment of homosexuality, eventually drifting into an unpleasant streak of overt Mormon-bashing. The film also fails to take into account the many other factors in play during the 2008 election, narrowing events down to one all-encompassing Mormon-based explanation. 8 means well, but is too blinded by its own biases to do its cause justice.\"[13]The San Francisco Chronicle notes that the film is \"marred by loaded language and a propagandistic tone that undercuts rather than promotes its purposes.\" It concludes that \"The movie almost sinks its teeth into one interesting argument: Because of the Mormon church's vigorous involvement in politics, shouldn't its tax-exempt status be revoked? But the movie drops that discussion almost as soon as it introduces it, in favor of talking about the distress of gay Mormon youths.\"[14]The Deseret News, owned by the LDS Church, called the film a \"heavy-handed, supposed nonfiction feature\" that is one-sided, inept, and ineffective from a storytelling standpoint. The review also stated that the filmmakers did not show opinions from any of the over 7 million people that voted for the measure nor did the film indicate if any input from LDS Church leadership was sought.[15]","box_office":"$100,280","Synopsis":"Director Reed Cowan, who is a former Mormon missionary, \"planned on making a film about gay teen homelessness and suicide in Utah, but switched his focus to Mormon ideology because of how it contributes to the homophobia that causes these problems\".[1] The film focuses on the wealth and power of the The Church of Jesus Christ of Latter-day Saints, and how the Church uses the National Organization for Marriage to advocate for denial of rights to lesbian, gay, bisexual, and transgender (LGBT) Americans. It states that LDS Church leader Thomas S. Monson asked to ensure the passage of the controversial California Proposition 8. It also states that many homeless people in Utah are LGBT teens who were abandoned by their Mormon parents.According to the New York Times, the film \"uncovers the classified church documents and the largely concealed money trail of Mormon contributions that paid for a high-powered campaign to pass Proposition 8\", noting that \"Mormons raised an estimated $22 million for the cause.\"[2]When The Washington Post requested comment, the LDS Church forwarded its official statement that said in part, \"We have not seen '8: The Mormon Proposition.' However, judging from the trailer and background material online, it appears that accuracy and truth are rare commodities in this film. Although we have given many interviews on this topic, we had no desire to participate in something so obviously biased.\"[3] \"Clearly, anyone looking for balance and thoughtful discussion of a serious topic will need to look elsewhere,\" said Michael Purdy, a spokesman for the LDS Church, in a statement quoted by the Los Angeles Times.[4]","cinematography":"Reed Cowan Steven Greenstreet Mark Barr Marian Eckley Todd Petersen Toby Quaranta Christopher Reece-Volz Richard Samuels Derrick Shore","production_company":"David v. Goliath Films","directed_by":"Reed Cowan Steven Greenstreet","Box office performance":"In its opening weekend, the film grossed $42,566 in 16 theaters in the United States, averaging about $2,660 per venue, and ranking #48 at the box office.[18] The total gross of the film is $100,280.[19]","8:_the_mormon_proposition":"Official logo","narrated_by":"Dustin Lance Black","release_dates":"January 18, 2010 (2010-01-18) (Sundance)|June 18, 2010 (2010-06-18) (US)||||","produced_by":"Reed Cowan Steven Greenstreet Bruce Bastian Christopher Reece-Volz Emily Pearson","running_time":"80 minutes","music_by":"Thomas Chase Nicholas Greer","edited_by":"Steven Greenstreet Brian Bayerl John Paul Kinhart","written_by":"Reed Cowan","budget":"$2.5 million"}