{"country":"United States","distributed_by":"20th Century Fox","Plot":"Michael Caine is Matthew Hollis, married to Karen (Valerie Harper), and father to teenage daughter, Nikki (Demi Moore). Victor (Joseph Bologna), Matthew's colleague and best friend, who is going through a divorce, is father to 17-year-old Jennifer (Michelle Johnson).Matthew's marriage is not going well for reasons not explained. Just before they are to leave for a trip to Rio de Janeiro, Brazil, Karen says she is going on vacation by herself to \"think about everything.\" Matthew and Victor decide to go to Rio with their daughters.Jennifer and Nikki share a room, where she says to Nikki, \"Your father is so sweet... I used to have a crush on him,\" to which Nikki replies, \"Me, too.\" At the beach, Victor and Matthew pass numerous women walking around topless. The fathers spot their daughters in the distance, and the girls turn around to reveal that they are topless, also.After dropping the girls off at a wedding, the men visit a pub. After Victor pairs off with a local divorcée, Matthew winds up at the wedding, where he runs into Jennifer. They eventually share a passionate kiss, which Nikki witnesses. Matthew and Jennifer have sex on the beach. Matthew stresses it can never happen again. However, Jennifer begins coming onto Matthew in various, inappropriate situations. At one point she takes a naked Polaroid of herself and gives it to Matthew in public.Jennifer tearfully confesses to her dad that she had an affair with an \"older man.\" Victor becomes furious and sets out to hunt down the mystery man, expecting Matthew to help. Matthew tries to talk Jennifer into ending their relationship, but she is determined to never give him up.Matthew ultimately discloses to his friend that it was he with whom Jennifer had the affair. Victor is not as angry as Matthew expects, because it is revealed that Victor had been having an affair with Karen.Jennifer tries to commit suicide with an overdose of birth control pills. She survives and the incident brings all closer together, although the men constantly bicker about each other's sexual misconduct. Karen and Matthew decide to work on their marital problems, Jennifer begins dating a young male nurse she met while recuperating in the hospital, and Matthew thanks daughter Nikki for being the only one who hasn't misbehaved.As closing credits roll, Matthew, in voice-over narration, says, \"You only live once, but it does help if you get to be young twice.\"","language":"English","Reception":"Vincent Canby, reviewing Blame It on Rio, stated \"...there's not a single funny or surprising moment in the movie. However, Blame It on Rio is not simply humorless. It also spreads gloom. It's one of those unfortunate projects that somehow suggests that everyone connected with the movie hated it and all of the other people involved.\" [7] The Australian newspaper The Canberra Times described Blame It on Rio as \"one of the worst movies ever made and definitely the most banal piece of rubbish to have Michael Caine's name on the credits - and he has quite a few bombs to his credit.\" [8]Blame It on Rio currently has a rating of 9% on Rotten Tomatoes out of 22 reviews. [9]","box_office":"$18,561,998 (USA)","cinematography":"Reynaldo Villalobos","production_company":"Sherwood Productions","directed_by":"Stanley Donen","release_dates":"February 17, 1984 (1984-02-17)|||||","Production":"The film was shot on location in Rio de Janeiro.[5][6] Johnson, who was 17 at the time of filming, received permission from a judge to film her nude scenes.","produced_by":"Stanley Donen Larry Gelbart Robert E. Relyea","starring":"Michael Caine|Joseph Bologna|Valerie Harper|Michelle Johnson|Demi Moore|","running_time":"100 minutes","music_by":"Kenneth Wannberg","blame_it_on_rio":"Theatrical release poster","edited_by":"George Hively Richard Marden","written_by":"Charlie Peters Larry Gelbart"}