{"country":"France West Germany","distributed_by":"SELTA Films Little Bear Sara Films Gaumont Antenne 2 TV 13 Munich","Plot":"The film is set in a future where death from illness has become extremely unusual. When Katherine Mortenhoe (Romy Schneider) is diagnosed as having an incurable disease, she becomes a celebrity and is besieged by journalists. The television company NTV (headed by Vincent Ferriman) offers her a large sum of money if she will allow her last days to be filmed and made into a reality television show – they have already spied on her as she is told of her diagnosis (her doctor is colluding with them) and prepared posters for the show which show her face (to her annoyance when she sees the posters on display before they have contacted her).Katherine pretends to agree but evades NTV's employees and goes on the run with the assistance of a casual acquaintance called Roddy (Harvey Keitel). The audience knows – but she does not – that Roddy is, in fact, a senior NTV cameraman who has undergone an experimental surgical procedure which implants cameras and transmitters behind his eyes, so that everything he sees is relayed back to NTV, who use it as the basis for their reality show. A side-effect of the procedure is that he will go blind if he experiences more than a short period of darkness; he uses drugs to keep awake, has learned to sleep for brief periods with his eyes open, and carries a flashlight which he shines on his eyes at night.Much of the filming took place in and around Glasgow, including: Glasgow Necropolis, Glasgow Cathedral, the former Queen's Dock on the River Clyde and the Glasgow City Chambers. In 2012 Shout! Factory released the film on Blu-ray in Region 1, whilst Park Circus handled the Region 2 release.","language":"English French","cinematography":"Pierre-Wiliam Glenn","directed_by":"Bertrand Tavernier","release_dates":"1980 (1980)|||||","produced_by":"Gabriel Boustiani Janine Rubeiz","starring":"Romy Schneider Harvey Keitel Harry Dean Stanton Therese Liotard Caroline Langrishe William Russell Vadim Glowna Eva Maria Meineke Bernhard Wicki Max von Sydow","running_time":"128 minutes","music_by":"Antoine Duhamel","External links":"","edited_by":"Michael Ellis Armand Psenny","written_by":"David Rayfiel"}