{"based_on":"Dreamgirls  by Henry Krieger Tom Eyen","country":"United States","distributed_by":"United States:|DreamWorks Pictures|International:|Paramount Pictures|","Plot":"Backstage at an R&B amateur talent show at the Detroit Theatre in 1962, young car salesman Curtis Taylor Jr. meets a black girl group known as \"The Dreamettes\": lead singer Effie White and back-up singers Deena Jones and Lorrell Robinson. Curtis presents himself as The Dreamettes' new manager and arranges for the girls to become backup singers for popular R&B singer Jimmy 'Thunder' Early.Curtis soon starts his own record label, Rainbow Records, out of his Detroit car dealership, and appoints Effie's brother C.C as his head songwriter. When their first single fails after another pop group releases a cover version, Curtis, C.C, and their producer Wayne turn to payola to make Jimmy and The Dreamettes mainstream pop stars. Offstage, Effie becomes infatuated with Curtis, while the married Jimmy begins an affair with Lorrell.Jimmy's manager Marty grows weary of Curtis' plans to make his client more pop-friendly and walks out. When Jimmy bombs in front of a white Miami Beach audience, Curtis sends Jimmy out on the road alone, keeping The Dreamettes behind to headline in his place. Feeling that Effie's curvy figure and distinctive voice will not attract white audiences, Curtis appoints the slimmer and higher-voiced Deena lead singer and renames the group “The Dreams\".With the aid of new songs and a new more glamorous image, Curtis and C.C. transform The Dreams into a top selling mainstream pop group by 1965. However, Effie begins acting out, particularly when Curtis' affections also turn towards Deena. Curtis eventually drops Effie (who has just learned she is pregnant with Curtis' child) from the group, hiring Michelle Morris, his secretary, to take her place beginning with their New Year's Eve debut in Las Vegas as \"Deena Jones & the Dreams\". Despite Effie's defiance and desperate appeal to Curtis, he, C.C., and The Dreams leave her behind and forge ahead to stardom.Seven years later, Effie has become an impoverished welfare mother, living in inner-city Detroit with her daughter, Magic. Struggling to restart her career in music, Effie goes to Marty for management; Deena Jones & the Dreams have become superstars. With Rainbow the biggest pop business in the country, Curtis is now attempting to produce a film about Cleopatra starring an unwilling Deena, who is now his wife. Meanwhile, Jimmy Early has descended into drug addiction, his career neglected due to Curtis' preoccupation with Deena. When Jimmy has a breakdown onstage at Rainbow's tenth anniversary TV special the following year, Curtis drops him from the label, and Lorrell ends their long affair. A short time later, C.C. quits after a fight with Curtis, whom C.C. feels is undermining the artistic merit of his songs by making them into funk music for the sake of making a profit; their fight is interrupted by the breaking news that Jimmy has been found dead in a hotel room from a heroin overdose.Disillusioned by Jimmy's death and Curtis' cold reaction to the news, C.C returns to Detroit to find Effie. The two siblings reconcile and C.C. writes and produces Effie's comeback single, \"One Night Only\". Just as the record begins gaining local radio play, Curtis uses payola to force radio stations to play a disco cover of \"One Night Only\" by The Dreams instead. His plan falls apart when Deena, angry over Curtis' control of her career, finds evidence of his payola schemes and contacts Effie and C.C, who arrive in Los Angeles with Marty and a lawyer.Deena and Effie reconcile, with Effie revealing to Deena that Curtis is the father of Magic while Curtis, wanting to avoid being reported to the FBI for payola, agrees to give Effie's record national distribution. Inspired by Effie's victory and realizing Curtis' true character, Deena leaves him to make it on her own.Some time later, The Dreams give a farewell performance at the Detroit Theater and Effie is invited onstage for the final song. As the concert ends, Curtis notices Magic in the front row and realizes that he is her father.","language":"English","Reception":"Dreamgirls premiered on December 4, 2006 at the Ziegfeld Theatre in New York City, where it received a standing ovation.[44] The film's Los Angeles premiere was held on December 11 at the Wilshire Theater in Beverly Hills.[45]Similar to the releases of older Hollywood musicals such as The Sound of Music, My Fair Lady, and West Side Story, Dreamgirls debuted with three special ten-day roadshow engagements beginning on December 15, 2006 at the Ziegfeld Theatre in New York City, the Cinerama Dome in Los Angeles, and the AMC Metreon 15 in San Francisco.[4] Tickets for the reserved seats were $25 each; the premium price included a forty-eight page full-color program and a limited-print lithograph.[4] This release made Dreamgirls the first American feature film to have a roadshow release since Man of La Mancha in 1972.[4] Dreamgirls earned a total of $851,664 from the roadshow engagements, playing to sold-out houses on the weekends.[3][46][47] The film's national release, at regular prices, began on December 25. Outside of the U.S., Dreamgirls opened in Australia on January 18, and in the United Kingdom on February 2. Releases in other countries began on various dates between January and early March. Dreamgirls eventually grossed $103 million in the United States, and almost $155 million worldwide.[3]DreamWorks Home Entertainment released Dreamgirls to home video on May 1, 2007[48] in DVD, HD DVD, and Blu-ray formats. The DVD version was issued in two editions: a one-disc standard version and a two-disc \"Showstopper Edition\". The two-disc version also included a feature-length production documentary, production featurettes, screen tests, animatics, and other previsualization materials and artwork.[48] Both DVD versions featured alternate and extended versions of the musical numbers from the film as extras, including the \"Effie, Sing My Song\" scene deleted during previews. An extended \"director's cut\" is currently planned for release in the future.[41]Both the Blu-ray and HD DVD versions were issued in two-disc formats. Dreamgirls was the first DreamWorks film to be issued in a high definition home entertainment format.[49] Total Domestic Video Sales to date are $94,989,214.Dreamgirls received positive reviews from critics. Review aggregator website Rotten Tomatoes shows a 78% rating based on 200 reviews, with an average rating of 7.2/10. The site's consensus states: \"Dreamgirls' simple characters and plot hardly detract from the movie's real feats: the electrifying performances and the dazzling musical numbers.\"[7] Metacritic reports a 76 out of 100 rating, based on 37 critics, indicating \"generally favorable reviews\".[50] Rolling Stone's Peter Travers gave the film three and a half stars (out of four) and the number-two position on his \"best of 2006\" list, stating that \"despite transitional bumps, Condon does Dreamgirls proud\".[51][52] David Rooney of Variety reported that the film featured \"tremendously exciting musical sequences\" and that \"after The Phantom of the Opera, Rent and The Producers botched the transfer from stage to screen, Dreamgirls gets it right.\"[53]On the December 10, 2006 episode of the television show Ebert & Roeper, Richard Roeper and guest critic Aisha Tyler (filling in for Roger Ebert, who was recovering from cancer-related surgery) gave the film \"two thumbs up\", with Roeper's reservations that it was \"a little short on heart and soul\" and \"deeply conventional\".[54] Roeper still enjoyed the film, noting that Jennifer Hudson's rendition of \"And I Am Telling You I'm Not Going\" as the \"show-stopping moment of any film of 2006\" and very much enjoyed Murphy's performance as well, remarking that \"people are going to love this film.\" [54] Kirk Honeycutt of The Hollywood Reporter was less enthusiastic, stating that while the film was \"a damn good commercial movie, it is not the film that will revive the musical or win over the world\".[55] Ed Gonzales of Slant magazine found the entire picture too glossy, and declared that \"the film doesn't care to articulate the emotions that haunt its characters\".[56] University of Sydney academic Timothy Laurie was critical of the film's social message, noting that \"the worthy receive just deserts by working even harder for the industries that marginalise them\".[57]Many reviews, regardless of their overall opinion of the film, cited Hudson's and Murphy's performances as standouts, with Travers proclaiming Murphy's performance of \"Jimmy's Rap\" as \"his finest screen moment.\"[51] Television host Oprah Winfrey saw the film during a November 15 press screening, and telephoned Hudson on the Oprah episode airing the next day, praising her performance as \"a religious experience\" and \"a transcendent performance\".[58] A review for The Celebrity Cafe echoes that Hudson's voice \"is like nothing we’ve heard in a long time, and her acting is a great match for that power-house sound.\"[59]Jennifer Holliday, who originated the role of Effie onstage, expressed her disappointment at not being involved in the film project in several TV, radio, and print interviews.[60] Holliday in particular objected to the fact that her 1982 recording of \"And I Am Telling You I'm Not Going\" was used in an early Dreamgirls film teaser trailer created before production began. Many of the other original Dreamgirls Broadway cast members, among them Obba Babatundé, Vondie Curtis-Hall, and Cleavant Derricks, were interviewed for a Jet magazine article in which they discussed their varying opinions of both the Dreamgirls film's script and production.[61]DreamWorks and Paramount began a significant awards campaign for Dreamgirls while the film was still in production. In February 2006, the press was invited on set to a special live event showcasing the making of the film, including a live performance of \"Steppin' to the Bad Side\" by the cast.[62] Three months later, twenty minutes of the film — specifically, the musical sequences \"Fake Your Way to the Top\", \"Family\", \"When I First Saw You\", and \"Dreamgirls\" - were screened at the 2006 Cannes Film Festival, with most of the cast and crew in attendance.[63][64] The resulting positive buzz earned Dreamgirls the status of \"front-runner\" for the 2006 Academy Award for Best Picture and several of the other Oscars as well.[65]Following the success of the Cannes screening, DreamWorks and Paramount began a widespread \"For Your Consideration\" advertisement campaign, raising several eyebrows by demoting Jennifer Hudson to consideration for Best Supporting Actress and presenting Beyoncé Knowles as the sole Best Actress candidate, as opposed to having both compete for Best Actress awards. By contrast, the actresses who originated Hudson's and Knowles' roles on Broadway, Jennifer Holliday and Sheryl Lee Ralph, respectively, were both nominated for the Tony Award for Best Leading Actress, with Holliday winning the award.[30] The presentation of Knowles over Hudson as the sole Best Actress candidate had interesting parallels with the film itself.[30]Dreamgirls received eight 2007 Academy Award nominations covering six categories, the most of any film for the year, although it was not nominated for Best Picture, Best Director, or either of the lead acting categories. The film's nominations included Best Supporting Actor (Eddie Murphy), Best Supporting Actress (Jennifer Hudson), Best Achievement in Costume Design, Best Achievement in Art Direction, Best Achievement in Sound Mixing, and three nominations for Best Song (\"Listen\", \"Love You I Do\", and \"Patience\"). Dreamgirls is the first live-action film to receive three nominations for Best Song; previously the Disney animated features Beauty and the Beast (1991) and The Lion King (1994) had each received three Academy Award nominations for Best Song; Enchanted (2007) has since repeated the feat.[66]In addition, Dreamgirls was the first film in Academy Award history to receive the highest number of nominations for the year, yet not be nominated for Best Picture.[67] The film's failure to gain a Best Picture or Best Director nod was widely viewed by the entertainment press as a \"snub\" by the Academy.[68] Some journalists registered shock,[69] others cited a \"backlash\".[70] On the other hand, director Bill Condon stated that \"I think academy members just liked the other movies better\"[71] and that he believed that \"we were never going to win even if we were nominated.\"[71] Reports emerged of significant behind-the-scenes in-fighting between the DreamWorks and Paramount camps, in particular between DreamWorks' David Geffen and Paramount CEO Brad Grey, over decision making and credit-claiming during the Dreamgirls awards campaign.[72]At the Academy Awards ceremony on February 25, 2007, Dreamgirls won Academy Award for Best Actress in a Supporting Role and Best Sound Mixing. As such, Hudson became one of the few actresses ever to win an Oscar for a film debut performance. In what was considered an upset, Murphy lost the Best Supporting Actor award to Alan Arkin for Little Miss Sunshine. Knowles, Hudson, Rose, and Robinson performed a medley of the three Dreamgirls songs nominated for Best Original Song, although all three songs lost the award to \"I Need to Wake Up\" from An Inconvenient Truth.[73]For the 2007 Golden Globe Awards, Dreamgirls was nominated in five categories: Best Picture - Comedy or Musical, Best Actress in a Comedy or Musical (Beyoncé Knowles), Best Supporting Actor (Eddie Murphy), Best Supporting Actress (Jennifer Hudson), and Best Original Song (\"Listen\"). The film won the awards for Best Picture — Comedy or Musical, Best Supporting Actor, and Best Supporting Actress.[8] Dreamgirls received eight NAACP Image Award nominations, winning for Best Supporting Actress (Jennifer Hudson) and Outstanding Album (the soundtrack LP).[74] It was also named as one of the American Film Institute's top ten films of 2006.Dreamgirls also garnered Screen Actors Guild Awards for Supporting Actress (Jennifer Hudson) and Supporting Actor (Eddie Murphy), as well as a nomination for its ensemble cast.[75] The film was also nominated by the Producers Guild of America for Best Picture and the Directors Guild of America for Bill Condon's directing. The British Academy of Film and Television Arts gave the film awards for Supporting Actress (Jennifer Hudson) and Music (Henry Krieger).Furthermore, Dreamgirls was nominated for eleven 2007 International Press Academy Satellite Awards, and won four of the awards: Best Picture — Comedy or Musical, Best Director (Bill Condon), Best Actress in a Supporting Role (Jennifer Hudson), and Best Sound (Mixing & Editing).[76] Dreamgirls also received a record eleven Black Reel Award nominations, and won six of the awards, among them Best Film.[77] At the 50th Grammy Awards ceremony, \"Love You I Do\" won the award for Best Song Written for a Motion Picture, Television or Other Visual Media.[78] The Dreamgirls soundtrack was also nominated for the Grammy for Best Compilation Soundtrack Album.[78]For the opening performance at the 2007 BET Awards on June 26 of that year, Hudson performed a duet of \"And I Am Telling You I'm Not Going\" with her predecessor, Jennifer Holliday. Later that night, Hudson won the BET Award for Best Actress.[79]To give the story more exposure for the upcoming film release, DreamWorks and the licenser of the original play, The Tams-Witmark Music Library, announced that they would pay the licensing fees for all non-professional stage performances of Dreamgirls for the calendar year of 2006. DreamWorks hoped to encourage amateur productions of Dreamgirls, and familiarize a wider audience with the play. As a result, more than fifty high schools, colleges, community theaters, and other non-commercial theater entities staged productions of Dreamgirls in 2006, and DreamWorks spent up to $250,000 subsidizing the licensing.[80]The Dreamgirls novelization was written by African-American novelist Denene Millner, and adapts the film's official script in chapter form, along with fourteen pages of photographs from the film. The book was released on October 31, 2006. A scrapbook, entitled Dreamgirls: The Movie Musical, was released on March 27, 2007. The limited edition program guide accompanying the Dreamgirls road show release was made available for retail purchase in February. In addition, the Tonnor Doll Company released \"The Dreamettes\" collection, featuring dolls of the characters Deena, Lorrell, and Effie, to coincide with the release of the film.","dreamgirls":"Theatrical release poster","box_office":"$154.8 million[3]","Allusions to actual events":"Aside from the overall plot of the film and elements already present in the stage musical, many direct references to Supremes, Motown, or R&B/soul history in general are included in the film. In one scene, Effie saunters into Curtis' office and discusses Rainbow Records' latest LP, The Great March to Freedom, a spoken word album featuring speeches by Martin Luther King, Jr. This LP is an authentic Motown release, issued as Gordy 906 in June 1963.[81][82] A later scene features Curtis and the Dreams recording in the studio, while a riot rages outside. By comparison, Motown's Hitsville U.S.A. studio remained open and active during Detroit's 12th Street Riot in July 1967.[83][84] The photo shoot montage which accompanies \"When I First Saw You\", as well as the subplot of Deena being forced to star in Curtis' Cleopatra film against her will, reflect both scenes from and the production of Mahogany, a 1975 Motown film starring Diana Ross and directed by Motown CEO Berry Gordy.[85]Among the more direct references are the uses of adapted Supremes album cover designs for albums recorded in the film by the Dreams. Three Supremes albums And One Diana Ross album - Let the Sunshine In, Cream of the Crop, Touch Me in the Morning, and Touch - were reworked into Deena Jones & The Dreams album designs, with the only differences in the designs being the substitution of the names and images of the Supremes with those of Deena Jones & the Dreams. Another Dreams LP seen in the film, Meet the Dreams, is represented by an album cover derived from the designs for the Supremes LPs Meet The Supremes More Hits by The Supremes and The Supremes A' Go-Go.[86] There is also a solo album, Just In Time, recorded by Deena Jones shown in the film, the album cover for which is based on Dionne Warwick's 1970 album Very Dionne.Diana Ross, long a critic of the Broadway version of Dreamgirls for what she saw as an appropriation of her life story,[87] denied having seen the film version.[88] On the other hand, Mary Wilson attended the film's Los Angeles premiere, later stating that Dreamgirls moved her to tears and that it was \"closer to the truth than they even know\".[89]Smokey Robinson, however, was less than pleased about the film's allusions to Motown history. In a January 25, 2007 interview with NPR, Robinson expressed offense at the film's portrayal of its Berry Gordy analogue, Curtis Taylor Jr., as a \"villainous character\" who deals in payola and other illegal activities.[90] He repeated these concerns in a later interview with Access Hollywood, adding that he felt DreamWorks and Paramount owed Gordy an apology.[91] On February 23, a week before the Oscars ceremony, DreamWorks and Paramount issued an apology to Gordy and the other Motown alumni.[92] Gordy issued a statement shortly afterwards expressing his acceptance of the apology.[92]The payola scheme used in the film's script, to which Robinson took offense, is identical to the payola scheme allegedly used by Gordy and the other Motown executives, according to sworn court depositions from Motown executive Michael Lushka, offered during the litigation between the label and its chief creative team, Holland–Dozier–Holland.[93][94] Several references are also made to Mafia-backed loans Curtis uses to fund Rainbow Records.[95] Gordy was highly suspected, though never proven, to have used Mafia-backed loans to finance Motown during its later years.[96]","cinematography":"Tobias A. Schliessler","directed_by":"Bill Condon","production_companies":"Laurence Mark Productions DreamWorks Pictures Paramount Pictures","release_dates":"December 25, 2006 (2006-12-25)|||||","Production":"Since the 1980s and 1990s, several different attempts have been made to produce a film adaptation of Dreamgirls, a Broadway musical loosely based upon the story of The Supremes and Motown Records, which won six Tony Awards in 1982. David Geffen, the stage musical's co-financier, retained the film rights to Dreamgirls and turned down many offers to adapt the story for the screen. He cited a need to preserve the integrity of Dreamgirls stage director Michael Bennett's work after his death in 1987.[15] That same year, Geffen, who ran his Warner Bros.-associated Geffen Pictures film production company at the time, began talks with Broadway lyricist and producer Howard Ashman to adapt it as a star vehicle for Whitney Houston, who was to portray Deena. The production ran into problems when Houston wanted to sing both Deena and Effie's songs (particularly \"And I Am Telling You I'm Not Going\"), and the film was eventually abandoned.[16]When Geffen co-founded DreamWorks in 1994 and dissolved Geffen Pictures, the rights to Dreamgirls remained with Warner Bros. Warner planned to go ahead with the film with director Joel Schumacher and screenwriter Tina Andrews [6] in the late 1990s, following the success of Touchstone Pictures's Tina Turner biopic What's Love Got to Do with It. Schumacher planned to have Lauryn Hill [17] portray Deena and Kelly Price play Effie. After Warner's Frankie Lymon biopic Why Do Fools Fall in Love failed at the box office, the studio shut down development on Dreamgirls.[16]DreamWorks' Dreamgirls adaptation came about after the film version of the Broadway musical Chicago was a success at both the box office and the Academy Awards. Screenwriter and director Bill Condon, who wrote Chicago's screenplay, met producer Laurence Mark at a Hollywood holiday party in late 2002, where the two discussed a long held \"dream project\" of Condon's — adapting Dreamgirls for the screen.[18] The two had dinner with Geffen and successfully convinced him to allow Condon to write a screenplay for Dreamgirls.[19] Condon did not start work on the Dreamgirls script until after making the Alfred Kinsey biographical film Kinsey (2004).[18] After sending Geffen the first draft of his screenplay in January 2005, Condon's adaptation of Dreamgirls was greenlit.[12]While much of the stage musical's story remains intact, a number of significant changes were made. The Dreams' hometown—the setting for much of the action—was moved from Chicago to Detroit, the real-life hometown of The Supremes and Motown Records.[15] The roles of many of the characters were related more closely to their real-life inspirations, following a suggestion by Geffen.[15]Warner Bros. had retained the film rights to Dreamgirls, and agreed to co-produce with DreamWorks. However, after casting was completed, the film was budgeted at $73 million and Warner backed out of the production. Geffen, taking the role of co-producer, brought Paramount Pictures in to co-finance and release Dreamgirls. During the course of production, Paramount's parent company, Viacom, would purchase DreamWorks, aligning the two studios under one umbrella (and giving the senior studio US distribution rights on behalf of DreamWorks).[15] The completed film had a production budget of $75 million, making Dreamgirls the most expensive film with an all-black starring cast in cinema history.[2]Mark and Condon began pre-production with the intentions of casting Jamie Foxx and Eddie Murphy, both actors with record industry experience, as Curtis Taylor, Jr. and James \"Thunder\" Early, respectively.[18] When offered the part of Curtis, Foxx initially declined because DreamWorks could not meet his salary demands.[18] Denzel Washington, Will Smith, and Terrence Howard were among the other actors also approached to play Curtis.[20] Murphy, on the other hand, accepted the role of Jimmy Early after being convinced to do so by DreamWorks co-founder Jeffrey Katzenberg.[15] As a result, Dreamgirls became Murphy's first film for Paramount since 1995; the actor at one time had an exclusive contract with that studio.While Condon had intended to cast relatively unknown actresses as all three Dreams,[12] R&B singer Beyoncé Knowles lobbied for the part of Deena Jones,[21] and was cast after a successful screen test.[15] Upon learning that Knowles and Murphy had signed on, Foxx rethought his original decision and accepted the Curtis role at DreamWorks' lower salary.[22]R&B star Usher was to have been cast as C.C. White,[23] but contract negotiations failed: Usher was unable to dedicate half a year to the film project. André 3000 of OutKast was also offered the role, but declined.[24] After briefly considering R&B singer Omarion,[25] singer/actor Keith Robinson was eventually cast in the role.[26]Anika Noni Rose, a Broadway veteran and a Tony Award winner, won the part of Lorrell Robinson after an extensive auditioning process.[21] Rose, significantly shorter than most of her co-stars at five feet and two inches (157 cm), was required to wear (and dance in) four and five-inch (127 mm) heels for much of the picture, which she later stated caused her discomfort.[22]The most crucial casting decision involved the role of Effie White, the emotional center of the story.[21] The filmmakers insisted on casting a relative unknown in the role, paralleling the casting of then-21-year-old Jennifer Holliday in that role for the original Broadway production.[21] A total of 783 singing actresses auditioned for the role of Effie White, among them American Idol alumnae Fantasia Barrino and Jennifer Hudson, former Disney star Raven-Symoné, and Broadway stars Capathia Jenkins and Patina Miller.[27] Though Barrino emerged as an early frontrunner for the part,[28] Hudson was eventually selected to play Effie, leading Barrino to telephone Hudson and jokingly complain that Hudson \"stole [Barrino's] part.\" [29][30][31]Hudson was required to gain twenty pounds for the role,[32] which marked her debut film performance. In casting Hudson, Condon recalled that he initially was not confident he'd made the right decision, but instinctively cast Hudson after she'd auditioned several times because he \"just didn't believe any of the others.\"[33]After Hudson was cast in November 2005, the Dreamgirls cast began extensive rehearsals with Condon and choreographers Fatima Robinson and Aakomon \"AJ\" Jones, veterans of the music video industry.[34] Meanwhile, the music production crew began work with the actors and studio musicians recording the songs for the film. Although rehearsals ended just before Christmas 2005, Condon called Hudson back for a week of one-on-one rehearsals, to help her more fully become the \"diva\" character of Effie. Hudson was required to be rude and come in late both on set and off, and she and Condon went over Effie's lines and scenes throughout the week.[22]Loretta Devine, who played Lorrell in the original Broadway production, has a cameo as a jazz singer who performs the song \"I Miss You Old Friend.\"[21] Another Dreamgirls veteran present in the film is Hinton Battle, who was a summer replacement for James \"Thunder\" Early onstage and here portrays Curtis' aide-de-camp Wayne.[21]Principal photography began January 6, 2006 with the filming of dance footage for the first half of \"Steppin' to the Bad Side,\" footage later deleted from the film.[35] The film was primarily shot on soundstages at the Los Angeles Center Studios and on location in the Los Angeles area, with some second unit footage shot in Detroit, Miami, and New York City.[35] The award-winning Broadway lighting team of Jules Fisher and Peggy Eisenhauer were brought in to create theatrical lighting techniques for the film's musical numbers.[36]Beyoncé elected to lose weight to give the mature Deena Jones of the 1970s a different look than the younger version of the character. By sticking to a highly publicized diet of water, lemons, maple syrup, and cayenne pepper (also known as the Master Cleanse), Knowles rapidly lost twenty pounds, which she gained back once production ended.[37]Shooting was completed in the early-morning hours of April 8, 2006, after four days were spent shooting Jennifer Hudson's musical number \"And I Am Telling You I'm Not Going\", which had purposefully been saved until the end of the shoot.[35] Originally scheduled to be shot in one day, Condon was forced to ask for extra time and money to finish shooting the \"And I Am Telling You\" scene, as Hudson's voice would give out after four hours of shooting the musical number, and she was unable to plausibly lip-sync while hoarse.[18][33] The scene was felt by everyone involved to be pivotal to the film, as \"And I Am Telling You\" was Jennifer Holliday's show-stopping number in the original Broadway musical.[18][21]Dreamgirls musical supervisors Randy Spendlove and Matt Sullivan hired R&B production team The Underdogs — Harvey Mason, Jr. and Damon Thomas — to restructure and rearrange the Henry Krieger/Tom Eyen Dreamgirls score so that it better reflected its proper time period, yet also reflected modern R&B/pop sensibilities.[38] During post-production, composer Stephen Trask was contracted to provide additional score material for the film.[39] Several musical numbers from the Broadway score were not included in the film version, in particular Lorrell's solo \"Ain't No Party\".[40]Four new songs were added for the film: \"Love You I Do\", \"Patience\", \"Perfect World,\" and \"Listen.\" [38] All of the new songs feature music composed by original Dreamgirls stage composer Henry Krieger. With Tom Eyen having died in 1991,[6] various lyricists were brought in by Krieger to co-author the new songs. \"Love You I Do,\" with lyrics by Siedah Garrett, is performed in the film by Effie during a rehearsal at the Rainbow Records studio.[6] Willie Reale wrote the lyrics for \"Patience,\" a song performed in the film by Jimmy, Lorrell, C.C., and a gospel choir, as the characters attempt to record a message song for Jimmy.[6] \"Perfect World,\" also featuring lyrics by Garrett, is performed during the Rainbow 10th anniversary special sequence by Jackson 5 doppelgängers The Campbell Connection.[6] \"Listen\", with additional music by Scott Cutler and Beyoncé Knowles, and lyrics by Anne Preven, is presented as a defining moment for Deena's character late in the film.[6]After preview screenings during the summer of 2006, several minutes worth of musical footage were deleted from the film due to negative audience reactions to the amount of music.[41] Among this footage was one whole musical number, C.C. and Effie's sung reunion \"Effie, Sing My Song\", which was replaced with an alternative spoken version.[14][41]The Dreamgirls: Music from the Motion Picture soundtrack album was released on December 5 by Music World Entertainment/Columbia Records, in both a single-disc version containing highlights and a double-disc \"Deluxe Version\" containing all of the film's songs. The single-disc version of the soundtrack peaked at number-one on the Billboard 200 during a slow sales week in early January 2007.[42] \"Listen\" was the first official single from the soundtrack, supported by a music video featuring Beyoncé. \"And I Am Telling You I'm Not Going\" was the Dreamgirls soundtrack's second single. Though a music video with all-original footage was once planned,[43] the video eventually released for \"And I Am Telling You\" comprised the entire corresponding scene in the actual film.","produced_by":"Laurence Mark","starring":"Jamie Foxx|Beyoncé Knowles|Jennifer Hudson|Eddie Murphy|Danny Glover|Anika Noni Rose|Keith Robinson|Sharon Leal|","running_time":"130 minutes[1]","music_by":"Stephen Trask","edited_by":"Virginia Katz","written_by":"Bill Condon","budget":"$80 million[2]"}