{"country":"United States","distributed_by":"American International Pictures (AIP)","Plot":"An anthropologist, Professor Robert Orville Sutwell is secretly studying the \"wild mating habits\" of Southern California teenagers who hang out at the beach and use strange surfing jargon. After he temporarily paralyzes Eric Von Zipper, the leader of the local outlaw motorcycle club, who was making unwanted advances on Dolores, she develops a crush on the Professor. Her surfing boyfriend Frankie becomes jealous and begins flirting with Ava, a Hungarian waitress. Meanwhile, Sutwell's assistant Marianne further develops her crush on the Professor. Von Zipper and his gang plot to bring down Sutwell, only to be thwarted in the end by the surfing teenagers.","Films in the series":"Many of the same cast – and much of the same crew – were involved in the AIP films that followed. Sometimes character names changed (like in Pajama Party, Ski Party and Sergeant Deadhead), and not all were beach-based (Ski Party in the mountains, Ghost in the Invisible Bikini in a haunted house), but the basic elements and tone remained the same:* Avalon appeared in every film except The Ghost in the Invisible Bikini, and Thunder Alley. Funicello appeared in every film except Sergeant Deadhead and The Ghost in the Invisible Bikini.At one stage there was talk of a Beach Party TV series but this did not happen.[18]","language":"English","Reception":"Beach Party was the highest grossing film AIP had made to that date, earning more its opening weekend than any of its competition.[16]The Golden Laurel, which had no ceremony but published its award results in the trade magazine Motion Picture Exhibitor from 1958 to 1971, gave this film The Golden Laurel for Sleeper of the Year in 1964.","box_office":"$2,300,000 (US/ Canada)[1][2]","Cultural references":"The Rat Pack motorcycle gang is largely a parody of The Wild One (1953); Harvey Lembeck's \"Eric Von Zipper\" spoofs Marlon Brando's performance as the leader of the gang; however, unlike the Brando character he is generally clumsy and inept.Big Daddy's club in this film (and Cappy's Place in Muscle Beach Party) is a reference to Southern California beach coffeehouses in general and Cafe Frankenstein in particular.[citation needed]","beach_party":"Original film poster","cinematography":"Kay Norton","production_company":"Orion Pictures Alta Vista Productions","directed_by":"William Asher","Production notes":"The film was shot over three weeks starting in March 1963.[1] Locations included Newport, Balboa, Laguna and Malibu Beach.[13]John Ashley later recalled:We all had to wear body make up because nobody had a tan. One day Frankie and I had some dialogue to do on our way to the water with our surfboards. It was colder than hell that day and the water was freezing. We had our backs to the camera and Frankie said, 'Man, can you believe us? Two thirty year old guys in body make up playing teenagers.'[12]Although Mickey Dora was Bob Cummings' stunt surfer for long-shots, Cummings was already a competent surfer himself by the time he starred in Beach Party as the ungainly Professor. Films of him surfing in Hawaii on the Ken Murray's Hollywood television show feature a muscular young Bob cruising along comfortably on an old style long board.[14]Contrary to the popular opinion that Annette Funicello was not allowed to be seen in a bikini bathing suit in these films for AIP (or that she was not even allowed to wear a two-piece suit or show her navel), Funicello does indeed wear a pink two-piece in this very first film, shows her navel in a two-piece in Muscle Beach Party, and wears a bikini in Bikini Beach.[citation needed]In one of the first instances of film cross-selling, AIP took advantage of the target demographic of this film to promote another in a different genre, when at the very end of the credits – after giving \"A Special thanks\" to Vincent Price for appearing as Big Daddy – the title reads \"Soon to be seen in The Haunted Palace\", a AIP horror film that would be released on August 28, 1963 – just weeks after the release of Beach Party. Price's line, \"The Pit… Bring me my pendulum, kiddies, I feel like swinging…\", is a jocular reference to AIP's 1961 Price vehicle, The Pit and the Pendulum, directed by Roger Corman.","Music":"The music in Beach Party was written specifically for the film and directed by Kaylen Mandry and featured a score that picked up several cues from the songs used – a common move for most musicals, but a rarity for a B-grade studio teen film filled with pop songs – even today.[15] Les Baxter composed this score, as well as most of the films that followed, including Sergeant Deadhead, Dr. Goldfoot and the Bikini Machine and Fireball 500.Gary Usher and Roger Christian wrote three songs that appear in the film: the title track, performed by Avalon and Funicello; and \"Swingin' and a-Surfin'\" and \"Secret Surfing Spot\", both performed by Dick Dale and the Del Tones.Bob Marcucci and Russ Faith wrote \"Don't Stop Now\", performed by Avalon.Guy Hemric and Jerry Styner wrote two songs for Funicello featured in the film: \"Treat Him Nicely\", which Funicello performs while harmonizing with herself; and \"Promise Me Anything (But Give Me Love)\" performed off-screen and presented as source music.","release_dates":"July 14, 1963 (1963-07-14) (Premiere )|August 7, 1963 (1963-08-07) (U.S.)||||","Development":"In the summer of 1962 Samuel Arkoff and Jim Nicholson were watching films in Italy with a view to purchasing some for release in the US. They saw one about a middle-aged man who falls in love with a young woman who spends all her time at a beach resort. They did not like the movie but were attracted by the setting, and commissioned Lou Rusoff to write a film set at the beach.[8] The film was announced in July 1962.[9] It was part of AIP's policy of \"mass entertainment on a frankly escapist level.\"[10]Rusoff's script was apparently more in line with AIP's traditional fare of children getting in trouble with their parents. It was shown to William Asher who agreed to make the movie if it became more of a musical comedy about teenagers having a good time and not getting in trouble.[11] Arkoff and Nicholson agreed so Asher rewrote the script with Robert Dillon. He was asked not to take credit by Samuel Arkoff who told them that Lou Rusoff was dying of brain cancer. Asher agreed and Rusoff has sole credit; he died in June 1963.[11]Annette Funicello was always first choice for the female lead, although Asher says they were worried because she was under contract to Walt Disney:We had thirty pages of material. Disney had to approve it. Not having all the material, he was concerned about Annette's image. I told him that there wouldn't be anything that would offend, that it wasn't that type of a picture. They were a little wary because it was AIP.[12]Arkoff says that AIP tried to get Fabian Forte to play opposite her but he was under contract to 20th Century Fox so Frankie Avalon was cast instead.[8] In July 1962 it was announced Avalon would play the lead with Funicello \"probably\" appearing alongside him.[10]John Ashley had made a number of movies for American International and was cast to play Avalon's best friend.","produced_by":"Executive producer: Samuel Z. Arkoff Associate producer: Robert Dillon Producer: James H. Nicholson and Lou Rusoff","starring":"Bob Cummings Dorothy Malone Frankie Avalon Annette Funicello","running_time":"101 min.","Cultural impact":"With this film, AIP created a new subgenre – the beach party film. Several other studios attempted to imitate the AIP Beach Party formula, but never with equal success.[4][5][6] Films of the genre include: Surf Party, Ride the Wild Surf, and For Those Who Think Young (all from 1964), A Swingin' Summer and Beach Ball (both 1965), Catalina Caper and It's a Bikini World (from 1967).The 1996 film That Thing You Do! features a parody of 1960s beach movies. In the film, the fictional singing group called The Wonders star as \"Cap'n Geech and The Shrimpshack Shooters.\" The movie within the movie is titled Weekend at Party Pier and features characters similar to Frankie Avalon and Annette Funicello.William Asher later said that \"the key to these pictures is lots of flesh but no sex. It's all good clean fun. No hearts are broken and virginity prevails.\"[17]","music_by":"Les Baxter","edited_by":"Homer Powell","written_by":"Lou Rusoff William Asher (uncredited) Robert Dillon (uncredited)","budget":"$300,000[1]"}