{"country":"United States","distributed_by":"Paramount Pictures","changing_lanes":"Theatrical release poster","Plot":"In New York City, a middle-aged African-American insurance salesman named Doyle Gipson is a recovering alcoholic who is attending Alcoholics Anonymous meetings to stay sober. On the same morning that Gipson drives to a hearing to try to regain custody of his children, a successful, white, young Wall Street attorney, Gavin Banek, is distracted while driving and collides with Gipson's car. Banek was in a rush to get to court to file a power of appointment document, which will prove a dead man signed his foundation over to Banek's law firm. Gipson was also in a rush to get to a hearing to prevent his estranged wife from taking his two boys to Oregon. Banek tries to brush Gipson off with a blank check, rather than exchanging insurance information, thereby disobeying the law. After Gipson refuses to accept the check and voices his desire to \"do the right thing\", that is, filing a police report and insurance claim, Banek strands Gipson on a median, telling him, \"better luck next time\". After arriving to the court late, Gipson learns that it proceeded without him and that it did not go in his favor. Gipson did not get the chance to tell the judge about a house he is buying for his wife and children.When Banek, gets to court, he realizes that he dropped the crucial power of appointment file at the scene of the accident, and the judge gives him until the end of the day to re-obtain the papers and present them. Gipson, who took the papers, is in dilemma on whether to return the file, especially after the events of the day. On the other hand, Banek, who is desperate to get his papers back, goes to a \"fixer\", a shady computer hacker, and gets him to switch off Gipson's credit. Gipson needed credit for a loan so he could buy the house for his family. Gipson becomes very upset when he finds out his credit has been cut off, and he comes close to starting to drink again. Determined to get back at Banek, Gipson loosens the bolts on the front tire of Banek's luxury car, and the wheel comes off later while Banek is driving, causing his car to crash on the highway, leading to minor injuries. Enraged, Banek goes to the elementary school of Gipson's children and falsely claims to school officials that Gipson plans to kidnap the boys, which leads to Gipson being arrested and jailed.Both men continue to do morally reprehensible things in an attempt to one-up each other, and eventually they begin to question their actions. Though it is made clear that Banek and Gipson are radically different, they both have an angry, vengeful streak, each capable of abandoning his morals just to punish the other. The film ends with both men having a new outlook on life, concentrating on ethics and the moral implications of their actions. Ultimately the two men apologize to each other and Gipson returns the file, but it looks to be too late for both of what they were trying to do. Banek ends up using the file to force his law firm boss to conduct business honestly and plans to represent Gipson pro bono so he can get the house he wants. Banek also visits Gipson's wife to explain everything to her, knowing he owes Gipson that much. The film ends with Gipson's wife and children smiling at him from across the street.","language":"English","Reception":"The movie was a box office success, with a budget of $45,000,000, it grossed $66,818,548 in the United States and $28,117,216 internationally, for a total gross of $94,935,764.[1]The film received favorable reviews from critics. Review aggregation website Rotten Tomatoes gives the film a score of 77% based on reviews from 151 critics, with an average score of 7/10.[3] Metacritic gave it an average score of 69/100 from the 36 reviews it collected.[4]Roger Ebert of the Chicago Sun-Times praised the film, calling it one of the year's best.[5]","box_office":"$94,935,764","cinematography":"Salvatore Totino","directed_by":"Roger Michell","release_dates":"April 12, 2002 (2002-04-12)|||||","produced_by":"Scott Rudin Scott Aversano","starring":"Ben Affleck|Samuel L. Jackson|Toni Collette|Sydney Pollack|William Hurt|Amanda Peet|","running_time":"99 minutes","music_by":"David Arnold","edited_by":"Christopher Tellefsen","written_by":"Chap Taylor Michael Tolkin","budget":"$45 million[1]"}