{"based_on":"Bully: A True Story of High School Revenge  by Jim Schutze","country":"United States","Inspiration":"The film is based on the July 15, 1993 murder of Bobby Kent at a remote area in Weston, Florida, south of Alligator Alley.[5] Four of the convicted teens, known as the Broward County Seven, were released after serving brief prison terms. Today, only three are still serving prison sentences. The book, Bully: A True Story of High School Revenge by Jim Schutze was released in 1998. The film includes two title cards that reveal how several of the perpetrators appealed their sentences and the results of those actions.The actual co-perpetrators of the murder were convicted and sentenced as follows:","distributed_by":"Lions Gate Films","screenplay_by":"Zachary Long Roger Pullis","Plot":"Ali Willis (Bijou Phillips) and Lisa Connelly (Rachel Miner) are friends with Bobby Kent (Nick Stahl) and Marty Puccio (Brad Renfro). They all go out on a double date. While in a parked car, Ali performs oral sex on Bobby, while Lisa and Marty have sex in the back seat. Lisa later learns she is pregnant, but is afraid that the child is Bobby's instead of Marty's, since Bobby raped her after beating Marty unconscious.Bobby emotionally and physically abuses Marty, and also rapes Ali. Marty reveals to Lisa that the abuse has been going on since they were kids, starting with Marty taking drugs at an early age, which Marty thinks that Bobby has been using to take advantage of him. Marty and Bobby then go to a gay bar, where he is forced to strip down to his underwear, and begins to dance, while Bobby starts to videotape the whole ordeal. Lisa eventually proposes that they murder Bobby.Ali recruits her new boyfriend, Donny (Michael Pitt), and her friend, Heather Swallers (Kelli Garner), while Lisa recruits her cousin, Derek Dzvirko (Daniel Franzese). After doing drugs and having sex, the teens make their first attempt, but back out. Realizing they need help, they hire a supposed \"hitman\", Derek Kaufman (Leo Fitzpatrick), who is just a tough-talking adolescent.The teens come up with a new plan. They arrive at a swamp, where Donny stabs Bobby in the back of the neck. Shocked by the violence, Ali, Heather, and Derek Dzvirko run back to Ali's car. Bobby begs for mercy, but Marty slits his throat, and Derek Kaufman bludgeons him with a baseball bat. Lisa witnesses it all, never turning away. They dispose of Bobby's body in the swamp and flee. Marty later realizes that he left the sheath to his diving knife at the canal.They go to retrieve the sheath, and check on the corpse, which is now being eaten by crabs. Lisa, Derek, Ali, and Heather do not believe they did anything wrong, since they did not directly participate in Bobby's actual death. Lisa decides to dispose of the knife, which is the only evidence linking them to the crime.Unable to maintain the secret, Derek and Lisa reveal to their other friends what they've done, while Ali phones in an anonymous tip to the media, alerting them to Bobby's death. Lisa calls Derek and speaks to his younger brother, who says that Derek has already been arrested for the murder. Eventually, all the teenagers turn themselves in, with the exception of Marty, who is arrested a few days later. The group is later seen in court wearing prison jumpsuits, and Lisa visibly pregnant by this time.Marty and Donny argue, inadvertently admitting to Bobby's murder in front of the entire court. It is then revealed that the teenagers were all convicted of Bobby's murder, and list the sentences they receive:Subsequent title cards reveal that some of the characters and events were composited or exaggerated for dramatic effect, and the results of the defendants' appeals at the making of the film:","language":"English","Critical reception":"Bully received mixed reviews from critics and has a \"Rotten\" rating of 54% on Rotten Tomatoes based on 91 reviews with an average score of 5.7 out of 10. The critical consensus states \"With its lingering shots of naked teenage bodies, Bully feels more sordidly exploitative than realistic.\"[4] The film holds a score of 45 out of 100 on Metacritic, based on 26 critics indicating 'Mixed or average reviews'.[13]Roger Ebert was one of the film's notable admirers and gave the film four out of four stars and stated in his review \"Larry Clark's Bully calls the bluff of movies that pretend to be about murder but are really about entertainment. His film has all the sadness and shabbiness, all the mess and cruelty and thoughtless stupidity of the real thing....If the director doesn't have a strong personal feeling about material like this, he shouldn't be making movies about it...Clark is not some objectified, outside adult observer making an after-school special, but an artist who has made a leap into this teenage mindscape....I believe Bully is a masterpiece on its own terms, a frightening indictment of a society that offers absolutely nothing to some of its children—and an indictment of the children, who lack the imagination and courage to try to escape. Bobby and his killers deserve one another.\"[14]","box_office":"$704,808[2][3]","cinematography":"Steve Gainer","production_company":"Blacklist Films Gravity Entertainment Muse Productions FilmFour Distributors StudioCanal","directed_by":"Larry Clark","release_dates":"June 15, 2001 (2001-06-15) (Method Fest)|July 13, 2001 (2001-07-13) (United States)|November 14, 2001 (2001-11-14) (London Film Festival)|||","produced_by":"Don Murphy Chris Hanley Fernando Sulichin","starring":"Brad Renfro Bijou Phillips Rachel Miner Michael Pitt Kelli Garner Leo Fitzpatrick Nick Stahl","running_time":"113 minutes[1]","bully":"Theatrical release poster","music_by":"Joe Poledouris Jerome Dillon","edited_by":"Andrew Hafitz"}