{"country":"United States","distributed_by":"Universal Pictures","Plot":"In Upstate New York, a waste management firm loads barrels of toxic waste onto trucks, intending to illegally dispose of them. They are shown heading into The Holland Tunnel along with several other commuters, including struggling playwright Maddy Thompson (Amy Brenneman), a bus of juvenile offenders, a vacationing family, an elderly couple, and mountain climbing equipment retailer Roy Nord (Viggo Mortensen). Meanwhile, a gang of diamond thieves in a stolen car try to escape the NYPD by racing into the tunnel. The gang force their way through the north tube traffic, where the driver loses control, smashing though a security booth and into one of the trucks, causing it to detonate, and resulting in a sympathetic detonation of the remaining trucks. The tunnel entrances cave in, and a devastating fireball sweeps through the tunnel, incinerating the majority of the motorists within it.About to enter the Manhattan end of the tunnel, former New York City Emergency Medical Services Chief Kit Latura (Sylvester Stallone), now working as a cab driver, witnesses the fireball erupting from the entrance. While racing to help whoever he can he runs into an old EMS colleague, who tells him that the tunnel is severely damaged, and could come down if any wrong moves are made. Kit then checks with tunnel administrators, and finds that most of the old exits have been sealed off or are considered unsafe. Kit makes his way into the tunnel through the ventilation system, risking his life as the massive fans can only be slowed down for a short time.A group of the survivors trapped inside band around Nord, who believes he can find a way out through the mid-river passage, a service corridor running between the north and south tubes. Kit arrives and finds Nord, warning him that the passage could come down at any moment, but Nord dismisses the possibility. Kit barely escapes as the mid-river collapses, killing Nord, and causing another explosion which kills a survivor.Water begins seeping in from the river above, and Kit uses an explosive to stop the leak. Police officer George Tyrell (Stan Shaw) returns from investigating the Manhattan end and is crushed under a truck as the road shifts. The group manage to free him before he can drown, but he is left with a broken neck. The water level continues to rise and the angry survivors confront Kit. He claims he can slow it down but not stop it, as the clean-up effort on the Manhattan side of the tunnel is causing water to enter their side. Kit recalls that there are sleeping quarters beside the tunnels (left over from when the tunnel was built) and asks George how to access them. Kit finds one by swimming under a security booth, and leads the group to this area, but George has to be left behind. He gives Kit a bracelet intended for his girlfriend Grace (Vanessa Bell Calloway), and tells him to \"get them to daylight\".Eleanor (Claire Bloom), one of the elder survivors, is distressed that her late son's dog Cooper is missing. She refuses to go on, then suddenly yet quietly passes away, presumably from hypothermia. The group moves to another room as the first one floods, convincing Eleanor's husband Roger (Colin Fox) to come with them. As they reach the top of an old wooden staircase, Kit notices Cooper swimming in the water below and dives down to rescue him, passing him up to one of the survivors, but a beam falls and destroys the lower half, sending Kit into the water. Maddy tries to help Kit up, but she falls as well, as more of the staircase is knocked down. The main group escape through a manhole into daylight while the corridor caves in behind them, but not before one of the survivors takes a flashlight from his daughter and tosses it to Kit, leaving Kit and the hysterical Maddy behind.Kit and Maddy swim around looking for a possible way out, with the main highway tunnel now almost completely submerged. Kit realizes he will have to use his explosives to cause a \"blow out\" and rip the tunnel roof open. The blast forces Maddy towards the surface, but throws Kit downwards. Maddy finds a barely conscious Kit and keeps him afloat, as a boat discovers them offshore. Lying on a stretcher, Kit sees Grace in the crowd and hands her George's bracelet. Maddy insists on riding with him in the ambulance, to which Kit replies \"on one condition; we gotta take the bridge.\"","language":"English","Reception":"The film received negative reviews and has a 26% rating on Rotten Tomatoes based on 39 reviews with an average rating of 4.7 out of 10.[3]There were, however, some moderate and positive reception. Roger Ebert gave the film two stars out of four, commenting, \"Daylight is the cinematic equivalent of a golden oldies station, where you never encounter anything you haven't grown to love over the years. At one point, when a trapped civilian asks him if they have a chance, I expected him to say, 'Calm down, lady. I've done this in a dozen other movies.'\"[4] Empire gave the film four stars out of five, stating, \"Daylight is great because it never tries to be any more than it is — a disaster movie with all the special-effects hoopla the '90s can bring.\"[5]Daylight opened in 2,175 theaters in North America and grossed $10,015,875. The film ended up earning only $33,023,469 domestically but $126,189,000 internationally for a total of $159,212,469, double its estimated $80 million production budget.[6]The film won a Golden Reel Award for best Sound Editing and was nominated for an Academy Award in the same category (Richard L. Anderson and David A Whittaker). It was also nominated for two Golden Raspberry Awards, Worst Actor (Sylvester Stallone) and Worst Original Song (Whenever There Is Love).","box_office":"$159.2 million[2]","production_company":"Davis Entertainment","directed_by":"Rob Cohen","daylight":"Theatrical film poster","release_dates":"December 6, 1996 (United States) December 26, 1996 (United Kingdom)","produced_by":"John Davis David T. Friendly Joseph Singer","starring":"Sylvester Stallone Amy Brenneman Viggo Mortensen Dan Hedaya Jay O. Sanders Karen Young Claire Bloom Barry Newman Stan Shaw","running_time":"114 minutes[1]","music_by":"Randy Edelman","written_by":"Leslie Bohem","budget":"$80 million[1]"}