{"Cast":"The film includes cameo appearances by Raimi himself as an uncredited ghost at the seance, Raimi's younger brother Ted as a doctor, members of Raimi's family Emma, Henry, and Lorne in minor roles, frequent Raimi collaborator Scott Spiegel as a mourner at the death feast, and John Paxton and Irene Roseen as the old couple at the diner.","country":"United States","distributed_by":"Universal Pictures","Plot":"In 1969 Pasadena, California, a couple seeks the aid of the medium Shaun San Dena (Flor de Maria Chahua) saying their son (Shiloh Selassie) has been hearing evil spirits' voices after stealing a silver necklace from gypsies. San Dena aids the family by carrying out a seance, but they are attacked by an unseen force that pulls the boy into Hell. The medium says she will encounter the force again one day.In present-day Los Angeles, bank loan officer Christine Brown hopes to be promoted to assistant manager over her co-worker Stu Rubin. Her boss, Jim Jacks, advises her to demonstrate that she can make tough decisions to get a promotion. Christine is visited by an elderly gypsy woman, Sylvia Ganush, who asks for an extension on her mortgage payment. Though empathetic with the old woman's crisis, Christine denies Ganush an extension to prove herself to her boss. Ganush begs Christine not to repossess her house and kneels in front of her. Christine gets scared of the woman's bizarre pleading as she is helping her to stand up and calls security, who take Ganush away while Ganush blames Christine for \"shaming\" her and vows to take revenge. Jim compliments Christine on how she handled the situation.When Christine goes to the bank parking garage to drive home, Ganush attacks Christine in her car, rips a button off Christine's coat and uses it to place a curse on Christine. Later, Christine and her boyfriend Clay Dalton meet the fortune teller, Rham Jas who tells Christine that she is being haunted by an evil spirit. At home, Christine is attacked by the spirit and has nightmares about Ganush. At work the next day, Christine snaps at Stu and has a projectile nose bleed that soaks her boss in blood. She runs away and Stu secretly takes a file off Christine's desk.Christine goes to talk to Ganush but learns that she died the previous night. Christine returns to Rham Jas, who explains that as long as Christine is the owner of an accursed object, she will be haunted by a powerful demon called the Lamia (loosely based on the Greek child-eating demon) that will torment her for three days before taking her to Hell for eternity. He suggests a sacrifice to appease the demon. Desperate to stop the attacks, Christine reluctantly sacrifices her pet kitten. At a dinner party with Clay and his parents, she is again tormented by the Lamia, but this time through the use of illusions, which frightens the Daltons.Christine returns to Rham Jas who says that Shaun San Dena will risk her life to stop the demon for a fee of $10,000. San Dena prepares a seance to trap the Lamia's spirit in a goat and kill it, and then allows the Lamia to inhabit her body. Rham Jas tries to persuade it not to steal Christine's soul, but it vows never to stop until Christine dies. Christine then places San Dena's hand on the goat, causing the spirit to enter its body. San Dena's assistant, Milos, attempts to kill the goat, but is bitten by the goat and becomes possessed, attacking the members of the seance. San Dena banishes the Lamia from the seance, but dies in the process. Christine thinks the medium has overcome the Lamia, but Rham Jas explains that she only managed to drive the spirit away until the next day. Then he seals the cursed button in an envelope and tells Christine that she can get rid of the curse by giving the button to someone as a gift, thereby passing the curse on to that person.Christine decides to give the envelope to Stu in revenge for his stealing her work, but changes her mind after seeing how pathetic, tearful and panicky Stu is when he meets her. With guidance from Rham Jas, Christine learns that she can give it to Ganush even though she is dead. Christine digs up Ganush's grave and jams the envelope in her mouth just in time before dawn.Christine returns home and prepares to meet Clay at Los Angeles Union Station for a weekend trip to Santa Barbara. She gets a message from her boss telling her that she landed her dream position after Stu confessed to stealing her work and was fired. At the station, Christine also buys a coat that she has been wanting as a sign of a new beginning. Clay, planning to propose, reveals to Christine that he found the envelope containing the cursed button in his car. Christine then realizes she mixed up her envelope with another that she gave to Clay when she accidentally dropped it. Horrified, Christine backs away and falls onto the tracks. As a train barrels towards her, fiery hands suddenly emerge from the tracks and drag Christine into the neverending flames of Hell, as a horrified Clay watches from the platform above with the cursed button still in his hands.","language":"English|Spanish|","box_office":"$90.8 million[2]","cinematography":"Peter Deming","production_company":"Ghost House Pictures","directed_by":"Sam Raimi","drag_me_to_hell":"Theatrical release poster","release_dates":"March 15, 2009 (2009-03-15) (SXSW)|May 29, 2009 (2009-05-29) (United States)||||","Production":"The original story for Drag Me to Hell was written ten years before the film went into production and was written by Sam Raimi and his brother Ivan Raimi. The film went into production under the name The Curse.[3] The Raimis wrote the script as a morality tale, desiring to write a story about a character who wants to be a good person, but makes a sinful choice out of greed for her own betterment and pays the price for it.[4] The Raimis tried to make the character of Christine the main focal point in the film, and tried to have Christine in almost all the scenes in the film.[3] Elements of the film's story are drawn from the British horror film Night of the Demon (itself an adaptation of M.R. James' short story \"Casting the Runes\") such as the similar-shaped demons and the three day curse theme in the film.[5][6] The most significant parallel is that both stories involve the passing of a cursed object, which has to be passed to someone else, or its possessor will be devoured by one or more demons. Unlike his past horror films, Raimi wanted the film to be rated PG-13 and not strictly driven by gore, stating, \"I didn't want to do exactly the same thing I had done before.\"[3][7]After finishing the script, Raimi desired to make the picture after the first draft of the script was completed, but other projects such as the Spider-Man film series became a nearly decade-long endeavor, pushing opportunities to continue work on Drag Me to Hell to late 2007.[3] Raimi offered director Edgar Wright to direct Drag Me to Hell which Wright turned down as he was filming Hot Fuzz and felt that \"If I did it, it would just feel like karaoke.\"[8] After the previous three Spider-Man films, Raimi came back to the script of Drag Me to Hell, wanting to make a simpler and lower-budget film.[9] In 2007, Sam Raimi's friend and producer Robert Tapert of Ghost House Pictures had the company sign on to finance the film.[3] Universal Studios agreed to distribute domestically.[3]After completing the script and having the project greenlit, Raimi started casting the film.[3] Ellen Page was originally cast for the main role of Christine, but dropped out of the project due to SAG strike-related scheduling issues.[10] The main role eventually went to Lohman, who didn't enjoy horror films, but enjoyed doing the stunts during filming.[3] Stage actress Lorna Raver auditioned for the role of Mrs. Ganush. Raver was not aware of the specific nature of her character until being cast, stating that all she had read was \"about a little old lady coming into the bank because they're closing down her house. It was only later that I saw the whole script and said, 'Oh my!'\"[3] To prepare for this role, Raver met with a Hungarian dialect coach and asked to have portions of the script translated into Hungarian.[3] Raimi would later ask Raver to use some of the Hungarian words in the scenes of Ganush's attacking Christine.[3] Dileep Rao, who plays Rham Jas, made producer Grant Curtis mildly hesitant in casting him, stating that during his audition \"he was a little bit younger than he read in the script. But as we were looking at his reading, Sam said, 'There's no minimum age requirement on wisdom.' Dileep has that wisdom and presence on screen, and that’s what made him right. Once he got on camera, he brought that shoulder for Alison to lean on.\"[3] Many of the actors playing secondary characters in Drag Me to Hell have appeared previously in Raimi's films, including Joanne Baron, Tom Carey, Molly Cheek, Aimee Miles, John Paxton, Ted Raimi, Bill E. Rogers, Chelcie Ross, and Octavia Spencer.[3]Raimi said he set out to create “a horror film with lots of wild moments and lots of suspense and big shocks that’ll hopefully make audiences jump. But I also wanted to have a lot of dark humor sprinkled throughout. I spent the last decade doing Spider-Man and you come to rely on a lot of people doing things for you and a lot of help, but it’s refreshing and wonderful to be reminded that, as with most filmmakers, the best way to do it is yourself, with a tight team doing the main jobs.\"[11]Production for Drag Me to Hell began on location in Tarzana, California.[3] The production team included director of photography Peter Deming (Evil Dead II, Mulholland Dr.), production designer Steve Saklad (Juno), and visual effects supervisor Bruce Jones. The film was produced by Grant Curtis and Rob Tapert. Tapert and Raimi are longtime collaborators, having attended college together in Michigan.[11]Drag Me to Hell was edited by Bob Murawski, who has collaborated with Raimi on several films including the Spider-Man series, The Gift, and Army of Darkness.[11]Raimi has said of working with Murawski on Drag Me to Hell, \"He’d come (down to the set) to see how things were going and to let me know if he’d just cut something that wasn’t working the way he’d wanted it to, or to suggest a pick-up shot I should get for a piece he felt we needed in a sequence I hadn’t realized I needed. He’s very detail-oriented... So we’re very close collaborators.\"Raimi finds editing with Murawski to be \"relaxing\", adding, \"I love it. For me, it's so relaxing, unlike pre-production, which is fraught with anxiety and fear about how we'e going to do things, and production, which is so rushed and a sleepless time and you're just racing to finish every shot and worrying about focus and so on. So post is soothing and I can watch the film come together, so it's a time of discovery for me as Bob and I fit all the pieces together. I see new possibilities in post, as Bob puts the film together, sometimes in a way I never imagined...\"[11]The film was edited by Murawski on an Avid computer system in a West Los Angeles facility. The color grading was completed at Company 3 with colorist Stephen Nakamura. Nakamura used a \"da Vinci Resolve.\" It was CO3's first start-to-finish feature in 4K resolution.[11]\"For us, post is a very creative time where it's not just about this factory producing the blueprinted product. It's really a very creative, experimental time where we try and take everything that's been written and then shot to the next level,\" said Raimi.[11]The final sound mix was completed at the Dub Stage in Burbank with mixers Marti Humphrey and Chris Jacobson.[11]The effects in Drag Me to Hell were created in many different ways, including green screen, puppets, prosthetics and computer-generated imagery.[3] Bruce Jones was the visual effects supervisor on the film. Of Jones, Raimi commented, \"He brought a great can-do approach to the film... He's got a great team of artists and technicians with him, and he's got great instincts.”[11]There were hundreds of visual effects in the film, and different effects houses were utilized. According to Raimi, the Bay Area's Tippett Studio was a big player. \"We also had work done by Amalgamated Pixels, Ghost VFX, KNB Effects, Home Digital, Cinesoup and IE Effects,\" said Raimi. According to Raimi, “Bob (Murawski) and I kept adding visual effects as post proceeded. In this film, the supernatural, the unseen, is almost another character, so sequences were developed — even in post — that would suggest the presence of the supernatural, and we kept on adding. The same with the sound effects, so it was a very ongoing, very live process in post.\"[11]Director of photography Peter Deming tried to use realistic lighting in the film. Said Deming, \"Normally, you'd put all corrected bulbs in, but we went with what was there, including the shots in the street. We used the streetlight look and mixed that with interior lighting. There were a lot of odd color sources that we chose to leave the way they would be naturally. It's a heightened sense of realism.\"[3] One of the earliest projects the special effects teams did was the scene in which Mrs. Ganush attacks Christine in her car. To film the action, which included close-ups of Christine jamming her foot on the pedal, hitting the brake, and shifting gears, the team created a puzzle car which allowed the front engine compartment and back trunk — as well as all four sides and doors — to come away from the car. The roof came off in two directions.[3]The film score was composed by Christopher Young. Young has worked with director Raimi previously on his films The Gift and Spider-Man 3. The soundtrack was released on August 18, 2009.[14] Sam Raimi stated that emphasis was on using the soundtrack to create a world that didn't exist, a world of the \"supernatural\".[11] The score contains elements of Young's previous work on Flowers in the Attic. This is particularly apparent in the utilization of the ethereal childlike soprano vocals that feature prominently throughout the soundtrack.","produced_by":"Grant Curtis|Robert Tapert|","starring":"Alison Lohman|Justin Long|Lorna Raver|Dileep Rao|David Paymer|Adriana Barraza|","running_time":"99 minutes[1]","music_by":"Christopher Young","edited_by":"Bob Murawski","Release":"Drag Me to Hell was first shown to the public as a \"Work in Progress\" print at the South by Southwest festival on March 15, 2009.[15] The film debuted in its full form at the 2009 Cannes Film Festival, where it was shown out of competition on May 21 as a midnight screening.[16][17]The film was released in American theaters on May 29, 2009.[18] The film opened at #4 with $15,825,480 from 2,900 screens at 2,508 theaters, for an average of $6,310 per theater ($5,457 average per screen). In its second weekend, it dropped 56%, falling to #7, with $7,040,550 from 2,800 screens at 2,510 theaters, for an average of $2,805 per theater ($2,514 average per screen), and bringing the 10-day gross to $28,233,230.[19] Drag Me to Hell closed on August 6, 2009, with a final gross in the United States and Canada of $42,100,625, and an additional $48,742,021 internationally for a total of $90,842,646 worldwide.[2]Drag Me to Hell received widespread acclaim from critics upon its release. Rotten Tomatoes rated the film as \"Certified Fresh\", with 92% of critics giving the film a positive review, based upon a sample of 254 reviews, with the critical consensus stating, \"Sam Raimi returns to top form with Drag Me to Hell, a frightening, hilarious, delightfully campy thrill ride.\"[20] At Metacritic the film has received an average score of 83 out of 100, based on 32 reviews, signifying \"universal acclaim\".[18]Positive critical reception of the film generally praised the film's scary but humorous and campy tone. Owen Gleiberman of Entertainment Weekly gave the film an A rating, stating that \"Raimi has made the most crazy, fun, and terrifying horror movie in years.\"[21] Betsy Sharkey of the Los Angeles Times praised the film, stating that it \"should not be dismissed as yet another horror flick just for teens. The filmmakers have given us a 10-story winding staircase of psychological tension that is making very small circles near the end.\"[22] Michael Phillips of the Chicago Tribune described the film as a \"hellaciously effective B-movie [that] comes with a handy moral tucked inside its scares, laughs and Raimi's specialty, the scare/laugh hybrid.\"[23] Roger Ebert of the Chicago Sun Times gave the film 3 out of 4 stars, and stated that the film \"is a sometimes funny and often startling horror movie. That is what it wants to be, and that is what it is.\"[24] In a positive review, Variety said of the film: \"Scant and barren of subtext, the pic is single-mindedly devoted to pushing the audience's buttons... Still, there's no denying it delivers far more than competing PG-13 thrillers.\"[6]Bloody Disgusting gave the film four and a half stars out of five, with the review calling it \"quite simply the most PERFECT horror film I've seen in a long, long while... [It's] a blast and moved quickly from start to finish [and] is well on its way to becoming an immediate classic.\"[25] The film was then ranked thirteenth in Bloody Disgusting's list of the 'Top 20 Horror Films of the Decade'.[26]Kyle Smith of the New York Post thought it was cheesy, with too many \"gross-outs\",[27] Rex Reed of the New York Observer thought that the plot wasn't believable enough,[28] and Peter Howell of The Toronto Star disliked Lohman's performance and thought it was \"just not very funny\".[29] The film was nominated for \"Choice Movie: Horror/Thriller\" at the 2009 Teen Choice Awards, which the film lost to Friday the 13th (2009).[30][31] At the 2009 Scream Awards show, Drag Me to Hell won the awards for Best Horror Movie and Best Scream-play.[32][33]Reviews have also received the film as a comedy horror in a more classic Raimi vein. Vic Holtreman of Screenrant claims the film is a long-awaited movie that combines both genres as Army of Darkness had done.[34] A reviewer at UGO Networks says that the film is very much more a comedy than horror and that this is in keeping with Raimi not having produced a \"true horror\" film since he began directing.[35]Drag Me to Hell was released on DVD and Blu-ray Disc in the US on October 13, 2009. Both media include an Unrated Director's Cut as well as the Theatrical Version.[36] In its first two weeks the DVD sold 459,217 copies generating $7.98 million in sales.[37] It since accumulated $13.9 million in DVD sales in the United States.","written_by":"Sam Raimi|Ivan Raimi|","budget":"$30 million[2]"}