{"a_night_to_remember":"original poster","Cast":"Cast notes:","country":"United Kingdom","distributed_by":"The Rank Organisation Carlton International Media (UK) CBS (TV) Criterion (USA DVD)","screenplay_by":"Eric Ambler","story_by":"Walter Lord","Plot":"The Titanic was the largest vessel afloat and was widely believed to be unsinkable. Her passengers included the cream of American and British society. The story of her sinking is told from the point of view of her passengers and crew, principally Second Officer Charles Lightoller (Kenneth More).Once in the open sea on her maiden voyage, the ship receives a number of ice warnings from other steamers. Only a few of the messages are relayed to Captain Edward J. Smith (Laurence Naismith), who orders a lookout, but because of nearly universal faith in the ship's indestructibility, does not slow the ship or consider an alternate route.Late on 14 April 1912, lookout Frederick Fleet (Bernard Fox) spots an iceberg directly in front of the ship. The vessel turns hard to port but collides with the iceberg on its starboard side, opening the first five compartments to the sea, below the waterline. Thomas Andrews (Michael Goodliffe), the ship's builder, inspects the damage and determines the ship will soon sink, a bad situation made horrific by the fact that it lacks sufficient lifeboat capacity for everyone on board.A distress signal is sent out, and efforts begin to signal the Californian, visible on the horizon, a mere 10 miles away. But its radio operator is off duty and does not hear the distress signal. Fortunately, the radio operator on the RMS Carpathia receives the distress call, understands the emergency, and immediately alerts Captain Arthur Rostron (Anthony Bushell), who promptly orders the ship to head to the site at maximum speed.Captain Smith orders Officers Lightoller and William Murdoch (Richard Leech) to start lowering the lifeboats. Many women and children are reluctant to get in the small, cramped lifeboats, and Murdoch and Lightoller must use force to put them in. Many men try to sneak on board, but Lightoller will not allow them. Murdoch, working the other side of the ship, is shown as more accommodating to men. As the stewards struggle to hold back women and children in third-class, most of those from first- and second-class board the lifeboats and launch away from the ship.The Carpathia is four hours away and is racing to the site, in hopes of saving more lives. The Titanic sinks amid much chaos on the deck, with third-class passengers allowed up from below only after all the lifeboats have gone. Thomas Andrews retreats to the first-class smoking room (deciding to go down with the ship). The Titanic's bow submerges, and there are only two collapsible lifeboats left. Lightoller and other able seamen struggle to untie them and, unable to take the time to put passengers into them, leave them in the hope that they will save more lives. Captain Smith walks onto the bridge (deciding to go down with the ship), as the ship takes its final plunge; Lightoller and many others are swept off the ship. As the sinks deeper into the water; a funnel suddenly breaks loose and crashes onto the surface, killing a pair of newlyweds from second-class, and the ship finally goes under. One of the overturned collapsible boats is floating, so Lightoller and a few more men balance on it and wait. Chief Baker Charles Joughin (George Rose) is found in the water, not minding the cold because he's been drinking, and is pulled up onto the boat. Lightoller spots another boat, and the men are saved. The Carpathia comes and rescues the survivors.Lightoller, the senior surviving officer, reflects that they were all so sure about the safety of the ship, and that he will \"never be sure again, about anything.\"On the Carpathia, Lightoller is told that only 705 have survived, and the ship has only passed one body. The wireless operator comes on deck to inform Rostron that the Californian has just heard about Titanic's sinking and wants to help. Rostron says anything that was humanly possible has been done. Lightoller observes a long trail of debris in the ocean from the Titanic.The film's epilogue states that the passengers and crew of the Titanic have not died in vain, as today ships reflect lessons learned: they are equipped with lifeboats for all and an unceasing radio vigil, and the International Ice Patrol guards the sea lanes, making them safe for the peoples of the world.","language":"English","Reception":"Upon its December 1958 U.S. premiere, Bosley Crowther called the film a \"tense, exciting and supremely awesome drama...[that] puts the story of the great disaster in simple human terms and yet brings it all into a drama of monumental unity and scope\"; according to Crowther:[16]\"this remarkable picture is a brilliant and moving account of the behavior of the people on the Titanic on that night that should never be forgotten. It is an account of the casualness and flippancy of most of the people right after the great ship has struck (even though an ominous cascade of water is pouring into her bowels); of the slow accumulation of panic that finally mounts to a human holocaust, of shockingly ugly bits of baseness and of wonderfully brave and noble deeds.\"The film was a relative disappointment at the box office.[1] However, it received critical acclaim. A Night to Remember won the 1959 \"Samuel Goldwyn International Award\" for the UK at the Golden Globe Awards.[17] The film currently has a \"certified fresh\" score of 100%. It still receives praise. It is considered \"the best Titanic film before Titanic (1997)\" and \"the most accurate of all Titanic films\" [18] and \"the definitive Titanic tale\",[19] especially for its social realism, reflecting, in the words of one critic, \"the overwhelming historical evidence that the class rigidity of 1912, for all its defects, produced a genuine sense of behavioural obligation on the Titanic among rich and poor alike; that the greatest number of people aboard faced death or hardship with a stoic and selfless grace that the world has wondered at for most of this century.\"[20]","Home video":"A Night to Remember is one of the Criterion Collection's early titles. A high definition upgrade of the DVD and a Blu-ray edition were released on 27 March 2012.","cinematography":"Geoffrey Unsworth","directed_by":"Roy Ward Baker","Historical inaccuracies":"Of note are some historical inaccuracies:The first scene of A Night to Remember depicts the christening of the ship at its launch. However, Titanic was never christened, as it was not the practise of the White Star Line to stand on this sort of ceremony. This has come down in popular lore as one of the many contributing factors to the ship's \"bad luck\".As with most films about the Titanic made before the discovery of the wreck in 1985, the film portrays the ship as sinking in one piece,[12] when in fact, Titanic broke into two pieces as she sank.The crew, including Captain Smith is depicted having a full trust in the Titanic, considering her \"unsinkable\", an allegation which was never claimed with such a certainty.[13]During the ship's final plunge, Captain Smith walks onto the bridge (deciding to go down with the ship). There are conflicting accounts of his death, although some state that he died in this manner.The fourth funnel collapses into the ocean. In reality, the forward funnel broke off and landed in the water.During the last minutes of the sinking, a steward pauses as he flees through the first-class smoking room to ask ship's designer Thomas Andrews if he is going to save himself. Although this has become one of the most famous legends of the sinking of the Titanic, this story, which was published in a 1912 book (Thomas Andrews: Shipbuilder) and therefore perpetuated, came from John Stewart, a steward on the ship who in fact left the ship in boat n. 15 at approximately 1:40 a.m.[14] There were testimonies of sightings of Andrews after that moment.[14] It appears that Andrews stayed in the smoking room for some time, then he continued assisting with the evacuation.[14] At around 2:00 AM, Andrews was seen back on the boat deck. The crowd had begun to stir, but there were still women reluctant to leave the ship. To be heard and to draw attention to himself, Andrews waved his arms and announced to them in a loud voice.[15] Another reported sighting was of Andrews frantically throwing deck chairs into the ocean for passengers to cling to in the water. Andrews then headed towards the bridge, perhaps in search of Captain Smith.[15] Andrews was last seen leaving the ship at the last moment.","release_dates":"3 July 1958 (1958-07-03)|||||","Production":"The film is based on Walter Lord's book A Night to Remember (1955), but in Ray Johnson’s documentary The Making of 'A Night to Remember' (1993), Lord says that when he wrote his book, there was no mass interest in the Titanic,[8] and he was the first writer in four decades to attempt a grand-scale history of the disaster, synthesizing written sources and survivors’ firsthand accounts. Lord dated the genesis of his interest in the subject to childhood. So did producer MacQuitty, who, as a boy of six, watched the Titanic set out from Belfast, as well as screenwriter Ambler, who was a lad in London when the ship was launched.Producer MacQuitty had originally contracted with Shaw, Savill & Albion Line to use its former flagship QSMV Dominion Monarch to shoot scenes for the film, but the company pulled out of the production at the last minute, citing that they did not want to use one of their liners to recreate the Titanic sinking. However, according to MacQuitty, the Shaw Savill Line at the time was managed by Basil Sanderson, son of Harold Sanderson, the White Star Line's director in the U.S. at the time of the sinking. Harold Sanderson would later succeed J. Bruce Ismay as president of the International Mercantile Marine Company, J.P. Morgan's shipping conglomerate that owned the White Star Line. This connection to White Star, according to MacQuitty, is what actually led the Shaw Savill Line to pull out of the film. MacQuitty eventually got permission from Ship Breaking Industries in Clydebank, Scotland to film scenes aboard RMS Asturias, a liner the company was in the process of scrapping. The liner's port side had been demolished, but its starboard was still intact, and so MacQuitty got art students to paint the liner the White Star Line colors and used mirrors to recreate scenes that took place on the port side.In addition to basing the script — both in action and dialogue — on Lord's book, the filmmakers achieved nuanced performances and authentic atmosphere by consulting several actual Titanic survivors who served as technical advisors. Among them were Fourth Officer Joseph Boxhall, and passengers Edith Russell and Lawrence Beesley. Boxhall and Russell were also portrayed in the movie.Kenneth More recalled the production of the film in his autobiography, published 20 years later in 1978. There was no tank big enough at Pinewood Studios to film the survivors struggling to climb into lifeboats, so it was done in the open-air swimming bath at Ruislip Lido, at 2:00am on an icy November morning. When the extras refused to jump in, More realised he would have to set an example. He called out: \"Come on!\"\"I leaped. Never have I experienced such cold in all my life. It was like jumping into a deep freeze. The shock forced the breath out of my body. My heart seemed to stop beating. I felt crushed, unable to think. I had rigor mortis, without the mortis. And then I surfaced, spat out the dirty water and, gasping for breath, found my voice.'Stop!' I shouted. \"Don't listen to me! It's bloody awful! Stay where you are!The character of the baker, seen drinking after giving up his seat in a lifeboat to a female passenger, is based on Chief Baker Charles Joughin who, on that night, drank some whisky, threw deck chairs overboard, rode the stern all the way down, swam in the freezing water for hours, was eventually picked up by the overturned collapsible boat B, and survived the disaster.During the sinking, a steward pauses as he flees through the first-class smoking room to ask ship's designer Thomas Andrews, \"Aren't you even going to try for it, Mr Andrews?\" This sequence was replicated essentially word-for-word in Titanic (1997), substituting that film's protagonists Jack Dawson and Rose DeWitt Bukater instead of the steward. The scene was also repeated in S.O.S. Titanic, with a stewardess asking him if he will save himself, pointing out that there would be questions that only he could answer.Four clips from the Nazi propaganda film Titanic (1943) were used in A Night to Remember; two of the ship sailing in calm waters during the day, and two of a flooding walkway in the engine room.[10] As Brian Hawkins writes: the British came closest \"to the Titanic truth in 1958 with their black-and-white production of Walter Lord's novel A Night to Remember, seamlessly incorporating sequences from director Herbert Selpin's 1943 (Nazi) Titanic without giving any screen credits for these incredible scenes.\"[11] Selpin, himself, was executed by Goebbels over the course of production in early August 1942, for offering a negative opinion of the German military while directing this earlier Nazi era film.","produced_by":"William MacQuitty","starring":"Kenneth More James Dyrenforth","running_time":"123 minutes","music_by":"William Alwyn","budget":"£500,000[1]"}