{"country":"Norway","distributed_by":"Happy Endings A/S","Plot":"The film is about 24-year-old Kristoffer (Nicolai Cleve Broch), who lives in Tøyen in Oslo with his friends Geir (Aksel Hennie) and Stig Inge (Anders Baasmo Christiansen). Geir likes to live dangerously, while Stig is a more cautious and uncertain type. Kristoffer and Geir work as billboard hangers, and in his spare time Kristoffer makes a video diary with Geir and Stig, containing stunts of a Jackass-nature. When Kristoffer's girlfriend, Elisabeth (Janne Formoe), leaves him, his life seems to fall to pieces. Then his videos are featured on Norway's most popular talk show, \"God morgen Norge\" on TV 2, and Kristoffer becomes famous.","language":"Norwegian","Reception":"Buddy was generally well received by the Norwegian press. The newspaper Verdens Gang gave it five out of six points, and remarked that in spite of a simple story, the movie was \"damn well made\".[4] Dagbladet was less impressed, and gave the film a dice throw of four out of six pips. The reviewer concluded that the film makers had succeeded in what they set out to do: to create an essentially \"harmless\" \"feel-good-movie\" after an American model.[5] The movie was also released internationally, and reviewed by the American magazine Variety. Eddie Cockrell, as opposed to the Norwegian reviewers, thought the film was \"overly plotted\". He found the movie to be \"on the sweet side\", but commended its \"solid, sympathetic characterizations from the five leads\".[6]The film was awarded two Amandas in 2004: for \"Best Film (Norwegian)\" and \"Best Actor\" (Christiansen). It was also nominated in the category \"Best Screenplay\". It also received the \"Audience Award\" and the \"Most Enjoyable Film\" (awarded by Theatre Owners) at the Norwegian International Film Festival, the festival where the Amandas are awarded.[7] At the Karlovy Vary International Film Festival in the Czech Republic it won the \"Audience Award\" in competition with 200 other films.[8]","cinematography":"John Andreas Andersen","directed_by":"Morten Tyldum","release_dates":"Norway: 4 July 2003","Production":"The idea for the movie started with two A4 pages of text in January 2002, from which it developed quickly.[1] The creators described it as a love declaration for the city of Oslo, a city they believed was under-represented on film. The choice of composer for the score – Lars Lillo-Stenberg – was in the same spirit; in the words of Tyldum: \"He is Oslo\".[1]Buddy received support from Norsk Filmfond – the Norwegian government body for film funding – on 12 June 2002.[2] Neither the script writer, the director, the producer or the actor for the main character had worked with feature-length films prior to this project.[3] The director, Morten Tyldum, had worked with television, music videos, commercials and short films before, and he had been named \"Film talent of the year\" by the newspaper Dagbladet in 1999, but this was his first full-length motion picture.[3]","starring":"Nicolai Cleve Broch Aksel Hennie Anders Baasmo Christiansen Pia Tjelta Janne Formoe","running_time":"105 min","music_by":"Lars Lillo-Stenberg","edited_by":"Eli Nilsen","written_by":"Lars Gudmestad"}