{"based_on":"\"Children of the Corn  by Stephen King","country":"United States","distributed_by":"New World Pictures","children_of_the_corn":"Original 1984 theatrical poster","Plot":"In the fictional town of Gatlin, Nebraska, Job, a small child who is a resident of the town, tells the story of how the town became a haven for a group of young cultists. The economy of the town is mostly agricultural, and the town is surrounded by vast cornfields. One particular year the corn crop fails and the people of Gatlin turn to prayer in an attempt to ensure a successful harvest. A young boy, Isaac Chroner, takes all the children of Gatlin into a cornfield and preaches to them about the prophecies of a strange, bloodthirsty incarnation of the Abrahamic God called \"He Who Walks Behind The Rows\". Isaac, through his lieutenant Malachai, leads the children in a revolution, brutally killing all of the adults in the town. Over the ensuing years, the children take any adults passing through as sacrifices.Three years later, Vicky and her boyfriend Burt pass through Nebraska while driving cross-country to Burt's new job as a physician in Seattle, Washington. As they travel in their car they hit a small boy out on the highway, one of the Gatlin children who tried to escape the iron hand of the syncretistic death cult. After inspection of the boy's body Burt determines that the child had his throat slit before being hit by the car and had stumbled on to the road from inside the cornfield. They take the blood-soaked suitcase as evidence, load the body in the trunk and set out to find the nearest telephone to call for help. Pulling into a rundown service station, they encounter an old man who refuses to help due to his secret agreement with the children to supply them with oil and gasoline in exchange for his life. However, Malachai breaks the pact against Isaac's will and murders the old man and his dog once Burt and Vicky leave.Vicky and Burt finally end up in seemingly abandoned Gatlin. The two enter a small diner hoping to find a phone, but find that the diner is abandoned and strewn with dead corn leaves. While searching an abandoned house, the two encounter Sarah, who explains that she is hiding from Isaac and Malachai. Burt asks Vicky to stay with Sarah in the house and goes on foot into town to continue searching for a phone. He finds that most of the buildings are in a state similar to the diner; rundown and strewn with corn leaves. Even the school and the town hall are abandoned, with various lines from Isaac's sermons written on the walls in blood. Meanwhile, at the house, Vicky is ambushed by Malachai and a group of followers, led to her location by the parked car Vicky and Burt came in. Vicky is captured and brought to a clearing in the cornfield where she is lifted onto a cross, ready to be sacrificed.Downtown, Burt enters the church to find a congregation of children performing a birthday ritual for an older teenager, in which a pentagram is cut into the boy's chest and his blood is consumed by the congregation. The girl leading the ritual tells Burt about He Who Walks Behind The Rows, and about the ritual: that it is a preparation for the ritual sacrifice of a child who has grown to adulthood. Burt is attacked by the girl and flees the church. Burt is chased through the town and is rescued by Job, who stops him and beckons for him to hide in the fallout shelter built by the siblings' father, now deceased. While caring for Burt, Job and Sarah tell him that Vicky has been taken hostage by Malachai.Meanwhile, in the clearing, Isaac scolds Malachai for breaking the pact with the old man, whose gasoline is needed by the children. However, Malachai and the others have grown weary of Isaac's arrogance. Assuming command over the children, Malachai orders for Isaac to be sacrificed in Vicky's place. A furious Isaac warns them that they will all be punished for this affront, as by sacrificing him, they will have broken their covenant with He Who Walks Behind the Rows. Night soon falls and Burt enters the cornfield, stealthily waiting for the right moment to intervene. Suddenly, an unnatural wind descends upon the field and a bright, amorphous light seemingly devours the screaming Isaac. Burt attacks and battles Malachai, telling the children that their minds have been poisoned and their humanity sacrificed in the name of a false god. As Malachai tries to regain control of the children, a demonic voice calls out to him. Isaac's bloodied corpse appears, seemingly reanimated and speaking in an unnaturally deep and commandingly loud voice. Burt, Vicky, and all the children flee the scene as Isaac seizes and kills Malachai by breaking his neck.The wind becomes a terrible storm that gathers over the cornfield as Vicky and Burt gather the children inside a barn to protect them from both the storm and the supernatural forces at work. As the storm intensifies all around them, Sarah shows a Bible verse to Vicky and Burt that indicates that they must destroy the cornfield for the evil to cease (it is heavily implied that He Who Walks Behind The Rows is not the God of the Bible but an aspect of the Devil). While filling the irrigation pumps with gasohol fuel, He Who Walks Behind The Rows (this time in the form of a demonic red cloud) lashes out at Burt, and prepares to destroy the barn. However, Burt is able to spray the fields with the flammable liquid and lights a Molotov cocktail, tossing it into the field, burning it and seemingly destroying the demon.Vicky, Burt, Sarah and Job survive and are able to leave Gatlin as the cornfields burn. They arrive back at the car but see that it had been disabled by the children earlier. Deciding to walk the 19 miles to the nearest town, Burt sits in the front seat and searches in the glove compartment for a map. Suddenly, the teenage girl who was leading the pre-sacrifice ritual at the church earlier jumps out at him from the back seat and attempts to stab him. Burt grapples with her and manages to escape the car. Vicky knocks the girl out with the passenger door, and the four leave the scene.","language":"English","Reception":"The film received negative reviews from Gene Siskel and Roger Ebert on At the Movies.[2] At Rotten Tomatoes, it has a \"Rotten\" rating of 38%, based on 24 reviews, with the average review being 4.1/10.[3] The film took in over $14 million at the US box office.[4]","box_office":"$14,568,589[1]","cinematography":"Joao Fernandes (credited as Raoul Lomas)","production_company":"Angeles Entertainment Group Cinema Group Hal Roach Studios Inverness Productions Planet Productions","directed_by":"Fritz Kiersch","Filming locations":"The towns of Hornick and Whiting, both in Iowa, were used for most of the exterior scenes and several of the interiors.The exterior street scene with the yellow concrete flag pole in the center of the intersection is located at Whittier and Blair Streets in Whiting, Iowa.","release_dates":"March 9, 1984 (1984-03-09)|||||","Television remake":"In June 2008, it was confirmed that Donald P. Borchers would begin writing and directing a TV remake of the first film, which would premiere on the Syfy channel. Production began in August, filming in Davenport, Iowa,[5] however, it was moved to Lost Nation, Iowa.(TJC)The cast included David Anders, Kandyse McClure, Preston Bailey, Daniel Newman and Alexa Nikolas. The movie aired on September 26, 2009, and the DVD was released on October 6, 2009 by Anchor Bay.[6] The television remake closely follows the original storyline present in the short story, and not that of the original film.","produced_by":"Donald P. Borchers Terence Kirby","starring":"Peter Horton|Linda Hamilton|","running_time":"92 minutes","music_by":"Jonathan Elias","edited_by":"Harry Keramidas","written_by":"George Goldsmith","budget":"$800,000[1]"}