{"based_on":"Broken April  by Ismail Kadare","country":"Brazil France Switzerland","Awards and nominations":"BAFTA Film AwardsGolden Globe AwardsHavana Film FestivalVenice Film Festival","distributed_by":"Buena Vista International","Plot":"The year is 1910; the place, the badlands of Northeast Brazil. Twenty-year-old Tonho is the middle son of an impoverished farm family, the Breves. He is next in line to kill and then die in an ongoing blood feud with a neighboring clan, the Ferreiras. For generations, the two families have quarreled over land. Now they are locked into a series of tit-for-tat assassinations of their sons; an eye-for-an-eye, a tooth-for-a-tooth. Embedded in this choreography of death is a particular code of ethics: \"Blood has the same volume for everyone. You have no right to take more blood than was taken from you.\" Life is suffused with a sense of futility and stoic despair.Under pressure from his father, Tonho kills one of the Ferreira sons to avenge the murder of his older brother. This act marks him as the next victim. Tonho's younger brother is addressed only as \"the Kid\" by the family. Anticipating future loss, his parents don't give him a name. The Kid is an imaginative and loving child, whose spirit will not break in the face of harsh parenting, brutalizing isolation, and numbing poverty. The Kid's love encourages Tonho to question his fate. When Tonho meets Clara, a charming itinerant circus girl, all of life's possibilities open up for him.The film is narrated by \"The Kid\" who is later given a name by Clara and her stepfather, the traveling circus performers. They call him \"Pacu\" and he spends the whole film narrating which ultimately drives the viewers to identify and allows the film to humanize the characters.Later, Pacu and Tonho visit the circus in town, with Tonho forming a relationship with Clara. Clara later leaves her stepfather to be with Tonho, arriving at the farm to be with him. The two sleep together before she departs, telling Tonho to meet her in the east by the ocean. One of the Ferreira men come to the farm in order to exact revenge on the Breves, initially appearing to kill Tonho. However, it is revealed that they actually shot and killed Pacu, devastating the Breves.The father tells Tonho to get the gun in order to kill all of the remaining Ferreiras in retaliation. Tonho, realizing that his life with his family is destroyed, walks off without a word. His father attempts to shoot him for disregarding the honor of their family, but he is stopped by the mother who insists that the feud no longer matters and that it's over. Tonho arrives on a beach, staring at the sea with an expression of melancholic wonder on his face.","behind_the_sun":"Original film poster","language":"Portuguese","Themes":"Family- Tonho is driven by his family and only wants to please his father in this endless land battle. His approval by the family and wanting to continue on tradition, because this is all he knows, is proven when he avenges his older brother's death. By wanting to escape this battle, he attempts to elongate his younger brother's life, however, he's too late.Love- The act of love in this film is powerful. Seeing the way Tonho interacts with Clara, Pacu tries to emulate his brother so he can live happily ever after. Love plays an important role in this film by distinguishing the different characters and what they stand for.War- This endless family land battle is a symbol of how change and progress are not made within early 20th century Brazil. War allows the viewers to understand tradition in Brazil during this time period. The land battle signifies the ability to adapt and change is not happening any time soon.","box_office":"R$2.063.956[1] ($928,037)","production_company":"Videofilmes","directed_by":"Walter Salles","release_dates":"September 6, 2001 (2001-09-06) (Venice)|May 1, 2002 (2002-05-01) (Brazil)||||","produced_by":"Arthur Cohn","starring":"Rodrigo Santoro José Dumont Rita Assemany","running_time":"105 minutes","music_by":"Ed Cortês Antonio Pinto Beto Villares","edited_by":"Isabelle Rathery","written_by":"Karim Aïnouz Sérgio Machado Walter Salles João Moreira Salles Daniela Thomas","budget":"$4 million"}