{"country":"United States","distributed_by":"Entertainment One","Adaptation from source material":"The scene in which Peter Mitchell tells his music class an anecdote about meeting Pablo Casals is adapted from an anecdote found in Cellist, the autobiography of cellist Gregor Piatigorsky; the circumstances of the encounter and the pieces played are changed in the film, but Casals's words are essentially identical to those recounted by Piatigorsky.[6]","Plot":"As the Fugue String quartet approaches its 25th anniversary, the onset of a debilitating illness to cellist Peter Mitchell (Christopher Walken), forces its members to reevaluate their relationships. After being diagnosed with Parkinson's disease, Peter announces his decision to play one final concert before he retires. Meanwhile the second violinist, Robert (Philip Seymour Hoffman), voices his desire to alternate the first violinist role, long held by Daniel (Mark Ivanir). Robert is married to Juliette (Catherine Keener), the viola player of the group. Upon discovering Juliette does not support him in this matter, Robert has a one-night stand. Further complicating matters, their daughter, Alexandra (Imogen Poots), begins an affair with Daniel, whom her mother once pined for. Yet bound together by their years of collaboration, the quartet will search for a fitting farewell to their shared passion of music and perhaps even a new beginning.","language":"English","Reception":"A Late Quartet received generally positive reviews, currently holding a 79% \"fresh\" rating on Rotten Tomatoes.[7]","box_office":"$1,562,546[2]","cinematography":"Frederick Elmes","production_company":"Opening Night Productions RKO Pictures","directed_by":"Yaron Zilberman","Soundtrack":"The film's stage performances were filmed in the Metropolitan Museum of Art's Grace Rainey Rogers Auditorium, the same stage where the Guarneri Quartet gave its farewell concert in 2009.","release_dates":"September 10, 2012 (2012-09-10) (TIFF)|November 2, 2012 (2012-11-02)||||","produced_by":"Yaron Zilberman Mandy Tagger Vanessa Coifman David Faigenblum Emanuel Michael Tamar Sela","starring":"Philip Seymour Hoffman Christopher Walken Catherine Keener","running_time":"106 minutes[1]","music_by":"Angelo Badalamenti","edited_by":"Yuval Shar","a_late_quartet":"Theatrical release poster","written_by":"Yaron Zilberman Seth Grossman"}