{"based_on":"Bastard out of Carolina  by Dorothy Allison","country":"United States","distributed_by":"Showtime","Plot":"Ruth Anne, nicknamed \"Bone\" Boatwright, is a young girl growing up in Greenville, South Carolina in the 1950s. Born out of wedlock to Anney, Bone lives with her mother and their extended family in a poor part of town. Anney loves Bone, but is still very much a child herself, tired out from working and needy for attention and adoration. Bone and Anney nearly always have to face the shame of the \"ILLEGITIMATE\" stamp on Bone's birth certificate. Later, when the county courthouse burns down, Anney is happy that a copy of Bone's birth certificate no longer exists, much less has \"ILLEGITIMATE\" stamped on it.After her kind, hardworking first husband, Lyle Parsons, the father of Bone's half-sister, is killed in an automobile accident, Anney remarries a man named Glen Waddell, who seems attentive until Anney's and Glen's baby dies at birth. Glen first sexually assaults Bone, while waiting in the car for the birth of his child. Frustrated by the loss of his eagerly-anticipated son, Anney's inability to have more children, and his own inability to manage his temper and maintain steady employment, Glen begins to physically and sexually abuse Bone regularly in the bathroom. Anney is saddened by her new husband's behavior towards her child, but does not leave him.One day at Aunt Ruth's funeral, Bone's Aunt Raylene discovers lashes on her legs and alerts the girl's uncles, Earle, Wade, and Travis, and a man who beat Glen unconscious. Bone is sent to live with her aunts, and eventually tells her mother that she is allowed to love Glen, but that Bone will never come home to him again. Eventually, Glen comes around while the aunts are out, trying to force her to come back. When she fights back, he punches and then rapes her. Anney discovers the rape and breaks a bottle over Glen's head, causing his head to bleed, pulls and kicks him off of Bone, then carries her out of the house to her car while screaming at Glen, calling him a son of a bitch, a monster, and a bastard. Glen stumbles out of the house after Anney, screaming his apologies and saying he can't live without her. Anney yelled at him to stay away. Then, she puts Bone into her car. When Glen gets his hand on Anney, she pushes him away and gets into her car. Glen then leans against the car door and repeatedly smashes his head against it, screaming for Anney to kill him. Instead, she strokes his head in forgiveness, believing he will never hurt Bone again. Ultimately, Anney returns to Glen.Bone is taken to the hospital by her Aunt Raylene. When a cop attempts to question her about who brutalized her, she still refuses to reveal that it was Glen and calls out for her Momma who is nowhere to be found. In the end, Bone is allowed to stay with her Aunt Raylene and Uncle Earle, far away from the reach of those who would harm her. Her mother visits one final time to deliver to her the copy of her birth certificate without the mark of \"ILLEGITIMATE\" that had plagued Bone her whole life, and apologizes for what happened. She never wanted Bone to get hurt and never thought Glen would hurt her like that. And she loved him. And couldn't believe she couldn't imagine.Bone's mother kisses her forehead, like she used to, and tells her that she will always love her, before driving away to rejoin Glen. Bone remains with her Aunt, and with this final, tearful goodbye, she cries for her mother's sacrifice and for the freedom she has at last achieved. Her final words are voiced in the narration by Laura Dern.\"Who had Momma been? What'd she wanted to be, or do before I was born? Once I was born, her hopes turned, and I climbed up her life like a flower reaching for the sun. Her life had folded into mine. Who would I be when I was 15, 20, 30? Would I be as strong as she had been? As hungry for love? As desperate, determined and ashamed? I wouldn't know, that I was already who I was gonna be. Someone like her, like my Momma. A Boatwright. A bastard. A bastard outta Carolina.\"","language":"English","bastard_out_of_carolina":"DVD cover for Bastard out of Carolina","cinematography":"Anthony B. Richmond","directed_by":"Anjelica Huston","narrated_by":"Laura Dern","release_dates":"December 15, 1996","produced_by":"Amanda DiGiulio","starring":"Jennifer Jason Leigh Jena Malone Ron Eldard Glenne Headly Dermot Mulroney Grace Zabriskie Michael Rooker Christina Ricci","running_time":"97 minutes","music_by":"Van Dyke Parks","edited_by":"Éva Gárdos","written_by":"Anne Meredith"}