{"country":"United States","cobb":"Theatrical release poster","distributed_by":"Warner Bros.","Plot":"Sportswriter Al Stump is hired in 1960 as ghostwriter of an authorized autobiography of baseball player Tyrus Raymond \"Ty\" Cobb. Now 73 and in failing health, Cobb wants an official biography to \"set the record straight\" before he dies.Stump arrives at Cobb's Lake Tahoe estate to write the official life story of the first baseball player inducted into the National Baseball Hall of Fame. He finds a continually-drunken, misanthropic, bitter racist who abuses his biographer as well as everyone else he comes in contact with. Although Cobb's home is luxurious, it is without heat, power and running water due to long-running violent disputes between Cobb and utility companies. Cobb also rapidly runs through domestic workers, hiring and firing them in quick succession.Although Cobb is seriously ill and prone to frequent physical breakdown, he retains considerable strength and also keeps several loaded firearms within easy reach at almost all times, making the outbreak of violent confrontation always an immediate possibility in his presence.Cobb almost gets killed in an automobile accident off the Donner Pass, driving recklessly in a blizzard. Stump rescues him, but Cobb then seizes control of Stump's car until he gets into another accident. The car has to be towed to Reno.Stump and Cobb go see a show at a Reno resort hotel featuring Keely Smith and Louis Prima, whose act Cobb rudely interrupts. A cigarette girl, Ramona, becomes interested in Stump, but when Cobb barges into the hotel room, he's in a jealous rage. He takes Ramona to another room, where he physically abuses her.Cobb and Stump travel together cross-country by automobile to the Baseball Hall of Fame's induction weekend in Cooperstown, New York, where many star players from Cobb's era are in attendance, including Rogers Hornsby and Mickey Cochrane. Cobb is haunted by images from his violent past as he views film footage of his career.From there, Cobb and Stump drive south to Cobb's native Georgia, where his estranged daughter continues to live. She refuses to see him. Stump, having spent months with Cobb witnessing his behavior and absorbing considerable abuse, is torn between creating the autobiography that Cobb hired him to write and writing his own book on Cobb's true self. Cobb begins to regard Stump as a friend of sorts; it is clear his conduct has driven away virtually all his legitimate friends and family.Stump writes two books simultaneously: the one Cobb expects, and his own, sensational, merciless account which will reveal the real Cobb, warts and all. Stump plans to complete Cobb's version while the old man is still alive, guaranteeing his payment for the project, letting Cobb die happy, then issue the hard-hitting followup after Cobb is gone. After a long night of drinking when his own personal life begins to unravel, Stump passes out. Cobb discovers his notes for the no-punches-pulled version, bringing on an epic explosion.Cobb begins to cough up blood and is taken to a hospital, where he wields a gun and treats doctors and nurses as harshly as he has everyone else. Stump gains a grudging respect for the player's legendary intensity and fearsome competitive fire, as well as an understanding that the murder of Cobb's father may have been partly responsible for his antagonistic personality. Stump is conflicted in his opinion of Cobb, and, in the end, completes the glowing autobiography Cobb hired him to write.","language":"English","Reception":"Peter Travers of Rolling Stone hailed it as \"one of the year's best\" and Charles Taylor of Salon included it on his list of the best films of the decade. Others took a harsher view of the picture. Owen Glieberman of Entertainment Weekly gave the film a 'D', claiming it to be a \"noisy, cantankerous buddy picture\" and presented Cobb as little more than a \"septuagenarian crank.\" He noted that while the film had constant reminders of Cobb's records, it had little actual baseball in it, besides one flashback where Cobb is seen getting on base, then stealing third and home, and instigating a brawl with the opposing team. He explained: \"By refusing to place before our eyes Ty Cobb's haunted ferocity as a baseball player, it succeeds in making him look even worse than he was.\"[citation needed]Roger Ebert's review of Dec. 2, 1994 in the Chicago Sun-Times described Cobb as one of the most original biopics ever made and including \"one of Tommy Lee Jones's best performances,\" yet gave the film only two stars of a possible four.Cobb currently has a 64% rating on Rotten Tomatoes based on 47 reviews.The film opened in limited release in December 1994. It earned a reported $1,007,583 at the U.S. box office.","box_office":"$1,007,600","cinematography":"Russell Boyd","production_company":"Regency Enterprises Alcor Films","directed_by":"Ron Shelton","release_dates":"December 2, 1994","Production":"Baseball scenes were filmed in Birmingham, Alabama at Rickwood Field, which stood in for Philadelphia's Shibe Park and Pittsburgh's Forbes Field. Scenes also were filmed in Cobb's actual hometown of Royston, Georgia.Much of the Cobb location filming was done in Northern Nevada. The hotel check-in was at the Morris Hotel on Fourth Street in Reno. Casino, outdoor and entry shots were done outside Cactus Jack's Hotel and Casino in Carson City and outside the then-closed, now-reopened (2007) Doppelganger's Bar in Carson City.The late baseball announcer Ernie Harwell, a member of the Hall of Fame, is featured as emcee at a Cooperstown, New York awards banquet.[citation needed] Real-life sportswriters Allan Malamud, Doug Krikorian, and Jeff Fellenzer and boxing publicist Bill Caplan appear in the movie's opening and closing scenes at a Santa Barbara bar as Stump's friends and fellow scribes.[citation needed] Carson City free-lance photographer Bob Wilkie photographed many still scenes for Nevada Magazine, the Associated Press, and the Nevada Appeal.Tommy Lee Jones was shooting this film when he won the Academy Award for Best Supporting Actor for The Fugitive. Since his head was partially shaved in the front for his role as the balding, 72-year-old Cobb, the actor made light of the situation in his acceptance speech: \"All a man can say at a time like this is, 'I am not really bald,'\" Jones said. He added, \"But I do have work.\" In addition to his partially shaved head, Jones also endured a broken ankle, suffered while practicing Cobb's distinctive slide.[1]The film shows Cobb sharpening his spikes as a means to keep infielders from tagging him out as he ran the bases, and was accused of spiking several players who tried. Cobb, however, always denied ever spiking anyone on purpose.Tyler Logan Cobb, a descendant of Cobb's, played \"Young Ty.\"","produced_by":"David V. Lester Arnon Milchan","starring":"Tommy Lee Jones Robert Wuhl Lolita Davidovich","running_time":"128 min.","music_by":"Elliot Goldenthal","edited_by":"Kimberly Ray Paul Seydor","written_by":"Al Stump (book and article) Ron Shelton (screenplay)"}