{"country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","story_by":"John Lasseter Brad Lewis Dan Fogelman","Sequel and spin-offs":"On August 17, 2013, Michael Wallis the voice of Sheriff stated that Cars 3 was in development and it would include California's Route 99.[85] At the Disney shareholders meeting in March 2014, Disney CEO and chairman Bob Iger confirmed that Pixar is in preproduction on a third Cars film.[86] In July 2015, Lasseter said that the film may be released in the summer of 2018 or 2019.[87]An animated feature film spin-off called Planes, produced by DisneyToon Studios,[88] was released on August 9, 2013.[89] A sequel to Planes, titled Planes: Fire & Rescue, was later released the following year on July 18, 2014.[90]","language":"English","Voice cast":"Much of the cast from the original Cars remained intact for the sequel, but three voice actors of the original film have died since its release. Joe Ranft (who voiced Red) died in an automobile accident on August 16, 2005, ten months before Cars was released. The first film was dedicated in memoriam to him. Red appears in this film, but he does not speak or vocalize. George Carlin (who voiced Fillmore) died of heart failure on June 22, 2008; Fillmore also shows up in Cars 2, and he was voiced by Lloyd Sherr (who also voices Tony Trihull). Paul Newman (who voiced Doc Hudson) died of cancer on September 26, 2008. After Newman's death, Lasseter said they would \"see how the story goes with Doc Hudson.\"[12] Doc was eventually written out,[13] with a few references to the character, where he is thought to have died before the events of the movie, as Mater says that he would have been proud for McQueen's Piston Cups, which have been renamed after Doc; also, in the Tokyo race, one of the announcers says that Doc was one of the best dirt racers ever.In international versions of the film, the character Jeff Gorvette is replaced with race car drivers better known in the specific countries in his dialogue scenes (however, he still appears as a competitor).[15]In Brazil, Gorvette is replaced by Carla Veloso in his dialogue scenes (Carla appears in all other versions of the film, but with no lines); Carla is voiced by Brazilian singer Claudia Leitte. Sportspeople still appear, with Lewis Hamilton becoming Formula One champion Emerson Fittipaldi, while Brent Mustangburger and David Hobbscap were done by sports announcers José Trajano and Luciano do Valle.[19]","box_office":"$559.9 million[2]","cinematography":"Jeremy Lasky Sharon Calahan","production_company":"Walt Disney Pictures Pixar Animation Studios","directed_by":"John Lasseter","release_dates":"June 18, 2011 (2011-06-18) (Hollywood premiere)|June 24, 2011 (2011-06-24) (United States)||||","Production":"Cars is the second Pixar film, after Toy Story, to have a sequel as well as becoming a franchise.[20] John Lasseter, the director of the film, said that he was convinced of the sequel's story while traveling around the world promoting the first film. He said:Cars 2 was originally scheduled for a summer 2012 release, but Pixar moved the release up by a year.[12]In 2009, Disney registered several domain names, hinting to audiences that the title and theme of the film would be in relation to a World Grand Prix.[22]In March 2011, Jake Mandeville-Anthony, a U.K. screenwriter, sued Disney and Pixar alleging copyright infringement and breach of implied contract. In his complaint he alleged that Cars and Cars 2 are based in part on work that he had submitted early in the 1990s and he sought an injunction to stop the release of Cars 2 and requested actual or statutory damages. On May 13, 2011, Disney responded to the lawsuit, denying \"each and every one of Plaintiff's legal claims concerning the purported copyright infringement and substantial similarity of the parties' respective works.\"[23] On July 27, 2011, the lawsuit was dismissed by a district court judge who, in her ruling, wrote that the \"Defendants have sufficiently shown that the Parties' respective works are not substantially similar in their protectable elements as a matter of law\".[24]In November 2010, Owen Wilson, Larry the Cable Guy, Michael Caine, Emily Mortimer, Jason Isaacs, Joe Mantegna, Peter Jacobson, Bonnie Hunt, Tony Shalhoub, Cheech Marin, and Thomas Kretschmann were confirmed as the voice talent featured in the film.[25] From November 2010 until May 2011, Disney released information about the other voice talent, including Jenifer Lewis, Katherine Helmond, Michael Wallis, Darrell Waltrip, Franco Nero, Vanessa Redgrave, Bruce Campbell, Sig Hansen, Michel Michelis, Jeff Gordon, Lewis Hamilton, Brent Musburger, David Hobbs, John Turturro, and Eddie Izzard.[26]","running_time":"106 minutes","Release":"During the Summer of 2008, John Lasseter announced that Cars 2 would be pushed forward and released in the summer of 2011, one year earlier than its original 2012 release date.[28] The US release date was later confirmed to be June 24, 2011, with a UK release date set for July 22, 2011.[29] The world premiere of the film took place at the El Capitan Theatre in Hollywood on June 18, 2011.[30] Cars 2 was released in 4,115 theaters in the USA and Canada[31] setting a record-high for a G-rated film[32] and for Pixar. The latter was surpassed by Brave (4,164 theaters).[33]The film was preceded by a short film titled Hawaiian Vacation, directed by Gary Rydstrom and starring the characters of the Toy Story franchise.The film was released on DVD, Blu-ray, Blu-ray 3D, and Movie Download on November 1, 2011. This release was produced in four different physical packages: a 1-disc DVD, a 2-disc combo pack (DVD and Blu-ray), a 5-disc combo pack (DVD, Blu-ray, Blu-ray 3D, and Digital Copy), and an 11-disc three movie collector's set, which features Cars, Cars 2, and Cars Toons: Mater's Tall Tales). The film was also released as a Movie Download edition in both standard and high definition.[34]The Movie Download release includes four bonus features: Cars Toons \"Air Mater\", the Toy Story Toon \"Hawaiian Vacation\", \"World Tour Interactive Feature\", and \"Bringing Cars 2 to the World\". The 1-disc DVD and 2-disc Blu-ray/DVD combo pack releases include the shorts \"Air Mater\" and \"Hawaiian Vacation\", plus the Director John Lasseter Commentary. The 5-disc combo pack includes all of the same bonus features as the 1-disc DVD and 2-disc Blu-ray/DVD combo pack versions, in addition to \"World Tour Interactive Feature\" and \"Sneak Peek: The Nuts and Bolts of Cars Land.\" The 11-disc three movie collection comes packaged with Cars (DVD, Blu-ray, and Digital Copy), Cars 2 (DVD, Blu-ray, Blu-ray 3D,nand Digital Copy), and Mater's Tall Tales (DVD, Blu-ray, and Digital Copy).[34]Cars 2 sold a total of 1,983,374 DVD units during its opening week,[35] generating $31.24 million and claiming first place.[36] It also finished on the top spot on the Blu-ray chart during its first week, selling 1.76 million units and generating $44.57 million. Its Blu-ray share of home media was 47%, indicating an unexpectedly major shift of sales from DVD to Blu-ray.[37] Blu-ray 3D contributed to this, accounting for 17% of total disc sales.[38]","budget":"$200 million[1]","screenplay_by":"Ben Queen","Plot":"Finn McMissile, a British spy, infiltrates the world's largest untapped oil reserves owned by a group of lemon cars. After being discovered, he flees and fakes his death.Lightning McQueen, now a 4-time Piston Cup champion, returns home to Radiator Springs to enjoy some quiet time, but when Italian formula race car, Francesco Bernoulli, challenges McQueen to the newly created World Grand Prix, led by its creator Sir Miles Axlerod, he and his best friend Mater — along with Luigi, Guido, Fillmore, and Sarge — depart for Tokyo for the first race of the Grand Prix. Meanwhile, the lemons, who are led by weapons designer Professor Zündapp and an unknown mastermind, secretly plot to secure their oil profits by using an Electromagnetic pulse emitter disguised as a camera (discovered by Finn on the oil platform) to trigger and destabilize the use of Allinol, a fuel that was created by Axlerod and required for racers to use in the Grand Prix. McMissile and his partner Holley Shiftwell attempt to meet with American spy car Rod \"Torque\" Redline at a World Grand Prix promotional event in Tokyo, to receive information about the mastermind. However, Redline is attacked by Zündapp's henchmen, but not before passing his information to Mater before he is captured, who is then mistaken to be the American contact of Holley and Finn. Before killing Redline, Professor Zündapp finds out that Mater was given the information.At the first race, three cars are ignited by the camera, and McQueen falls second in the race after Bernoulli, due to Mater accidentally giving him bad racing advice shortly after evading Zündapp's henchmen with help from Holley and Finn. Mater is soon abducted by Finn and boards his plane, where he helps to identify some of the information he was given. After travelling to Paris to get more information from Finn's old friend, they travel to Italy, where the next race is being held. While the race is being held, Mater infiltrates the criminals' meeting, just as the camera is used on a few more cars, causing a multi car pileup, while allowing McQueen to finish first. Due to the criminals plan causing Allinol to be perceived as troublesome, Sir Miles Axlerod removes it as a required fuel for the final race. However, when McQueen decides to continue using it, the criminals plot to kill McQueen in the next race in London, which spooks Mater, causing him to blow his cover and allow him, Finn and Holley, to be abducted.Taken to the inside of the clock tower of Big Ben clock in London and tied up in it, while the final race is being held, Mater discovers that the camera did not function on McQueen, but quickly learns the criminals are planning to plant a bomb on him in his pits, causing him to break free and escape. Finn and Holley escape later, but realize that the bomb is on Mater's air filter. Mater soon flees on the race course when McQueen (who arrived at the pits) chases after him, while Finn apprehends Professor Zündapp. The other lemons soon arrive and outnumber Finn, Holley, Mater, and McQueen, but they are soon rescued by the arrival of the other Radiator Springs residents. Mater then uses evidence he had seen to reveal that Axlerod is the leader of this plot and placed the bomb on him, whom he soon confronts and forces to deactivate the bomb, before he and the other lemons are taken into custody, foiling the operation.In the end, Mater receives a honorary knighthood from the queen, while Sarge reveals that he changed McQueen's fuel from Allinol to gasoline, hence why the camera did not work on him. Finn and Holley ask if Mater can join them on another mission, but he turns it down. The final scene ends with the World Grand Prix competitors racing each other at Radiator Springs.","Reception":"On Rotten Tomatoes Cars 2 has an approval rating of 39%, based on 205 reviews, with an average rating of 5.5/10, making it the first Pixar film to garner a \"rotten\" certification. The site's consensus reads, \"Cars 2 is as visually appealing as any other Pixar production, but all that dazzle can't disguise the rusty storytelling under the hood.\"[39] Another review aggregator, Metacritic, which assigns a weighted average score to reviews from mainstream critics, gave the film an average score of 57 out of 100, based on 38 critics, indicating \"mixed or average reviews\".[40]\"The original Cars was not greeted with exceptional warmth,\" said The New York Times, \"but the sequel generated Pixar's first truly negative response.\"[41] Critics generally criticized the G-rating, the focus on Mater and felt the film lacked warmth and charm, while also feeling the film was made as an exercise in target marketing.[42][43][44][45] Reviewing the film for The Wall Street Journal, Joe Morgenstern wrote, “This frenzied sequel seldom gets beyond mediocrity.\"[46] Entertainment Weekly critic Owen Gleiberman said, \"Cars 2 is a movie so stuffed with \"fun\" that it went right off the rails. What on earth was the gifted director-mogul John Lasseter thinking – that he wanted kids to come out of this movie was [sic] more ADD?\"[47] Although Leonard Maltin on IndieWire claimed that he had \"such high regard for Pixar and its creative team led by John Lasseter\" he said he found the plot \"confusing\" and felt that Tow Mater's voice annoying saying that he'd \"rather listen to chalk on a blackboard than spend nearly two hours with Tow Mater.\"[48] Considering the low reviews given to the Pixar production, critic Kyle Smith of the New York Post said, \"They said it couldn't be done. But Pixar proved the yaysayers wrong when it made its first bad movie, Cars. Now it has worsted itself with the even more awful Cars 2.\"[49]Conversely, Peter Travers of Rolling Stone gave the movie 3½ stars out of four, and said that \"the sequel is a tire-burning burst of action and fun with a beating heart under its hood.\" He also praised its \"fluid script\" and called it a \"winner\".[50] Roger Ebert was the most effusive of the more positive reviews, writing, “At a time when some ‘grown-up’ action films are relentlessly shallow and stupid, here is a movie with such complexity that even the cars sometimes have to pause and explain it to themselves.”[51] Justin Chang of Variety commented, “The rare sequel that not only improves on but retroactively justifies its predecessor.”[52] Ticket buyers also gave the film an A– in exit polls, on par with other Pixar titles.[41]A central current of the negative reviews was the theory that Cars 2 was forced out of Pixar by its corporate parent, the Walt Disney Company, out of greed to drive merchandising sales.[46][53] Lasseter vehemently denied these claims, which he attributed to \"people who don’t know the facts, rushing to judge.\"[41] Some theorized that the vitriol was less about the film but more about Pixar's broadened focus to sequels. The New York Times reported that although one negatively reviewed film would not be enough to scratch the studio, \"the commentary did dent morale at the studio, which until then had enjoyed an unbroken and perhaps unprecedented run of critical acclaim.\"[41]Cars 2 grossed $191,452,396 in the USA and Canada, and $368,400,000 in other territories for a worldwide total of $559,852,396.[2] Worldwide on its opening weekend it grossed $109.0 million, marking the largest opening weekend for a 2011 animated title.[54] Overall, Cars 2 became seventh biggest Pixar film in worldwide box office among the fourteen released.Cars 2 made $25.7 million on its debut Friday (June 24, 2011), marking the third-largest opening day for a Pixar film after Toy Story 3's $41.1 million. At the time, though, it was the third least-attended opening day for a Pixar film, only ahead of Up and Ratatouille.[55] It also scored the sixth largest opening day for an animated feature.[56] On its opening weekend as a whole, Cars 2 debuted at No.1 with $66.1 million,[31] marking the largest opening weekend for a 2011 animated feature, the seventh largest opening for Pixar,[57] the eighth largest among films released in June,[58] and the fourth largest for a G-rated film.[59] In its second weekend, however, the film dropped 60.3%, the largest second weekend drop ever for a Pixar film, and grossed $26.2 million.[60] Cars 2 is the third lowest-grossing Pixar film in North America, only ahead of A Bug's Life and The Good Dinosaur.[61][62][63] It is also the least attended Pixar film ever.[64]Outside North America, it grossed $42.9 million during its first weekend from 3,129 theaters in 18 countries, topping the box office.[65] It performed especially well in Russia where it grossed $9.42 million,[66] marking the best opening weekend for a Disney or Pixar animated feature and surpassing the entire runs of Cars and Toy Story 3.[67] In Mexico, it made $8.24 million during its first weekend,[68] while in Brazil, it topped the box office with $5.19 million ($7.08 million with previews).[69] It also premeiered at No.1 with $5.16 million in Australia,[70] where it debuted simultaneously with Kung Fu Panda 2 and out-grossed it.[65] It is the highest-grossing film of 2011 in Lithuania ($477,117),[71] Argentina ($11,996,480).[72] It is the highest-grossing animated film of 2011 in Estonia ($442,707),[73] Finland ($3,230,314),[74] Norway ($5,762,653).[75]Cars 2 marks the first Pixar film not to be nominated for an Oscar. It is also the first Pixar film not nominated for Best Animated Feature in the history of that Award (2001–present).[76]","cars_2":"Theatrical release poster","Video games":"A video game based on the movie was developed by Avalanche Software and published by Disney Interactive Studios for the PlayStation 3, Xbox 360, Wii, PC and Nintendo DS on June 21, 2011.[79] The PlayStation 3 version of the game was reported to be compatible with stereoscopic 3D gameplay.[80] A Nintendo 3DS version was released on November 1, 2011,[81] and a PSP version was released on November 8, 2011.[82]An app based on the film was released on iTunes for a dollar on June 23, 2011. The Lite version was released for free that same day. The object of the game was to complete each race, unlock new levels, and get a high score. As of June 28, 2011, the app had hit No. 1 on the App Store.[83] The game was retired on August 29, 2014.[84]","Soundtrack":"The Cars 2 soundtrack was released on both CD album and digital download June 14. It is the fourth Pixar film to be scored by Michael Giacchino after The Incredibles, Ratatouille and Up.[27] It also marks the first time that Giacchino has worked with John Lasseter as a director, as Lasseter had been executive producer on Giacchino's previous three Pixar films and that Lasseter has not worked with Randy Newman.All music composed by Michael Giacchino, except as noted.","produced_by":"Denise Ream","starring":"Owen Wilson Larry the Cable Guy Michael Caine Emily Mortimer John Turturro Eddie Izzard","music_by":"Michael Giacchino","edited_by":"Stephen Schaffer"}