{"country":"India","Plot":"Unemployed and branded a trouble-maker, Jaikishan lives a poor lifestyle in a slum-area called Asha Colony, very near Andher's Lokhandwala Complex along with his sister, Seema; mom and dad. He comes to the rescue of a homeless orphan, Mili, who suffers from a deep inferiority complex, and permits her to live with his family. Brutally outspoken, he believes that India should be awarded unlimited gold medals for corruption at all levels, fully aware that these beliefs portray him as a 'revolutionary', and prevent him from securing any gainful employment. His life will be turned upside down when he refuses to go along with the plans of the Khan family - consisting of builder, Majid; his goon brother, Farid, and their seemingly benevolent father, Jahangir. His family will also be traumatized after the Police arrest him for the alleged broad-daylight murder of Farid","language":"Hindi","Reception":"The film was the 9th highest-grossing film in India in 1992.[2] The National Film Development Corporation of India described it as \"an urban action film\".[3] The Times of India called it \"one of the most engaging mafia films to have come out of Bollywood\", attributed to it being \"quite a dark film\".[4] According to The Hindu, Angaar \"was, in a way, a first of its kind, in that the film gave us within the mainstream cinema framework a fairly authoritative account of the alleged nexus between the underworld and the politicians who manipulated the law and order machinery to suit their nefarious activities.\"[1] It further mentioned that the film had a \"deep concern for contemporary life\" which gave it a \"distinctive touch\".[1]","cinematography":"Ishwar Bidri","directed_by":"Shashilal K. Nair","release_dates":"1 September 1992","produced_by":"Shashilal K. Nair S.M. Arif","starring":"Jackie Shroff Dimple Kapadia Nana Patekar Kader Khan","music_by":"Laxmikant-Pyarelal","angaar_अँगार":"DVD cover","edited_by":"Waman B. Bhosle Gurudutt Shirali","written_by":"Kader Khan Sujit Sen"}