{"based_on":"Dracula  by Bram Stoker","country":"Spain Italy West Germany[1]","screenplay_by":"Augusto Finocchi[1]","DVD release":"Count Dracula was released on DVD in 2007 by Dark Sky Films. Special features include an interview with director Jesús Franco, a reading from Bram Stoker's Dracula novel by Christopher Lee, and a text essay on the life of actress Soledad Miranda.[5] The DVD has come under criticism for omitting the scene in which a distraught mother pleads for her baby's life at the door of Dracula's castle.[6] The DVD also uses the Italian credits for the film but with the French title card Les Nuits de Dracula.","Plot":"The story starts with a shot of Count Dracula's castle and the following text:Over fifty years ago, Bram Stoker wrote the greatest of all horror stories. Now, for the first time, we retell exactly as he wrote, one of the first — and still the best — tales of the macabre.Jonathan Harker, a lawyer traveling from London to Transylvania to secure property for Count Dracula, arrives at Bistritz to stay for the night. There, he is warned by a concerned lady against continuing his journey the following day. Harker believes that her concerns are rooted in peasant superstition. He ignores her, but starts to feel increasingly unnerved by the way everyone looks at him. Harker sets off for the rest of his journey and arrives at the Borgo Pass where he's picked up by the Count's mysterious coachman.Harker debarks at Castle Dracula, and the coach immediately rushes off. Somewhat hesitantly, Harker approaches the main door, whereupon a thin, tall, gaunt old man opens it. Harker asks, \"Count Dracula?\" \"I am Dracula, enter freely and of your own will,\" says the man at the door. Dracula takes Harker to his bedchamber where Harker notices that Dracula casts no reflection.Later, Harker goes to sleep. He wakes in an ancient crypt where he is seduced by three beautiful vampiresses. Dracula rushes into the room in a rage and orders them to leave Harker alone. Dracula explains, \"This man belongs to me,\" then gives the vampiresses a baby to feed on. Harker wakes up screaming in his room and assumes it was a nightmare, but two small wounds on his neck indicate otherwise.Harker soon realises he is a prisoner, and tries to escape by climbing out of his bedroom window. He finds his way back to the crypt where Count Dracula and his three brides rest in coffins. Harker runs out of the crypt screaming, and jumps out of the castle's tower into the river below.Harker wakes up in a private psychiatric clinic outside London, owned by Dr. Van Helsing, in the care of Dr. Seward. He is told he was found delirious in a river near Budapest. Naturally, no one believes his story about Castle Dracula until Van Helsing finds the two punctures on Harker's neck. Harker's fiancée Mina and her close friend Lucy also arrive at the hospital to help take care of him. Unbeknownst to them, Count Dracula has followed Harker back to England and now resides in an abandoned abbey close to the hospital.As Mina nurses Harker back to health, her friend Lucy's health strangely declines. Dracula has been secretly appearing to her by night and drinking her blood, growing younger as he feeds off his victim. Quincey Morris, Lucy's fiancé, joins Drs. Seward and Van Helsing in an attempt to save Lucy by giving her a blood transfusion from Quincey.One of the patients at the clinic, R. M. Renfield, becomes of considerable interest to the men. Renfield is classed as a zoophagus: he eats flies and insects in order to consume their life, believing that each life he consumes increases his own. He reacts violently whenever Dracula is nearby.Lucy eventually dies while her men helplessly look on. As Van Helsing suspected, Lucy has become one of the undead and murders a young child, but the ordeal is put to an end when Quincey, Seward and Van Helsing ambush Lucy in her tomb, stake her through the heart and decapitate her. Harker, restored to health, joins the group who now are sure that Count Dracula is a vampire.Dracula turns his attention to Mina and begins corrupting her as well. Van Helsing suddenly has a stroke and remains in a wheelchair. Dracula visits the weakened man, mocking his attempts to destroy him. Quincey, Harker and Seward track Dracula to the abandoned abbey, but he has fled to Transylvania with the aid of a traveling Gypsy band.As Count Dracula's Gypsy servants take him back to his castle, he is trailed by Harker and Quincey. After battling the Gypsies, the two heroes find Dracula's coffin and set it on fire. Dracula, unable to escape in full daylight, is consumed by flames.","Reception":"Robert Firsching of The New York Times wrote, \"This doggedly faithful adaptation is plodding and dull. Even Christopher Lee (in an uncharacteristically weak performance as Dracula), Klaus Kinski (as the mad Renfield), and seven credited screenwriters cannot make this confused, distant film worthwhile. Franco appears as a servant to Professor Van Helsing (Herbert Lom), and though certainly literate, the film nevertheless fails as both horror and drama.[4]Brett Cullum of DVD Verdict wrote, \"For curious Dracula fans, Jess Franco's Count Dracula is a neat find. It's a stellar cast working under a low budget, and it comes off entertaining if not a classic. It's a B-movie treatment at best, but ... Lee comes off fiery and committed to making this Count one that will be noticed.\"[5] Brian Lindsey of Eccentric Cinema wrote, \"Upon weighing [the film's] pros and cons, Count Dracula emerges a substantially flawed film. But I can still recommend it to any fan of Lee, Franco, Miranda, and even of Stoker's novel.\"[6] George R. Reis of DVD Drive-In wrote, \"Count Dracula is flawed in many ways, but for fans of gothic horror, it’s still irresistible ... Barcelona naturally allows for some truly handsome scenery and an appropriate castle for Dracula to dwell in, and the performances of the international cast are above average.\"[7]Dracula scholar Leslie S. Klinger said \"the picture begins well, closely following the Stoker narrative account of Harker's encounter with Dracula. The film rapidly proceeds into banality, however, and except for the characterization of Lee as an older Dracula and the brilliant Kinski, the film is largely forgettable.\"[8]Film critic Jonathan Rosenbaum called it \"one of the world’s worst horror films\" in his review of Pere Portabella's film Cuadecuc, Vampir, which was shot during the making of this film.[9]","cinematography":"Manuel Merino Luciano Trasatti[1]","production_company":"Fénix Films Filmar Corona Filmproduktion GmbH[1]","directed_by":"Jesús Franco[1]","release_dates":"April 3, 1970 (1970-04-03) (Germany)|||||","produced_by":"Harry Alan Towers[1]","starring":"Christopher Lee Herbert Lom Klaus Kinski Susann Korda","running_time":"97 min.","music_by":"Bruno Nicolai[1]","edited_by":"Bruno Mattei Derek Parsons[1]","count_dracula":"Theatrical release poster"}