{"country":"United States","distributed_by":"Summit Entertainment (United States) Lionsgate (United Kingdom) Metropolitan Filmexport (France)","Plot":"John Milton (Nicolas Cage) is an undead criminal who has broken out of Hell to kill Jonah King (Billy Burke), a cult leader who tricked Milton's daughter into joining his followers in the wake of Milton's death 10 years prior, only to kill her and her husband and steal their daughter -Milton's granddaughter- to be sacrificed in a Satanist ritual, since King believes that if he kills the baby, he will unleash Hell over Earth. He also stole Satan's personal gun, labeled The Godkiller.After interrogating and murdering some of King's followers, Milton discovers that the ritual will take place in Stillwater, an abandoned prison in Louisiana. He heads there, but stops by a diner, where he meets Piper (Amber Heard), a waitress. Milton's car is damaged in the pursuit, so he sabotages Piper's car, a 1969 blue Dodge Charger R/T 440 and follows her to fix it in exchange for a ride on the way to Stillwater to find King.Entering her room, Piper walks in on her boyfriend, Frank (Todd Farmer), having sex with another woman. Piper beats up the woman and assaults Frank, getting knocked to the ground. Milton, in a phone booth nearby, hears the commotion and comes to Piper's aid, kicking Frank in the face as he is about to continue assaulting Piper, and punching Frank repeatedly. Milton steals his car, taking Piper along with him driving to Stillwater. Meanwhile, a supernatural operative of Satan, The Accountant (William Fichtner), arrives on Earth with the mission to bring Milton back to Hell and take the rifle back. After interrogating Frank, he discovers that Milton and Piper are heading to Louisiana. After murdering Frank with a bat, he tricks a pair of state troopers into helping him by impersonating an FBI agent.At a shady hotel, Milton is attacked by King and his men, who heard about his return, but he kills most of them. The Accountant appears with the police and chases after Milton and Piper, who are chasing after King's van. Milton uses The Godkiller to shoot the Accountant out of the road. They then follow King to a church, only to find it filled with King's followers. They are ambushed and captured. Piper is kidnapped and Milton is shot in the eye and left for dead, but he awakens and kills King's men before pursuing the RV once again. Inside, Piper breaks free and fights King before jumping out of the RV and onto Milton's car. King then disables the car by repeatedly shooting its engine.Milton and Piper then meet Milton's friend Webster (David Morse), who provides them a new car, a 1971 red Chevrolet Chevelle SS. Piper discovers that Milton is literally undead and had to abandon his daughter to protect her from his former companions and that's why she was so easily manipulated by King. Webster reveals that he died 10 years prior in a shootout, and that Webster personally carried his coffin. She also discovers that the Godkiller was stolen by Milton from Satan himself and has the power to completely destroy one's soul, preventing it from going to either Heaven or Hell.After arming himself, Milton tells Piper that he can not guarantee her safety and that she should leave, but she assures him that she has never had a worthy cause to fight for until now, and that she is with him regardless of the consequences. Milton tells Webster to stay behind, not wishing him to die. With the help of the Accountant, they evade the troops of Sheriff Cap (Tom Atkins) and finally arrive at Stillwater. The Accountant captures Piper and forces Milton to give up the Godkiller before he can engage King, but he allows Milton to go into battle against King and his followers to save his granddaughter, noting that Satan is more of a well-educated, calm warden of a very large prison, rather as a face of evil, and that he actually despises the sacrifices of innocent lives in his name.While Milton slaughters King's men before they can sacrifice the child, Piper escapes The Accountant's clutches with the Godkiller. King eventually gets the upper hand on Milton and savagely beats him. Piper fires the Godkiller at King, but misses and hits one of his few surviving men instead. She is knocked out by the gun's recoil. King orders one of his female servants to murder the child. However, the woman, who had been caring for the baby ever since King stole her, finds herself unable to carry out the deed, making King angry. The Accountant attracts King's attention, allowing Milton to grab the Godkiller and shoot King, destroying his soul. The Accountant retrieves the baby. He allows Milton to say goodbye to her and Milton gives her to Piper, who promises to care for and protect her. Webster arrives and looks on as Milton \"dies.\"After both Piper and Webster have left, Milton is revealed to be still \"alive\" and with the Accountant. Following this, Milton makes good on his earlier promise to Webster, and nonchalantly drinks a beer out of what is left of King's skull. He agrees to go back to Hell, but warns that if he is punished too severely for his actions, he will escape again. The Accountant claims that he looks forward to it, insinuating that chasing Milton is the most fun he has ever had. The Accountant then wiggles his keys and manifests a black 1957 Chevrolet Bel Air before throwing the keys to Milton. They then drive off into the gates of Hell.","language":"English","box_office":"$28.9 million[2]","drive_angry":"Theatrical release poster","cinematography":"Brian Pearson","production_company":"Millennium Films Nu Image Saturn Films","directed_by":"Patrick Lussier","release_dates":"February 25, 2011 (2011-02-25)|||||","Production":"Cage stated that he was originally drawn to the project by a scene in which his character's eyes get shot out.[11] In his previous film, Season of the Witch, he had wanted to have such a scene but producers rejected the idea.[11]The film was shot in 3D, and special effects were created by Gary Tunnicliffe.[12] The cameras were rented from Paradise FX.[13] One of the reasons why Cage chose this movie is that he wanted to play in a 3D movie to be part of the new technology [14]The three cars driven by Cage in the film are a 1964 Buick Riviera, a 1969 Dodge Charger R/T (440 Engine) and a 1971 Chevrolet Chevelle SS 454.[15]Cage narrated the supernatural film at WonderCon 2010.[16] Patrick Lussier wrote the film with Todd Farmer.[17] Lussier filmed the movie in Minden,[18] Plain Dealing and Shreveport, Louisiana.[19]","produced_by":"Michael De Luca René Besson","starring":"Nicolas Cage Amber Heard William Fichtner Billy Burke Charlotte Ross Katy Mixon Tom Atkins","running_time":"105 minutes","music_by":"Michael Wandmacher","edited_by":"Patrick Lussier Devin C. Lussier","Release":"The film was released in the US on February 25, 2011.[20] Footage premiered on July 23, 2010 as part of the San Diego Comic-Con International.[21]The film has received mixed reviews from critics. As of June 2015 it holds a 45% rating on Rotten Tomatoes, based on 111 reviews, and an average rating of 5.3/10. At Metacritic, which assigns a weighted average score out of 100 to reviews from mainstream critics, the film received an average score of 44 based on 21 reviews, indicating \"mixed or average reviews\".[22] James Kendrick called it \"loud, vicious, tasteless and inane\". He then went on to say \"it thunders at you from every direction with a wild abandon that is more irritating and desperate than enlivening\". Mark Jenkins from the Washington Post commented that \"Even at its most lurid, though, the movie is a little dull. And it only gets less compelling as the back story fills in.\" On the other hand, Elizabeth Weitzman from the New York Daily News wrote, \"Drive Angry is pure grindhouse, so committed to its own junkiness that it is, in its way, a pleasure to behold.\"The film opened at ninth place within the box office rankings at an underperforming $1.6 million on Friday, with a lower than expected $5 million weekend.[23] Drive Angry's box office performance made it the lowest-grossing opening of a 3D film released in over 2,000 US theaters.[23] The film was slightly more successful in international markets, earning $18,210,368 according to Box Office Mojo.[24]Drive Angry was released on DVD, Blu-ray and 3D Blu-ray on May 31, 2011.","written_by":"Todd Farmer Patrick Lussier","budget":"$50 million[1]"}