{"based_on":"Characters created by Dan O'Bannon Ronald Shusett Characters created by Jim Thomas John Thomas","country":"United States|United Kingdom|Czech Republic|Canada|Germany|","distributed_by":"20th Century Fox","screenplay_by":"Paul W. S. Anderson","story_by":"Paul W. S. Anderson Dan O'Bannon Ronald Shusett","Plot":"In 2004, a satellite detects a mysterious heat bloom beneath Bouvetøya, an island about one thousand miles off the coast of Antarctica. Wealthy industrialist Charles Bishop Weyland (Lance Henriksen) discovers through thermal imaging that there is a pyramid buried 2000 feet beneath the ice. He attempts to claim it for his multinational communications company, Weyland Industries, a subsidiary of the Weyland Corporation, and assembles a team of experts to go investigate. The team includes archaeologists, linguistic experts, drillers, mercenaries, and a guide named Alexa Woods (Sanaa Lathan).As a Predator ship reaches Earth's orbit, it fires a beam that creates a passage through the ice towards the source of the heat bloom. When the team arrives at the abandoned whaling station above the heat source, they find the passage and descend beneath the ice. They locate the mysterious pyramid and begin to explore it, finding evidence of a pre-historic civilization and what appears to be a sacrificial chamber filled with human skeletons with ruptured rib cages.Meanwhile, three Predators arrive and kill the humans on the surface. They make their way down to the pyramid and arrive just as the team unwittingly activates the structure. The Alien Queen awakes from cryogenic stasis and begins to produce eggs. When the eggs hatch, several facehuggers attach themselves to humans trapped in the sacrificial chamber. Chestbursters emerge from the humans and quickly grow into adult Aliens. Conflict erupts between the Predators, Aliens, and humans, resulting in several deaths. Two Predators are killed by a lone Alien, and Weyland is killed by the remaining Predator, while allowing Alexa and archaeologist Sebastian De Rosa (Raoul Bova) enough time to escape. The two witness the Predator kill a facehugger and an Alien before unmasking and marking himself. After Alexa and Sebastian leave, another facehugger attaches itself to the unmasked Predator.Through translation of the pyramid's hieroglyphs, Alexa and Sebastian learn that the Predators have been visiting Earth for thousands of years. It was they who taught early human civilizations how to build pyramids, and were worshiped as gods. Every 100 years they would visit Earth to take part in a rite of passage in which several humans would sacrifice themselves as hosts for the Aliens, creating the \"ultimate prey\" for the Predators to hunt. If overwhelmed, the Predators would activate a self-destruct device to eliminate the Aliens and themselves. The two deduce that this is why the current Predators are at the pyramid, and that the heat bloom was to attract humans for the sole purpose of making new Aliens to hunt.Alexa and Sebastian decide that the Predators must be allowed to succeed in their hunt so that the Aliens do not reach the surface. Unfortunately, Sebastian is captured by an Alien, leaving only Alexa and the Predator to fight against the Aliens. The two form an alliance and use a self-destruct device to destroy the pyramid and the remaining Aliens. Alexa and Scar reach the surface, where they battle the Alien Queen. They defeat the Queen by attaching its chain to a water tower and pushing her over a cliff, dragging the Queen to the ocean floor. It is unknown whether this killed the Queen, as Xenomorph creatures have been seen to survive submerged in water for extended periods of time. Scar, however, is impaled through the torso by the Alien Queen's tail and succumbs to his wounds and dies.A Predator ship uncloaks and several Predators appear. They retrieve their fallen comrade and an elite Predator presents Alexa with one of their spear weapons in recognition of her skill as a warrior. As the Predators retreat into space, a chestburster with Predator-like features erupts from Scar's chest, beginning the events of Aliens vs. Predator: Requiem.","language":"English","Reception":"Alien vs. Predator was released in North America on August 13, 2004 in 3,395 theatres. The film grossed $38.2 million over its opening weekend for an average of $11,278 per theatre, and was number one at the box office. The film spent 16 weeks in cinemas and made $80,281,096 in North America.[30] It grossed $9 million in the United Kingdom, $16 million in Japan, and $8 million in Germany and totalled $92,262,423 at the international box office. This brought the film's worldwide gross to $172,543,519, making it the highest grossing film in either the Predator or Alien franchises (excluding Prometheus, which grossed over $403 million worldwide[31]). It ranks second behind Aliens at the domestic box office, and fifth behind the first three Alien films and the first Predator, when adjusted for inflation.[32][33]The film received negative reviews from critics, but reception from fans were more positive.[34] On Rotten Tomatoes the film has a rating of 21%, based on 141 reviews, with the site's critical consensus reading, \"Gore without scares and cardboard cut-out characters making this clash of the monsters a dull seat.\"[35] On Metacritic the film has a score of 29 out of 100, based on 21 critics, indicating \"generally unfavorable reviews\".[36] Chief criticisms of the film included its dialogue, a PG-13 rating, the \"fast-paced editing\" during fight sequences, and lighting. However, special effects and set designs received praise.[35][36]Rick Kisonak of Film Threat praised the film stating, \"For a big dumb production about a movie monster smackdown, Alien vs. Predator is a surprisingly good time\".[37] Ian Grey of the Orlando Weekly felt, \"Anderson clearly relished making this wonderful, utterly silly film; his heart shows in every drip of slime.\"[37] Staci Layne Wilson of Horror.com called it \"a pretty movie to look at with its grandiose sets and top notch creature FX, but it's a lot like Anderson's previous works in that it's all facade and no foundation.\"[36] Gary Dowell of The Dallas Morning News called the film, \"a transparent attempt to jumpstart two run-down franchises\".[37] Ed Halter of The Village Voice described the film's lighting for fight sequences as, \"black-on-black-in-blackness\",[38] while Ty Burr of The Boston Globe felt the lighting \"left the audience in the dark\".[39]","box_office":"$172.5 million[2]","cinematography":"David Johnson","production_company":"Davis Entertainment Brandywine Productions","directed_by":"Paul W. S. Anderson","alien_vs._predator":"Theatrical release poster","release_dates":"August 12, 2004 (2004-08-12) (international)|August 13, 2004 (2004-08-13) (United States)||||","Production":"Before 20th Century Fox gave Alien vs. Predator the greenlight, Aliens writer/director James Cameron had been working on a story for a fifth Alien film. Alien director Ridley Scott had talked with Cameron, stating \"I think it would be a lot of fun, but the most important thing is to get the story right.\"[3] In a 2002 interview, Scott's concept for a story was \"to go back to where the alien creatures were first found and explain how they were created\"; this project eventually became Scott's 2012 film Prometheus. On learning that Fox intended to pursue Alien vs. Predator, Cameron believed the film would \"kill the validity of the franchise\" and ceased work on his story, \"To me, that was Frankenstein Meets Werewolf. It was Universal just taking their assets and starting to play them off against each other...Milking it.\"[4] After viewing Alien vs. Predator, however, Cameron remarked that \"it was actually pretty good. I think of the five Alien films, I'd rate it third. I actually liked it. I actually liked it a lot.\"[4] Conversely, Ridley Scott had no interest in the Alien vs. Predator films. When asked in May 2012 if he had watched them, Scott laughed, \"No. I couldn't do that. I couldn't quite take that step.\"[5] Director Neill Blomkamp would eventually go on to pitch his sequel to Aliens.[6]The concept of Alien vs. Predator originated from the Aliens versus Predator comic book in 1989, and was hinted at when an Alien skull appeared in a trophy case aboard the Predator ship in Predator 2.[7] Screenwriter Peter Briggs created the original spec screenplay in 1990–1991, which was based on the first comic series.[7] In 1991, he successfully pitched the concept to 20th Century Fox, who owned the film franchises, although the company did not move forward with the project until 2002. The project was delayed chiefly because 20th Century Fox was working on Alien: Resurrection.[8] A draft penned by James DeMonaco and Kevin Fox was rejected by producer John Davis, who hoped to give the film an original approach by setting it on Earth.[9]As there were six producers between the film franchises, Davis had difficulty securing the rights as the producers were worried about a film featuring the two creatures. Paul W. S. Anderson pitched Davis a story he worked on for eight years, and showed him concept art created by Randy Bowen.[10] Impressed with Anderson's idea, Davis thought the story was like Jaws in that it \"just drew you in, it drew you in\".[11] Anderson started to work on the film after completing the script for Resident Evil: Apocalypse, with Shane Salerno co-writing. Salerno spent six months writing the shooting script, finished its development, and stayed on for revisions throughout the film's production.[12]Early reports claimed the story was about humans who tried to lure Predators with Alien eggs, although the idea was scrapped.[13] Influenced by the work of Erich von Däniken, Anderson researched von Däniken's theories on how he believed early civilisations were able to construct massive pyramids with the help of aliens, an idea drawn from Aztec mythology.[14] Anderson wove these ideas into Alien vs. Predator, describing a scenario in which Predators taught ancient humans to build pyramids and used Earth for rite of passage rituals every 100 years in which they would hunt Aliens. To explain how these ancient civilisations \"disappeared without a trace\", Anderson came up with the idea that the Predators, if overwhelmed by the Aliens, would use their self-destruct weapons to kill everything in the area.[14] H. P. Lovecraft's 1931 novella At the Mountains of Madness served as an inspiration for the film, and several elements of the Aliens vs. Predator comic series were included.[10][15] Anderson's initial script called for five Predators to appear in the film, although the number was later reduced to three.[14]As Alien vs. Predator is a sequel to the Predator films and prequel to the Alien series, Anderson was cautious of contradicting continuity in the franchises. He chose to set the film on the remote Norwegian Antarctic island of Bouvet commenting, \"It's definitely the most hostile environment on Earth and probably the closest to an Alien surface you can get.\"[16] Anderson thought that setting the film in an urban environment like New York City would break continuity with the Alien series as the protagonist, Ellen Ripley, had no knowledge the creatures existed. \"You can't have an Alien running around the city now, because it would've been written up and everyone will know about it. So there's nothing in this movie that contradicts anything that already exists.\"[16]The first actor to be cast for Alien vs. Predator was Lance Henriksen, who played the character Bishop in Aliens and Alien 3. Although the Alien movies are set 150 years in the future, Anderson wanted to keep continuity with the series by including a familiar actor. Henriksen plays billionaire Charles Bishop Weyland, a character that ties in with the Weyland-Yutani Corporation. According to Anderson, Weyland becomes known for the discovery of the pyramid, and as a result the Weyland-Yutani Corporation models the Bishop android in the Alien films after him; \"when the Bishop android is created in 150 years time, it's created with the face of the creator. It's kind of like Microsoft building an android in 100 years time that has the face of Bill Gates.\"[17]Anderson opted for a European cast including Italian actor Raoul Bova, Ewen Bremner from Scotland, and English actor Colin Salmon. Producer Davis said, \"There's a truly international flavor to the cast, and gives the film a lot of character.\"[18] Several hundred actresses attended the auditions to be cast as the film's heroine Alexa Woods. Sanaa Lathan was selected, and one week later she flew to Prague to begin filming. The filmmakers knew there would be comparisons to Alien heroine Ellen Ripley and did not want a clone of the character, but wanted to make her similar while adding something different.[18]Anderson reported in an interview that California Governor Arnold Schwarzenegger was willing to reprise his role as Major Alan \"Dutch\" Schaeffer from Predator in a short cameo appearance if he lost the recall election on condition that the filming should take place at his residence.[19] Schwarzenegger, however, won the election with 48.58% of the votes and was unavailable to participate in Alien vs. Predator. Actress Sigourney Weaver, who starred as Ellen Ripley in the Alien series, said she was happy not to be in the film, as a possible crossover was \"the reason I wanted my character to die in the first place\", and thought the concept \"sounded awful\".[20][21]Production began in late 2003 at Barrandov Studios in Prague, Czech Republic, where most of the filming took place. Production designer Richard Bridgland was in charge of sets, props and vehicles, based on early concept art Anderson had created to give a broad direction of how things would look. 25 to 30 life-sized sets were constructed at Barrandov Studios, many of which were interiors of the pyramid. The pyramid's carvings, sculptures, and hieroglyphs were influenced by Egyptian, Cambodian, and Aztec civilisations, while the regular shifting of the pyramid's rooms was meant to evoke a sense of claustrophobia similar to the original Alien film.[22] According to Anderson, if he was to build the sets in Los Angeles they would have cost $20 million. However, in Prague they cost $2 million, an important factor when the film's budget was less than $50 million.[10]Third scale miniatures several meters in height were created to give the film the effect of realism, rather than relying on computer generated imagery (CGI). For the whaling station miniatures and life-sized sets, over 700 bags of artificial snow were used (roughly 15–20 tons).[11] A 4.5-meter miniature of an icebreaker with working lights and a mechanical moving radar was created, costing almost $37,000 and taking 10 weeks to create. Visual effects producer Arthur Windus, claimed miniatures were beneficial in the filming process: \"With computer graphics, you need to spend a lot of time making it real. With a miniature, you shoot it and its there.\"[23] A scale 25-meter miniature of the whaling station was created in several months. It was designed so the model could be collapsed and then reconstructed, which proved beneficial for a six-second shot which required a re-shoot.[23]Special effects company Amalgamated Dynamics Incorporated (ADI) was hired for the movie, having previously worked on Alien 3 and Alien: Resurrection. Visual special effects producers Arthur Windus and John Bruno were in charge of the project, which contained 400 effects shots.[23] ADI founders Alec Gillis, Tom Woodruff Jr., and members of their company, began designing costumes, miniatures and effects in June 2003. For five months the creatures were redesigned, the Predators wrist blades being extended roughly four times longer than those in the Predator films, and a larger mechanical plasma caster was created for the Scar Predator.[11]The basic shape of the Predator mask was kept, although technical details were added and each Predator was given a unique mask to distinguish them from each other. These masks were created using clay, which was used to form moulds to create fiberglass copies. These copies were painted to give a weathered look, which Woodruff claims \"is what the Predator is all about\".[11] A hydraulic Alien puppet was created so ADI would be able to make movements faster and give the Alien a \"slimline and skeletal\" appearance, rather than using an actor in a suit. The puppet required six people to run it; one for the head and body, two for the arms, and a sixth to make sure the signals were reaching the computer. Movements were recorded in the computer so that puppeteers would be able to repeat moves that Anderson liked. The puppet was used in six shots, including the fight scene with the Predator which took one month to film.[11]The crew tried to keep CGI use to a minimum, as Anderson said people in suits and puppets are scarier than CGI monsters as they are \"there in the frame\".[11] Roughly 70% of scenes were created using suits, puppets, and miniatures. The Alien queen was filmed using three variations: a 4.8-meter practical version, a 1.2-meter puppet, and a computer-generated version. The practical version required 12 puppeteers to operate,[10] and CGI tails were added to the Aliens and the queen as they were difficult to animate using puppetry.[18][24] The queen alien's inner-mouth was automated though, and was powered by a system of hydraulics. Anderson praised Alien director Ridley Scott's and Predator director John McTiernan's abilities at building suspense by not showing the creatures until late in the film, something Anderson wanted to accomplish with Alien vs. Predator. \"Yes, we make you wait 45 minutes, but once it goes off, from there until the end of the movie, it's fucking relentless\".[25]Austrian composer Harald Kloser was hired to create the film's score. After completing the score for The Day After Tomorrow, Kloser was chosen by Anderson as he is a fan of the franchises.[26] It was recorded in London, and was primarily orchestral as Anderson commented, \"this is a terrifying movie and it needs a terrifying, classic movie score to go with it; at the same time it's got huge action so it needs that kind of proper orchestral support.\"[26]The score was released on 31 August 2004, and received mixed reviews. James Christopher Monger of Allmusic thought Kloser introduced electronic elements well, and called \"Alien vs. Predator Main Theme a particularly striking and serves as a continuous creative source for the composer to dip his baton in.\"[27] Mike Brennan of Soundtrack, however, said it \"lacks the ingenuity of the previous trilogy and the Predator scores, which all shared a strong sense of rhythm in place of thematic content. Kloser throws in some interesting percussion cues (\"Antarctica\" and \"Down the Tunnel\"), but more as a sound effect than a consistent motif.\"[28] John Fallon of JoBlo.com compared it to character development in the film, \"too generic to completely engage or leave a permanent impression.\"[29]","Home media releases":"Alien vs. Predator was released on DVD in North America on 25 January 2005.[40] The DVD contained two audio commentaries. The first featured Paul W. S. Anderson, Lance Henriksen, and Sanaa Lathan, while the second included special effects supervisor John Bruno and ADI founders Alec Gillis and Tom Woodruff. A 25-minute \"Making of\" featurette and a Dark Horse AVP comic cover gallery were included in the special features along with three deleted scenes from the film. On release, Alien vs. Predator debuted at number 1 on the Top DVD Sales and Top Video Rental charts in North America.[41][42]A two-disc \"Extreme Edition\" was released on 7 March 2005, featuring behind the scenes footage of the conception, pre-production, production, post-production, and licensing of the film. An \"Unrated Edition\" was released on 22 November 2005, containing the same special features as the Extreme Edition as well as an extra eight minutes of footage in the film. John J. Puccio of DVD Town remarked that the extra footage contained \"a few more shots of blood, gore, guts, and slime to spice things up...and tiny bits of connecting matter to help us follow the story line better, but none of it amounts to much.\"[43] The film was released on Blu-ray Disc in North America on 23 January 2007.","produced_by":"John Davis Gordon Carroll David Giler Walter Hill","starring":"Sanaa Lathan Lance Henriksen Raoul Bova Ewen Bremner Colin Salmon","running_time":"101 minutes 109 minutes (2005 Unrated Cut)","Sequel":"A sequel, Aliens vs. Predator: Requiem, was released in December 2007.[44] Directed by brothers Greg and Colin Strause, the story continues from the conclusion of Alien vs. Predator.[45] The film was panned, and despite having a worldwide theatrical gross of nearly $130 million,[46] the film grossed less than its predecessor.","music_by":"Harald Kloser","edited_by":"Alexander Berner","budget":"$60 million[2]"}