{"country":"United States","distributed_by":"Cinedigm Entertainment","screenplay_by":"Becky Johnston","arthur_newman":"Theatrical release poster","Plot":"Former pro golfer Wallace Avery (Colin Firth) is struggling with boredom, depression, and a life from which he longs to escape. Trapped in an unfulfilling FedEx floor manager job in Florida, he finds little comfort in his failed first marriage or his current relationship with his girlfriend Mina (Anne Heche). He has even become estranged from his teenage son Kevin (Lucas Hedges) who has come to resent him. Driven to desperate measures, Wallace decides that he needs a new start and a new life.Faking his own death by drowning on a deserted beach, he acquires a forged passport and a new identity—that of a golf pro named \"Arthur Newman\". Leaving Florida behind, \"Arthur\" heads out for Terre Haute, Indiana to start a new life and a new job as a resident golf pro at a club. Along the way, he meets a beautiful but troubled young thief. He takes her to the hospital after finding her slumped beside his motel swimming pool from a near-lethal dose of morphine-infused cough syrup. The young woman, Charlotte Fitzgerald (Emily Blunt), is also traveling under a false identity—that of her paranoid-schizophrenic twin sister, Michaela or \"Mike\"—and has fled her home in Durham, North Carolina.Arthur and Mike become traveling companions and eventual lovers on their way to Indiana. Mike thinks up a game in which they spot interesting-looking couples, break into their homes, dress up in their clothes and pretend to be them. Meantime, Wallace's teenage son Kevin initiates an unlikely friendship with his father's former girlfriend Mina. Together they struggle to understand the man who skipped out of their lives.Eventually, the role-playing games that Arthur and Mike have engaged in lose their appeal, revealing two hearts that have been hurt by life's challenges. The two are forced to take another look at themselves and the lives they've left behind. Arthur drives Mike to her hometown of Durham, so she can look after her schizophrenic twin sister. As he prepares to leave, he assures her that he knows where he can find her. Arthur then drives back to his hometown in Florida to reconnect with his son.","language":"English","Reception":"The film has gained mixed to negative reviews, as it currently holds a 41 out of 100 at Metacritic.com based on 22 reviews.[4] At Rotten Tomatoes, the film was given a 22% on the tomatometer based on 45 reviews.[5]","box_office":"$207,853[1]","cinematography":"Eduard Grau","production_company":"Vertebra Films Cross Creek Pictures","directed_by":"Dante Ariola","release_dates":"September 10, 2012 (2012-09-10) (TIFF)|April 26, 2013 (2013-04-26) (USA)||||","Production":"Filming took place in North Carolina including Raleigh, Durham,Graham, North Carolina, Wilmington, and Fairmont in 2011.[2][3]","produced_by":"Mac Cappuccino|Becky Johnston|Brian Oliver|Alisa Tager|","starring":"Colin Firth|Emily Blunt|","running_time":"101 minutes","music_by":"Nick Urata","edited_by":"Olivier Bugge Coutte"}