{"based_on":"The Death and Life of Charlie St. Cloud  by Ben Sherwood","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Craig Pearce","Plot":"Charlie St. Cloud is a sailor who wins a boating race on his sailboat, the Splendid Splinter, along with his younger brother Sam. He receives a sailing scholarship to Stanford University. Charlie graduates from Winslow High School and after returning from his graduation ceremony, Charlie promises Sam that they will practice baseball every day until he leaves for Stanford. That night Charlie is supposed to go to a graduation party with his friends, but his mother makes him babysit Sam while she picks up another shift at her job.When Sam watches television, Charlie tries sneaking out to the party. He is caught by Sam, who asks Charlie to drive him to his friend Tommy's house. Charlie and Sam get into a car accident. During an out-of-body experience, Charlie hugs a badly wounded Sam and reassures him that everything will be fine.Knowing his injuries are fatal, Sam asks Charlie to never leave him alone, saying that if so they will always be together. As Charlie promises, a paramedic named Florio Ferrente revives Charlie; Sam has died in his arms. At Sam's funeral, Charlie runs off after being unable to put Sam's baseball glove in the grave. After a run through the woods, Charlie finds Sam's spirit and discovers that Sam can interact with him on the physical plane. Charlie fulfills Sam's dying wish by practicing baseball with him every day at sunset.Five years later, Charlie, who gave up his scholarship, is a caretaker at Waterside Cemetery. During a trip into town, Charlie visits the boat docks and meets Tess Carroll, a sailor planning to sail solo around the world. The following day, Charlie runs into Florio. Florio is dying of cancer and asks Charlie if he ever wonders why he was saved. Charlie returns to the cemetery and finds Tess injured tending her father's grave. He takes her to his home to patch her up and they develop a relationship. Sam begins feeling that he is being erased from existence because Charlie is forgetting him when Charlie arrives late for their game. Tess follows Charlie and he explains to her that the more he is in her world, the less he is in Sam's.Charlie discovers that Tess went missing while sailing through a storm a few days earlier; Charlie has been seeing her just like he can Sam. Florio's wife Carla tells Charlie that Florio died the previous night. During one of the evenings Charlie and Tess have together they play hide and seek. Tess sticks a note on the door which says \"come find me\" with a drawing of a boat beneath it. Charlie realizes that Tess is not dead and that he must find her.Along with his friend Alistair and Tess's coach Tink, Charlie takes a boat to find her. The following sunset, Charlie misses his game with Sam. As Charlie confesses his love for his departed sibling, Sam tells Charlie that he loves him back and moves on from the living world. He appears to Charlie as a shooting star in the sky to reveal Tess' location. The group finds Tess' wrecked boat along with her lying on the rocks. Charlie uses his body heat to keep Tess warm until they are found by the Coast Guard.Alistair tells Charlie that Tess had hypothermia and he saved her. Later, Charlie purchases an old boat and asks Tess if she would like to take a ride with him. However, Tess fears him explaining that she had vivid dreams about them together. Charlie tells Tess that her dreams are memories and recites a quote from her father's funeral that they spoke about in her dreams. Charlie resigns from his job and goes into the forest to say farewell to Sam, telling him they will always be brothers; although he is unable to see him, Sam is there and reveals that he is at peace. Charlie and Tess sail around the world.","language":"English","Reception":"Reviews for Charlie St. Cloud have been mostly negative, with the film garnering a 27% approval rating on review aggregator Rotten Tomatoes, based on 70 reviews.[19] Nick Schager of Slant Magazine called Charlie St. Cloud \"The schmaltzy spawn of The Sixth Sense.\"[20] Aaron Hills of the Village Voice praised the film, saying \"This handsomely shot melodrama has a twist too peculiar to dismiss as some two-bit Nicholas Sparks weepie.\"[21]","box_office":"$48,190,704","cinematography":"Enrique Chediak","production_company":"Relativity Media Marc Platt Productions Charlie Film Productions","directed_by":"Burr Steers","charlie_st._cloud":"Theatrical release poster","Music":"This is a list of music featured in the film but will not be included in the soundtrack","release_dates":"July 30, 2010 (2010-07-30)|||||","Production":"A bidding war for the film rights to the book by author Ben Sherwood broke out in April and May 2003, before the book was published.[2] Three studios competed for the rights.[2] Universal Studios and Marc Platt (Universal's president of production) won the right to make the book into a film, paying a reported $500,000 to $1 million for the rights (with that figure rising above $1 million if the film is made).[2] Ben Sherwood was guaranteed an executive producer credit on the film, and Universal Studios executive producer Donna Langley was assigned to the picture.[2] Joe Johnston was initially chosen to direct.[3]Drafts for the script were written by James Schamus and Lewis Colick,[4][5] but the final script was written by Craig Pearce.[4][6] By March 2009, Johnston had been replaced as director by Burr Steers, and Platt had named himself as producer.[4][6] Steers helped polish the script.[6] The first lead performer cast in the film was Zac Efron, who turned down the lead role in Paramount Pictures' remake of Footloose to star in this film.[4][7][8] Pre-production had commenced by March 2009, with filming set to begin in July 2009.[4]Training with Efron began in Vancouver, British Columbia, in July 2009,[9] and started production in Upstate New York July 2009 to October 5.[10] Actress Amanda Crew joined the film as Tess Carroll in July 2009,[11] and was shooting her scenes the following September.[12] Quite a few scenes in the film were shot in Gibsons, British Columbia, including a scene in the famous 'Beachcombers' restaurant.[13] Some of the film was also filmed at a Deep Cove school, Seycove Secondary School, in North Vancouver, B. C. Actress Kim Basinger agreed to play Louise St. Cloud (later Claire) in mid-August 2009.[6][14] Teen actor Chris Massoglia was signed in October 2009 to play a teenaged Sam St. Cloud, but never made it into the final film.[15][16][17]Efron wrapped his scenes in late October 2009.[18]Rolfe Kent wrote the score, with Tony Blondal orchestrating. It was recorded at Skywalker Sound, Marin County, California.","produced_by":"Marc Platt|Ben Sherwood|","starring":"Zac Efron|Charlie Tahan|Amanda Crew|Kim Basinger|Ray Liotta|Augustus Prew|Donal Logue|","running_time":"99 minutes","music_by":"Rolfe Kent","edited_by":"Padraic McKinley","budget":"$44 million[1]"}