{"based_on":"Novel: Agatha Christie","Changes":"The novel takes place primarily in Petra, Jordan whereas the film takes place in Jerusalem and Qumran (near the Dead Sea). This change was made because the production company was Israeli.","appointment_with_death":"Original cinema poster","country":"United Kingdom","distributed_by":"Cannon Film Distributors","screenplay_by":"Michael Winner Anthony Shaffer Peter Buckman","DVD availability":"This is the only one of the six films in which Peter Ustinov portrayed Poirot that has never been released onto Region 1 DVD for US and Canadian home video.","Plot":"Emily Boynton, stepmother to the three Boynton children – Lennox, Raymond and Carol – and mother to Ginevra, blackmails the family lawyer, Jefferson Cope, into destroying a second will of her late husband that would have freed the children from her dominating influence.She takes herself, the children and her daughter-in-law Nadine on holiday to Europe and the Holy Land. In Trieste, the great detective Hercule Poirot meets up with a woman friend, Dr. Sarah King, who falls in love with Raymond Boynton to Emily's disapproval.Lady Westholme, her secretary Miss Quinton and lawyer Cope are following them too. The children discover the second will and Emily succeeds in rubbing the rest the wrong way, causing much hatred towards her. At a dig, Emily is found dead. Poirot investigates.","language":"English","Reception":"The movie received a mixed reception. Vincent Canby wrote in The New York Times that the film \"is not up to the stylish standard of the earlier all-star, Hercule Poirot mysteries, especially Sidney Lumet's Murder on the Orient Express. The pleasures of the form are not inexhaustible, and this time the physical production looks sort of cut-rate.\"[3] Michael Wilmington of the Los Angeles Times blasted the film as \"unsatisfying, even a little soporific [with a] tendency to blame co-writer-producer-director Michael Winner, whose 1978 adaptation of \"The Big Sleep\" ruined the story by translating its action from Los Angeles in the 1930s to London in the 1970s.\"[4] Another blasting of the film came from Variety, who wrote: \"Peter Ustinov hams his way through Appointment with Death one more time as ace Belgian detective ‘Hercuool Pwarow,’ but neither he nor glitz can lift the pic from an impression of little more than a routine whodunit. Even the normally amusing Ustinov looks a bit jaded in his third big-screen outing as the sleuth, as well as several TV productions. Director Michael Winner has some fine Israeli locations to play with, but his helming is only lackluster, the script and characterizations bland, and there simply are not enough murders to sustain the interest of even the most avid Agatha Christie fan.\"[5] Critic David Aldridge, from an issue of Film Review magazine dated May 1988, classified the film as \"another loser from Winner, though, to give the man some small due, even a more talented director would have floundered forcing freshness in such formularised fare.\". He also criticized Cannon Films for the production value of a film that ostensibly was shot on an exotic location, with the quote: \"But, then, it is a Cannon Film and they're not known for spending a penny when a halfpenny would just about do. Good for TV\".The movie was not a box office success.[6]","box_office":"$960,040[2]","cinematography":"David Gurfinkel","directed_by":"Michael Winner","Ustinov as Poirot":"This film was Peter Ustinov's sixth and last appearance as Hercule Poirot.","release_dates":"15 April 1988 (US)","produced_by":"Michael Winner Menahem Golan Yoram Globus","starring":"Peter Ustinov|Lauren Bacall|Carrie Fisher|John Gielgud|Piper Laurie|Hayley Mills|Jenny Seagrove|David Soul|","running_time":"102 minutes","music_by":"Pino Donaggio","edited_by":"Arnold Crust Jr. (Michael Winner)","budget":"$6 million[1]"}