{"camera_setup":"multi-camera video/film inserts","original_language(s)":"English","Film version":"A film version directed by Richard Loncraine and starring Denholm Elliott (Bates), Joan Plowright (Mrs. Bates), Suzanna Hamilton (Pattie) and Sting (Martin) was released in 1982 and is also available on DVD. In the film, Mrs. Bates' first name is Norma instead of Amy.The film's soundtrack included works by The Police, Sting, The Go-Go's, and Squeeze, while Sting's cover of \"Spread a Little Happiness\" reached number 16 in the UK Singles Chart.[1]Brimstone and Treacle was released to DVD by MGM Home Video on September 16th, 2003 as a Region 1 widescreen DVD.","Plot":"For two years, Tom and Amy Bates have been struggling to cope with their altered lives, after their daughter Pattie (or Patricia) was severely injured in a hit-and-run accident. Pattie is unable to walk, completely dependent upon others for the activities of daily living, and seemingly unable to communicate beyond making unintelligible sounds. Although poorly educated and gullible, Amy Bates firmly believes that Pattie is able to understand what is being said in her presence, whereas Tom Bates has given up all hope of her recovery. In fact, judging from the sounds she makes, Pattie seems to realise what is going on around her, but Tom Bates is beyond noticing.One day on his way home from work he witnesses a handsome, well-dressed young man collapse in the street. Tom Bates is among the passersby who offer to help him. The young man, who gives his name as Martin Taylor, quickly recovers. A few hours later he turns up at the Bates', handing Tom Bates his wallet, which Martin pretends Tom lost in the general hubbub. Though the cash is gone, Bates' credit card is still there. Although Martin's true identity remains a mystery, Sting (who played Martin in the film production) has said that he believes him to be the Devil.From the moment he enters the house, he casts furtive and knowing glances at the audience (according to the stage directions) so they know at once that he is not what he pretends to be. He claims to have been Pattie's fiancé.He offers to be at Pattie's side despite the changed circumstances, and care for her for an unspecified period of time. Amy Bates in particular jumps at the suggestion; she has not had an hour off since Pattie's accident and is stranded in the house without the chance to go even to the hairdressers or do some window-shopping.Tom Bates is reluctant to accept Martin's help. He has always been very choosy about his daughter's friends, and as he cannot remember Pattie ever mentioning Martin's name, he does not want her to be left alone with what might well be a complete stranger. Eventually Martin wins him over by his excellent cooking and lip service to his bigotry; Tom has joined the National Front.At the first opportunity, Martin rapes the helpless Pattie (although in the film version, the rape comes late in the action, precipitating Pattie's return to consciousness shortly after he removes her nappy). When Amy Bates comes back from the hairdressers she recognises a change in her daughter's facial expression, but attributes it to Martin's presence. However, when Martin tries to rape the disabled girl again after Mr. and Mrs. Bates have gone to bed, Pattie starts screaming so loudly that he runs out of the house. When the Bateses come to see what has happened to their daughter, they find that she has fully recovered from her disabilities, and though still confused, asks her father what has been happening to her. She also recovers her memories of the events preceding her accident, which result from her discovery of her father's infidelity.Brimstone and Treacle was originally written by Potter as a television play, commissioned, paid for and recorded in 1976 by the BBC, for their Play for Today slot. The cast were Denholm Elliott (Mr. Bates), Michael Kitchen (Martin), Patricia Lawrence (Mrs. Bates) and Michelle Newell (Pattie); plus minor characters.It was withdrawn shortly before its scheduled transmission, it was listed in the Radio Times, because then Director of Television Programmes Alasdair Milne found it \"nauseating\" though \"brilliantly made\". Brimstone and Treacle was finally shown in August 1987, and has been released as a DVD.Rewritten by Potter for the stage, the play premiered on 11 October 1977 at the Crucible Theatre, Sheffield.","country_of_origin":"United Kingdom","original_network":"BBC 2 (originally intended for BBC 1)","directed_by":"Barry Davis","Potter on Brimstone and Treacle":"In 1978, Potter said:I had written Brimstone and Treacle in difficult personal circumstances. Years of acute psoriatic arthropathy—unpleasantly affecting skin and joints—had not only taken their toll in physical damage but had also, and perhaps inevitably, mediated my view of the world and the people in it. I recall writing (and the words now make me shudder) that the only meaningful sacrament left to human beings was for them to gather in the streets in order to be sick together, splashing vomit on the paving stones as the final and most eloquent plea to an apparently deaf, dumb and blind God. [...] I was engaged in an extremely severe struggle not so much against the dull grind of a painful and debilitating illness but with unresolved, almost unacknowledged, 'spiritual' questions.","original_release":"25 August 1987 (1987-08-25)","starring":"Michael Kitchen Denholm Elliott, Patricia Lawrence, Michelle Newell","running_time":"72 minutes","producer(s)":"Kenith Trodd","written_by":"Dennis Potter"}