{"country":"United States","distributed_by":"Orion Pictures","Plot":"In the year 2017, the United States has fragmented into postapocalyptic wastelands and limited civilized areas. One of the effects of the economic crisis is a decline in manufacturing, and heavy emphasis on recycling aging 20th-century mechanical equipment. Society has become increasingly bureaucratic and hypersexualized, with the declining number of human sexual encounters requiring contracts drawn up by lawyers prior to sexual activity. At the same time, robotic technology has made tremendous developments, and female androids (or \"gynoids\") are used as substitutes for wives.Business executive Sam Treadwell owns a \"Cherry 2000\" gynoid named Cherry. After Cherry short-circuits during sex, Sam is told by a repairman that she is irreparable. A gynoid dealer tells Sam that \"Cherry 2000\" gynoids were manufactured in a defunct factory in \"Zone 7\", a particularly dangerous, lawless area. With Cherry's memory disk, Treadwell hires Edith \"E\" Johnson, a tough tracker, to guide him to the factory.As they enter Zone 7, they encounter Lester, a wasteland overlord with deranged subordinates. Edith and Sam enter an underground reservoir occupied by Six-Fingered Jake, an elderly tracker who was Edith's mentor. When Lester's men attack, the three attempt to escape, but Sam is knocked unconscious and taken to a 1950s-styled motel/village run by Lester. He is greeted by his ex-girlfriend, Elaine, who now calls herself Ginger and works for Lester. Ginger tells Sam that he was the only one spared by Lester's men. Lester decides to induct Sam into the group, and Sam goes along. When he witnesses the group sadistically murdering a tracker, he decides to escape. As he escapes Lester's group, Sam runs into Edith and Jake. Jake stays behind to create some distractions, and gives Cherry's memory disk to Edith, though he had earlier led Sam to believe the chip had been lost.Edith, realizing Sam is a veteran of earlier wars, begins to see him in a new light and have feelings for him. Sam realizes he is attracted to Edith, but feels guilty when he is reminded of Cherry. After fighting off Lester's goons, they continue on to the factory. Edith goes to a brothel/gas station owned by Snappy, a friend of Jake, to borrow his light plane. Snappy betrays them to Lester. Jake is killed, but Edith and Sam escape in the plane.Sam suggests that they turn around, but Edith is determined to find a Cherry 2000 model so Jake's death will not be meaningless. As they land, Zone 7 is revealed to be actually the ruins of Las Vegas, now a ghost town. The gynoid \"factory\" is actually a casino called \"Pharaoh's Casino\". Sam finds a functional Cherry 2000, and activates her with the memory disk.When Lester's gang finds them, Edith and Sam manage to evade and kill many of his henchmen. Escaping to the plane, the three find that their combined weight prevents takeoff. Edith jumps out, despite Sam rejecting the idea. Sam turns the plane around to help the now-trapped Edith. Sam sends Cherry to get him a Pepsi, then has Edith get aboard. Lester is killed trying to stop them from escaping. Edith and Sam then kiss as they fly away.","language":"English","box_office":"$14,000","cinematography":"Jacques Haitkin","directed_by":"Steve De Jarnatt","Soundtrack":"Cherry 2000 is widely known for the original score composed by Basil Poledouris. The soundtrack album prepared for release at the time of the film was canceled due to the film being shelved for a few years instead of receiving a theatrical release. Later, Varèse Sarabande decided to make it the debut release in their CD Club. Originally sold by mail-order for US$20 and at only 1,500 copies, it became a highly valued collectible, one copy selling for $2,500 on eBay. However, for being such a touted collectors' item, the packaging for this limited-edition CD was riddled with typographical errors. The track list had the incorrect length printed for the last two tracks, and two tracks were missing from the track list entirely.Track Listing (as printed on label):[3]In 2004, Prometheus Records acquired the rights to the score and made it available in a double package with another Poledouris score, No Man's Land. The Prometheus Records release was not a limited edition and, as well as rectifying the track listing, features an additional eight minutes of unreleased music; however, it sold poorly.Track Listing:Tracks 30–40 are from No Man's Land.","release_dates":"November 17, 1988 (1988-11-17) (VHS)|||||","produced_by":"Edward R. Pressman Caldecot Chubb","starring":"Melanie Griffith David Andrews Tim Thomerson Pamela Gidley","running_time":"93 minutes","cherry_2000":"Theatrical poster","music_by":"Basil Poledouris","edited_by":"Edward M. Abroms Duwayne Dunham","Release":"After its completion in December 1985,[2][4] Orion Pictures originally scheduled Cherry 2000 for a U.S. release on August 15, 1986.[5] Sometime later, the date was postponed to March 1987,[6] then September 1987.[7] The film ultimately premiered on videocassette on November 17, 1988.[1] Producer Edward R. Pressman confessed that Cherry 2000's combination of genres stumped promoters at Orion, resulting in its repeated shelving.[2]","written_by":"Lloyd Fonvielle (story) Michael Almereyda (screenplay)","budget":"$10 million[2]","Location":"According to the credits, the film was shot entirely in the state of Nevada. The van plunging into an open pit was shot at Three Kids Mine. The river crossing sequence was filmed at the Hoover Dam. Scenes at the Sky Ranch were filmed at the Beehive group camping area in the Valley of Fire State Park. E.'s and Sam's first kiss was filmed in the upper reaches of the Las Vegas Wash. Adobe Flats was filmed at Eldorado Valley Dry Lake Bed. The town of Glory Hole was filmed in Goldfield, Nevada. The Integratron building in Landers, California was used as the casino that was the \"abandoned manufacturing plant\" holding a rare copy of the outdated Cherry 2000 android female robot at the end of the movie. The fortress-like building featured in the film is in Commerce, California at the location of a former tire factory which was renovated and transformed into the Citadel Outlet Mall."}