{"country":"Canada United States","distributed_by":"Film Collective","screenplay_by":"Bill Kauffman","story_by":"Harold Frederic","Plot":"In a rural community upstate New York in 1862, farmer Abner Beech is a Northern antiwar Democrat. While his neighbors take up the Union cause in the ongoing American Civil War, Beech believes that coercion in resisting the secession of the southern states is unconstitutional, and gradually becomes more and more harassed for his views, derisively called a \"Copperhead\". His son, Thomas Jefferson Beech, enlists in the Union Army. Beech also arouses the ire of militant abolitionist Jee Hagadorn, whose daughter Esther (Lucy Boynton) loves Jeff.","language":"English","Reception":"\"Well researched, intellectually admirable, and beautifully photographed . . . If every war has more than one side, this story of one man who dares to stand against the tide of history has a contemporary relevance that remains uncontested.\" <Rex Reed, New York Observer>Copperhead opened in limited theatrical release June 28, 2013, playing in 59 theaters.[1] and was simultaneously released in video-on-demand platforms including Amazon Video where it is remains available.","box_office":"$171,740[1]","cinematography":"Kees Van Oostrum","production_company":"Swordspoint Productions Brainstorm Media","directed_by":"Ron Maxwell","release_dates":"June 28, 2013 (2013-06-28)|||||","Production":"The film had the working title Copperhead: The War at Home.[citation needed] Filmed at Kings Landing Historical Settlement in New Brunswick, Canada,.[2][3] \"Copperhead\" was produced by Ron Maxwell and co-produced by John Houston.","copperhead":"film poster","produced_by":"Bryan Cassels","starring":"Billy Campbell|Angus Macfadyen|Peter Fonda|Augustus Prew|Lucy Boynton|Casey Thomas Brown|François Arnaud|Josh Cruddas|Genevieve Steele|","running_time":"118 minutes","music_by":"Laurent Eyquem","Relation to director's previous works":"Copperhead is Maxwell's third Civil War film, though the director does not consider it to be part of the trilogy he has planned along with Gettysburg (1993) and Gods and Generals (2003), as he expects to conclude the series with a final film based on Jeff Shaara's The Last Full Measure.[4]"}