{"based_on":"The Brady Bunch  by Sherwood Schwartz","Cast":"The film also features a variety of cameos, including RuPaul, Zsa Zsa Gabor, Rosie O'Donnell, Barbara Eden, David Spade (uncredited as the hairstylist), Richard Belzer and John Hillerman.","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Harry Elfont Deborah Kaplan","story_by":"Harry Elfont Deborah Kaplan James Berg Stan Zimmerman","Plot":"Following its predecessor, the film places the 1970s Brady Bunch family in a contemporary 1990s setting, where much of the humor is derived from the resulting culture clash and the utter lack of awareness they show toward their relatively unusual lifestyle.One evening, a man claiming to be Carol's long-lost first husband, Roy Martin, shows up at the suburban Brady residence. He is actually a con man named Trevor Thomas and is there to steal their familiar horse statue that is actually a $20 million ancient artifact. They, portrayed as naïve, believe his story about suffering from amnesia and having plastic surgery after being injured. Throughout Trevor's stay, he is openly hostile to them, his sarcasm and insults completely going over their heads. Eventually, Trevor's ruse is uncovered by Bobby and Cindy; in retaliation, he kidnaps Carol and takes her and the artifact to a buyer in Hawaii. The remaining Brady family travels to Hawaii to save her and foil his plans.Besides the main storyline, the children have their own subplots in the film. Greg and Marcia both want to move out of their shared rooms and when neither wants to back down, they have to share the attic together. When Trevor's arrival suggests that Carol and Mike might not be married, Greg and Marcia believe that they are technically not related. That leads them to realize they are in love with each other, but try to hide it from one another throughout the movie. Eventually both cave in and they share a kiss at the end of the movie. Jan's subplot involves her making up a pretend boyfriend named George Glass in order to make herself seem more popular. Jan then meets a real boy named George Glass during the family's trip to Hawaii. Peter, who is trying to decide what career path to choose, starts idolizing and emulating Trevor. Bobby and Cindy start a \"Detective Agency\" hunting down her missing doll, an act that inadvertently leads them to discover Trevor's true intentions.","language":"English","Reception":"The film received generally mixed reviews from film critics. It currently holds a 52% rating on Rotten Tomatoes. Nonetheless the film grossed $7,052,045 on opening weekend in August 1996 debuting on 2,147 screens.[1] Gross sales are estimated at $21,397,954.[1]","box_office":"$21,440,752[1]","cinematography":"Mac Ahlberg","production_company":"The Ladd Company","directed_by":"Arlene Sanford","release_dates":"August 23, 1996 (1996-08-23)|||||","produced_by":"Sherwood Schwartz Lloyd J. Schwartz Alan Ladd, Jr.","starring":"Shelley Long Gary Cole Tim Matheson","running_time":"89 minutes","a_very_brady_sequel":"Theatrical release poster","music_by":"Guy Moon","edited_by":"Anita Brandt-Burgoyne","budget":"$15 million[1]"}