{"country":"United States","distributed_by":"RKO Radio Pictures","Plot":"Pop Jones inherits a piece of family land in Montana, so he and his daughter, Sierra Nevada, decide to leave their Texas ranch and move there. As she bathes in a pond along the trail, Sierra Nevada encounters a stranger, Farrell, a hired gunman who warns her about dangerous Indians nearby.Farrell is on his way to work for Tom McCord, a rich rancher. Quite a bit of rustling has been going on in the territory of late. McCord is in cahoots with Indians, in particular Natchakoa of the Blackfoot tribe, whose braves stampede the Jones family's cattle, knock Sierra cold, wound her cowhand Nat and kill Pop, after which McCord steals a document from Pop's dead body that grants rights to the land.Sierra is nursed back to health by Colorados, a young Blackfoot who attends school among the whites, to the displeasure of the tribal chief, his father. McCord offers a $2,000 bounty to Farrell if he kills Sierra, but instead Farrell comes to her rescue.Farrell reveals that he is actually an agent for the U.S. Cavalry, investigating the rustling and killing. With the help of Sierra, he blows up a McCord wagon filled with ammunition being sold to the Indians, doing away with McCord once and for all and bringing peace to the territory at last.","cattle_queen_of_montana":"Original poster","language":"English","cinematography":"John Alton","directed_by":"Allan Dwan","release_dates":"November 18, 1954 (1954-11-18) (US)[1]|||||","produced_by":"Benedict Bogeaus","starring":"Barbara Stanwyck Ronald Reagan Gene Evans","running_time":"88 minutes","Influence":"In Cattle Queen of Montana, one of Tom McCord's men is shot by Sierra Jones, and Farrel (Ronald Reagan's character, who is an undercover U.S. Marshal), another of McCord's men and witness to the shooting, lies about how the altercation took place to one of the gang leaders, and leaves despite being asked to wait at the headquarters for Tom McCord to show up. In Martin Scorsese's film The Departed, Leonardo DiCaprio's character, Billy Costigan, whose identity as an undercover police officer has been discovered by a wounded man, is asked to stick around at the gang's headquarters until all of the gang members' backgrounds have been checked, but leaves anyway despite the warning.In the 1985 film Back to the Future, Marty McFly travels back to 1955 and sees a poster for Cattle Queen of Montana playing at the Essex Theater in Hill Valley.","music_by":"Louis Forbes","edited_by":"Carlo Lodato","written_by":"Robert Blees Howard Estabrook"}