{"country":"Netherlands","distributed_by":"Asmik Ace Entertainment","antonia's_line":"German poster","Plot":"Following World War II, the widow Antonia and her daughter Danielle arrive at Antonia's home town where her mother is dying. Antonia turns down an offer of marriage from Farmer Bas, but develops a romance with him anyway. Danielle becomes an artist and expresses interest in raising a child, while rejecting the idea of having a husband. Antonia and Danielle visit the city to find a man to impregnate Danielle, resulting in the birth of Therèse, an unusually intelligent girl. Danielle also develops a lesbian relationship with Therèse's tutor.Years later, Therèse is raped by a man named Pitte, who had earlier raped his mentally handicapped sister Deedee. Antonia places a curse on him, after which he is drowned. Therèse is unable to find her intellectual match but eventually has a relationship with a childhood friend, resulting in her pregnancy. She decides to keep the baby and gives birth to Sarah, the film's narrator. Antonia later dies of old age, in the company of friends and family.","language":"Dutch","Reception":"Reception of Antonia's Line was largely favourable. Roger Ebert gave the film four stars, saying the film showed \"the everyday realities of rural life, a cheerful feminism, a lot of easygoing sex and a gallery of unforgettable characters.\"[8] Leonard Maltin called it \"a treat from start to finish.\"[9]Women's studies Professor Linda Lopez McAlister commented that \"It seems to me that Gorris's accomplishment in this film is to have created a sense of place and characters full of life, full of quirks and idiosyncrasies and peccadillos, full of love,and rage, and desire.\"[10] Conversely, Edward Guthmann of the San Francisco Chronicle called the film \"rubbish\" and the character of Antonia a \"sour pickle.\"[11]Antonia's Line won the 1996 Academy Award for Best Foreign Language Film,[9] the Toronto International Film Festival People's Choice award,[11] and two Nederlands Film Festival Golden Calf awards.[12] Gorris also won for Best Director at the Hamptons International Film Festival and Best Screenplay at the Chicago International Film Festival.[7]Anneke Smelik analyzed the film, writing \"It is Oedipal in the sense that it is about a family, but instead of featuring the triangle of father, mother and child, the film establishes a line of mothers and daughters.\" She goes on to write, \"Female desire is represented in all of its diverse manifestations: Antonia's wish for independence, Danielle's quest for artistic creativity, Therèse's pursuit of knowledge, and Sarah's curiosity about life in general.\"[13]","box_office":"$4.2 million","directed_by":"Marleen Gorris","release_dates":"12 September 1995 (1995-09-12) (TIFF)|21 September 1995 (1995-09-21)||||","Production":"Gorris wrote the screenplay herself and finished it in 1988. However, making the film took three attempts, with challenges stemming from putting together a large cast and finding a village that could be portrayed as realistic for a 50-year period. It was eventually filmed in Belgium.[5]Another major challenge was finding investors.[6] Funding ultimately came from the Netherlands, Belgium and the UK.[5] With the help of producer Hans de Weers, Gorris found investors and also worked with British producer Judy Counihan of Red Hot Organization.[6]Filming finished in November 1994.[7]","produced_by":"Gerard Cornelisse Hans De Weers Hans de Wolf","starring":"Willeke van Ammelrooy Els Dottermans Jan Decleir Victor Löw Johan Heldenbergh","running_time":"102 minutes","edited_by":"Wiebe van der Vliet","written_by":"Marleen Gorris"}