{"country":"People's Republic of China","distributed_by":"Columbia Pictures (US)","Plot":"Yan Shouyi is a TV host who has an affair with Wu Yue (Fan Bingbing), a young and attractive woman working in publishing. Yan diligently erases all text messages and call records between him and Wu on his cellphone before he gets home everyday, in order to avoid detection by his wife Yu Wenjuan (Lu Zhang). One night, after telling Yu that he has a work meeting with Fei Mo (Zhang Guoli), a TV producer and Yan's superior, Yan rendezvous with Wu and switches off his cellphone. Not being able to reach Yan a while later, Yu calls Fei, who has been in the know of Yan's affair.","language":"Mandarin Chinese","Reception":"The popularity of Cell Phone among the cinema-goers is evident in its strong box office performance. Having achieved ¥50 million in box office within a month after release (US$6.4 million in total according to Business Week[2]), the film became the best-selling domestic production in 2003.[1] The film also clinched all three top awards at the 2004 Hundred Flowers Awards, which is based on viewer voting. However, it failed to bag any award or even acquire nomination for any of the major awards at the jury-based Golden Rooster Awards in the same year. According to Golden Rooster's leading juror Zhong Chengxiang, albeit being popular among viewers, Cell Phone lacked \"class and style\".[3] Producer Wang Zhongjun retorted that viewers' approval is of the utmost importance and rejected the Golden Rooster as an award that has \"not a single bit of commercial driving force\".[4] On the other hand, the official Huabiao Awards gave out an unprecedented special award to Cell Phone for its achievements in \"market development\", signifying official recognition of the market forces and taste of the masses.","cell_phone":"Promotional poster for Cell Phone","cinematography":"Zhao Fei","directed_by":"Feng Xiaogang","release_dates":"18 December 2003 (2003-12-18)|||||","produced_by":"Wang Zhongjun Yang Buting","starring":"Ge You Zhang Guoli Fan Bingbing Xu Fan","running_time":"107 minutes","music_by":"Su Cong","edited_by":"Zhou Ying","written_by":"Liu Zhenyun"}