{"country":"United States","distributed_by":"New Line Cinema","Plot":"Butch \"Bullet\" Stein (Mickey Rourke) is a 35-year-old Jewish ex-con who is released from prison after serving an 8-year sentence for being an accomplice to a robbery. After his release he returns to Brooklyn to live with his dysfunctional family, including his alcoholic father, depressed mother, unstable older brother Louis, and his younger brother Ruby, an aspiring artist.Tank (Tupac Shakur) is a local drug kingpin with a score to settle after Bullet stabbed him in the eye while they were serving time together. Bullet seems to welcome the challenge. In the meantime, he keeps himself occupied by shooting heroin and robbing his neighbor's house for jewelry, which he sells to a gangster named \"Frankie Eyelashes\".One night Tank arranges a fight between his henchman and Bullet. The fight ends when the henchman breaks his hand and Bullet returns home where he tells his mother he loves her and he's sorry for everything he put her through over the years. Bullet then has a final showdown with Tank, who shoots him dead. Soon after, Louis gets revenge by cutting Tank's throat and leaving Bullet's pet rat (named Tony Curtis) on the dead body.","language":"English","cinematography":"Crescenzo Notarile","production_company":"Village Roadshow Pictures Clipsal Films","directed_by":"Julien Temple","Alternate versions":"The DVD contains an Unrated cut that features apparently material that was cut for an R-rating. Included was blood gushing out when Butch drives a knife into a drug dealer's eye. One of Tank's henchmen getting shot in the head with blood splattering on the wall during the gunfight between Tank and Paddy's gang is also included. More shots of Lester having sex with the two girls, including some extra dialogue.","release_dates":"October 1, 1996 (1996-10-01)|||||","produced_by":"Greg Coote Graham Burke John Flock Roger Paradiso","starring":"Mickey Rourke Tupac Shakur Donnie Wahlberg","running_time":"96 minutes","edited_by":"Niven Howie","written_by":"'Sir' Eddie Cook Bruce Rubenstein"}