{"country":"South Korea","Awards and nominations":"2003 Sitges Film Festival[8]2003 Screamfest Horror Film Festival2003 Busan Film Critics Awards2003 Blue Dragon Film Awards2003 Korean Film Awards2003 Director's Cut Awards2004 Brussels International Fantastic Film Festival2004 Fantasia Festival2004 Fantasporto Film Festival2004 Gérardmer Film Festival2004 Grand Bell Awards","distributed_by":"Cineclick Asia Big Blue Film","revised_romanization":"Janghwa, Hongryeon","language":"Korean","hangul":"장화, 홍련","box_office":"$72,541 (US only)[2]","cinematography":"Lee Mo-gae","production_company":"B.O.M. Film Productions Co.","directed_by":"Kim Jee-woon","release_dates":"June 13, 2003 (2003-06-13)|||||","Production":"The film is loosely based on a popular Korean fairy tale \"Janghwa Hongryeon jeon\" which has been adapted into film versions in 1924, 1936, 1956, 1962, 1972, and 2009.In the original Korean folktale, the sisters' names are Janghwa and Hongryeon (Rose Flower and Red Lotus). In the film, they are Su-mi and Su-yeon (though the names still hold the meaning, Rose and Lotus).Im Soo-jung (Su-mi) originally auditioned for the role of Su-yeon (played by Moon Geun-young).Kim Jee-woon originally wanted Jun Ji-hyun to play Su-mi, but she refused the role because she thought the script was too scary. Ironically, her next film was an unrelated horror film, The Uninvited.","running_time":"115 minutes","a_tale_of_two_sisters":"Poster for A Tale of Two Sisters","budget":"$3,700,000[1]","Plot":"A teenage girl, Su-mi, is being treated for shock and psychosis. The doctor questions her about the day that led her to be admitted, but she refuses to answer. Later, Su-mi is returned home to her family's secluded estate with her father and her younger sister Su-yeon. At a family dinner, their cold and distant stepmother announces that their uncle and his wife will arrive tomorrow night for a dinner party. The girls are disappointed with her announcement and leave the table. Whilst the family goes to sleep, Su-yeon hears strange noises in her bedroom and goes to Su-mi for protection. However, Su-mi experiences a terrifying nightmare in which a female ghost with blood pouring down her legs climbs on top of her bed. Afterwards, all of the females in the family discover that their periods have occurred at the same time.The next day, Su-mi finds several family photos, which reveal that her father and her stepmother once worked together and that the stepmother was an in-home nurse for her late biological mother. Su-mi discovers bruises on her sister's arms and angrily confronts her stepmother about it. At night, their uncle and his wife attend the dinner party and the stepmother tells bizarre stories, much to the bewilderment of the other guests. Suddenly, the uncle's wife suffers a violent seizure. Upon recovering, she claims to have seen a ghost beneath the kitchen sink. The stepmother later attempts to search for the ghost and she is attacked when a disfigured arm suddenly grabs her.After finding out that her pet bird has been killed, the stepmother enters Su-yeon's room and discovers another dead bird, along with defaced family photos of herself. She locks Su-yeon in the closet and promises to release her if she apologises. Su-mi eventually releases her sister and she tearfully apologises that she didn't hear her pleas in time. Su-mi's father blames her for the family's recent trauma, but she retorts that her stepmother is to blame for attacking Su-yeon. The father tells her that Su-yeon is dead, but Su-mi refuses to believe him.The next morning, after the father leaves the house to arrange Su-mi's readmission to the institution, the stepmother is seen dragging a large bloodied sack throughout the house. After discovering the trail of blood, Su-mi believes that Su-yeon is inside and tries to find a knife to open it. Her stepmother catches her and attempts to scald her with boiling water, but Su-mi manages to stab the stepmother in the hand with a pair of scissors. Su-mi is knocked unconscious by her stepmother. As Su-mi awakens, her stepmother taunts her about all of the suffering she experienced. She attempts to kill Su-mi with a garden statue, but is interrupted when the father arrives home and finds Su-mi alone. The father takes the stepmother into another room and orders her to sit down whilst he gives Su-mi medication.It is revealed that Su-yeon and the stepmother are Su-mi's split personalities. Inside the bloodied sack, it is revealed that the sack wasn't actually bloodied but instead, there was a porcelain doll inside which Su-mi used to whip to act out her stepmother hitting her sister Su-yeon.The father and the real stepmother send Su-mi back to the mental institution and the stepmother attempts to reconcile her relationship with Su-mi but Su-mi rejects her advances. They return home and whilst the stepmother sits alone in the kitchen at night, she hears footsteps racing towards Su-yeon's room. Entering the room, the lights suddenly black out and the door shuts close by itself. The bedroom closet suddenly opens by itself and the stepmother sees a lace that is stuck between two mattresses. Pulling the lace out, a ghost suddenly emerges and the stepmother backs away out of fear. The ghost continues to crawl closer to her and she screams out loud, which could be heard outside from the house, and is presumably killed by the ghost.Flashbacks reveal the father entering the house with the stepmother after an apparent marriage. The sisters' biological mother, uncle and his wife are also present in the house. The sisters developed a troubled relationship with the stepmother, resulting in Su-yeon leaving the kitchen and going to her bedroom to cry with her gravely ill biological mother. Later, Su-yeon discovers that her biological mother had hanged herself in the bedroom closet. Attempting to revive her, Su-yeon accidentally causes the closet to collapse on top of her body, which created a loud crash. The stepmother investigates the source of the loud crash and sees Su-yeon's hand hitting the floor several times. She turns her back against her due to their troubled relationship but she decides to save her but she sees Su-mi arriving at the scene, causing both of them to go into a heated argument which eventually made the stepmother too angry to save Su-yeon.Before Su-mi stormed off, the stepmother tells her that she would regret this one day. Su-mi exits the house and she sees her stepmother looking coldly at her from the balcony. as Su-yeon eventually dies from being crushed by the weight of the closet. Su-mi continues walking away from the house and is unaware of the tragic events that occurred inside the house, which is the initial event that led her to be institutionalised.","Reception":"It is both the highest-grossing Korean horror film and the first to be screened in American theatres.[4] With a limited American release starting December 3, 2004, it grossed $72,541.[2] A Tale of Two Sisters garnered very positive reviews, with an 87% \"Certified Fresh\" rating on Rotten Tomatoes.[5] Meanwhile, Metacritic scored the film 65 out of 100, meaning \"generally favorable reviews\" from 19 critics.[6]Kevin Thomas of Los Angeles Times described A Tale of Two Sisters as \"a triumph of stylish, darkly absurdist horror that even manages to strike a chord of Shakespearean tragedy – and evokes a sense of wonder anew at all the terrible things people do to themselves and each other.\"[7]","hanja":"薔花, 紅蓮","mccune–reischauer":"Changhwa, Hongnyŏn","Remake":"DreamWorks announced the two lead actresses on June 28, with Emily Browning as Anna Ivers (Su-mi), and Arielle Kebbel as Alex Ivers (Su-yeong). Although originally titled A Tale of Two Sisters like the original film, it was later renamed as The Uninvited.","produced_by":"Oh Jeong-wan Oh Ki-min","starring":"Im Soo-jung Moon Geun-young Yum Jung-ah Kim Kap-soo","music_by":"Lee Byung-woo","edited_by":"Ko Im-pyo","written_by":"Kim Jee-woon"}