{"Cast":"","country":"United States","distributed_by":"RKO Radio Pictures Inc.","Plot summary":"At the Central Park Zoo in New York City, Serbian-born fashion designer Irena Dubrovna makes sketches of a black panther. She catches the attention of marine engineer Oliver Reed, who strikes up a conversation. Irena invites him to her apartment for tea. As they walk away, one of Irena's discarded sketches is revealed as a panther impaled by a sword.At her apartment, Oliver is intrigued by a statue of a medieval warrior on horseback impaling a large cat with his sword. Irena informs Oliver that the figure is King John of Serbia and that the cat represents evil. According to legend, long ago the Christian residents of her home village gradually turned to witchcraft and devil worship after being enslaved by the Mameluks. When King John drove the Mameluks out and saw what the villagers had become, he had them killed. However, \"the wisest and the most wicked\" escaped into the mountains.Oliver buys her a kitten, but upon meeting her it hisses. Irena explains that \"cats just don't like me\" and suggests they go to the pet shop to exchange it, but when they enter the shop the animals go wild in her presence. The shopkeeper says that animals can sense things about people. It gradually becomes clear that Irena believes she is descended from the cat people of her village, and that she fears that she will transform into a panther if aroused to passion.Despite her odd beliefs, Oliver persuades her to marry him. However, during the dinner after their wedding at a Serbian restaurant, a catlike woman walks over and asks Irena if she is \"мојa сестрa\" (moya sestra, \"my sister\"). Fearing something evil within her and dreading what could happen, Irena avoids sleeping with her husband. He persuades her to see a psychiatrist, Dr. Louis Judd. Irena tells Judd of her childhood, revealing that the other children had called her mother a cat person, and her father had died mysteriously. Judd tries to convince her that her fears are of a mundane nature, and stem from these childhood traumas. When Irena returns from her consultation with Judd, she discovers that Oliver has confided their marital problems to his attractive assistant, Alice Moore, and she feels betrayed.At work, Alice confesses to Oliver that she loves him. After Irena chances to see Oliver and Alice seated together at a restaurant, she follows Alice as she walks home alone through one of the Central Park transverses. Alice becomes increasingly uneasy, sensing an unseen someone or something behind her. Just as she hears a menacing sound, a bus pulls up, and she hastily boards it. Soon after, a groundskeeper discovers several freshly killed sheep. The bloodied pawprints leading away turn into imprints of a woman's shoes.Later, when Alice decides to take a dip in the basement swimming pool of her apartment building, she is stalked by an animal shown only by its shadow. She jumps into the pool, using the water to keep the creature at bay. When Alice screams for help, Irena turns on the lights and claims to be looking for Oliver. Alice emerges, wondering if she had imagined the whole thing, until she finds her robe torn to shreds.After a talk with Judd, Irena tells Oliver she is no longer afraid, but it is too late; Oliver has realized that he loves Alice and is getting a divorce. Later, at work, he and Alice are cornered by a ferocious animal. Thinking quickly, he grabs his T-square (which is in the shape of a cross) and tells Irena to go away.After it leaves, Alice calls Judd to warn him to stay away from Irena, but he hangs up when Irena arrives for her appointment with him. Attracted to her, he makes the fatal mistake of kissing her. She transforms into a panther and kills him, though he manages to wound her in the shoulder with the sword concealed in his cane. Oliver and Alice arrive a few minutes too late. Irena slips away, back in her human shape, and goes to the zoo. There, she opens the panther's cage and allows herself to be killed.","language":"English","Reception":"The movie was popular and made a profit of $4,000,000 in U.S.A. with an estimated budget of $134,000.[12]Variety estimated its rentals in 1943 as $1.2 million.[13]Another source puts its gross at $535,000 and says it made profit to the studio of $183,000.[14]Reviews of the film were mixed when the film was first released. Variety called Cat People a \"weird drama of thrill-chill caliber\"[15] while Bosley Crowther writing for The New York Times commented that \"The Cat People is a labored and obvious attempt to induce shock.\"[16]In retrospect critics agreed on Cat People being a landmark in the horror genre. William K. Everson dedicated a whole chapter to the film and its successor The Curse of the Cat People in his book Classics of the Horror Film.[17] Paul Taylor in Time Out magazine remarked Lewton's \"principle of horrors imagined rather than seen\", its \"chilling set pieces directed to perfection by Tourneur\" and Simon's \"superbly judged performance\".[18] TV Guide's review of the film praised the film's cast:Superbly acted (with Simon evoking both pity and chills), Cat People testifies to the power of suggestion and the priority of imagination over budget in the creation of great cinema. The film was Lewton's biggest hit, its viewers lured in by such bombastic advertising as \"Kiss me and I'll claw you to death!\" – a line more lurid than anything that ever appeared onscreen.[19]Bravo awarded the film's stalk scene the 97th spot on their \"The 100 Scariest Movie Moments\", while Channel 4 awarded the scene the 94th spot on their \"The 100 Greatest Scary Moments\" list.[20]In 1993, Cat People was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".[21] Also, the New York Museum of Modern Art holds a copy of the film in its collection.[22] Critic Roger Ebert has included it in his list of \"Great Movies\".[23] As of July 16, 2012, the film holds a 91% Fresh rating on review aggregator website Rotten Tomatoes.[24]Horror director John Carpenter, however, found the film and Lewton's techniques (in particular the Lewton bus and the theme of implying the monster's presence rather than showing it) highly overrated, quipping that \"Jurassic Park done by Val Lewton would be nothing!\" in the BBC documentary series A History of Horror.Much has been said of Lewton and Tourneur’s use of shadows in lieu of an actual monster in the film. This is very much in contrast to competing horror films being produced by Universal at the time. J. P. Tollette in his book Dreams of Darkness: Fantasy and the Films of Val Lewton speaks to the meaning of the extensive use of shadows in the film:“While engaging our imaginative participation, the absence marked by those dark patches speaks of a fundamental – and disturbing – relationship between man and his world: it signals a black hole or vacant meaning in the physical realm which, in spite of man’s natural desire to fill it with consciousness and significance, persistently and troublingly remains open.”[25]","box_office":"$8,000,000[1]","DVD releases":"In the US, Cat People and The Curse of the Cat People were issued as a double feature DVD or as part of the Val Lewton Horror Collection DVD box. Foreign DVD editions have been released in France (as La Féline), Spain (as La mujer pantera) and Germany (as Katzenmenschen), while in the UK the film has only been released on VHS. Until now, a company called Odeon Entertainment (OEG) has licensed and released the DVD in the UK (The link is shown in the external links). This company are releasing the sequel in April \"The Curse of the Cat People\".","cinematography":"Nicholas Musuraca","directed_by":"Jacques Tourneur","cat_people":"Theatrical release poster","release_dates":"December 6, 1942 (1942-12-06) (New York City)|December 25, 1942 (1942-12-25) (U.S.)||||","Production":"Cat People was the first production for producer Val Lewton, who was a journalist, novelist and poet turned story editor for David O. Selznick. RKO hired Lewton to make horror films on a budget of under $150,000 to titles provided by the studio.[4]The film was shot from 28 July to 21 August 1942 at RKO's Gower Gulch studios in Hollywood.[5] Sets left over from previous, higher-budgeted RKO productions—notably the staircase from The Magnificent Ambersons—were utilized.[6] Costing $141,659 ($7,000 under budget),[7] it brought in almost $4 million in its first two years and saved the studio from financial disaster.[8]Near the end of the filming of Cat People, two crews were working to finish the picture on time, one at night, filming the animals, and one during the day with the cast.[4]Cat People was the first collaboration of director Tourneur with cinematographer Nicholas Musuraca. Their later collaboration on RKO's Out of the Past (1947) would again be regarded as seminal for its genre,[9][10] in this case the Film noir.Lewton and his production are credited for inventing or popularising the horror film technique called the 'Lewton Bus'. The term derives from the scene in which Irena is following Alice. The audience expects Irena to turn into a panther at any moment and attack. At the most tense point, when the camera focuses on Alice's confused and terrified face, the silence is shattered by what sounds like a hissing panther—but is just a bus pulling up. This technique has been used many times since. Any scene in which tension is dissipated by a mere moment of startlement, a boo!, is a 'Lewton Bus'.[11]","produced_by":"Val Lewton","starring":"Simone Simon Kent Smith Tom Conway Jane Randolph","running_time":"73 minutes","Sequel":"Lewton accepted the assignment of producing a follow-up film called The Curse of the Cat People in 1944, which retained Kent Smith and Jane Randolph's characters, and showed Simone Simon either as a ghost or else as the imaginary friend of the couple's young daughter. A remake of the first film directed by Paul Schrader and starring Nastassja Kinski, Malcolm McDowell, and John Heard was released in 1982. In March 1999 a second remake of the film was announced as a co-production between Universal Pictures and Overbrook Entertainment. The proposed remake, to be written by Rafael Moreu, would be updated to the present day and set in New York.[26]","music_by":"Roy Webb","edited_by":"Mark Robson","written_by":"DeWitt Bodeen","budget":"$134,000[1][2]"}