{"based_on":"BAT-21: Based on the true story of Lieutenant Colonel Iceal E. Hambleton, USAF (book)  by William C. Anderson","country":"United States","distributed_by":"TriStar Pictures","screenplay_by":"William C. Anderson George Gordon","Plot":"During the last days of the Vietnam War, USAF Lieutenant Colonel Iceal E. \"Gene\" Hambleton (Gene Hackman) call sign BAT-21 Bravo, is flying on board a EB-66C electronic warfare aircraft, engaged in electronic countermeasures preparatory to a major bombing strike. Without warning, a number of SA-2 Guideline surface to air missiles are launched from South Vietnam, targeting their aircraft. A massive SAM explosion tears off the tail and Hambleton, in the navigator's position, ejects as the sole survivor of the six-man crew.While still coming down by parachute, Hambleton makes radio contact with Captain Bartholomew \"Birddog\" Clark (Danny Glover), the pilot of a Cessna O-2 Skymaster, flying a Forward Air Control mission near where the EB-66 was destroyed. Birddog becomes Hambleton's link to rescue.Hambleton, an expert on electronic weapons systems, is known to the North Vietnamese, who begin an all-out search, attempting to capture him. An effort by Hambleton to get help from Vietnamese villagers is not successful, meanwhile, American forces begin an all-out attempt to rescue him.Knowing that it is too dangerous for rescue aircraft to come to where he is, and knowing that the bombs will soon be falling where he is, Hambleton devises a plan to reach safer territory. He plots a course to the river which is the boundary of the target area, then communicates his intended path to Birddog in a code composed of various golf courses he knows well. This will allow the rescuers to keep track of his progress, making it easier for them to pick him up.Several attempts are made to recover Hambleton. Two helicopters are lost and members of its crews are killed or captured. Clark ultimately flies a \"Huey\" helicopter rescue mission, but as he retrieves Hambleton, the pair are shot down by ground fire, with Clark being wounded. A F-100 bombing raid both assists and hinders their progress through the jungle, as North Vietnamese irregulars are trailing them. In the end, Hambleton and Clark are rescued by a US river boat patrolling nearby on the Cam Lo River.Portions of Bat*21 were highly dramatized, including the climactic battle. Some characters were composites of real people, while others were created for the film. However, some other details were accurate, including the fact that rescuer Captain Larry Potts was of African American ancestry.[3]The actual rescue took over 11 days, during which a major attack was delayed, resulting in numerous South Vietnamese soldiers being killed and wounded. A Forward Air Observer aircraft was shot down and USAF 1Lt Bruce Walker and USMC 1Lt Larry Potts parachuted to the ground safely, eluding capture. In an ensuing attack, six more Americans lost their lives attempting to rescue him. The North Vietnamese, alerted by the intense efforts to find the flyer, increased their efforts to find Hambleton. Walker was discovered and killed by the Vietnamese forces. During a nighttime, covert operation from more than 2 miles (3.2 km) behind enemy lines, Hambleton was finally rescued in a land operation by U.S. Navy SEAL Lt. j.g Thomas R. Norris and VNN Petty Officer Third Class Nguyen Van Kiet.[4]","language":"English","Reception":"Film historian Alun Evans in Brassey's Guide to War Films, considered the production an unusual look at \"... the perspective of a service non-combatant.\"[6] In a contemporary review, Roger Ebert noted: \"'BAT*21' is the kind of lean, no-nonsense war film Hollywood used to make back before the subject became burdened with metaphysical insights.\"[7] Listed in the \"best\" category of \"The Best (and Worst) War Movies of All Time\", Popular Mechanics, characterized Bat*21 as the \"Best Vietnam War Movie.\"[8]","box_office":"$3.1 million[1]","cinematography":"Mark Irwin","production_company":"TriStar Pictures Vision PDG Eagle Films","directed_by":"Peter Markle","bat*21":"theatrical release poster","release_dates":"October 21, 1988 (1988-10-21)|||||","Production":"Bat*21 was filmed entirely on location in Sabah, Malaysia, with the assistance of the Malaysian government. Resources, locations and other assistance were supplied by the Malaysian Army and the Royal Malaysian Air Force, which also supplied aircraft and pilots, including the services of Captain V. Thiagarajah, who flew both on- and off-camera.[5]","produced_by":"Michael Balson Gary A. Neill Jerry Reed","starring":"Gene Hackman|Danny Glover|Jerry Reed|David Marshall Grant|Clayton Rohner|Erich Anderson|Joe Dorsey|","running_time":"105 minutes","music_by":"Christopher Young","edited_by":"Stephen E. Rivkin"}