{"country":"United States","distributed_by":"20th Century Fox","Plot":"Peter LaFleur is the owner of Average Joe's, a small gym with only a few members. When he defaults on the gym's mortgage, it is purchased by his rival, the arrogant White Goodman, a fitness guru and owner of the Globo-Gym across the street. Unless Peter can raise $50,000 in thirty days, White will foreclose on Average Joe's and demolish it to build a parking garage. Attorney Katherine \"Kate\" Veatch is working on the transaction for White. White unsuccessfully attempts to seduce her, and she instead develops a close friendship with Peter.Average Joe's employees Dwight and Owen and members Steve \"the Pirate\", Justin and Gordon try to raise the money needed to save the gym. Gordon suggests that they enter a dodgeball tournament in Las Vegas with a $50,000 prize. They form a team with Peter and watch a 1950s-era training video narrated by dodgeball legend \"Patches\" O'Houlihan. They are soundly defeated by a Girl Scout troop in a local qualifying match, but win by default when the Scouts are disqualified because of one member's steroid and beaver tranquilizer use.White has been spying on Average Joe's using a hidden camera, and forms his own elite dodgeball team to defeat them. Peter is approached by the aging, wheelchair-bound Patches, who volunteers to coach the team. Patches' training regimen includes throwing wrenches at the team (\"If you can dodge a wrench you can dodge a ball!\"), forcing them to dodge oncoming cars and constantly roasting them with insults. Kate demonstrates skill at the game, but declines to join the team as it would be a conflict of interest. Upon finding a loophole in the contract with Kate, White arranges for her to be fired from her law firm so that dating him would not be a conflict of interest. This enrages Kate and motivates her to join the Average Joe's team.At the tournament in Las Vegas, Average Joe's suffers early setbacks but manages to advance to the final round against Globo-Gym. The night before the match, Patches is killed by a falling sign. Peter expresses his anxiety that the team will lose and scolds Steve for his embarrassing pirate persona, causing Steve to leave the team. White offers Peter $100,000 for the deed to Average Joe's, which Peter accepts. The day of the final round, Justin leaves to help his classmate Amber with a cheerleading competition, leaving the team without enough members to compete. Peter has a chance encounter with Lance Armstrong, who talks him into rejoining his team, but he arrives too late: Average Joe's has already been forced to forfeit. Gordon finds a loophole in the rules: a majority of the judges can overturn the forfeiture. Chuck Norris casts the tie-breaking vote allowing the team to play.After an intense game, Peter and White face off in a sudden-death match to determine the winner. Inspired by a vision of Patches, Peter blindfolds himself and is able to dodge White's throw and strike him, winning the championship and the prize money. White declares the victory meaningless, since Peter had sold Average Joe's to him the previous night, but Peter reveals that he used White's $100,000 to bet on Average Joe's to win; with the odds against them at 50 to 1, he has won $5 million. He can now buy a controlling interest in Globo-Gym, which now also includes Average Joe's, and fire White. Steve returns to the group after Peter apologizes to him. He has appeared to have quit being a pirate until Peter inspires him to be his old self. Peter is upset when a girlfriend of Kate's kisses her passionately, but Kate then reveals that she is bisexual and kisses Peter as well. Justin finds romance with Amber, while Owen begins dating Fran from the Globo-Gym team. Peter opens youth dodgeball classes at a newly renovated Average Joe's, while White, as depicted in a vignette during the credits becomes massively obese from junk food.","language":"English","Reception":"Dodgeball received a generally positive response from critics and audiences. On Rotten Tomatoes, the film holds a rating of 70%, based on 161 reviews, with an average rating of 6.3/10. The site's consensus reads, \"Proudly profane and splendidly silly, Dodgeball is a worthy spiritual successor to the goofball comedies of the 1980s.\"[2] On Metacritic the film has a score of 55 out of 100, based on 34 critics, indicating \"mixed or average reviews\".[3]Slant Magazine dismissed the film as \"a less-than-one-joke film\",[4] while TV Guide remarked that Ben Stiller \"doesn't know when to stop\".[5] Other critics, such as The Boston Globe, praised Stiller's satirical take on male virility and praised the chemistry between Vince Vaughn and Christine Taylor.[6] Joe Morgenstern of The Wall Street Journal initially declined to review the movie, believing it was not worthy of his time. However, after reviewing the DVD, he changed his view of the movie, writing, \"Mea culpa, mea culpa. Rawson Marshall Thurber's debut feature, starring Ben Stiller opposite Vince Vaughn, is erratic, imbecilic if not completely idiotic, inconsequential in even the small scheme of things, and thoroughly entertaining\".[7] Roger Ebert gave the film a 3 stars out of 4 rating in his Chicago Sun-Times review and writes \"in a miraculous gift to the audience, 20th Century-Fox does not reveal all of the best gags in its trailer.\"[8]In its first week, the film grossed over $29 million, and would go on to a domestic gross of $114,324,072,[9] and a worldwide total of $167,722,310.[10]","box_office":"$167.7 million","cinematography":"Jerzy Zielinski","production_company":"Fox 2000 Pictures Red Hour Films","directed_by":"Rawson Marshall Thurber","release_dates":"June 18, 2004 (2004-06-18)|||||","produced_by":"Ben Stiller Stuart Cornfeld","starring":"Vince Vaughn Ben Stiller Christine Taylor Rip Torn","running_time":"92 minutes","Sequel":"On April 22, 2013, it was announced that 20th Century Fox has started developing a sequel to the film, with Clay Tarver writing the script and Ben Stiller and Vince Vaughn returning to star.[16]","music_by":"Theodore Shapiro","dodgeball:_a_true_underdog_story":"Theatrical release poster","edited_by":"Alan Baumgarten Peter Teschner","Copyright lawsuit":"In 2005, two New York City screenwriters, David Price and Ashoka Thomas, filed suit in federal court against Fox and Thurber, claiming copyright infringement of an unproduced screenplay they had written, DodgeBall: The Movie, by Thurber and Fox. They alleged there were a number of similarities in the plots of the two screenplays, and that Thurber may have had access to their screenplay, which was finished a month before his and submitted to an agent whose assistant he was acquainted with.[11] Lawyers for the defendants dismissed some of the allegations as coincidental. They said that both screenplays were the work of writers who used common formulaic elements. Judge Shira Scheindlin denied the defense motion for summary judgement and ordered a jury trial.[12][13] The suit was later settled out of court.[14][15]","written_by":"Rawson Marshall Thurber","budget":"$20 million"}