{"country":"United States","distributed_by":"Dimension Films Paramount Pictures (Home Video)","Plot":"The plot involves Hemingford, Nebraska, a town near Gatlin (the original film's setting). The people of Hemingford decide to adopt the surviving children from Gatlin, intending to help them start new lives. Unfortunately for the well-meaning locals, the children go out to the cornfield where one of the cult members, Micah, is possessed by He Who Walks Behind The Rows, the demonic entity the cult worships.Caught in the middle are reporter John Garret and his son Danny, who have a troubled relationship. John is in town working on a story about the children. He runs into two of his former coworkers, Bobby and Mac, who are leaving town and are soon killed by He Who Walks Behind The Rows. John begins a relationship with bed and breakfast owner Angela. Danny spends most of his time with a local orphan girl, Lacey.Micah and the other children murder a local woman, Ruby Burke, by dropping her house on her.[clarification needed] Micah then kills another member of the town by using a type of voodoo doll, which causes him to bleed to death. John begins to ask the town doctor questions about what is going on, but the doctor acts suspiciously and asks John to leave. The doctor is later stabbed to death by the children. Micah and the children then kill Mrs. Burke's sister, but it appears as if she was simply hit by a car.John teams up with Frank Red Bear, a professor at a nearby University, to try and figure out what is going on. They discover that the residents of the town are selling spoiled corn from the previous year's harvest along with the new crop for years. The spoiled corn has a toxin growing on it which they believe is the source of the children's delusions. The town Sheriff captures them, ties them up, and tries to kill them with a corn harvester, but they escape.The Sheriff and the rest of the town leadership attend a meeting to discuss the situation, but the children lock them inside and set the building on fire killing all of them. The children kidnap Angela and Lacey and bring them out into the cornfield. Danny agrees to join the children and Micah orders him to sacrifice Lacey. Danny hesitates, then John and Frank arrive driving the harvester. One of the children shoots Frank with an arrow, and he is apparently killed. Danny and John free Lacey and Angela and attempt to escape, but the cornfield seemingly never ends and they return to where they started. Micah begins to harness the power of He Who Walks Behind The Rows. Then, Frank, who is still alive, starts up the harvester before he finally dies. Micah's robe gets caught in it, and calls for Danny to help. Danny hesitates but doesn't leave. Then, Micah's face transforms into the demon that possessed him. The demon then leaves him, making Micah himself again. Danny runs in to help him but does so too late, as Micah is pulled in by the harvester and shredded to bits. The rest of the children scatter, and Danny, Angela, Lacey, and John leave the clearing.Later, John and Danny reconcile. They, Lacey, and Angela burn Frank's body and give him a funeral before they all drive off together away from Nebraska.","language":"English","box_office":"$6,980,986 (USA)[1]","children_of_the_corn:_the_final_sacrifice":"Theatrical release poster","cinematography":"Levie Isaacks","directed_by":"David Price","release_dates":"October 21, 1992 (1992-10-21) (Germany)|January 29, 1993 (1993-01-29) (U.S.)||||","Production":"Film production began at the end of spring 1992, and shooting began in summer 1992 in Liberty, North Carolina. Most of the cast were locals, including the children. The scene involving an elderly woman flying through a store window after her wheelchair becomes controlled by Micah was filmed in downtown Ramseur, North Carolina. The scene where Micah and the children of the corn burn the town elders was filmed in a home at the corner of Asheboro St. and Luther Ave. in Liberty. The home was burned for the film and a vacant lot remains where the house once stood. The production crew used a local parsonage at the corner of Fayetteville and Raleigh Sts. in Liberty as its headquarters during shooting. Brian Yuzna's son Xeno appears as one of the children of the corn.In the DVD commentary, director David F. Price said during the shoot there was a local Christian group who held a few (low-key) protests during filming, and he received a dead rodent on his door step as a warning. As a result, the production constructed their own church for a few scenes in the film. Despite this, no actual incidents occurred.Also in the DVD commentary, Price said the ending involving Red Bear painting a stone was added at the last minute. Originally, it involved John Garrett making a phone call to his tabloid at a phone booth by the side of the road near the cornfield, only to have it swallowed into the earth by He Who Walks Behind The Rows, killing him. This was scrapped due to budget constraints.According to the original draft of the script, the film was going to be called Children of the Corn 2: Deadly Harvest.","produced_by":"Scott A. Stone David G. Stanley","starring":"Terence Knox Paul Scherrer Ryan Bollman Ned Romero","running_time":"94 minutes","music_by":"Daniel Licht","edited_by":"Barry Zetlin","Release":"The film was originally only released on VHS in North America. The Canadian and European cut of the film features a different soundtrack; the American cut of the film features an additional and extended CGI sequence in which Micah is possessed by He Who Walks Behind The Rows, along with more intense sound effects.In the UK, a PAL DVD was released but is time-compressed. On April 12, 2011, a Region 1 DVD was released by Echo Bridge Home Entertainment.","written_by":"A. L. Katz Gilbert Adler","budget":"$900,000[1]"}