{"country":"United States","distributed_by":"Paramount Pictures","Plot":"Mike Donnelly (Chris Farley), a good-natured but loud and bumbling oddball of his family, is driving an advertisement truck to support his brother Al Donnelly's (Tim Matheson) campaign for Governor of Washington. His competition is incumbent Evelyn Tracy (Christine Ebersole). Mike is chased by dogs while driving the truck and crashes into a local movie theatre. Al's campaign manager, Roger Kovary (Timothy Carhart), advises Al to get rid of Mike, but Al decides to have Mike campaign for him in town with the assistance of campaign aide Steve Dodds (David Spade), who accepts the job in return for a spot on Al's staff following the election. As Steve goes to pick up Mike, he hits crazed Vietnam veteran Sgt. Drake Sabitch (Gary Busey), who ends up stealing his rental car.Later on, Mike tries to stop underage youngsters from drinking, but incriminating pictures make it look like he was drinking with them, leading to his termination from a county recreation center. While packing up, he runs into a pair of thugs who set fire to the recreation center, while the same photographer takes potentially incriminating pictures of Mike right after the thugs leave the scene of the fire. However, the first cop to arrive at the scene is Robbie Mighuem (Grant Heslov), a friend of Mike's who lets him and Steve leave before the police arrive. The two take off in Mike's car and, per Kovary's instructions to Steve, head for a shack in rural Garfield County.The next day, as Steve and Mike hang fliers, Steve tries to make a call via cell phone; while looking for a place with reception, Steve stumbles upon the home of the aforementioned Drake Sabitch - an old school bus with a TV, a hammock, a grill, and several weapons. While trying to find a high-ground to get reception on his phone, Steve accidentally loosens a rock in a pile of stones. Later on, as the guys play checkers, a huge boulder rolls down the mountain, almost completely knocking their cabin off its foundation; that night, a stormy wind blows the cabin's roof away and hail falls inside. The next day, Mike tries to talk to Al, but Kovary refuses, so Mike decides to head into Seattle that night to talk to Al, who is going on MTV's Rock the Vote campaign. However, after hanging out with some Rastafarians, Mike makes a fool of himself onstage (culminating to his yelling \"KILL WHITEY!\" to a suddenly silent audience) as a shocked Al and Kovary helplessly watch. Because of his stunt, Al decides to have Mike to not bother helping him with the campaign, leaving Mike down. The next day, Steve and Mike sneak into Drake's home (after dodging some hidden land mines) to watch Al's debate on his TV. When Steve goes outside to use the restroom, he is attacked by Drake, but is saved by Mike, who beats the ex-soldier in unarmed combat. Drake is impressed by Mike's fighting skill and befriends both men.Governor Tracy, in hopes of sabotaging Al following their debate, purchases the pictures of Mike at the rec center fire and posts them on the TV news, therefore allowing Tracy to win the election. Mike notices that the voting results are wrong, since the total vote count is 1,882 for Garfield County, when in fact there are only 1,502 registered voters there; furthermore, Mike recognizes the two men who set the recreation center on fire standing next to Tracy. Mike and Steve go to the Garfield County Courthouse, where they obtain the names of the voters in the election. Steve discovers that over half the people who voted for Tracy have been dead for over ten years (including Drake's father and grandfather), proving Tracy had rigged the elections. To get this to the people and Al, Steve and Mike borrow Robbie's squad car to Governor Tracy's victory party the following day.At the party, the duo appears during Tracy's victory speech and the police try to arrest Mike for arson. At the podium, Mike takes a gun from one of the cops and pretends to hold Steve hostage, while Drake shows up in time to prevent a sniper from shooting Mike and controls the crowd by threatening them with an RPG. Mike reveals Tracy's election fraud, overturning the election results and making Al the election winner, while Tracy is ousted for fraud (especially after her long-suffering assistant, Neuschwander (Bruce McGill), drunkenly admits that she made him and her other associates go along with the fraud).Three months later, Steve is Al's new assistant, Mike has his job running the recreation center back, and Al has decreased crime rates in Washington. As Al and Steve get into a jet to go to a meeting, Mike's jacket gets caught in the jet's door, causing him to be trapped outside the plane, while it takes off.","language":"English","Reception":"Black Sheep is the last film that David Spade and Chris Farley co-starred in, and it is often unfavorably compared to Tommy Boy. Nonetheless, Black Sheep has gone onto garner a cult following. It has a 28% rating on Rotten Tomatoes.[7]","box_office":"$32.4 million[1]","cinematography":"Daryn Okada","directed_by":"Penelope Spheeris","release_dates":"February 2, 1996 (1996-02-02)|||||","Production":"Saturday Night Live creator Lorne Michaels produced the film, which was directed by Wayne's World director Penelope Spheeris. Michaels later said that the film was \"an act of desperation by Paramount\", in that the movie studio had under-promoted Spade and Farley's 1995 film, Tommy Boy and was now looking to cash in on the same comedy formula.[3] At the time, Michaels had just finished contentious battles with the studio over the script of Wayne's World 2, and the animosity between the two camps spilled over into Farley's contract with Paramount.[3] Although his agent lined up possible roles for the actor in The Cable Guy (for which he was offered $3 million)[4] and Kingpin, the movie studio remained firm on wanting another buddy comedy with Farley and Spade.[3]The film was written by Fred Wolf, who claimed the studio told him to \"deliver a finished script by midnight on Sunday, the last day Chris was contractually allowed to get out of the movie. If I didn't have a finished script -- any finished script -- they were going to sue me.\"[4] Wolf wrote 45 pages within only a few days, and dropped the script off at Paramount 15 minutes before his deadline.[4] After reading the script, Farley said that he \"wasn't crazy\" about it, and only agreed to do the film after coaxing from David Spade.[4]Spheeris had notable disagreements with writer Fred Wolf and David Spade throughout the entire production of the film. Spheeris fired Wolf from the film three times (he was hired back twice by Farley and once by Lorne Michaels), then refused to speak to him and finally banned him from the set.[5] Her relationship with Spade was equally as tumultuous. Speaking to Farley's official biographer, she said, \"I don't think I've ever even smiled at anything David Spade's ever done... I still have a recording of a message David left on my answering machine. He said, 'You've spent this whole movie trying to cut my comedy balls off.'\"[5] Surprisingly, the two worked together again in the 1998 comedy Senseless.The combination of bright lights on-set and working under sunlight while filming Black Sheep caused permanent damage to David Spade's eyes. Spade says of his condition: \"I have to wear a hat even indoors and flashes in particular freak me out. I even have to make them turn down the lights in the make-up trailers. I've become such a pain in the butt with this light-sensitive thing, it's a wonder they don't Just Shoot Me!\"[6]","produced_by":"Lorne Michaels","starring":"Chris Farley David Spade Gary Busey Tim Matheson","running_time":"87 minutes","black_sheep":"Theatrical release poster","music_by":"William Ross","edited_by":"Ross Albert","written_by":"Fred Wolf"}