{"country":"United States","distributed_by":"Circle Films (1985) USA Films (2000)","Pre-Production":"The Coen brothers had the idea for what became Blood Simple in their heads but they knew no one would buy it because they wanted to make it themselves. They estimated that they needed around $1.5 million to make the film. So the Coens decided to follow Sam Raimi's steps, who made a prototype version of The Evil Dead to make money for his movie. So they adapted the concept and decided to make a two-minute trailer for the film. Joel Coen then contacted a friend of his from NYU, Barry Sonnenfeld, to help them. They didn't have any equipment and only enough money to rent out a camera and lights for a day. So they waited until the Thursday before President's Weekend Holiday, which was four days to rent it out. That meant they had exactly five days to shoot.The brothers themselves acted in the trailer, shooting a few scenes that were relevant to the movie and hopefully would excite their viewers. The trailer became their selling tool. Once they were done with the movie they took it to Minnesota for potential investors to view in the hope it would make money. They wanted to get in touch with as many philanthropists as possible so they contacted people from a list of a hundred supplied by Hadassah, the Zionist women’s charity.The Coens then took their movie and a projector and went around people's homes and jobs to show it. Daniel Bacaner, was one of the first people to invest money in the project. He not only put money into the project but became its executive producer and introduced the Coens to other potential backers. The entire process of raising the necessary $1.5 million took a year.[5]","Plot":"The movie opens with a short voice-over monologue (voiced by M. Emmett Walsh) as various bleak images of the hot, dry, windy Texas landscape are shown. Three of the themes of the film are articulated in this monologue: \"Nothing comes with a guarantee,\" \"Something can always go wrong,\" and, in Texas, \"You're on your own.\" The film then shifts to a conversation between Abby (Frances McDormand) and Ray (John Getz) in a car as it drives through a heavy downpour at night. They seem to be discussing Abby's bad marriage and Ray indicates that he's driving her to Houston. But instead of driving Abby to Houston, Ray drives to a motel and they have sex. We later find out that Julian Marty (Dan Hedaya), who owns a bar in the rural countryside of Texas, has suspected Abby's affair with Ray, one of his bartenders, for a while so he hires private detective Loren Visser (M. Emmet Walsh) to take photos of them. She protects herself with a revolver and three bullets.Visser photographs them in the act and phones them while they are in the motel room, but remains silent.When Visser reports back to Marty, he teases him about being cuckolded. The morning after their tryst, Marty makes a silent phone call to Ray and Abby.The following day Ray goes to the bar to collect his earnings, two weeks worth of work, but instead confronts Marty and quits his job. Marty threatens Ray's life and advises him not to trust Abby, that she will one day tell him she \"hasn't done anything funny\" and he won't believe her.Marty then hires Visser to kill the couple. Visser suggests he take a fishing trip to Corpus Christi to establish an alibi. He then breaks into Ray's home, steals Abby's gun, and photographs the sleeping couple through the bedroom window.Visser presents an edited photo of their fake corpses to Marty, who dumps four dead fish on his desk. Marty goes to the bathroom to vomit, then opens the safe to give Visser his $10,000 fee. Visser then shoots Marty with Abby's gun in a double cross, leaving her gun at the scene as evidence that she killed Marty. But he accidentally leaves his cigarette lighter and does not realize that Marty has stolen one of the incriminating photographs and locked it in the safe.Ray returns to the bar to get his last paycheck and accidentally kicks Abby's gun, firing it. He finds a motionless Marty and decides to cover up the murder. He cleans up the blood and disposes of evidence in a backyard incinerator, loading Marty's body into his back seat with Abby's gun in the body's coat pocket. While Ray is driving down a lonely country road at night to dispose of the body he sees that Marty is still alive and stops the car and runs into a field. When he catches his breath and returns to the car, Marty is out of the car slowly crawling down the road. Ray struggles to get him back into the car as a truck approaches. The scene jumps to Ray digging a grave in a freshly plowed field. As he throws dirt onto Marty's body, Marty pulls the gun out and tries twice to shoot Ray, but the gun just clicks at the empty chambers. Ray takes the gun and buries Marty alive. Ray calls Abby from a phone booth and tells her he loves her, and she thanks him. Ray suspects Abby tried to kill Marty by finding her gun at the scene.Visser burns the doctored photos, but realizes one is missing. He assumes Marty must have locked it in the bar's safe when he was taking out his payment. It is then that he also realizes that he left his cigarette lighter in Marty's office.A distraught Ray tells Abby, \"I cleaned up your mess.\" Abby insists she \"hasn't done anything funny.\" While arguing they are interrupted by a telephone call from Visser, who says nothing. Abby tells Ray that it was Marty again. A confused Ray storms out. At this point they both think the other has done something to harm Marty.Meanwhile, the other bartender, Meurice, listens to several old phone messages from Marty, accusing him or Ray of stealing money from the safe. Meurice arrives at Ray's house and accuses him of stealing the money. Ray is silent, hiding the blood in the back seat of his car.Visser goes to the bar to get the photo and the lighter. As he takes a hammer to the safe he is interrupted by Abby, who wants to find out why Ray has been acting so strangely. Visser hides while Abby finds the bar ransacked and bloodstained.Abby has a dream about Marty. She first thinks it's Ray in the dream until she realizes it's Marty warning her, before he vomits blood, \"he'll kill you too.\" After Abby wakes up from her dream she finds Ray at his apartment, packing to leave. She tells him she thinks he killed Marty because he refused to pay him, and then broke into the safe and fought with him. Ray explains that he found her gun at the bar and that he buried Marty alive. She leaves with the misunderstanding still not resolved. Meurice later tries to assure her that Marty is still alive.Ray returns once more to the bar and finds Visser's faked photo, and leaves for Abby's apartment realizing she might be in danger. While there he notices headlights in his rear view mirror. When Abby arrives home she turns on a light and finds Ray looking out the large window. He tells her to turn off the light because he thinks someone is watching. She thinks Ray is threatening her and turns the light back on. Visser is on a nearby rooftop with a rifle, and shoots Ray dead through the window. Barely escaping a second shot, then hearing approaching footsteps, Abby knocks out the light bulb with her shoe. She hides in the bathroom as Visser arrives. He then enters the bathroom to kill her, muttering, \"I don't know what you two thought you were going to pull off,\" but he finds the bathroom empty and the window open. Reaching out the window, he opens it to the next room, but Abby slams the sash down on his wrist and drives a knife through his gloved hand into the sill. Visser shoots holes through the wall, then punches through and removes the knife while Abby retreats and waits outside the bathroom, holding the gun Ray returned to her.As Visser is about to emerge, she fires through the door, hitting him. \"I'm not afraid of you Marty,\" Abby says. Visser, lying on the bathroom floor, mortally wounded, bursts into cackling laughter, saying, \"Well, ma'am, if I see him, I'll sure give him the message.\" The scene then focuses on a water droplet forming directly over his head from the pipes under the bathroom sink. The Four Tops' \"It's the Same Old Song\" (1965) starts to play and as the droplet falls the screen cuts to black.[4]","blood_simple":"Theatrical release poster","language":"English","Reception":"While the film was only a modest box office success, it was a huge critical success. The film currently holds a 94% \"fresh\" rating on Rotten Tomatoes, where its critical consensus reads: \"Brutally violent and shockingly funny in equal measure, Blood Simple offers early evidence of the Coen Brothers' twisted sensibilities and filmmaking ingenuity.\"[7] The movie made about 3 million. Its first big public viewing was the USA Film Festival in Dallas, followed by Sundance Film Festival, where it received the Grand Jury Prize. The brothers took the film to the Toronto Film Festival, Cannes, and the New York Film Festival. They were very proud of their movie, after all they raised the money to make the film based on a fake trailer.[4]","box_office":"$3,851,855[2]","cinematography":"Barry Sonnenfeld","Filming and post-production":"The film was shot in several locations in the towns of Austin and Hutto, Texas over a period of eight weeks in the fall of 1982. The film spent a year in post-production and was completed by 1983.[6]","directed_by":"Joel Coen Ethan Coen (uncredited)","Soundtrack":"Carter Burwell wrote the Blood Simple score, the first of his collaborations with the Coen Brothers; he went on to write scores for the majority of their films.[citation needed] Blood Simple was also the first feature film score for Burwell, and he became a much-in-demand composer in Hollywood.[citation needed]The score is a mix of solo piano and electronic ambient sounds. One track, \"Monkey Chant\", is based on kecak, the \"Ramayana Monkey Chant\" of Bali.[citation needed]In 1987, seven selections from Burwell's Blood Simple score were released on, and comprise the final tracks on, a 17-track album that also features selections from the soundtrack of Coens' next film, Raising Arizona (1987).[citation needed]Blood Simple selections on the 1987 album:","production_companies":"River Road Productions Foxton Entertainment","release_dates":"September 7, 1984 (1984-09-07) (Toronto International Film Festival) October 12, 1984 (1984-10-12) (New York Film Festival) January 18, 1985 (USA)","produced_by":"Ethan Coen Joel Coen (uncredited)","starring":"John Getz Frances McDormand Dan Hedaya Samm-Art Williams M. Emmet Walsh","running_time":"99 minutes[1]","Chinese Remake":"In December 2009, Zhang Yimou released a loose remake of the film as a comedy. The film, titled A Simple Noodle Story (known internationally as A Woman, a Gun and a Noodle Shop), is set in a Chinese noodle shop in a desert and revolves around the restaurant owner's plan to murder his adulterous wife and her lover.[11]","\"Director's Cut\" and home media":"The film was released on VHS tape in 1995 with a 99-minute running time,[citation needed] and, after the film had been re-released theatrically in 1998 (premiering at the Austin Film Festival on October 3[citation needed]) as a \"Director's Cut\" with a 96-minute running time, this version was released on DVD in 2001.[citation needed] This shorter version was released again on DVD in 2008 by MGM.[citation needed]Unusual for such an exercise, the \"Director's Cut\" is some three minutes shorter than the original 1985 theatrical release. The Coens reduced the running time with tighter editing, shortening some shots, and removing others altogether. Additionally, they resolved long-standing rights issues with the music: the original theatrical version of the film made prominent use of The Four Tops' \"It's the Same Old Song\" (1965); the Coens had replaced it with Neil Diamond's \"I'm a Believer\" (1966) for the 1995 U.S. home video edition on VHS. The \"Director's Cut\" reinstated the Four Tops track.[8]The 2001 DVD release features several spoofs of DVD \"special features\". One is an introduction to the film by fictional film historian \"Mortimer Young\", who claims the \"Director's Cut\" removes some of \"the boring bits\" and adds other parts; this was also included in the theatrical release of the \"Director's Cut\".[citation needed]The 2001 DVD release also includes an audio commentary by \"Kenneth Loring\", the fictional artistic director of the equally fictional \"Forever Young Films\". Loring offers several entirely spurious \"facts\": for example, he claims the scene with Ray and Abby driving in the rain, talking about Marty, was acted out in reverse as well as upside down, to synch the headlights of the passing car just as certain lines were said. (He claims filming the scene backwards and upside down was the logical choice to get the timing right, and the actors are wearing hair spray to keep their hair pointing \"down\".) Elsewhere in the commentary, he claims that, in scenes with both dialogue and music, the actors simply mouth the words and record them in post-production, so they won't interfere with the music; that Marty's dog is animatronic; that the sweat on various actors is \"movie sweat\", gathered from the flanks of Palomino horses; that Fred Astaire and Rosemary Clooney were at one time intended for the film; and that a fly buzzing about is not real, but the product of computer generated imagery. \"Loring\" is voiced by actor Jim Piddock, using a script written by the Coen brothers.[citation needed]The 2008 MGM release is a barebones DVD edition of the 96-minute \"Director's Cut\", billed as Blood Simple: Director's Cut with no commentary or extras.[citation needed]In June 2016 the Criterion Collection announced they would be releasing Blu-ray and DVD special editions of the film in September with a new 4K digital transfer supervised and approved by Barry Sonnenfeld and the Coen brothers, along with various new special features.[9]","music_by":"Carter Burwell","edited_by":"Joel Coen Ethan Coen (as Roderick Jaynes) Don Wiegmann","written_by":"Joel Coen Ethan Coen","budget":"$1.5 million"}