{"directed_by":"Gaëtan Brizzi Paul Brizzi","country":"France","VHS and DVD release":"In 1990, the film was released on VHS by Celebrity Home Entertainment. In 2006, the film was released on Region 2 DVD as a part of a box set of animated Asterix films.","Book adaptation":"A book of the film was released containing the story and stills from the film. It was later re-printed when Orion Publishing re-released the entire series.","release_dates":"1985 (1985)|||||","Plot":"In Rome, to honour the success of his campaigns of conquest, several provinces of the Roman Empire arrive in the city to offer gifts to Julius Caesar. Seeking to cement the celebrations with a grand show at the Colosseum, Caesar instructs the head of a prominent Gladiator School, Caius Fatuous, to ensure that the Circus Maximus is a success, promising to make him the wealthiest man in Rome, or the main attraction of the show if he fails. While discussing about the many gifts he has received from his Empire, Caius knows that one province hasn't, since it has yet to be conquered - a small village in Gaul.In the village at the same time, Asterix begins to notice his friend Obelix acting strangely, following the return of the chief's niece, Panacea. When Druid Getafix sees him become tongue-tied when talking with her, he reveals that Obelix has fallen in love with her. When Asterix sees that he is still infatuated with her the next day, he quickly suggests that his friend heads out for flowers to impress her. However, upon returning with a bouquet for Panacea, his heart is quickly broken when he sees her reunite with the recently returned Tragicomix, a handsome, young man whom Chief Vitalstatistix reveals will be soon marrying Panacea. Seeking to spend more time together following their reunion, the two lovers venture out into the nearby woods, but are swiftly ambushed and captured by a group of Romans, led by a fresh recruit hoping to make a good impression of himself with his Centurion, the head of a nearby garrison. However, his actions infuriate the Centurion, who berates him for his rashness before ordering the recruit to take Tragicomix and Panacea to the farthest outpost of the Empire (situated in the Sahara) before the Gauls realise what had happened. When they do, they quickly trash the camp, only to find out what the Centurion did with them, thus sending Asterix, Obelix and Dogmatix (Idéfix) to go after the pair and rescue them.Seeking to find out where they went, the group head for the nearest Legion HQ for information, where upon learning of the outpost they were taken to, the group decide to join the Roman Army in order to catch up with them. Although they manage to succeed in being posted at the same outpost, their undisciplined behaviour and their strength from the magic potion to speed up their march towards Massalia, cause them to drive their commanding officer, Dubius Status, back to Rome in tears. Unbeknown to the pair as they sail for the Saharan outpost, Tragicomix and Panacea, both of whom had been forced to do humiliating work for the outpost's men, manage to escape after a recently arrived officer tries to make a move on Panacea. However, both end up being stranded in the desert before being captured by a group slave traders that comes across them. Sold on as slaves, the pair eventually are brought to Rome where they acquired by Caius at a slave market (in a humorous scene), who decides to use Tragicomix as part of Caesar's grand show. However, when the pair are presented to Caesar, Tragicomix refuses to bow before him during the show, while Panacea speaks out against being separated from him, Caesar commands that both are thrown to the lions instead for their defiance, as part of the grand finale of the Circus Maximus.Having learnt of their escape, deserted the army, and tracked them down to Rome, Asterix and Obelix quickly seek out Caius at a local bathhouse, who witness Obelix's strength when he takes down Caius' bodyguards. Desperate to have them in the show as new gladiators, he order for the pair to be brought to him. While his men easily capture Asterix, after he discovered he lost his magic potion when he separated from Obelix following a minor argument, they fail to acquire Obelix due to his invulnerable strength, who soon begins searching for his friend, losing Dogmatix in the process when he spots the misplaced magic potion and tries to get it back. That night, a storm hits the city, in which lightning causes a gutter to break and let rainwater begin flooding a cell that Asterix had been thrown in to. Just before he drowns from the rising water, Obelix saves him in the nick of time. Without the magic potion and with Dogmatix missing, the pair continue their search for Panacea and Tragicomix, quickly learning that they are in the Colosseum and of the fate that awaits them.Hoping to gain entry, the pair visit Caius' school, and manage to secure places as gladiators for the Circus Maximus, whereupon the pair soon begin to make a mess of the show, winning a chariot race, and beating down a number of gladiators. Soon the lions are unleashed, with Tragicomix and Panacea sent out into the centre of the arena without any weapons to defend themselves with. Fortunately, Dogmatix arrives with the magic potion, having recovered it from the city's sewers , and gives it to Asterix, who soon tosses it over to Tragicomix to help him deal with the lions. While attempting to capture the lions that are knocked into the air, Obelix becomes distracted by Panacea and runs into a pillar, shattering a third of Colosseum and making its audience scatter. Caesar, somewhat impressed with the show, decides to grant the Gauls their freedom.Returning to the village, the group receive a trademark victory feast in their honour, where Asterix is thanked by Panacea for his bravery with a kiss, who is slightly surprised by her actions. As the movie ends and the villagers celebrate, Asterix sits up in a tree on his own, having somewhat fallen for her.","produced_by":"Yannik Piel","running_time":"79 minutes","language":"French / English","music_by":"Vladimir Cosma","written_by":"Pierre Tchernia adapted from René Goscinny Albert Uderzo"}