{"based_on":"Characters  by Adam Herz","country":"United States Germany","distributed_by":"Universal Pictures","american_wedding":"Theatrical release poster","Plot":"While on a date in a fancy restaurant with Michelle, Jim is ready to propose to her. His father calls to inform him that he has the ring. Michelle misinterprets when Jim stalls the question. Jim's dad arrives as Jim is receiving fellatio, and a mishap grasps the restaurant's attention. Jim proposes and Michelle accepts.Jim wants to exclude Stifler from the wedding, having concerns that Stifler's behavior isn't socially acceptable. When Jim is worried about learning the dance, Stifler agrees to teach Jim to dance, and over time to tone down his obnoxious personality, in exchange that he be allowed to attend the wedding and host a bachelor party. The boys go on a road trip when they discover there is only one designer who makes the dress that Michelle wants. They go to Chicago looking for \"Leslie Sommers\"; Stifler unwittingly walks into a gay bar, and his raucous behavior gets him into a dispute with several patrons. Stifler challenges Bear to a dance-off, wins, and Bear offers to provide strippers for the bachelor party. Leslie reveals \"him\"self and agrees to make the dress for Michelle. Michelle's parents, who were initially skeptical of Jim, agree to have a preliminary dinner with him.Michelle's younger sister, Cadence, flies in for the wedding. Both Finch and Stifler are attracted to her, and in an effort to win her over, they each adopt the other's personality and mannerisms. Stifler arranges the bachelor party, including strippers, for everyone at Jim's house except Jim, who unknowingly has arranged dinner with Michelle's parents there. The party is abruptly halted by the unexpected return of the three. With assistance from Bear, who poses as a butler named \"Mr. Belvedere\", Jim nearly succeeds in keeping the activities a secret, until Michelle's mother opens a closet door and is shocked to find Kevin inside, stripped to his boxers and tied to a chair. The boys explain that it was an attempt to make Jim seem like a hero that went wrong, and Michelle's parents accept this and tell him that if he puts that much effort into the upcoming marriage, she can give her blessing.Michelle has doubts regarding that Jim's paternal grandmother dislikes Michelle for not being Jewish, and about Stifler's invite to the wedding. On the night before the wedding, Stifler inadvertently disrupts the walk-in refrigerator's power supply while retrieving a bottle of champagne in an attempt to lay down Cadence. Previously, Stifler, unaware of Cadence's presence, had revealed his true rude and obnoxious personality. When Stifler later returns, the flowers are dead. Angered and stunned, Jim asks him to leave, and all the others, including Cadence, support Jim's decision.Feeling guilty for his thoughtless behavior, Stifler convinces the florist to put together a new batch of flowers, and he enlists the help of his football players and Bear. As a gesture of remorse, he also gives a rose to Cadence, much to the amazement of Jim and Michelle. Moved by his actions, Cadence agrees to have sex with him before the ceremony, but Stifler's presence is delayed by a brief thank-you meeting Jim calls among his groomsmen, citing how he is grateful to have friends like them to back him up.Quickly returning to the hotel, Stifler hears someone in the supply closet and steps inside, unaware that Cadence was interrupted by wedding preparations and that the ushers placed Jim's grandmother in that closet to sustain her hostility about the wedding; Stifler only realizes this upon walk-in by Finch and the ushers. She becomes pleasant, particularly towards Stifler, making Michelle and Jim's dad unknowingly happy.Despite the chaotic events leading up to it, Michelle and Jim get married. At the reception, the couple dances while Stifler dances with Cadence. Finch is sitting by himself when Stifler's mom arrives. Although agreeing they are over each other, Stifler's mom mentions having a double suite and invites Finch to join her. The film ends with John and Justin spying on Stifler's mom and Finch in her suite's couple-size bathtub, having oral sex.","language":"English","Reception":"American Wedding received mixed reviews from critics. Rotten Tomatoes, a review aggregator, gave the film a rating of 55%, based on 154 reviews, with an average rating of 5.8/10. The site's critical consensus reads, \"Raunchier and even more gross than the first two American Pies, American Wedding ought to please fans of the series.\"[8] On Metacritic, the film has a score of 43 out of 100, based on 34 critics, which indicates \"mixed or average reviews\".[9]Robert Koeler of Variety compared it to the works of John Waters and called it a \"strong finish\" for the franchise.[10] Roger Ebert rated it 3/4 stars and wrote that the film \"is proof of the hypothesis that no genre is beyond redemption.\"[11] Elvis Mitchell of The New York Times wrote that the film \"struggles so hard to be tasteless that it's almost quaint.\"[12] Mick LaSalle of the San Francisco Chronicle rated it 2/5 stars and called it strained and desperate to find jokes.[13]","box_office":"$231,449,203[4]","cinematography":"Lloyd Ahern","production_company":"LivePlanet Zide/Perry Productions","directed_by":"Jesse Dylan","Soundtrack":"The film's soundtrack includes songs by Van Morrison, Blue October, The Working Title, Foo Fighters, Feeder, Avril Lavigne, American Hi-Fi, Sum 41, the All-American Rejects, Joseph Arthur, New Found Glory, and Hot Action Cop. Badly Drawn Boy and The Libertines also have songs in the feature. Note that most songs used were already singles. And, this is the first film to feature the song \"Laid\" (Matt Nathanson covering the band James) in both the trailers and the opening sequence. Notably, it is also the only film in the series to not play the song \"Mrs. Robinson\" in a scene where Finch has sex with Stifler's mother. It is also the first of the American Pie films not to feature a blink-182 song.The song \"Into the Mystic\", played at the end of the film when Jim and Michelle take to the dance floor at the reception, begins as Van Morrison's recording, but midway through it changes to The Wallflowers' cover version due to licensing reasons.The film's soundtrack peaked at number 23 on the Billboard 200 chart.[5]Songs that appear during Stifler's dance in the gay bar:Songs that appear during the bachelor party:","release_dates":"August 1, 2003 (2003-08-01)[1]|||||","produced_by":"Chris Moore Warren Zide Craig Perry Adam Herz Chris Bender Paul Weitz Chris Weitz","starring":"Jason Biggs Alyson Hannigan January Jones Thomas Ian Nicholas Seann William Scott Eddie Kaye Thomas Fred Willard Eugene Levy","running_time":"96 minutes[2]","music_by":"Christophe Beck","edited_by":"Stuart Pappé","Release":"American Wedding was released in the United States on August 1, 2003 and opened at #1 with $33,369,440 before dropping 53.7% the next weekend, landing at #3 behind the new releases of S.W.A.T. and Freaky Friday.[6] Closing about 3.5 months later (November 20, 2003), the film had grossed a domestic total of $104,565,114 and $126,884,089 overseas for a worldwide total of $231,449,203, based on a $55 million budget.[4] Despite being a huge box office success, it is the lowest-grossing film in the series, making roughly $2 million less than American Reunion would in 2012.American Wedding grossed $15.85 million on DVD and was the number seven DVD rental in 2004.[7]","written_by":"Adam Herz","budget":"$55 million[3]"}