{"country":"United States","distributed_by":"New Line Cinema1","Plot":"In Cleveland, Ohio, 1978, a middle-aged woman (Lin Shaye) is relaxing at home and puts on a vinyl record to listen to. While sipping a red wine and reading while humming The Carpenters' \"We've Only Just Begun\", she becomes agitated as rock music plays. When she discovers the record being Kiss' Love Gun album and a secret cache of Kiss albums, she is revealed to be ultra-conservative when she says \"Kiss, the devil's music\". She then leaves the house.Meanwhile, four rebellious teenage boys in a Kiss cover band named \"Mystery\" practice the Kiss song \"Rock and Roll All Nite\" in one of their members' homes. The band, consisting of guitarist-vocalist Hawk (Edward Furlong), bassist-vocalist Lex (Giuseppe Andrews), lead guitarist-vocalist Trip (James DeBello), and drummer-vocalist Jeremiah \"Jam\" Bruce (Sam Huntington), become elated to have tickets to see their idols in concert in Detroit the following night. Later, the same woman from the beginning races up to the house where the boys are hanging out and drags Jam home. She is revealed to be his mother, Mrs. Bruce. Later discovering the tickets, she burns them and has Jam transferred to a Catholic boarding school.The three remaining boys hear a radio contest for tickets to the show and Trip ends up winning them. The boys then plan to rescue Jam from the boarding school. Under the guise of pizza delivery for Father Phillip McNulty (Joe Flaherty), the Catholic priest who serves as the chaplain and rector, they place some hallucinogen mushrooms on the pizza he ordered. When he interviews Jam, the three boys deliver it and succeed in drugging him. With him drugged, he tells Jam that he can leave and the boys sneak out. With them reunited, they set off for Detroit in Lex's mother's car.On the freeway, Trip throws a slice of pizza out of the window, where it hits the windshield of a Trans Am, driven by two rude disco fanatics, Kenny and Bobby, along with their girlfriends, Christine (Natasha Lyonne) and Barbara (Emmanuelle Chriqui). The enraged Kenny pulls over, pulls Hawk out of the car, and rubs his face on the cheese-covered windshield. Upset by Kenny's behavior, Christine leaves. Using improvised weapons like a belt with a Kiss buckle, a wallet chain, and drumsticks, the boys engage in a fight with Kenny and Bobby. They win and, after leaving Kenny and Bobby tied to the guardrail with Kiss makeup on, they drive the Trans Am into a ditch. Continuing on their way, they come upon Christine and offer her a ride to the city.Upon arrival, the boys discover that Trip did not stay on the phone long enough to give the radio station his information, forcing them to give the tickets to the next caller. Back outside, Lex notices that the car has been stolen. They suspect Christine, who they left in it. Hawk then suggests that they go their separate ways in order to find Kiss tickets, and agree to meet in the same place in an hour and a half. Hawk finds a scalper who suggests that he enter a strip contest to raise money for tickets. He doesn't win, but is offered payment for his company by an older woman (Shannon Tweed). They go to her car and she takes his virginity. Using the money she gave him, he locates the scalper. However, he is sold out.Trip goes to a local convenience store in the hopes of mugging a younger child. He grabs a kid in Ace Frehley's Spaceman makeup, not knowing that he has a bullying older brother, Chongo. Suddenly, Chongo and his friends threaten to beat Trip if he doesn't give them $200. He then plans to rob the store with a fake gun, but ends up thwarting a real robbery attempt there. He earns a $150 reward. He encounters Chongo and his friends in an alleyway behind the store, gives them the money, and they steal his wallet to avoid being assaulted.Lex sneaks backstage with the Kiss loading crew, but is soon discovered. He is subsequently tossed over a fence where a group of vicious dogs menace him, but he wins them over with a frisbee. In a nearby building, he discovers a chained-up Christine and the car in a chop shop with two car thieves. He then uses his newly befriended dogs to chase the two thugs, saving Christine and the car. He and Christine share a passionate kiss.Jam encounters an anti-Kiss rally consisting of conservatives named \"Mothers Against the Music of Kiss\" being booed by passing crowds. When he discovers his mother leading it alongside another conservative (Kiss frontman Paul Stanley's then-wife Pamela Bowen), she spots him. She forcibly grabs and takes him to a nearby church across the street for confession, taking away his drumsticks. There, he is seen by Beth (Melanie Lynskey), a classmate who is in the process of moving to Ann Arbor, Michigan. They rush into a confessional booth where she reveals that she's been in love with him since freshman year. He admits that his feelings for her are mutual and they make love. They leave the church and eventually say goodbye.Jam, imbued with new confidence, goes back to the rally and angrily berates his mother for her domineering ways and her hypocrisy, and he demands his drumsticks back. His mother does and apologizes to him, telling the rally conservatives about kids growing to be young men and women. When the boys meet up again, they beat each other up to make it appear that they had been mugged. Upon arrival at the concert venue, the guards are skeptical. But Trip points out Chongo and his friends, who are just entering the concert hall, as the culprits. When the guards find Trip's wallet (with his Kiss Army picture ID and money), they take away Chongo and his friends and return Trip his belongings.Astonished and elated, the boys enter the concert hall as Kiss plays the title song of the film. As it ends, drummer Peter Criss throws a drumstick and Jam catches it with joy and excitement.[4]","language":"English","detroit_rock_city":"Theatrical release poster","box_office":"$4.2 million[2]","cinematography":"John R. Leonetti","directed_by":"Adam Rifkin","Soundtrack":"Note that the soundtrack does not feature all of the songs in the film. For instance, there are tracks from UFO in the film that did not make the soundtrack.","production_companies":"Base-12 Productions Takoma Entertainment Group","release_dates":"August 13, 1999 (1999-08-13)|||||","produced_by":"Barry Levine Gene Simmons","starring":"Edward Furlong|Sam Huntington|Giuseppe Andrews|James DeBello|Lin Shaye|Melanie Lynskey|Natasha Lyonne|Emmanuelle Chriqui|with Shannon Tweed|and featuring Kiss as themselves|","running_time":"94 minutes[1]","music_by":"J. Peter Robinson","edited_by":"Mark Goldblatt|Peter Schink|","Release":"The film opened in 1,802 theaters on August 13, 1999 and earned $2,005,512 in its opening weekend, ranking number 13 in the domestic box office.[5] By the end of its run, it had grossed only $4,217,115. Against an estimated $34 million budget, it was a box office bomb.[2]The film received mixed to negative reviews from critics. Review aggregator website Rotten Tomatoes shows that out of 39 reviews, it has a 46% rating.[6] On Metacritic, it has a 33/100 rating based on 18 critics, indicating \"generally unfavorable reviews\".[7]The film was released via VHS and DVD on December 21, 1999. DVD special features include four audio commentaries (director Rifkin, selected cast and crew members, and all four original Kiss members), deleted scenes, multi-angle views of the Kiss concert, an instructional segment featuring a step-by-step guitar lesson for \"Rock and Roll All Nite\", original screen test footage, and DVD-ROM features.In December 2007, the film was re-released on DVD as an exclusive bonus fifth disc contained within Kissology Volume Three: 1992–2000. It was only available with initial pre-orders sold during VH1 Classic's 24 Hours of Kissmas weekend marathon.The film was released on Blu-ray in April 2015, containing additional special features not in the original DVD release.","written_by":"Carl V. Dupré","budget":"$34 million[2]"}