{"country":"United States","distributed_by":"Warner Bros. Pictures","screenplay_by":"Tina Gordon Chism","story_by":"Antwone Fisher","Plot":"Rashad (T.I.) is a teen living in Atlanta, Georgia with his Uncle, George (Mykelti Williamson) and his little brother Ant (Evan Ross). He and his brother were raised by their uncle George since their parents died in a car accident, and they work with him as part of his custodial company. When not working or finishing his last year of high school, Rashad spends most of his time with his friends Brooklyn (Albert Daniels), Teddy (Jason Weaver), and Esquire (Jackie Long). Rashad is a talented artist but does not see much of a future in that field as he has become accustomed to working the family business. Esquire, Rashad's best friend, goes to a prep school on the opposite side of town from where they live, and is trying to attend an Ivy League college after senior year. However, he finds out that he will need a letter of recommendation from someone of high stature to better his chances of acceptance at the school he wants to attend.Rashad and his friends are also a skate crew, known as \"The Ones\", on Sunday nights at Cascade, a skating rink where local teens hang out. While there, Rashad catches the eye of New-New (Lauren London), a round-the-way girl with a mysterious background, since he only sees her around when she is hanging out with her friends Veda (Khadijah Haqq) and Star (Malika Haqq). The two become attracted to one another and they later kiss when he gives her a ride home in his Chevrolet El Camino. However, in contrast, Esquire instantly develops a disliking for Rashad's new love interest, considering her bad company. Meanwhile, no longer under Rashad's watchful eyes, Ant becomes involved with a drug dealer named Marcus (Patton) and begins to sell for him. He also starts dating a girl named Tondie (April Clark), who takes a liking to him only after he began to make money through drug dealing.At work one day, Esquire meets John Garnett (Keith David), a millionaire who heads a successful business venture called the United Express. The two quickly become friends, with Garnett's admiration for Esquire's ambition and Esquire's respect for Garnett's success driving the relationship. Esquire sees an opportunity to obtain the letter of recommendation that would bring about his acceptance to his primary college choice. When Esquire goes to Garnett's house to pick up the letter, he meets his daughter Erin, who, to his surprise, turns out to be New-New, whose real name is Erin. Erin says that she will reveal where Esquire is really from (something he lied to her father about) if he tells Rashad about her.Things soon begin to fall apart for Rashad; Ant is arrested for selling weed, and later Rashad finds out the truth about Erin. He no longer speaks to his friends, realizing that Esquire knew about Erin the whole time. Esquire, feeling guilty about the way he obtained the letter, decides to return it to Garnett, and reveals the truth about himself and his background. He, Brooklyn, and Teddy attempt to make peace with Rashad and ask him to attend Skate Wars, Cascade's annual skate competition, with them; Rashad, however, refuses their offer. Just as he decides that he will go, after being persuaded by his uncle, he finds out that Marcus is looking for Ant on the streets, searching for cash that Ant owes to him. Rashad tracks the two down and throws the money that Ant owes Marcus in his face. Marcus then holds Rashad at gunpoint and makes a rude comment. Rashad knocks the gun off of Marcus's hand, it goes off, and they fight briefly until Rashad gets up to leave. Rashad tells Ant to get into the car while Marcus grabs his gun and ends up shooting Ant (later revealed) in the chest. At the hospital, Rashad and Ant are able to reconnect; likewise, Erin, Esquire, and Rashad make peace, as the scene ends with the poem \"Love's Deceit\" by rapper Big Rube playing.In the film's final scene, Teddy opens his own business concerning the production of gold teeth, Brooklyn finds a job at a Krystal restaurant, while Esquire receives a mysterious letter of recommendation (presumably from Garnett) and is able to attend his college. The twins Veda and Star remain in the old neighborhood and hang out at Cascade on Sundays, while Erin goes to Spelman College, the school she wanted to attend. Uncle George starts attending church more often and finds a good woman to date. Ant changes direction, discarding the notion of drug dealing, finds a new girlfriend and begins to focus on his studies in school. Rashad, lastly, becomes a comic artist for the Sunday edition of the Atlanta Evening Standard, the city's newspaper. The film ends with Rashad leaving his skates in Cascades, and the building's lights go off.","language":"English","Reception":"ATL received generally positive reviews from critics. At Allmovie, the film was given three stars, and critic Derek Armstrong, in a positive review of the film, stated that the film is only an average coming of age story \"because some substance must take a backseat to all this beautifully crafted style.\"[11] Melissa Walters at BlackFilm.com, while believing some of the writing to be clichéd and the story familiar, also called the film \"heartfelt, genuine, and enjoyable.\"[12] Film critic Roger Ebert awarded the film three stars in his Chicago Sun-Times review, declaring the film \"warm\" and praising the screenplay's \"unforced, genuine affection for its characters.\"[13] IGN.com gave the film a 4/5 rating, naming Robinson's directorial debut \"masterful.\"[14] Metacritic, a normalized film rating website, provided the film a 63/100 score.[15] At the review aggregator site Rotten Tomatoes, the film averaged a 62% approval rate.[16] Ruthe Stein from the San Francisco Chronicle called the film one of the better kind of its genre, praising the performances of the young cast, and the film's star T.I. in particular.[17] At Yahoo! Movies, based on 13 reviews the film has averaged a B- by the critics standards.[18]All reviews of the picture weren't so enthusiastic, however. Lisa Schwarzbaum of Entertainment Weekly graded the film a B-, saying that while the skating scenes are a blast, the film stumbles when it attempts to be too much for too many audiences.[19] Neil Genzlinger of The New York Times said he was surprised that with so many untested actors rounding out the main cast, \"the most amateurish thing about it is the script.\" Genzlinger also called the screenplay cliché- marred and predictable, while giving credit to the young actors of the film. He was also critical of Chris Robinson's direction, stating that he \"can't stay with a scene long enough to let his actors build momentum.\"[20] At The Atlanta Journal-Constitution, Bob Longino provided a negative review of the movie, pointing it out as \"boring, uninteresting, and slow\". However, Longino did say that stars T.I. and Big Boi's performances improved as the film progressed, and that there were a few laugh-out-loud comedic moments in the film.[21]","box_office":"$21.2 million[1]","cinematography":"Karsten Gopinath aka Crash","production_company":"Overbrook Entertainment","directed_by":"Chris Robinson","Soundtrack":"The music for ATL was to be released as a soundtrack but they recorded so much music it became T.I.'s 4th studio album King. It features such singles as What You Know, Top Back, Why You Wanna and Aaliyah's At Your Best (You Are Love).","release_dates":"March 31, 2006","Production":"ATL's story is loosely based on material by producers Dallas Austin and Tionne Watkins, who set out to describe their experiences growing up on the south side of Atlanta in the early '90s.[2] Watkins and producer Jody Gerson approached James Lassiter with the idea of a story about a skating rink that many involved in the Atlanta music scene had started at, and how all of these people would attend the rink every Sunday night in their teen years.[3]Chris Robinson, a renowned music video director, was contacted with an offer to direct Austin and Watkins' visualization, and took on his first feature with ATL. The films producers decided Robinson would be well-suited for the project because of his ability to capture the music-driven aspects of the film, as provided by his experience in the field. They also cited his talent in storytelling. According to producer Austin, \"a lot of music video directors can't capture the story, so what we'd do was turn on the directors' tapes, turn down the music and just watch to see if we could find the story. Chris was far and away the best.\"[3] About making ATL his first feature, Robinson stated that \"as a music video director, I'd get a lot of scripts that had to do with really big visual pictures. But I wanted to start off doing something that had heart.\"[2] After being hired, Robinson traveled to Atlanta and spent time with Austin to try to soak up the vibe and energy of the unique city.[3]Open auditions were held in Atlanta, Chicago, Los Angeles, and New York to comb the crowd for candidates who could compose the film's ensemble cast. Robinson had already decided he wanted relatively unknown actors to perform in the film. Once the cast was assembled, Robinson had his actors converge in Atlanta for six weeks to rehearse the script and familiarize themselves with each other.[3] \"All this young black talent out there, all these young black actors who don't get a shot or who have to wait years to get their shot, are getting their shot in this film, and they're bringing it.\"[2]Three months prior to the start of production, the actors gathered at Atlanta’s Skatetown to begin training for the skating sequences in the film. Some had never been on roller skates before. Vaughn Newton, the actors' skate captain, worked with them rigorously, usually practicing five hours a day. “Lauren and the twins, Malika and Khadijah, adapted very quickly,\" said Newton. \"The guys came along a little slower. Al Be, Jason and Jackie Long developed very fast. T.I. was determined to learn. They were all great students and very supportive of each other.”[3] In addition to the main cast, Robinson decided to include numerous cameos in the film, generally involving people popular in the Atlanta music scene, a core element of the movie. Music producer Jazze Pha played the skating rink's DJ; Rico Wade, a part of the Atlanta-based production team Organized Noize, who also frequented Jellybeans in the early '90s, made an appearance as well. R&B singer Monica, a protégé of producer Austin's, also plays a Waffle House waitress in the film. A few of the south's most sought after music video models made appearances as well including 'Whyte Chocolate' also known as Monique Harris-Ford. There are also cameos from rappers Bone Crusher, Konkrete, and Killer Mike.[3]Dallas Austin coordinated the music for the film, which executive producer Timothy M. Bourne says is \"all new music that's rooted in the Atlanta vibe.\" Austin had already produced his first feature with Drumline in 2002, and wanted to be sure ATL would be similarly authentic to the culture of his hometown by using its current hip-hop scene as the story's backdrop. Music in the environment of the rink was the way Austin pitched the film \"as a way to make a musical without putting Singin' in the Rain on the screen... without the kids breaking into song. I'm determined to show Hollywood and New York the culture from the South.\"[3]Under the working title \"Jellybean\",[5] the film was shot over a span of six weeks in fifty-two locales throughout the city of Atlanta. Filming took place in the summer, sometimes in temperatures over a hundred degrees, challenging the cast and crew's ability to stay motivated. \"A lot of times we had to motivate each other to say 'listen, up your game. Go hard,'\" said Robinson. \"And sometimes we needed to step back, take a breath, so we could get through.\"[2]Chris Robinson and Robb Buono, the film's production designer, decided that the script was composed of two distinct parts — the reality of the teens' lives and the time they spent at the skating rink. According to Buono, \"we wanted to look at it [the rink] through rose colored glasses, because when you think back on your memories of that time period — no matter what age you are — you see everything bigger. Our goal was to make that roller skating rink a character that grows as we keep coming back, and each time it’s more magical — a Saturday Night Fever-like contrast to the reality of life.” Robinson and Buono chose to shoot at the Cascade Family Skating Rink in Atlanta after visiting and witnessing the energy and excitement of the rink. However, the filmmakers felt Cascade's interior design was too bland and decided it should be redesigned.Buono chose black and red for the rink's new color palette. Red was used for its intensity and energy, and black was utilized because the rink would appear larger. Additionally, usage of black would contrast more boldly with the red colors. The ceiling above the rink was removed for lighting purposes. The rink floor was also refinished with darker colors to provide better light reflection. Rigging for the lights became an artistic challenge for Buono. Working with the art department, the rigging electrics and the rigging grips, he designed a wagon wheel effect that moved with the motion of the skating and allowed the lights to be programmed, aesthetically lighting both ends of the rink and capturing the action of the skating sequences. The skate rental section, arcade and snack bar were redesigned at the rink as well, so that the areas besides the skating floor wouldn't feel monotonous. “We did every inch of that rink,” said Buono. “The carpet on the walls, painting the ceiling, putting in the lights, painting the snack bar, changing the color of the tables. We used a lot of neon and bold bright colors.”[3]","atl":"Theatrical release poster","produced_by":"Dallas Austin|Tionne \"T-Boz\" Watkins|James Lassiter|Jody Gerson|Will Smith|","starring":"Tip \"T.I.\" Harris|Lauren London|Evan Ross|Lonette McKee|Antwan Andre Patton|Mykelti Williamson|Keith David|","running_time":"105 minutes","Sequel":"On January 7, 2015 Chris Robinson posted a teaser poster of the sequel on Instagram with the main cast in it confirming that a sequel is in the works. On March 4, 2015 T.I. confirmed on his instagram, that an ATL 2 is to be released.","music_by":"Boombostic Beats","edited_by":"David Blackburn","Release":"ATL was released on March 31, 2006 in 1,602 theatres across the U.S. The film grossed at $11,554,404, and ranked third at the box office behind Ice Age: The Meltdown at one and Spike Lee's Inside Man at two; the film's opening weekend was a success.[6] Its second weekend profits were considerably lower, as the film only earned $3,710,215,[7] enough for it to be reach seventieth place on the list of widely released films with the biggest weekend drops in the last twenty-six years.[8] The film made less money in the following weekends, and by the end of its theatrical run ATL had accumulated a total of $21,170,563. After the theater take of approximately 50%, ATL earned around half of its production cost, producing a significant loss.The film was released in the U.S. on video and DVD July 18, 2006. DVD features include a behind-the-scenes featurette, deleted scenes, star T.I.'s music video for his single \"What You Know,\" and the film's theatrical trailer.[9] The film was also released on Blu-ray on November 14, 2006.[10]","budget":"$20 million"}