{"based_on":"Characters created for Barbershop  by Mark Brown","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"Since the events of the previous film, Calvin Palmer, Jr. has finally settled comfortably into his role as the owner of the inner city barbershop founded by his grandfather and father. The shop's latest threat comes from overzealous developer Quentin Leroux who opens a rival barbershop chain across the street, called \"Nappy Cutz\".While Calvin attempts to figure out how to deal with the coming threat of direct competition from Quentin's flashy establishment, his barbers have issues of their own. Isaac, the lone white barber, is now the star of the shop, and begins to feel that he deserves star treatment, feeling neglected by Calvin and the other barbers. Terri is finding success in managing her anger, but has trouble dealing with the growing mutual attraction between Ricky and her. Dinka is still interested in Terri, but is distraught when he finds out that she loves Ricky, instead. Jimmy has quit the shop to work for the local alderman Lalowe Brown; his replacement, Calvin's cousin Kenard, is fresh out of barber school and horribly inept at cutting hair. Meanwhile, the barbershop and other businesses like it are under threat from gentrification, and Calvin is offered a substantial bribe from Brown and Leroux in exchange for his support of the city council's gentrification legislation.A subplot involves Eddie recalling his time as a young man in the late 1960s, when he first started working at the shop with Calvin's father, including the riots following the assassination of Martin Luther King Jr. Also, Eddie remembers his long-lost love, Loretta. This subplot causes Eddie and Calvin to begin bonding. The film also introduces Calvin's good friend and ex-lover, Gina, who works at the beauty shop next door. The girls at the beauty shop have similar conversations and experiences as the barbers and Gina has a bitter rivalry with Eddie.After attempting to change his own barbershop's style and decor to match those of his rival, Calvin decides to refuse the bribe money and speak out against the neighborhood's gentrification at the local city council meeting. Though Calvin gives a passionate speech about the legislation helping the region to earn money at the cost of its soul and the community, the council still unanimously votes to approve the legislation and move forward with the project. Despite a mutual attraction, Terri and Ricky agree to remain friends (but not before sharing one last kiss). Dinka still loses out on Terri, but finds love with a stylist at Gina's beauty shop. Though the gentrification project is approved, the community remains loyal to Calvin's barbershop.","language":"English","box_office":"$66 million[2]","cinematography":"Tom Priestley","production_company":"Cube Vision State Street Pictures","directed_by":"Kevin Rodney Sullivan","barbershop_2:_back_in_business":"Theatrical release poster","Soundtrack":"A soundtrack containing hip-hop and R&B music was released on February 3, 2004 by Interscope Records. It peaked at #18 on the Billboard 200 and #8 on the Top R&B/Hip-Hop Albums.","release_dates":"February 6, 2004 (2004-02-06)|||||","Box office":"Barbershop 2 opened at #1 with $24,241,612.[4] The $30 million production would go on to gross $65,111,277 in the domestic box office and $860,036 internationally for a worldwide total of $65,971,313.[2]","produced_by":"Alex Gartner Robert Teitel George Tillman, Jr.","starring":"Ice Cube Cedric the Entertainer Sean Patrick Thomas Eve Troy Garity Michael Ealy Leonard Earl Howze Harry Lennix Queen Latifah","running_time":"106 minutes[1]","Sequel":"On March 26, 2014, Deadline.com reported that MGM was in negotiations with Ice Cube to produce a third Barbershop film.[5]On March 19, 2015, MGM announced that the studio has been setting up deals with Cedric the Entertainer, Queen Latifah, and Nicki Minaj to appear in the film. Malcolm D. Lee is set to direct the film and New Line Cinema (via Warner Bros.) will distribute. The film was released on April 15, 2016.[6]","music_by":"Richard Gibbs","edited_by":"Patrick Flannery Paul Seydor","written_by":"Don D. Scott","budget":"$30 million[2]"}