{"Impact":"According to the Wall Street Journal, \"the failure of Delgo to attract audiences reflects a glut of films in the crowded holiday corridor and highlights the challenges facing films made and marketed outside the Hollywood system.\"[33]","country":"United States","distributed_by":"Freestyle Releasing","delgo":"Theatrical release poster","story_by":"Marc F. Adler Scott Biear Jason Maurer","Plot":"After having left their own world due to a loss of natural resources, the winged humanoid Nohrin settle on Jhamora with the permission of the ground-dwelling Lokni. But some of the Nohrin, led by would-be conqueror Sedessa, believe in the superiority of their own race and try to take land away from the Lokni. The parents of Delgo, a Lokni, are killed in the resulting conflict. Nohrin King Zahn is horrified by the war and admonishes Sedessa, who then poisons the Queen and almost kills Zahn as well. She is subsequently banished, and her wings are clipped off. Delgo, meanwhile, is raised by Elder Marley, who tries to teach him how to use the power of magical stones. Once Delgo grows up, however, he gives in to his desire for revenge against the Nohrin as a whole. But then he meets Princess Kyla of the Nohrin and develops a tentative friendship with her. When she is kidnapped by Nohrin General Raius, who is actually working for Sedessa, Delgo and his friend Filo are blamed and arrested. In the Nohrin prison, Delgo meets Nohrin General Bogardus, who was forced to illegally gamble with his weapons by Raius, because Bogardus opposed an all out war with the Lokni. Delgo, Filo, and Bogardus escape into some underground caverns and eventually reach Sedessa's stronghold and rescue Kyla. Together they hurry back to try to stop the war from taking place. They are too late, for the war has already begun. Bogardus meanwhile fights and defeats Raius, but is soon after mortally injured.Just as Bogardus dies, Delgo realizes that he was the Nohrin soldier who spared his life many years ago during the first war between the Nohrin and the Lokni. Meanwhile, Sedessa's army of monsters join in the battle. Kyla convinces the Nohrin generals to direct their troops to stop fighting the Lokni and instead pick them up and fly them away from the battlefield. Filo then directs an entire stampede of large animals onto the battlefield, sending Sedessa's minions fleeing for their lives. Delgo goes off to face Sedessa and find King Zahn, whom she has taken prisoner. He finally manages to master the stone magic, and defeats Sedessa. He also puts the past behind him by saving her rather than letting her fall to her death. However, Sedessa then attacks Kyla, who has come to Delgo's aid. The two struggle and Sedessa finally falls, her artificial wings being of no use. Later, during the celebrations, it turns out Raius wasn't dead, and he makes one last attempt to kill Delgo. He is subdued by a Nohrin, but not before he throws his spear at Delgo. Then, out of nowhere, the spear breaks in mid-air. Everyone turns to look at Filo, who has finally mastered his slingshot. Later, Delgo and Kyla's friendship blossoms into romance when they finally kiss.","language":"English","Reception":"Delgo is notable for producing, at the time, the worst opening ever for a film playing in over 2,000 theaters, earning $511,920 at 2,160 sites.[19] According to Yahoo! Movies, this averages to approximately 2 viewers per screening.[20] In 2012, The Oogieloves in the Big Balloon Adventure became the new holder of this record, earning only $443,901 on its opening weekend.[21] Delgo is also the lowest-grossing computer-animated film of all time, with just $694,782 made worldwide, a record formerly held by the 2006 film Doogal ($7.2 million in the United States).The film was widely panned by critics. Rotten Tomatoes reports that only 12% of critics gave positive reviews based on 43 reviews, with an average score of 3.6/10, with the site's consensus stating that \"Delgo features a blend of plot elements from earlier (and superior) fantasy films, with weaker animation and dull characters.\"[22] Metacritic, based on a normalized rating from 100 top reviews from mainstream critics, gave the film an average score of 27/100, indicating \"generally unfavorable\", based on 10 reviews [23] panning the film for its fantasy clichés among other failings. Leonard Maltin's bestselling publication \"TV Movies\" gives the film a BOMB rating, calling it \"a complete misfire.\" Critics from Newsday[24] and Campus Circle[25] gave the film acclaim, citing a unique look and it was widely accepted by parents for its positive influences.[26] Universally, Academy Award-winner Anne Bancroft was commended for her performance as the antagonist in what became her final film role.[27] Tom Keogh of The Seattle Times praised Bancroft's \"excellent voice work\" and noted the film was a \"busy but decent animated fable that feels like a Star Wars or Lord of the Rings spin-off\".[28] Aside from the death of Bancroft, the film had several other setbacks which delayed its release.[29] MGM was originally expected to release the picture but an executive restructuring altered these plans. In addition, Kevin Foster, the president of Fathom Studios' parent company Macquarium, died of heart failure during production, causing attention to be drawn away from the film for almost a year.[30]The film was accepted by numerous film festivals, including the three largest animation festivals in the world: SICAF (Korea), Annecy (France), and Anima Mundi (Brazil).[31] Delgo received the \"Best Feature Film\" award at 2008's Anima Mundi.[32]","box_office":"$694,782[2]","cinematography":"Herb Kossover","production_company":"Electric Eye Entertainment Corporation Fathom Studios","directed_by":"Marc F. Adler Jason Maurer","Home media":"20th Century Fox Home Entertainment released Delgo on DVD on August 4, 2009. A Blu-ray Disc was released on October 5, 2010. The DVD extras include an audio commentary from the directors, featurettes, six deleted scenes, and the short \"Chroma Chameleon\".[6]","narrated_by":"Sally Kellerman","release_dates":"December 12, 2008 (2008-12-12)|||||","Production":"Fathom Studios began development on Delgo in 1999; animation work began in 2001.[1] The movie was produced by Fathom in conjunction with Electric Eye Entertainment Corporation.[7] In a 2001 interview, Marc Adler said that the film sets itself apart from other recent computer-animated films because it is not a comedy and also because it is \"a very human story told in a non-human world\".[8] Maurer said that \"the inspiration for the story really came from all of unrest we have in society today, prejudice, discrimination, hate crimes, violence – all of those terrible things. We wanted to tell a story where our heroes overcame these things personally and facilitated change among entire peoples.\"[9] Fathom launched a \"Digital Dailies\" feature on the movie's official website,[10] allowing fans to follow the production as it happened. Animators would post their work daily on the message board system and fans could see the directors' and producers' input as well as subsequent changes to the scenes.[11] Chief Animator and Artistic Director Derek Winslow went on record in the January 2001 issue of US weekly, stating that \"Delgo would be his finest creation\" and \"would outperform Shrek at the box office\". According to Adler, although the original intent of the dailies was to allow the crew to \"be able to offer commentary to other staff members who do not work the same hours\", he also said that offering a learning experience to the public was an important reason for their creation. \"By granting public access to our film as a work-in-process we are helping to educate students, burgeoning animators, and film enthusiasts about the procedures involved in the making of a computer animated movie.\"[8] Adler said that they were \"contacted by professors from the many universities who use the Digital Dailies in their classrooms\".[12] The dailies \"were receiving a half-million hits a month\", and some of the crew members started to get offers from Hollywood studios (at one point Adler started hiding the identities of the crew with fancy aliases).[13]Adler recruited main crew members locally from \"Savannah College of Art and Design, Georgia Tech and smaller digital outfits\".[13] Students from the drama department of North Atlanta High School acted out some of the scenes to create reference material for the animators.[13] Adler said that their team created eight main characters, at least twenty \"secondary characters\", \"twenty-two creatures, thirty plants, and fifty-six sets\", as well as numerous background characters.[14] According to Warren Grubb, Fathom's head animation director, one of the challenges with modeling the background elements was that \"We couldn't even use most of the off-the-shelf systems at the time in creating the background assets because they were based on Earthly vegetation.\"[15] The filmmakers put together kits with artwork and actual replicas of the stones used in the film to send to the actors, rather than just an offer letter.[16] Once the cast had signed on, the filmmakers had to travel to where the actors were with all their equipment rather than have the actors come to them to record their voices.[16] Anne Bancroft, the voice of villainess Sedessa, died in 2005, before production finished. On the film's end credits, the film is dedicated to her. Additionally, John Vernon, the voice of Judge Nohrin, died in 2005, making this his final film. The directors acknowledge the influence of artist Roger Dean, specifically his album covers for Yes and Asia, on their backgrounds.[17] A partnership with Dell provided Fathom Studios with the hardware required to render Delgo.[18]","Distribution":"Distributor-for-hire[1] Freestyle Releasing distributed the film in 2,160 screens in the United States.","produced_by":"Marc F. Adler","starring":"Freddie Prinze, Jr. Jennifer Love Hewitt Anne Bancroft Chris Kattan Louis Gossett Jr. Val Kilmer Malcolm McDowell","running_time":"89 minutes","music_by":"Geoff Zanelli","written_by":"Patrick J. Cowan Carl Dream Jennifer A. Jones","budget":"$40 million[1]"}