{"based_on":"Diary of a Mad Housewife by Sue Kaufman","Availability":"The film was released on DVD on October 15, 2014;[5] VHS copies of Housewife have become rare, with sealed copies routinely fetching over $100 on websites like Amazon.com and eBay.[6]","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Eleanor Perry","Plot":"Tina Balser, an educated, frustrated housewife and mother, is in a loveless marriage with Jonathan, an insufferable, controlling, emotionally abusive, social-climbing lawyer in New York City. He treats her like a servant, undermines her with insults, and belittles her appearance, abilities and the raising of their two girls, who treat their mother with the same rudeness as their father. Searching for relief, she begins a sexually fulfilling affair with a cruel and coarse writer, George Prager, who treats her with similar brusqueness and contempt, which only drives her deeper into despair. She then tries group therapy, but this also proves fruitless when she finds her male psychiatrist, Dr. Linstrom, as well as the other participants, equally shallow and abusive.At the climax of the film, Jonathan confesses to Tina that his ambitious plans have collapsed. A French vineyard he had invested in is wiped out, and he is now in debt. Because he has been focusing on non-job, his work at his law firm has suffered. He also confesses to having an affair. Tina tells Jonathan that she accepts what he's done, and promises to support him, but does not tell him of her own affair with George. Tina reveals her story to her therapy group, who angrily criticize or belittle her. The final shot is of Tina's face, steadfast, as angry voices from the group are heard from off-screen.","language":"English","diary_of_a_mad_housewife":"Theatrical release poster","box_office":"$6.1 million (rentals)[1]","cinematography":"Gerald Hirschfeld","directed_by":"Frank Perry","Response":"The film was critically acclaimed: it maintains a 77% rating at Rotten Tomatoes.[3] Roger Ebert gave the movie three out of four stars, saying, \"What makes the movie work... is that it's played entirely from the housewife's point of view, and that the housewife is played brilliantly by Carrie Snodgress.\"[3]Neil Young wrote the song \"A Man Needs a Maid\" inspired by Snodgress in Diary of a Mad Housewife: \"I was watching a movie with a friend/I fell in love with the actress/she was playing a part I could understand.\" The song was included on his 1972 album Harvest. Soon after, Young and Snodgress became romantically involved for several years.[citation needed]Groucho Marx spoke out against the movie in an interview on The Dick Cavett Show on May 25, 1971. He stated that it was an example of dirty entertainment and that he did not like it because the characters were in bed for 80 minutes. He made a joke of this, and stated, \"Well I'm not interested in that. I don't care what they are doing in the sack, if I am not doing it, why should I sit in the theater and watch it?\"[4]","release_dates":"August 10, 1970 (1970-08-10)|||||","produced_by":"Frank Perry","starring":"Richard Benjamin Frank Langella Carrie Snodgress Lorraine Cullen Frannie Michel Katherine Meskill The Alice Cooper Band","running_time":"104 minutes","edited_by":"Sidney Katz"}