{"based_on":"Doom 1993 game  by id Software","country":"United States[2][3]|United Kingdom|Czech Republic|Germany|","distributed_by":"Universal Pictures","screenplay_by":"David Callaham|Wesley Strick|","doom":"Film poster","Plot":"In the year 2046, a heavily populated research facility on Mars is suddenly attacked by an unknown assailant. Following a distress call sent by Dr. Todd Carmack, a group of marines, led by Asher \"Sarge\" Mahonin, is sent on a search-and-rescue mission. One of the marines, John \"Reaper\" Grimm, accompanies his sister, Dr. Samantha Grimm, to one of the labs within the devastated sector to retrieve data; here he learns that the dig site where their parents were accidentally killed was re-opened and ancient skeletons of a genetically enhanced race were discovered.While searching for survivors in the facility, the marines find Dr. Carmack, who is taken to a medical room for examination, but later disappears. The marines find a creature that leads them down to the facility's sewer. Marine Eric \"Goat\" Fantom is killed during their pursuit, along with the creature. The corpses of Goat and the creature are taken to the medical room. Marine Gregory \"Duke\" Schofield stays with Sam as she starts an autopsy, when they are attacked by a second creature. After trapping it, Sam continues the autopsy on the first creature, finding that its organs are human. Goat suddenly revives, and then kills himself by slamming his head against a glass window.The squad tracks a third creature down into the dig site, where it kills three more marines. Sam and Reaper try to convince Sarge that the creatures are humans from the facility, mutated by the addition of a Martian chromosome (called C24) they found and synthesized from the bones discovered, and that not all of those infected will fully transform into creatures. Regardless, Sarge orders his team to sanitize the entire facility. Sarge kills the creature in the medical lab (revealed to be a mutated Dr. Carmack) and executes one of his marines for defying his commands. Sam and the surviving marines are then flanked by the infected, partly mutated, humans. Only Sam and a wounded Reaper escape. Sam injects Reaper with the C24 serum, enhancing his abilities so that he is able to kill the infected humans and fully mutated creatures. Reaper then battles an infected Sarge and kills him. Having survived, Sam and Reaper enter the elevator to leave the facility.","language":"English","Reception":"The review aggregator Rotten Tomatoes reported that 19% of critics gave the film positive reviews, based on 130 reviews, with the critical consensus \"Sure to please fans of the video game, but lacking in plot and originality to please other moviegoers.\"[14] Roger Ebert said, \"Doom is like some kid came over and is using your computer and won't let you play.\"[15] Richard Roeper has also stated, \"The performances are awful, the action sequences are impossible to follow, the violence is gratuitous, the lighting is bad and I have my doubts that the catering truck was even up to snuff on this project.\"[citation needed] Rob Gonsalves gave it two stars, citing incoherent action sequences, flat and humorless characters, and poor acting: \"Only Richard Brake, as the sleazy and duplicitous grunt Portman, gives a performance of any interest, and even that's on the level of caricature.\"[16] In 2009, Time listed the film on their list of top ten worst video games movies.[17]It did well on its opening weekend, taking in $15.5 million. However, it quickly dropped in its second week in theaters and the final gross of the film was only $28.2 million domestically and almost $56 million worldwide, with a budget of $60 million. The film was nominated for a Razzie Award for Worst Actor (Dwayne Johnson), but lost to Rob Schneider for Deuce Bigalow: European Gigolo.[citation needed]In a 2009 interview, Johnson described the film as an example of \"trying and failing\" to do a good video game adaptation, and that it was a cautionary tale of what \"not to do\".[18]Doom was released on DVD on February 7, 2006, HD DVD on April 26 2006 and on Blu-ray Disc on February 10, 2009.[19]","box_office":"$56 million[5]","cinematography":"Tony Pierce-Roberts","production_company":"John Wells Productions Di Bonaventura Pictures","directed_by":"Andrzej Bartkowiak","Soundtrack":"The film's score was composed by Clint Mansell, upon which he produced a remix of the Nine Inch Nails song \"You Know What You Are?\", which was used in the film's ending credits. The song \"Switchback\" by Celldweller was licensed to be used for marketing and media purposes, such as the theatrical trailer and TV spots.","release_dates":"October 17, 2005 (2005-10-17) (Los Angeles)|October 21, 2005 (2005-10-21) (United States)|October 27, 2005 (2005-10-27) (Germany)|November 3, 2005 (2005-11-03) (Czech Republic)|December 2, 2005 (2005-12-02) (United Kingdom)|","Production":"The film's producer, John Wells, admitted in an interview that \"many\" video game movie adaptations had \"sucked.\" He revealed that the crew was able to get \"a lot of financial support from Universal\" and that it wasn't \"done on the cheap.\" Wells also revealed that the Doom movie would have a sequence shot in a first-person perspective because \"Doom without that would be a miscarriage of justice!\"Wells also revealed that \"we were all very concerned that we make sure that it was exactly the kind of experience that we [the crew] remembered so fondly from the game: turning the lights off at midnight, cranking it up and scaring the hell out of yourself!\"Wells further stated that there is a balance between CGI and prosthetics in the Doom movie, and he, for the first time as a producer, admitted that \"we didn't wanna rely on the CGI. Those effects still haven't quite got to the level where you fully believe it — certainly not for long periods of time,\" and that the crew used Stan Winston's Creature Shop and that his work is only \"enhanced with CGI.\" He also admitted that \"if you rely too much on CGI it can look cheesy: it doesn't quite work. It'll get there, but it's not there yet.\"Wells has stated that the crew insisted that the Doom movie be made into an R-rated movie and that he didn't \"think it was possible to do a PG-13 version—and that's been the mistake made by a couple of other computer game movies,\" and that \"a lot of studios didn't want to do it. But we made a conscious decision that we'd prefer not to make it any other way.\"Wells also revealed that if this first Doom film is successful, a second one could be made, and that \"we certainly have some ideas for the next one, if there is gonna be one. We'll have to wait and see: the audience will have to tell us ...\"One of the most noteworthy aspects of the film is a short sequence near the end of the film where the camera follows the progress of Grimm from a first-person perspective in homage to the original game. In the words of Karl Urban, the actor who plays Reaper:","produced_by":"Lorenzo di Bonaventura|Laura Holstein|John D. Schofield|Jeremy Steckler|","starring":"Karl Urban|Rosamund Pike|Razaaq Adoti|Dwayne Johnson|","running_time":"105 minutes[1]","music_by":"Clint Mansell","edited_by":"Derek Brechin","budget":"$60 million[4]"}