{"country":"United States","distributed_by":"Columbia Pictures","Plot":"In 1984, ten-year-old Tre Styles lives with his divorced single mother Reva in Inglewood, California. After Tre gets in a fight at school, his teacher informs Reva that Tre is highly intelligent but has a volatile temper and lacks respect. Worried about Tre's future, Reva sends him to live in the Crenshaw neighborhood of South Central Los Angeles with his father, Furious Styles, from whom she hopes Tre will learn valuable life lessons. In Crenshaw, Tre reunites with his friends, Darrin \"Doughboy\" Baker, Doughboy's maternal half-brother Ricky, and Chris, their mutual friend. That night, Tre hears his father shooting at a burglar who tried to steal from the house. Two police officers arrive more than an hour later, and while the Caucasian officer is civil, the African-American officer treats Furious with disrespect and contempt. The next day, Tre and his friends go out with Chris who shows them a dead body. While there, a group of older Crip gang members steal Ricky's ball and Doughboy aggressively tries to get it back but is easily defeated. While the boys walk away, one of the members gives Ricky back his ball and a frustrated Doughboy says he is going with Chris to the store. Later in the day, Furious spends quality time with Tre, taking him to the seaside for fishing and telling the boy more about his life story, including the time that he even went to Vietnam in hopes of making his boy proud of him. He concludes by advising Tre to not ever join the army, stating that the black man has no place in the army. While returning home, they see Doughboy and Chris getting arrested for stealing something at the store, while Ricky and Tre look on.The film then jumps forward to seven years later. At a backyard party, Doughboy is now a Crip and is celebrating his recent release from jail, along with most of his friends, including Chris, who is now in a wheelchair from a gunshot wound, and new friends Dooky and Monster, also Crips. Ricky, now a star running back for Crenshaw High School, lives at home with his mother Brenda, girlfriend Shanice, and their toddler son. Tre has grown into a mature and responsible teenager, works at a clothing store at the local mall, and hopes to attend college with his girlfriend, Brandi.Furious takes Tre and Ricky to Compton to talk about the dangers of decreasing property values in the black community. That night, during a local street racing gathering, Ricky is provoked by Ferris, a member of the Bloods. In response, Doughboy brandishes his handgun, leading to a brief argument between the two gangs. While the two gangs were done arguing, Ferris shoots his gun in the air to signal everyone to leave. While Tre talks about leaving Los Angeles, he and Ricky are pulled over by the police. The lead officer, the same one who was disrespectful to Furious seven years earlier, deliberately intimidates and threatens Tre with his gun, knowing he can't do anything. Distraught, Tre goes to Brandi's house, where he finally breaks down. After she consoles him, they have sex for the first time.The next day, Ricky has a fight with Doughboy, with Brenda quickly taking Ricky's side and berating Doughboy. While Ricky and Tre walk to a nearby store, they see Ferris and his gang driving around the neighborhood and to avoid them, cut through back alleys and separate. Ferris's car closes in on Ricky, and one of Ferris's gang guns Ricky down, killing him. Both Tre and Doughboy's gang catch up to the location of the shooting. Helpless, Tre and Doughboy carry Ricky's lifeless body back home. When Brenda and Shanice find out that Ricky is dead, they hysterically blame Doughboy, who unsuccessfully tries to comfort them. That night, Brenda sobs over Ricky's SAT test results, discovering he scored just enough to qualify for the USC scholarship he wanted.The remaining boys vow vengeance on Ferris and his group. Furious finds Tre preparing to take Furious's revolver, but convinces Tre to abandon his plans for revenge. However, Brandi and Furious catch Tre sneaking out of his bedroom window to join Doughboy. That night, as the gang drives around the city, Tre asks to be let out of the car and returns home, realizing that his father was right to keep him from falling into a cycle of violence. When Tre gets back, Furious is waiting for him; they look at each other without saying a word, and then Furious retreats to his bedroom. Doughboy finds Ferris's gang at a local fast food restaurant, and Monster opens fire on them, killing one and wounding the other two. Doughboy gets out and personally executes the other wounded gang member and Ferris, avenging Ricky's death.The next day, Doughboy visits Tre, now understanding Tre's reasons for abandoning the gang. Doughboy knows that he will soon face retaliation for Ferris' death, and accepts the consequences of his crime-ridden life. He plaintively questions why America \"don't know, don't show, or don't care about what's going on in the hood\". He sorrowfully says that he has no brothers left now after Ricky's death, but is embraced by Tre, who says to Doughboy \"You still got one brother left.\"The epilogue reveals that Doughboy saw Ricky buried the next day and was murdered two weeks later. Tre and Brandi resume their relationship, and go on to attend Morehouse and Spelman Colleges in Atlanta.","language":"English","Reception":"Boyz n the Hood received universal acclaim. Review aggregation website Rotten Tomatoes gives the film a score of 96% based on 49 reviews, with an average score of 8.3/10, making the film a \"Certified Fresh\" on the website's rating system.[4] At Metacritic, which assigns a weighted mean rating out of 100 to reviews from mainstream critics, the film received an average score of 73%, based on 18 reviews, which indicates \"Generally favorable reviews\".[5]The film has been referenced innumerable times in other works, including works by Lupe Fiasco, Game, and Ice Cube himself. In 1994, British jungle DJ duo Remarc and Lewi produced a song titled \"Ricky\". The song itself is built up of various sound bites from the movie, particularly the scene where Ricky is murdered. Ice Cube's song, \"Check Yo Self\", also references the film.On the July 12, 2011 episode of her self-titled talk show, Mo'Nique celebrated the 20th anniversary of the release of Boyz n the Hood with director John Singleton, Cuba Gooding, Jr., Yo-Yo, and Regina King.","boyz_n_the_hood":"Theatrical release poster","box_office":"$57.5 million (North America)[1]","cinematography":"Charles Mills","directed_by":"John Singleton","Awards and accolades":"Academy Awards: 1992BMI Film Music Award: 1992Image Award: 1993MTV Movie Award: 1992National Film Preservation Board, USA: 2002New York Film Critics Circle Award: 1991Political Film Society, USA: 1992Writers Guild of America, USA: 1992Young Artist Awards: 1992[6]In 2007, Boyz n the Hood was selected as one of the 50 Films To See in your lifetime by Channel 4.","release_dates":"July 12, 1991 (1991-07-12) (United States)|||||","produced_by":"Steve Nicolaides","starring":"Ice Cube|Cuba Gooding, Jr.|Morris Chestnut|Larry Fishburne|","running_time":"112 minutes","music_by":"Stanley Clarke","edited_by":"Bruce Cannon","written_by":"John Singleton","budget":"$6.5 million[1]"}