{"distributed_by":"Universal Pictures (US)|Buena Vista International (non-US)|","screenplay_by":"Brandon Camp|Mike Thompson|David Seltzer|","story_by":"Brandon Camp|Mike Thompson|","Plot":"Joe and Emily Darrow are doctors in a Chicago hospital. Seven months pregnant Emily travels to Venezuela to help natives in the Amazon area. She dies when a bus is hit by a landslide and plunges into the river below. Her body is never found by the local authorities.Without taking time to grieve Joe returns to work. One night he is awakened by his wife's dragonfly paper weight that falls and rolls across the room. His wife always had a passion for dragonflies and even had a birthmark on her shoulder which resembled a dragonfly. Joe starts visiting Emily´s patients at the pediatric oncology in the hospital. One of his wife's patients is brought in unconscious. Joe hears the child calling his name and follows the staff who are trying to revive him without success - the child´s heart flatlines. As Joe approaches the child, suddenly the heart begins beating again.The following afternoon Joe returns to the child who asks him if he is \"Emily's Joe\" and tells him she sent him back to tell Joe something. All over the room are drawings of a curvy cross, but the boy doesn't know what the symbol means. The boy tells about his near death experience, that he saw a light, and a woman showing him an image of Joe, and that the cross symbol was what he saw at the end of the rainbow. Later, while passing by another child's room, Joe sees the same drawing. That boy immediately knows who Joe is and tells him that he must \"go to the rainbow\".When Joe arrives at home, his parrot mysteriously goes into a rage breaking a pot making the same wavy cross symbol drawn in the spilled soil on the floor. Joe spots a dragonfly flying outside the window, and briefly sees Emily reaching for him outside that same window. Joe's neighbour, Miriam Belmont, tries to talk him back into reality. Instead, he goes to Sister Madeline, a controversial nun who investigated near-death experiences. Sister Madeline advises Joe that Emily is indeed trying to contact him from the other side.The breaking point occurs at the hospital when Joe is alone with a clinically dead patient. Joe hears his wife speaking through the patient, calling his name, but no one believes him. He decides to sell his home and go on vacation. While packing away his wife's belongings, the lightbulb in the room burns out. When he returns with a new bulb, all the belongings he had packed away are suddenly back in their original places. He enters his kitchen where a map has blown open, showing the mysterious curvy cross symbol at several places. He learns from a friend that the wiggly cross is the map symbol for a waterfall. Joe remembers and finds a photo of his wife posing in front of a waterfall with a rainbow behind her.He takes a trip to the South American area where his wife died. Joe's pilot, Victor, takes him to the victims' graves near a tribe village. Joe shows the photo of his wife and asks his native guides if they know where his wife is buried. They start arguing with each other that he should be brought to the village. Joe's attention then shifts to the village and he runs off to it. He comes to a cliff and sees the bus far down below in the water. Joe jumps into the river and enters the semi-flooded bus, causing the bus to shift and becoming completely submerged. Joe is trapped inside but calms down when a bright glow fills the bus and his wife appears to him, reaching his hand. The events of her final hours flash before him, showing she survived the initial accident and was pulled to safety by nearby Yanomami villagers. He is then suddenly rescued out of the bus by Victor.Joe runs to the village just to become surrounded by angry native men holding weapons. He holds up a photo of his wife. A native woman tells him they couldn't save her body but they saved her soul. Perplexed, he follows her into one of the huts, and inside is a female infant in a basket. The child his wife was carrying had survived the accident. The woman shows him a birthmark on the child in the shape of a dragonfly. As he embraces his daughter he realizes what his wife was trying to tell him.The film ends with Joe playing with his daughter, who is now a toddler, having the same wavy blonde hair and who is the very image of his wife.","language":"English","Reception":"The review aggregator Rotten Tomatoes reports that 7% of critics gave the film positive reviews based on 124 reviews. The consensus is: \"Sappy, dull and muddled, Dragonfly is too melancholic and cliched to generate much suspense.\"[2]","box_office":"$52.3 million[1]","Remake":"An Indian re-make was made of this film by the name Saaya in 2003.","cinematography":"Dean Semler","production_company":"Spyglass Entertainment Buena Vista Pictures Shady Acres Entertainment Gran Via Kalima Productions GmbH & Co. KG NDE Productions","dragonfly":"Dragonfly film poster","directed_by":"Tom Shadyac","release_dates":"February 22, 2002 (2002-02-22)|||||","produced_by":"Gary Barber|Roger Birnbaum|Mark Johnson|","starring":"Kevin Costner|Joe Morton|Ron Rifkin|Linda Hunt|Kathy Bates|","running_time":"104 minutes","music_by":"John Debney","edited_by":"Don Zimmerman","Release":"Produced on a $60 million budget, Dragonfly made $52 million worldwide.[1]","budget":"$60 million[1]"}