{"country":"Japan","Distribution and reception":"In the late 1980s, an English dubbed version, produced by Magnum Video Tape and Dubbing[7] for international Japan Airlines flights at the request of Tokuma Shoten, was briefly screened in the United States by Streamline Pictures. Carl Macek, the head of Streamline, was disappointed with this dub, deeming it \"adequate, but clumsy\".[8] Following this, Tokuma allowed Streamline to dub their future acquisitions My Neighbor Totoro and Kiki's Delivery Service. The Streamline dub of Laputa: Castle in the Sky was released only on the first Japanese DVD release along with the Streamline dub of My Neighbor Totoro and The Castle of Cagliostro. The initial Japanese DVD release is now out of print and the subsequent rerelease contains the Disney dub instead.The Disney-produced English dub was recorded in 1998 and planned for release on video in 1999, but Disney eventually decided to release it to theaters instead.After Princess Mononoke (1997) did not fare as well in the US as Japan, Laputa's release date was pushed back yet again; on occasion the completed dub was screened at select children's festivals. The film was finally released on DVD and video in the US on April 15, 2003 alongside Kiki's Delivery Service and Spirited Away. As with Mononoke and Kiki, critical opinion was mixed about the new dub, but Cloris Leachman and Mark Hamill's performances as Dola and Muska drew praise.[9] Laputa was the second-best selling DVD from Studio Ghibli distributed by Disney in the year of its release (after Spirited Away and ahead of Kiki's Delivery Service).[citation needed] Laputa was reissued on American home video in March 2010 as a tribute accompanying the home video release of Ponyo. The film was released on Blu-ray in North America on May 22, 2012, alongside Whisper of the Heart and The Secret World of Arrietty.The film currently holds a 95% \"Fresh\" rating at Rotten Tomatoes.[10] In an audience poll (with 80,402 voters) of 100 best animations of all time, conducted by Japan's Agency for Cultural Affairs in 2007, Castle in the Sky was the second highest-ranked animated film, and third highest-ranked animation overall on the list.[11]The film received a re-screening on May 22, 2011 in Aberystwyth as part of a charity fund for Japan. The print shown was the original theatrical Japanese print with English subtitles.The most tweeted moment in the history of Twitter was during the airing of Castle in the Sky on August 2, 2013 when fans tweeted the word \"balse\" at the exact time that it played in the movie. There was a global peak of 143,199 tweets in one second.[12]References to the film can be found in anime and other media, including a reference in episode 5 of No Game No Life.","distributed_by":"Toei Company","Influences":"The name 'Laputa' is derived from Jonathan Swift's novel Gulliver's Travels, wherein Swift's Laputa is also a flying island controlled by its citizens. Anthony Lioi feels that Miyazaki's Laputa: Castle in the Sky is similar to Swift's Laputa, where the technological superiority of the castle in the sky is used for political ends.[3]Laputa is credited by Colonel Muska with having informed Biblical and Hindu legends — thus tying the world of Laputa to our Earth (and to western European civilization) — as do the medieval castle architecture on the ground; the Gothic and half-timbered buildings in the village near the fort; the Welsh mining-town architecture, clothing, and ground vehicles of Pazu's homeland; and the Victorian ambiance of the pirate ship. The anime also makes references to the Hindu epic Ramayana, including \"Indra's arrow\", while the name Sheeta may be a reference to Sita, the female lead in the Ramayana.[4]Some of the architecture seen in the film was inspired by a Welsh mining town. Miyazaki first visited Wales in 1984 and witnessed the miners' strike firsthand. He returned to the country in 1986 to prepare for Laputa, which he said reflected his Welsh experience: \"I was in Wales just after the miners' strike. I really admired the way the miners' unions fought to the very end for their jobs and communities, and I wanted to reflect the strength of those communities in my film.\"[5] Miyazaki told The Guardian, \"I admired those men, I admired the way they battled to save their way of life, just as the coal miners in Japan did. Many people of my generation see the miners as a symbol; a dying breed of fighting men. Now they are gone.\"[6]","Plot":"In the film's backstory, human civilizations built flying cities, which were later destroyed by an unspecified catastrophe, forcing the survivors to live on the ground. The only remaining flying city, Laputa, still floats in the sky, concealed by a permanent powerful hurricane that surrounds it.In the story's opening, an airship carrying Sheeta, a girl who has been abducted by Muska, a secret agent working for the government, is attacked by Captain Dola and her air pirate sons who are in search of Sheeta's crystal amulet. In the resulting struggle, Sheeta falls from the airship but her descent is slowed by the amulet which starts glowing. She safely lands in a small mining town where she is discovered by a boy named Pazu, who takes her into his home to recover. On waking, Sheeta is surprised to find that Pazu is building a small aeroplane with the intention of finding the lost city of Laputa, which his father had taken a photograph of while flying some years previously. She tells him that her family lived in a small valley to the north named Gondoa, and that she lived alone once her mother, father, and grandmother died, until Muska and his agents abducted her. Later that day they are pursued by Dola's pirates, and then by Muska's soldiers. Eventually, the two fall into an abandoned mine, where they encounter the local eccentric 'Uncle Pomme', who informs them that Sheeta's amulet is made of 'volucite' crystal ('Aetherium' in the American release), a material used to keep Laputa and the other flying cities aloft.[2]Upon leaving the mines, Sheeta tells Pazu that her full name is 'Lusheeta Toel Ul Laputa'. They are then captured by Muska and taken to the fortress of Tedis, where Pazu is imprisoned in the fortress' dark, cold and damp tower while Sheeta is imprisoned in a more lavish room. Muska shows Sheeta a dormant Laputan robot and reveals his knowledge of her secret name, which he interprets to be that of the Laputan royal line. Muska then threatens Pazu's life to obtain Sheeta's cooperation. When they meet again, Sheeta orders Pazu to leave for his own safety, and Muska offers him money to leave and forget about Laputa.A distraught Pazu returns home, where he is ambushed by Dola's sons. After being questioned, Dola explains to Pazu that Sheeta told him to leave in an effort to protect him. She also explains that once Muska has what he wants from her, he will most likely kill her. Upon hearing that the airship Goliath will be taking off to find Laputa with Sheeta aboard, Dola and her sons prepare to intercept and capture the crystal. Pazu asks Dola to join her pirates to save her. Dola initially refuses but reconsiders, and they immediately leave for the fortress to rescue Sheeta. As preparations proceed, Sheeta recites an apotropaic verse and unexpectedly activates the amulet and the robot, which follows Sheeta. When struck by Muska's artillery, the robot retaliates and proceeds to destroy the fortress. When Sheeta orders it to desist, the robot is overcome by Goliath. Pazu arrives and rescues Sheeta, but Muska obtains the amulet.The pirates, accompanied by Pazu and Sheeta, return to their airship, Tiger Moth, where Dola assigns Sheeta to the galley and Pazu to assist the ship's engineer. They pursue the Goliath, which is following directions indicated by Sheeta's amulet to locate Laputa. Both airships arrive at Laputa on the following day. The two children, separated from Dola's pirates, discover the city to be devoid of human life, but overgrown by a park-like woodland with a gigantic \"eternal tree of life\" at its center, which is maintained by a robot similar to the one Sheeta encountered in the fortress.Dola's pirates are captured and Muska's soldiers plunder the city's treasures. The ancient city is revealed to be twofold; a crumbling, overgrown, yet beautiful ruin of a castle above, and a perfectly preserved scientific marvel below. The city exemplifies the ultimate evolution of the crystal levitation technology displayed by Sheeta's amulet, as well as holography, magnetic cohesion, pseudo-nuclear weaponry and a veritable army of the semi-sentient robots. Upon gaining entrance to the city's central sphere, Muska captures Sheeta and his agents open fire upon Pazu, who escapes and frees Dola's pirates.In the center of Laputa, which contains the immense 'volucite' crystal keeping the city aloft, Muska identifies himself as \"Romuska Palo Ul Laputa\", a member of another royal line, and he uses Sheeta's \"key\" crystal to access the advanced Laputian technology. He then massacres his own soldiers and destroys the Goliath. During the mayhem, Sheeta seizes her crystal amulet and flees, with Muska in pursuit. Encountering Pazu, Sheeta gives him her amulet through a gap in the wall and is cornered by Muska in Laputa's abandoned throne room. During her confrontation with Muska, Sheeta realizes and explains that the people of Laputa left the castle because they realized that man was meant to live on earth and not in the sky. Muska refuses her arguments, shoots off her braids and threatens to kill her unless the crystal amulet is given to him. Pazu then enters and says he'll give the crystal amulet to Muska if he can talk to Sheeta; Muska grants them one minute.Sheeta and Pazu recite a \"Spell of Destruction\", destroying much of the city, which leads to Muska's death. Having survived the collapse, protected thanks to the tree's gigantic roots, Pazu and Sheeta re-unite with Dola and her pirates (who have had the presence of mind to swipe some of the city's treasures before fleeing) and leave Laputa behind. When they part with the pirates, Pazu flies Sheeta to Gondoa as he had promised her, to start a new life together. The end credits show the remnants of Laputa still floating in orbit, with the guardian robot still tending the garden, maintained by the volucite crystal embedded in the roots of the central tree.","Title":"Although meaningless in Japanese, the name \"Laputa\" comes from Jonathan Swift's Gulliver's Travels. English language dubs of Laputa have been released under three different titles by three separate distributors, which is largely due to the similarity to the Spanish slang \"la puta\" (lit. \"the whore\"), which would be offensive to many.In 2003, the film's title was shortened from Laputa: Castle in the Sky to Castle in the Sky in several countries, including the United States, Mexico, and Spain. In Spain the castle was named Lapuntu. This change was carried to a number of non-Spanish speaking countries, including Britain and France, under Disney's Buena Vista Home Entertainment label. Although \"Laputa\" was removed from the title, it appeared on the rear cover of the DVD, and was used throughout the film, without modification.The film's full name was later restored in Britain, in February 2006, when Optimum Asia – a division of London-based Optimum Releasing – acquired the UK distribution rights to the Studio Ghibli collection.Additionally, during the late 1980s and early 1990s, the original English dub (the older, non-Streamline dub, or the pre-Disney dub) was screened in the UK, as an art house film, under the alternative title Laputa: The Flying Island. It was shown at least twice on British television, but some scenes were cut.[13]","language":"Japanese","cinematography":"Hirokata Takahashi","production_company":"Studio Ghibli","directed_by":"Hayao Miyazaki","laputa:_castle_in_the_sky":"Japanese theatrical poster for Laputa: Castle in the Sky","japanese":"天空の城ラピュタ","Soundtrack":"All compositions by Joe Hisaishi.","Differences between versions":"Although the plot and much of the script was left intact, Disney's English dub of Laputa: Castle in the Sky contains some changes. These differences do not appear in the original dub.Although all these alterations were approved by Studio Ghibli and Miyazaki, there have been a number of critics who called them into question. On the other hand, Miyazaki himself is said to have approved of Hisaishi's reworking;[15] his compliments were echoed by several reviewers.[16][17][18] The 2010 DVD re-release (later ported to a 2012 U.S. Blu-ray release) omits most of these changes. The new score has been removed, having been replaced by Hisaishi's original synthesizer score, the sound effects are reverted to the original Japanese production, and a lot of the added dialogue has been eliminated, making the dub closer to the original Japanese. Additionally, the subtitles on the newer release are mostly dubtitles. (Oddly, however, the Japanese, Australia, and UK Blu-rays contain the newer score on the Disney dub track — minus the extra dialogue and newer sound effects — as well as literal, properly timed subtitles.)","release_dates":"August 2, 1986 (1986-08-02)|||||","hepburn":"Tenkū no Shiro Rapyuta","produced_by":"Isao Takahata","starring":"Keiko Yokozawa Mayumi Tanaka Kotoe Hatsui Minori Terada","running_time":"126 minutes","music_by":"Joe Hisaishi","edited_by":"Takeshi Seyama Yoshihiro Kasahara","written_by":"Hayao Miyazaki"}