{"country":"United States","distributed_by":"Lorimar Film Entertainment (Former) Warner Bros. (Current)","Plot":"The story prologues with two auto-worker union officials addressing the recent death of a peer. Within moments, both are brutally murdered by a group of shadowy, almost supernatural killers that seem to move, disappear and reappear at will during a daring skyscraper assault.Detroit Michigan Police Detective Sergeant Jericho Jackson, known locally as \"Action Jackson\", was a celebrated lieutenant in the police force but demoted (nearly two years prior) because of a case he headed involving the criminal son of successful businessman Peter Anthony Dellaplane. The fall out over the case also collapsed Jackson's marriage and put the law school educated, star athlete and hometown hero at odds with the public. Even after his demotion, Jackson's continued interest leads to conflicts with his commander, Captain Armbruster, but he begins investigating Dellaplane's professional exploits, eventually uncovering the string of murdered trade union members connected to Dellaplane's company. He discovers Dellaplane is secretly maneuvering his way into a \"behind the throne\" seat of power and has been using the group of assassins, dubbed The Invisible Men, to kill uncooperative union officials.Jackson is assisted by Dellaplane's mistress, Sydney Ash, a local lounge singer and heroin addict whom the businessman has assisted financially. He is eventually framed for murdering Dellaplane's wife Patrice (killed by her husband after she discovers his plot and goes to Jackson for help). On the run from the police, Jackson is helped by friends from his old neighborhood, kid Sable, a local hotel owner and retired professional boxer, and Dee, a lively local hairdresser (and gossip informant) who gives Jackson a way to discreetly get to Dellaplane.Jackson and Sydney arrange a meeting with Dellaplane's figurehead replacement for the auto union, unaware that The Invisible Men had been tracking them and allowed the meeting so that Dellaplane could confront Jackson face to face. Before he leaves with Sydney in tow, Dellaplane arrogantly reveals the reasoning for his plans and intends to exact it using Jackson as a pawn. He intends to kill Jackson, put one of The Invisible Men in his place, have him kill an important union official, and then have Jackson's charred body discovered after he failed his getaway. \"Dellaplane, one of these days you are really going to piss me off,\" Jackson calls after his nemesis as he leaves with all but three of The Invisible Men. \"We're going to have ourselves a little barbecue,\" The Invisible Men's leader claims as they prepare to burn Jackson alive. But Jackson is suddenly rescued by Sydney's bodyguard \"Big\" Edd and the pair kill all three Invisible Men. (\"Barbecue, huh? How do you like your ribs?\" Jackson asks the leader before he kills him with his own grenade launcher.)Jackson's escape leads to a fight at Dellaplane's mansion during the birthday party for the union leader Dellaplane plans to have assassinated. During the melee, the other members of The Invisible Men are killed by Jackson (who personally deals with the one set to make the kill and frame him), Edd, Jackson's old partner Detective Kotterwell, and a rehabilitated young thief named Albert. However, Dellaplane takes Sydney hostage and hides inside a bedroom in his mansion. After being given a gun by Kotterwell, Jackson commanders a car being displayed at the party, crashes into the house, kills Dellaplane's butler/bodyguard by ramming him into a wall as the latter fires at him, and roars upstairs to crash into the room Dellaplane is holding Sydney in. After a brief standoff, Dellaplane, (a trained martial artist) challenges Jackson to hand-to-hand combat. At first Dellaplane has the upper hand, but after ramming Jackson into a car window, he is abruptly shoved back by Jackson, who turns and shouts \"Now you've pissed me off!\" Jackson proceeds to thrash Dellaplane. In desperation, Dellaplane goes for his gun, only for Jackson to seize his own and engage in a crossfire exchange, with Jackson killing Dellaplane and receiving a wound in the shoulder in return. Captain Armbruster arrives with reinforcements, informs Jackson that he wants a full report on his desk \"in the morning\"...and calls Jackson \"Lieutenant.\" Sydney soon reveals she plans to go \"cold turkey\" off of heroin, promising Jackson can have her \"on Thanksgiving.\" Jackson replies, \"Can I have you any sooner?\" Sydney giggles and the two kiss passionately as the screen fades to black.","language":"English","Reception":"While successful at the box office,[5][6] the movie received a negative reception from critics.[7][8][9]Weathers said he hoped the film would become a franchise \"but Lorimar sold the lot to Sony and sold the library to Warner Bros., and that was that. It never resurfaced again, unfortunately.\"The film wasn't well received, and scored a 29% on Rotten Tomatoes, and a 5.7/10 on imdb. But was an OK box office success, grossing $20 million on a $8 million budget, and made another $45 million in VHS sales.[2]","box_office":"$20,256,975","cinematography":"Matthew F. Leonetti","production_company":"Silver Pictures","directed_by":"Craig R. Baxley","Soundtrack":"The Action Jackson soundtrack features new music by Sister Sledge, The Pointer Sisters, Vanity, and Herbie Hancock.[4] Vanity's two songs, \"Faraway Eyes\" and \"Undress,\" were produced by musician Jesse Johnson.","release_dates":"February 12, 1988 (1988-02-12)|||||","Production":"Carl Weathers later called the film:A creation that came about when I was doing Predator and talking to Joel Silver, who loved blaxploitation movies. Joel said, “Well, you know, why don’t you put something together?” So during that time of shooting down in Puerto Vallarta, I created this story and came up with this guy — or at least this title —Action Jackson. And Joel found a writer [who] wrote the screenplay, and that was it. We got it made.[2]In 1990 Weathers starred in Dangerous Passion, an action film, which was released in Germany under the title Action Jackson 2, although it did not relate to the original film.[3]","produced_by":"Joel Silver","starring":"Carl Weathers|Craig T. Nelson|Vanity|Sharon Stone|Thomas F. Wilson|","running_time":"96 minutes","action_jackson":"Theatrical release poster","music_by":"Herbie Hancock Michael Kamen","edited_by":"Mark Helfrich","written_by":"Robert Reneau","budget":"$7 million"}