{"based_on":"A Captain's Duty  by Richard Phillips Stephan Talty","Cast":"Uncredited:","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Billy Ray","Plot":"Richard Phillips (Tom Hanks) takes command of the MV Maersk Alabama, an unarmed container ship from the Port of Salalah in Oman, with orders to sail through the Gulf of Aden to Mombasa, Kenya. Wary of pirate activity off the coast of the Horn of Africa, he and First Officer Shane Murphy (Michael Chernus) order strict security precautions on the vessel and carry out practice drills. During a drill, the vessel is chased by Somali pirates in two skiffs, and Phillips calls for help. Knowing that the pirates are listening to radio traffic, he pretends to call a warship, requesting immediate air support. One skiff turns around in response, and the other – manned by four heavily armed pirates led by Abduwali Muse (Barkhad Abdi) – loses engine power trying to steer through the Maersk Alabama's wake.The next day Muse's skiff, now fitted with two outboard engines, returns with the same four pirates aboard. Despite the best efforts of Phillips and his crew, the pirates secure their ladder to the Maersk Alabama. As they board, Phillips tells the crew to hide in the engine room and allows himself to be captured. He offers Muse the $30,000 in the ship's safe, but Muse's orders are to ransom the ship and crew in exchange for millions of dollars of insurance money from the shipping company. While they search the ship, Murphy sees that the youngest pirate Bilal (Barkhad Abdirahman) does not have sandals and tells the crew to line the engine room hallway with broken glass. Chief Engineer Mike Perry (David Warshofsky) cuts power to the ship, plunging the lower decks into darkness. Bilal cuts his feet when they reach the engine room, and Muse continues to search alone. The crew members ambush Muse and arrange to release him into a lifeboat to get the intruders off the ship. However, the pirates refuse to release Phillips, and the lifeboat launches with all five of them on board.As the lifeboat heads for the shore, tensions flare between the pirates as they run low on the herb stimulant khat and lose contact with their mother ship. Najee (Faysal Ahmed) becomes agitated and tries to convince the others to kill Phillips. They are later intercepted by the U.S. Navy destroyer USS Bainbridge. The Bainbridge's captain Frank Castellano (Yul Vazquez) is ordered to prevent the pirates from reaching the mainland by any means necessary. Even when additional ships arrive, Muse asserts that he has come too far and will not surrender. The negotiators are unable to change his mind and a DEVGRU SEAL team parachutes in to intervene, while Phillips makes an unsuccessful attempt to escape from the lifeboat.While three SEAL marksmen get into positions, Castellano and the SEALs continue to try to find a peaceful solution, eventually taking the lifeboat under tow. Muse agrees to board the Bainbridge, when he is told that his clan elders have arrived to negotiate Phillips's ransom. In the lifeboat, Najee decides to take full control; the pirates tie up Phillips and blindfold him, and the Bainbridge's crew stops the tow. As the pirates are about to shoot Phillips, the marksmen get three clear shots and simultaneously kill the pirates. On board the Bainbridge, Muse is taken into custody and arrested for piracy. Phillips is rescued and treated. He is in shock and disoriented, but he thanks the rescue team for saving his life.","language":"English Somali","box_office":"$218.8 million[2]","Historical accuracy":"In a New York Post article, some of the crew members of the Maersk Alabama accused the film of being inaccurate in facts and the portrayal of Phillips, claiming that Phillips was not as heroic as the film depicts him.[57]Mike Perry, the chief engineer of the Maersk Alabama, also asserted in a CNN interview that the film does not tell the true story.[58]Despite complaints of inaccuracy with how the film portrays the events surrounding the hijacking, the film's director, Paul Greengrass, publicly stated that he \"stands behind the authenticity of Captain Phillips [...] at the end of the day, it is easy to make anonymous accusations against a film [...] but the facts are clear [...] Captain Phillips' ship was attacked, and the ship and the crew and its cargo made it safely to port with no injuries or loss of life [...] That's the story we told, and it's an accurate one.\"[59]In an interview with Vulture published on October 13, 2013, Phillips' first mate, Shane Murphy, stated that he was satisfied with how the movie portrayed both Phillips and himself, and stated that he was only disappointed that the film didn't show footage of the crews' families at home or the president's comments on the hijacking.[60]","cinematography":"Barry Ackroyd","production_company":"Scott Rudin Productions Michael De Luca Productions Trigger Street Productions","directed_by":"Paul Greengrass","captain_phillips":"Theatrical release poster","release_dates":"September 27, 2013 (2013-09-27) (NYFF)|October 11, 2013 (2013-10-11) (United States)||||","Production":"Shortly after the publication of Richard Phillips' memoir A Captain's Duty in 2010, Sony Pictures optioned the film rights. In March 2011, actor Tom Hanks attached himself to the project after reading a draft of the screenplay by Billy Ray.[10] During the following June, director Paul Greengrass was offered the helm of the then-untitled film adaptation.[11] A worldwide search subsequently began to find the film's supporting Somali cast. From this search, Barkhad Abdi, Barkhad Abdirahman, Faysal Ahmed, and Mahat M. Ali were chosen from among more than 700 participants at a 2011 casting call at the Brian Coyle Community Center in Cedar-Riverside, Minneapolis. According to the search casting director, Debbie DeLisi, the four actors were selected because they were \"the chosen ones, that anointed group that stuck out.\"[12]Producers visited the National Navy UDT-SEAL Museum to see the bullet-scarred, five-ton fiberglass lifeboat aboard which the pirates held Capt. Phillips hostage so that they could accurately re-create the boat and interiors for the set.[14] They were also able to view an example of the Boeing Insitu ScanEagle UAV, used to monitor the crisis,[15] as well as the Mark 11 Mod 0 (SR-25) sniper rifle (the type used by the U.S. Navy SEALs), both also on display at the museum.Principal photography for Captain Phillips began on March 26, 2012.[16] Filming took place off the coast of Malta in the Mediterranean Sea.[4][17] Nine weeks were spent filming aboard the Alexander Maersk, a container ship identical to the Maersk Alabama; it was chartered on commercial terms.[18] The USS Truxtun, an Arleigh Burke-class destroyer and sister ship of USS Bainbridge, served as a set piece in the film.[19]The film score to Captain Phillips was composed by Henry Jackman.[20] A soundtrack album for the film was released in physical forms on October 15, 2013 by Varèse Sarabande.[21] Additional songs featured in the film include:[22]","produced_by":"Scott Rudin Dana Brunetti Michael De Luca","starring":"Tom Hanks Barkhad Abdi","running_time":"134 minutes[1]","music_by":"Henry Jackman","edited_by":"Christopher Rouse","Release":"Captain Phillips grossed $107.1 million in North America and $111.7 million in other countries for a worldwide total of $218.8 million, against its budget of $55 million.[2]The film grossed $25.7 million in its opening weekend, finishing second place at the box office behind Gravity ($43.2 million).Captain Phillips premiered on September 28, 2013, opening the 2013 New York Film Festival. The film was praised for its direction, screenplay, production values, cinematography, and the performances of Tom Hanks and Barkhad Abdi.[23][24][25]Captain Phillips received critical acclaim and has a \"certified fresh\" score of 93% on Rotten Tomatoes based on 238 reviews with an average rating of 8.3 out of 10. The critical consensus states: \"Smart, powerfully acted, and incredibly intense, Captain Phillips offers filmgoers a Hollywood biopic done right—and offers Tom Hanks a showcase for yet another brilliant performance.\"[26] The film also has a score of 83 out of 100 on Metacritic based on 48 reviews indicating \"Universal Acclaim\".[27]The film was nominated for 4 Golden Globes, including Best Picture (Drama), Best Actor in a Drama (Hanks), Best Supporting Actor (Abdi) and Best Director (Greengrass).[28] It did not win in any of the categories.[29] The film was also nominated for 9 BAFTA Awards, including Best Film, Best Director (Greengrass), Best Actor (Hanks), Best Supporting Actor (Abdi) and Best Adapted Screenplay.[30] Abdi won the film's only BAFTA for Best Supporting Actor.[31] The film was also nominated for six Academy Awards; Best Picture, Best Supporting Actor (Abdi), Best Adapted Screenplay, Best Film Editing, Best Sound Mixing and Best Sound Editing.[5] It did not win in any of the categories.[6]Various critics have named the film as one of the best of 2013.[32]Captain Phillips was released on Blu-ray Disc and DVD on January 21, 2014.[33]","budget":"$55 million"}