{"based_on":"Confessions of a Teenage Drama Queen  by Dyan Sheldon","confessions_of_a_teenage_drama_queen":"Theatrical release poster","country":"United States","distributed_by":"Buena Vista Pictures","screenplay_by":"Gail Parent","Plot":"Mary Elizabeth \"Lola\" Cep (Lindsay Lohan) is a 15-year-old girl who grew up in New York City and wants desperately to be a famous Broadway actress. Lola narrates the story. Much to her annoyance, she moves with her family to the suburbs of Dellwood, New Jersey, but she confidently tells the audience, \"A legend is about to be born. That legend would be me.\"At school, Lola makes friends with an unpopular girl, Ella Gerard (Alison Pill), who shares her love for the rock band Sidarthur. Lola idolizes the band's lead singer Stu Wolff (Adam Garcia). She also meets Sam, a cute boy who takes a liking to her, and makes enemies with Carla Santini (Megan Fox), the most popular girl in school.When Lola auditions for the school play, a modernized musical version of Pygmalion called \"Eliza Rocks\", she is chosen over Carla to play Eliza, and Carla promises to make her life miserable. Lola also beats Carla on a dancing video game at an arcade, where Carla reveals that she has tickets to the farewell concert of Sidarthur, who recently decided to break up. Afraid of being one-upped by Carla, Lola falsely claims that she and Ella have tickets, too. She loses her chance to buy tickets and new clothes when her mother takes away her allowance, and the concert is sold out by the time she persuades Ella to pay for the tickets. But Lola explains that they can buy tickets from a scalper, and she gets Sam to sneak Eliza's dress out of the costume room for her to wear at the concert.On the night of the concert, Lola and Ella take a train to New York City, but Lola loses the money for the tickets, and her plan to sneak into the concert doesn't work. Lola and Ella finally give up and walk through the city to Stu's after-show party. When they get there, Stu stumbles drunkenly out of the building and passes out in an alley. The two girls take him to a diner to sober him up, but he gets in trouble, and they end up at a police station, where Lola gives her father's New York City address.At this point, Lola's dishonesty becomes a problem. When she met Ella, she tried to impress her by telling her a dramatic story about her father dying years earlier. Ella highly values honesty, so she becomes infuriated when she discovers that Lola's story was a lie. After Lola's father arrives, and they explain what happened, Stu gratefully takes them all back to the party, where Ella forgives Lola for lying, and the two girls see Carla, who sees them as well and looks upset. Lola talks with Stu about his work but is disappointed to discover that he is a drunk.Back at school, Carla humiliates Lola by denying that she saw Lola or Ella at the party and calling Lola a liar. None of the other students believe Lola's story about being arrested with Stu and leaving her necklace at his house.Afterward, Lola goes home, depressed, and refuses to perform in the play, but she is spurred on by Ella's encouragement and arrives backstage just in time to prevent Carla from taking over her part. As she is about to go on stage, her mother wishes her good luck and finally calls her by her nickname, \"Lola\". The modernist interpretation of Pygmalion (Eliza Rocks) ensues. After a great performance that brings a standing ovation, the cast goes to an after-party at Carla's house, where Stu arrives to see Lola. Carla tries to save herself from humiliation by saying he is there to see her but is proved wrong when Stu gives Lola her necklace in front of everyone. As Carla's lies become apparent, she backs away from the crowd on the verge of tears and falls into a fountain, greeted by everyone's laughter. In a conciliatory gesture, Lola helps her up, and Carla accepts defeat. After dancing with Stu, Lola dances with Sam, and they eventually share a kiss.","language":"English","Reception":"Based on 88 reviews collected by Rotten Tomatoes, the film received an average 13% overall approval rating.[3] Dennis Harvey of Variety magazine commented in his review that \"Based on Dyan Sheldon's popular youth fiction, Confessions of a Teenage Drama Queen emerges a strained showcase for up-and-comer Lindsay Lohan as a sophisticated Big Apple teen unhappily relocated to New Jersey. Minimally funny comedy feels like a Disney Channel pic that got boosted to theatrical after Lohan scored a hit opposite Jamie Lee Curtis in the Freaky Friday remake. Nonetheless, it should have a lock on the 7- to 12-year-old female demo for a couple weekends before finding longer tube/tape shelf life.\"[4] Ultimate Disney reviewed the DVD saying that it \"doesn't garner a recommendation as a film, and its DVD special features are as breezy and shallow as the movie itself. Lindsay Lohan fans and teenage girls are bound to be the most interested, and they might well enjoy it on the surface as light entertainment. But for others, one viewing may be more than enough.\"[5]","box_office":"$33 million[1]","cinematography":"Stephen H. Burum","production_company":"Walt Disney Pictures","directed_by":"Sara Sugarman","Soundtrack":"The soundtrack was released February 17, 2004 by Hollywood Records and features Lindsay Lohan, Lillix, Simple Plan, and other various artists.","release_dates":"February 20, 2004 (2004-02-20)","Production":"Pre-production began on May 5, 2003, beginning with choreography rehearsals and make-up tests. Produced on a budget of $15,000,000, filming began on June 4. Behind the camera was Welsh director, Sara Sugarman, who was known for directing the television film, Very Annie Mary. While taking place in New Jersey, the film was filmed in Toronto and Oakville, Ontario. Scenes at Dellwood High School were filmed at King City Secondary School in King City and Birchmount Park Collegiate Institute in Scarborough. Mall scenes were filmed at Erin Mills Town Centre in Mississauga. It was also filmed on-location for the scenes in New York City. Scenes involving the train station were filmed at the Watchung Avenue Train Station in Montclair, New Jersey on New Jersey Transit's Montclair-Boonton Line.Originally, the role of Lola was offered to Hilary Duff. After Duff backed out of the film, Freaky Friday's Lindsay Lohan was cast as Lola. \"The part that stuck out to me most about the story was how different Lola is,\" says Lohan. \"She's really interesting. As outgoing as she is, she keeps a lot in and I think it's really good to see how her character develops throughout the story.\" Producer Robert Shapiro says, \"Lindsay Lohan is absolutely a 500-watt bulb. She's delightful to watch, she's a typical teenager, and she's very wise, and all of that comes across in the part of Lola.\"Alison Pill, who was known for co-starring in the Judy Garland-biopic Life with Judy Garland: Me and My Shadows, was cast as Lola's best friend, Ella Girard. \"I think the attraction to play Ella is she changes so completely and goes through this huge transformation from being this girl who's terrified of being herself, and disappointing her parents, and disappointing their expectations, and at the end she says, 'I've just decided to be who I am.'\" An unknown at the time, Megan Fox was cast as Carla Santini, Lola's nemesis (Brittany Gray played Fox's dance double). Eli Marienthal was cast as Sam, Lola's interest in high school and her friend. Marienthal had previously starred in Disney film, The Country Bears. Glenne Headly was cast as Lola's mother, Karen, while Carol Kane was cast as Miss Baggoli, who directs the school's play, Eliza Rocks. Tom McCamus appears as Lola's father, Calum, who is divorced from her mother and lives in New York City.","Box office":"Despite mostly negative critical reception, the film grossed a modest $9.3 million in its opening weekend (February 20–22, 2004), debuting at #2, right behind Adam Sandler's 50 First Dates. The film did fairly well at the box office, grossing $29 million domestically and $33 million worldwide.[1]","produced_by":"Robert Shapiro Jerry Leider","starring":"Lindsay Lohan Adam Garcia Glenne Headly Alison Pill Carol Kane","running_time":"89 minutes","music_by":"Mark Mothersbaugh","edited_by":"Anita Brandt-Burgoyne","budget":"$15 million"}