{"country":"Guinea France","Plot":"Manga and Sory are two young men in love with each other. Manga tells his widowed mother of the relationship, and Sory tells his father. Both parents forbid their sons to see each other again. Sory marries and has a child. Manga's mother turns to witchcraft to cure her son, and he unsuccessfully undergoes a lengthy form of aversion therapy. He meets and becomes engaged to a white woman called Oumou. Both men try to make their heterosexual relationships work but are ultimately drawn back to each other. Manga's mother eventually gives her blessing to the pair and the end of the film sees Sory and Manga driving off together towards an uncertain future.[1][2][3][4][5]","language":"French Mandinkan","Reception":"In 1998, Dakan won the Grand Jury Award for Outstanding Foreign Narrative Feature at L.A. Outfest.[13] Writing for Variety, David Stratton called it \"a trailblazer in the African context\" and praised the use of traditional music.[10] He said that Western audiences might find the story \"slight\".[10] In The New York Times, Anita Gates said that the film lacks subtlety but that within its context, it is significant.[14]","Background and production":"Dakan has been variously described as the first West African film, the first Sub-Saharan film and the first film by a Black African to deal with homosexuality.[2][6][7][8] It depicts the conflict between homosexual characters and their families in a society where homosexuality is taboo.[8] According to Monica Bungaro in \"Male Feminist Fiction\", the film suggests that homosexuality is in fact natural and widespread.[3] Sory appears to be attractive to several other young men, and the relationship between Sory and Manga is accepted by their classmates.[3][9]\"I made this film to pay tribute to those who express their love in whatever way they feel it, despite society's efforts to repress it.\"Camara started making Dakan with funding from the governments of France and Guinea. When the Guinean government discovered that the subject-matter was homosexuality, it withdrew funding.[1] Camara used his own money to fund the project and received some financial support from French television network La Sept.[1] Filming faced disruption from angry protesters.[1][2] The cast consisted of local Guinean actors, and one French actress.[9] Camara originally planned to play the part of Manga himself, but ended up playing Sori's father.[5] The soundtrack features the music of Guinean musician Sory Kandia Kouyate.[9]","cinematography":"Gilberto Azevedo","directed_by":"Mohamed Camara","dakan":"Movie poster","release_dates":"May 1997 (1997-05) (Cannes)|||||","Distribution":"Dakan premièred at the 1997 Cannes Film Festival during Directors' Fortnight.[10] It played at several other film festivals including the 1998 New York Lesbian & Gay Film Festival, the San Francisco International Lesbian & Gay Film Festival and the 1999 Panafrican Film and Television Festival of Ouagadougou in Burkina Faso.[8][10] It opened in French theatres on July 7, 1999. It was released onto Region 2 DVD by Éclair on September 22, 2005.[11] In 2006 Dakan was shown at the Museum of Modern Art's \"Another Wave: Global Queer Cinema\" exhibition in New York City.[12]","produced_by":"René Féret","starring":"Cécile Bois Mamady Mory Camara Koumba Diakite Aboucar Touré","running_time":"87 minutes","music_by":"Kouyate Sory 'Douga' Kandia","edited_by":"Dos Santos","written_by":"Mohamed Camara"}