{"country":"United States","distributed_by":"TriStar Pictures","Plot":"Walter Davis (Willis) allows his brother, Ted (Phil Hartman), to set him up on a blind date with his wife's cousin, Nadia (Basinger).Nadia is shy and the two experience some awkwardness. However, as the evening goes on, Nadia begins to drink and behave in a wild manner. (A warning about her behavior under the influence of alcohol had been given by Ted but disregarded by Walter, thinking it was a joke.)To make matters worse, Nadia's jealous ex-boyfriend, David (John Larroquette), shows up and exacerbates the situation by stalking the couple all night, assaulting and attempting to assault Walter several times, even ramming Walter's car with his own.Walter ends up being driven insane by Nadia's mishaps and David's pursuit; she gets him fired at the dinner; his car is destroyed; after wreaking havoc at a party, Walter gets arrested for menacing David with a mugger's revolver. He even forces David to do a moonwalk before firing at the frightened man's feet.Nadia posts $10,000 in bail and agrees to marry David if he will help Walter avoid prison time. Before the wedding, Walter gives Nadia chocolates filled with brandy. Walter attempts to stop the wedding. Chaos ensues.","language":"English","Reception":"Blind Date holds a 21% approval rating on Rotten Tomatoes based on 24 reviews.[2]Roger Ebert of the Chicago Sun-Times gave the film two and a half stars out of four and wrote, \"There are individual moments in this movie that are as funny as anything Edwards has ever done, but they're mostly sight gags and don't grow out of the characters. The characters, alas, are the problem. Willis plays a nerd so successfully that he fades into the shrubbery and never really makes us care about his fate. Basinger, so ravishing in most of her movies, looks dowdy this time. Her hair is always in her eyes, and her eyes are her best feature. [...] Most of the time I wasn't laughing. But when I was laughing, I was genuinely laughing - there are some absolutely inspired moments.\"[3]","blind_date":"Theatrical release poster","box_office":"$39.3 million[1]","cinematography":"Harry Stradling Jr.","directed_by":"Blake Edwards","Soundtrack":"The soundtrack to the motion picture was released by Rhino Records in 1987.","release_dates":"March 27, 1987 (1987-03-27)|||||","Production":"The film was originally intended for the recently married Madonna and Sean Penn, but both backed out after the project failed to attract a director. The screenplay was re-written and this draft was given to Edwards. He agreed to direct contingent he be allowed re-write that draft. The studio agreed. At that point, Penn dropped out and Madonna met with Edwards and she dropped out as well. The movie was re-cast with Willis and Basinger.Billy Vera & The Beaters appear in the bar scene, playing several songs.","produced_by":"Tony Adams","starring":"Kim Basinger|Bruce Willis|John Larroquette|William Daniels|","running_time":"95 minutes","music_by":"Henry Mancini","edited_by":"Robert Pergament","written_by":"Dale Launer"}