{"based_on":"\"The Wisdom of Eve\"  by Mary Orr","Cast":"Notes","Adaptations":"The first radio adaptation was broadcast on the Lux Radio Theatre on NBC on October 1, 1951 starring Bette Davis, Gary Merrill and Anne Baxter.[29]A second radio version of All About Eve starring Tallulah Bankhead as Margo Channing was presented on NBC's The Big Show by the Theatre Guild of the Air on November 16, 1952. Bankhead and many contemporary critics felt that the characterization of Margo Channing was patterned on her, a long-rumored charge denied by both Mankiewicz and Davis,[30] but attested by costume designer Edith Head.[31] Additionally, Bankhead's rivalry with her understudy (Lizabeth Scott) during the production of The Skin of Our Teeth [32] is cited as an alternative hypothesis for the origin of Mary Orr's The Wisdom of Eve, the original short story that formed the basis for the film. [33][34] Ironically, Bette Davis played three roles on film that had been originated by Tallulah Bankhead — Dark Victory, Jezebel and The Little Foxes, much to Bankhead's chagrin. Bankhead and Davis were considered to be somewhat similar in style.[35] Ironically, several decades later Davis would call Channing \"the essence of a Tallulah Bankhead kind of actress\" in an interview with Barbara Walters.[36] The production is notable in that Mary Orr, of The Wisdom of Eve, played the role of Karen Richards. The cast also featured Alan Hewitt as Addison DeWitt (who narrated), Beatrice Pearson as Eve Harrington, Don Briggs as Lloyd Richards, Kevin McCarthy as Bill Samson, Florence Robinson as Birdie Coonan, and Stefan Schnabel as Max Fabian.[35]In 1970, All About Eve was the inspiration for the stage musical Applause, with book by Betty Comden and Adolph Green, lyrics by Lee Adams, and music by Charles Strouse. The original production starred Lauren Bacall as Margo Channing, and it won the Tony Award for Best Musical that season. It ran for four previews and 896 performances at the Palace Theatre on Broadway. After Bacall left the production, she was replaced by Anne Baxter in the role of Margo Channing.","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Joseph L. Mankiewicz","Plot":"At an awards dinner, Eve Harrington (Anne Baxter)—the newest and brightest star on Broadway—is being presented the Sarah Siddons Award for her breakout performance as Cora in Footsteps on the Ceiling. Theatre critic Addison DeWitt (George Sanders) observes the proceedings and, in a sardonic voiceover, recalls how Eve's star rose as quickly as it did.The film flashes back a year. Margo Channing (Bette Davis) is one of the biggest stars on Broadway, but despite her success she is bemoaning her age, having just turned forty and knowing what that will mean for her career. After a performance one night, Margo's close friend Karen Richards (Celeste Holm), wife of the play's author Lloyd Richards (Hugh Marlowe), meets besotted fan Eve Harrington in the cold alley outside the stage door. Recognizing her from having passed her many times in the alley (as Eve claims to have seen every performance of Margo's current play, Aged in Wood), Karen takes her backstage to meet Margo. Eve tells the group gathered in Margo's dressing room—Karen and Lloyd, Margo's boyfriend Bill Sampson (Gary Merrill), a director who is eight years her junior, and Margo's maid Birdie (Thelma Ritter)—that she followed Margo's last theatrical tour to New York after seeing her in a play in San Francisco. She tells a moving story of growing up poor and losing her young husband in the recent war. Moved, Margo quickly befriends Eve, takes her into her home, and hires her as her assistant, leaving Birdie, who instinctively dislikes Eve, feeling put out.Eve is gradually shown to be working to supplant Margo, scheming to become her understudy behind her back, driving wedges between her and Lloyd and Bill, and conspiring with an unsuspecting Karen to cause Margo to miss a performance. Eve, knowing in advance that she will be the one appearing that night, invites the city's theatre critics to attend that evening's performance, which is a triumph for her. Eve tries to seduce Bill, but he rejects her. Following a scathing newspaper column by Addison, Margo and Bill reconcile, dine with the Richardses, and decide to marry. That same night at the restaurant, Eve blackmails Karen into telling Lloyd to give her the part of Cora, by threatening to tell Margo of Karen's role in Margo's missed performance. Before Karen can talk with Lloyd, Margo announces to everyone's surprise that she does not wish to play Cora and would prefer to continue in Aged in Wood. Eve secures the role and attempts to climb higher by using Addison, who is beginning to doubt her. Just before the premiere of her play at the Shubert in New Haven, Eve presents Addison with her next plan: to marry Lloyd, who, she claims, has come to her professing his love and his eagerness to leave his wife for her. Now, Eve exults, Lloyd will write brilliant plays showcasing her. Unseen but mentioned in dialogue, Karen has begun to suspect Eve as a threat to her own marriage to Lloyd, and so she and Addison meet for lunch and help each other put the pieces about Eve together. Addison is infuriated that Eve has attempted to use him and reveals that he knows that her back story is all lies. Her real name is Gertrude Slojinski, she was never married, and she had been paid to leave her hometown over an affair with her boss, a brewer in Wisconsin. Addison blackmails Eve, informing her that she will not be marrying Lloyd or anyone else; in exchange for Addison's silence, she now \"belongs\" to him.The film returns to the opening scene in which Eve, now a shining Broadway star headed for Hollywood, is presented with her award. In her speech, she thanks Margo, Bill, Lloyd and Karen with characteristic effusion, while all four stare back at her coldly. After the awards ceremony, Eve hands her award to Addison, skips a party in her honor, and returns home alone, where she encounters a young fan (Barbara Bates)—a high-school girl—who has slipped into her apartment and fallen asleep. The young girl professes her adoration and begins at once to insinuate herself into Eve's life, offering to pack Eve's trunk for Hollywood and being accepted. \"Phoebe\", as she calls herself, answers the door to find Addison returning with Eve's award. In a revealing moment, the young girl flirts daringly with the older man. Addison hands over the award to Phoebe and leaves without entering. Phoebe then lies to Eve, telling her it was only a cab driver who dropped off the award. While Eve rests in the other room, Phoebe dons Eve's elegant costume robe and poses in front of a multi-paned mirror, holding the award as if it were a crown. The mirrors transform Phoebe into multiple images of herself, and she bows regally, as if accepting the award to thunderous applause, while triumphant music plays.","language":"English","box_office":"$8.4 million[4]","cinematography":"Milton R. Krasner","directed_by":"Joseph L. Mankiewicz","Response":"All About Eve received overwhelmingly positive reviews from critics upon its release on October 13, 1950 at a New York City premiere. The film's competitor, Sunset Boulevard, released the same year, drew similar praise, and the two were often favorably compared. Film critic Bosley Crowther of The New York Times loved the film, stating it was \"a fine Darryl Zanuck production, excellent music and on air ultra-class complete the superior satire\".[10]Film critic Roger Ebert of the Chicago Sun Times praised the film, saying Bette Davis' character \"veteran actress Margo Channing in All About Eve was her greatest role\".[11] A collection of reviews from the film's release are stored on the website Rotten Tomatoes.com, and All About Eve has garnered 100% positive reviews there, making it \"Certified fresh\". Boxoffice.com stated that it \"is a classic of the American cinema – to this day the quintessential depiction of ruthless ambition in the entertainment industry, with legendary performances from Bette Davis, Anne Baxter and George Sanders anchoring one of the very best films from one of Hollywood's very best Golden Era filmmakers: Joseph L. Mankiewicz. It is a film that belongs on every collector's shelf – whether on video or DVD. It is a classic that deserves better than what Fox has given it.\"[12]Critics and academics have delineated various themes in the film. Rebecca Flint Marx, in her Allmovie review, notes the antagonism that existed between Broadway and Hollywood at the time, stating that the \"script summoned into existence a whole array of painfully recognizable theatre types, from the aging, egomaniacal grand dame to the outwardly docile, inwardly scheming ingenue to the powerful critic who reeks of malignant charm.\"[13] Roger Ebert, in his review in The Great Movies, says Eve Harrington is \"a universal type\", and focuses on the aging actress plot line, comparing the film to Sunset Boulevard.[14] Similarly, Marc Lee's 2006 review of the film for The Daily Telegraph describes a subtext \"into the darker corners of show business, exposing its inherent ageism, especially when it comes to female stars.\"[15] Kathleen Woodward's 1999 book, Figuring Age: Women, Bodies, Generations (Theories of Contemporary Culture), also discusses themes that appeared in many of the \"aging actress\" films of the 1950s and 1960s, including All About Eve. She reasons that Margo has three options: \"To continue to work, she can perform the role of a young woman, one she no longer seems that interested in. She can take up the position of the angry bitch, the drama queen who holds court (the deliberate camp that Sontag finds in this film). Or she can accept her culture's gendered discourse of aging which figures her as in her moment of fading. Margo ultimately chooses the latter option, accepting her position as one of loss.\"[16]Professor Robert J. Corber, who has studied homophobia within the cultural context of the Cold War in the United States, posits that the foundational theme in All About Eve is that the defense of the norms of heterosexuality, specifically in terms of patriarchal marriage, must be upheld in the face of challenges from female agency and homosexuality.[17] The nurturing heterosexual relationships of Margo and Bill and of Karen and Lloyd serve to contrast with the loveless relationship predation and sterile careerism of the homosexual characters, Eve and Addison.[18] Eve uses her physical femininity as a weapon to try to break up the marriages of both couples, and Addison's extreme cynicism serves as a model of Eve's future. Even film reviewer Kenneth Geist, despite being critical of the emphasis that Sam Staggs' book All About All About Eve places on the film's homosexual elements, nonetheless acknowledged that Eve's lesbianism seemed apparent; specifically, Geist states that \"manifestations of Eve’s lesbianism are only twice briefly discernible\".[19] Geist asserted that Mankiewicz \"was highly contemptuous of both male and female homosexuals\",[19] although Mankiewicz himself suggested otherwise in an interview in which he argued that society should \"drop its vendetta against them\".[20]Homosexuality was often linked to Communism during the Cold War's Lavender Scare and critics have written about film's subtle, yet central, Cold War narrative. The fair amount of subtlety employed in All About Eve is seen as primarily being due to Production Code restrictions on the depiction of homosexuals in the media during this time.[17][21] However, notwithstanding those restrictions, Corber cites the film as but one example of a recurrent theme within American film of the homosexual as an emotionally bereft predator.[17] The documentary The Celluloid Closet also affirms this theme to which Corber refers, including citing numerous other film examples from the same Production Code time period in which All About Eve was made.[17][22]Another important theme of the film, in terms of war politics and sexuality, involves the post-World War II pressure placed upon women to acquiesce agency. This pressure to resume \"traditional\" female roles is especially illustrated in this film in the contrast between Margo's mockery of Karen Richards for being a \"happy little housewife\" and her lengthy and inspired monologue, as a reformed woman later, about the virtuousness of marriage, including how a woman is not truly a woman without having a man beside her. This submissive and effeminate Margo is contrasted with the theatricality, combativeness, and egotism of the earlier career woman Margo, and the film's two homosexual characters. Margo quips that Eve should place her award \"where her heart should be\", and Eve is shown bereft at the end of the film. At dinner, the two married couples see Eve and Addison in a similarly negative light, with Margo wondering aloud what schemes Eve was constructing in her \"feverish little brain\". Additionally, Eve's utility as a personal assistant to Margo early in the film, which is a subtle construct of a same-sex intimate relationship, is decried by Birdie, the same working-class character who immediately detected the theatricality in Eve's story about her \"husband\". Birdie sees such agency as being unnatural, and the film contrasts its predatory nature (\"studying you like a blueprint\") with the love and warmth of her later reliance upon Bill. The pressure to acquiesce agency and more highly value patriarchy, following the return of men from the war, after having been shown propaganda promoting agency such as Rosie the Riveter and after having occupied traditionally male roles such as bomb-building factory worker, was deemed \"the problem that has no name\" by well-known feminist Betty Friedan.[23]Despite what critics such as Corber have described as the homophobia pervasive in the movie,[17] All About Eve has long been a favored film among gay audiences, likely due to its campy overtones (in part due to the casting of Davis) and its general sophistication. Davis, who long had a strong gay fan base, expressed support for gay men in her 1972 interview with The Advocate.[24][25][26]","Awards and honors":"In 1990, All About Eve was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\"[28] The film received in 1997 a placement on the Producers Guild of America Hall of Fame. The film also has a 100% rating on Rotten Tomatoes. The film has been selected by the American Film Institute for many of their 100 Years lists.When AFI named Bette Davis # 2 on its list of the greatest female American screen legends, All About Eve was the film selected to highlight Davis' legendary career.The film opens with the image of a fictitious award trophy, described by DeWitt as the \"highest honor our theater knows: the Sarah Siddons Award for Distinguished Achievement.\" The statuette is modelled after the famous painting of Siddons costumed as the tragic Muse by Joshua Reynolds, a copy of which hangs in the entrance of Margo's apartment and often visible during the party scene. In 1952, a small group of distinguished Chicago theater-goers began to give an award with that name, which was sculpted to look like the one used in the film. It has been given annually, with past honorees including Bette Davis and Celeste Holm.","release_dates":"October 13, 1950 (1950-10-13)|||||","Production":"The story of All About Eve originated in an anecdote related to Mary Orr by actress Elisabeth Bergner. While performing in The Two Mrs. Carrolls during 1943 and 1944, Bergner allowed a young fan to become part of her household and employed her as an assistant, but later regretted her generosity when the woman attempted to undermine her. Referring to her only as \"the terrible girl\", Bergner related the events to Orr, who used it as the basis for her short story \"The Wisdom of Eve\" (1946). In the story, Orr gives the girl a more ruthless character and allows her to succeed in stealing the older actress' career. Bergner later confirmed the basis of the story in her autobiography Bewundert viel, und viel gescholten (Greatly Admired and Greatly Scolded).In 1949, Mankiewicz was considering a story about an aging actress and, upon reading \"The Wisdom of Eve\", felt the conniving girl would be a useful added element. He sent a memo to Darryl F. Zanuck saying it \"fits in with an original idea [of mine] and can be combined. Superb starring role for Susan Hayward.\" Mankiewicz presented a film treatment of the combined stories under the title Best Performance. He changed the main character's name from Margola Cranston to Margo Channing and retained several of Orr's characters — Eve Harrington, Lloyd and Karen Richards, and Miss Casswell — while removing Margo Channing's husband completely and replacing him with a new character, Bill Sampson. The intention was to depict Channing in a new relationship and allow Eve Harrington to threaten both Channing's professional and personal lives. Mankiewicz also added the characters Addison DeWitt, Birdie Coonan, Max Fabian, and Phoebe.Zanuck was enthusiastic and provided numerous suggestions for improving the screenplay. In some sections, he felt Mankiewicz's writing lacked subtlety or provided excessive detail. He suggested diluting Birdie Coonan's jealousy of Eve so the audience would not recognize Eve as a villain until much later in the story. Zanuck reduced the screenplay by about 50 pages and chose the title All About Eve from the opening scenes in which Addison DeWitt says he will soon tell \"more of Eve ... All about Eve, in fact.\"[6]Among the actresses originally considered to play Margo Channing were Mankiewicz's original inspiration, Susan Hayward, who was rejected by Zanuck as \"too young\", Marlene Dietrich, dismissed as \"too German\", and Gertrude Lawrence, who was ruled out of contention when her lawyer insisted that Lawrence not have to drink or smoke in the film, and that the script would be rewritten to allow her to sing a torch song.[7] Zanuck favored Barbara Stanwyck, but she was not available. Tallulah Bankhead and Ingrid Bergman were also considered, as was Joan Crawford,[8] who was already working on the film The Damned Don't Cry.Eventually, the role went to Claudette Colbert, but when Colbert severely injured her back and was forced to withdraw shortly before filming began, Bette Davis was chosen to replace her.[7] Davis, who had recently ended an 18-year association with Warner Bros. after several poorly received films, immediately accepted the role after realizing it was one of the best she had ever read. Channing had originally been conceived as genteel and knowingly humorous, but with the casting of Davis, Mankiewicz revised the character to be more abrasive. Mankiewicz praised Davis for both her professionalism and the calibre of her performance, but in later years continued to discuss how Colbert would have played the role.Anne Baxter had spent a decade in supporting roles and had won the 1946 Academy Award for Best Supporting Actress for The Razor's Edge. She got the role of Eve Harrington after the first choice, Jeanne Crain, became pregnant. Crain was at the height of her popularity and had established a career playing likable heroines; Zanuck believed she lacked the \"bitch virtuosity\" required by the part and that audiences would not accept her as a deceitful character.The role of Bill Sampson was originally intended for John Garfield or Ronald Reagan. Reagan's future wife Nancy Davis was considered for Karen Richards and Jose Ferrer for Addison DeWitt. Zsa Zsa Gabor actively sought the role of Phoebe without realizing the producers were considering her, along with Angela Lansbury, for Miss Casswell.[citation needed]Mankiewicz greatly admired Thelma Ritter and wrote the character of Birdie Coonan for her after working with her on A Letter to Three Wives in 1949. As Coonan was the only one immediately suspicious of Eve Harrington, he was confident Ritter would contribute a shrewd characterisation casting doubt on Eve and providing a counterpoint to the more \"theatrical\" personalities of the other characters. Marilyn Monroe, relatively unknown at the time, was cast as Miss Casswell, referred to by DeWitt as a \"graduate of the Copacabana School of Dramatic Art\". Monroe got the part after a lobbying campaign by her agent,[9] despite Zanuck's initial antipathy and belief she was better suited to comedy.[citation needed] Angela Lansbury had been originally considered for the role.[9] The inexperienced Monroe was cowed by Bette Davis, and it took 11 takes to complete the scene in the theatre lobby with the star; when Davis barked at her, Monroe left the set to vomit.[9] Smaller roles were filled by Gregory Ratoff as the producer Max Fabian, Barbara Bates as Phoebe, a young fan of Eve Harrington, and Walter Hampden as the master of ceremonies at an award presentation.[6]","produced_by":"Darryl F. Zanuck","starring":"Bette Davis Anne Baxter George Sanders Celeste Holm","running_time":"138 minutes[1]","all_about_eve":"1967 US re-release film poster","music_by":"Alfred Newman","edited_by":"Barbara McLean","budget":"$1.4 million[2][3]"}