{"country":"India","Resemblances with real-life D-Company events":"Company is believed to be an almost-true story based on depictions of the D-Company split between Mumbai crime lords Dawood Ibrahim and Chotta Rajan. It's said that the recruitment of Chandu to Aslam Ali's gang by Mallik was almost identical to Chotta Rajan's introduction to Dawood after Rajan's mentor and boss Bada Rajan died in the early 1980s.Company shows that Mallik's aide Yadav is interviewed by a journalist of Indian news channel Aaj Tak after their assassination attempt on Chandu in Nairobi, Kenya. The theme of this interview is an identical depiction of a real-life interview that Dawood Ibrahim's aide Chotta Shakeel gave to Indian journalist Sheela Bhatt, after an assassination attempt on Chotta Rajan in Bangkok in 2000.[12]Company shows how the Hindi film industry went into trouble after violent split between Chandu and Mallik. Another interview of Chotta Shakeel which was given to the Times of India describes the intense circumstance inside the Mumbai film industry due to gang disputes. It appears that depiction of a dispute in Company — where fictional film star Naved Khan falls between Mallik's and Chandu's disputing gangs and becomes immensely confused — is a reference to a notable interview when Chotta Shakeel almost leaves a clarification of underworld's finance in Indian film industry.[13]The role of Vilas Pandit, the closest aide of Malik who appeared to be the consigliere of Malik's gang, is believed to be a depiction of real-life D-Company aide, counselor and Dawood Ibrahim's confidant Sharad Shetty. After the split between Dawood and Rajan, Shetty was one of very few Hindus left in the mainstream D-Company. Here it can be stated that the fate of Shetty was correctly perceived in Company. Company showed Vilas Pandit was shot to death by Chandu in Hong Kong when Pandit went to Chandu's place for an unprecedented meeting; Chandu misinterpreted his appearance as an attempted hit. Real-life D-Company counselor Sharad Shetty, too, was killed outside a Dubai nightclub, by a hit carried out by Chotta Rajan. Ironically this real-life hit was carried out eight months after the release of Company which depicted a similar incident in the adopted storyline.","Plot":"The film highlights the economics behind running an Indian mafia organization.The story revolves around a young man named Chandu (Chandrakant Nagre) (played by Vivek Oberoi) joining the world of crime in the Mumbai underworld to \"make it big\" someday. Gradually he learns the tricks of the trade and increases the gang's earnings and profits. This leads to his affinity with Malik (Ajay Devgan), the leader of the gang. The film features one cold-blooded murder scene wherein Malik and Chandu kill Saeed and his brother Anis in the rear seat of the car on a chilling rainy day. Thereafter Malik goes on a bloody rampage killing all his opponents, to take the reins of underworld in his hands. In this stage, Malik says a prominent dialogue \"Saab ganda hai par dhanda hai ye\" (Thing are dirty but its business).His rival gang leader and colleague under Aslam's umbrella Sharma, who was in a meeting with police inspector Rathod, is killed off. Inspector Rathod, who once tortured and abused Chandu in jail in early days, is killed at Malik's permission. However, both come at loggerheads during the execution of a contract killing. Chandu stops the deliberate vehicle crash and falls from Malik's favor. The contract was from a politician who tries to use Malik's gang to eliminate a front-runner, a contender for Home Minister's post. The assassination (a staged truck-car collision) takes place in spite of Chandu's emotional misdemeanor since Malik, not relaying on Chandu anymore, gives direct orders. The rift between Chandu and Malik widens due to misunderstandings. The Commissioner of Police, Sreenivasan IPS (Mohanlal) uses the rift to bring the mafia under control. Chandu and Malik end up becoming bitter enemies. After Chandu's retaliation of the assassination of his lifelong friend of one of lieutenants Warsi, two factions of Mumbai's once most powerful gang 'Company' went to a full-scale war.Malik and Chandu killed as many members of each opponent gangs as possible. Sreenivasan, as the police chief of murders due to the war, became criticized greatly. But he and his men knew this war ultimately is shortening the to-do list of his department. Big numbers of button men and lieutenants from the gangs were being killed. The war results in an intense chase sequence shot in Kenya where Malik hires hitmen to kill Chandu. Chandu survives, though he is injured severely. Sreenivasan convinces Chandu to come back to Mumbai and fight his war with Malik by helping the police bring the mafia under control.In the climax, Chandu kills the politician (the mastermind of the contract killing) in prison. At the same time, one of Chandu's aides, Koda Singh, who swore revenge to kill who went against his friend Chandu, shoots Malik point blank to death in Hong Kong. Chandu and Malik came to a truce but Chandu never withdrew his order to Koda to kill Malik. It's not confirmed that whether Chandu has forgotten to withdraw his orders or deliberately kept that on. After the assassination, Sreenivasan notified Chandu and Chandu became tremendously shocked at this news. Koda Singh was arrested by suspicion by Hong Kong police on that day. The ends shows Chandu spending the rest of his life in prison after being persuaded by the Police Commissioner to surrender.","language":"Hindi","Reception":"Company received universal critical acclaim. Alok Kumar of Planet Bollywood gave the movie 9.5 stars out of 10, saying that \"Varma has brought his audience yet another innovative and enjoyable film. Company should prove to be a sound investment of time and effort for all those involved.\"[7]Arpan Panicker of Full Hyderabad gave the movie an 8.0 rating (out of 10) and commented that \"With powerful performances, especially from the three lead actors, Company turns out to be a masterpiece you won't forget in a hurry.\"[8]N.K. Deoshi of ApunkaChoice.com gave 4 out of 5 stars, calling Company \"a sleek, fast-paced thriller replete with violence and authentic Mumbai lingo.\"[9]Taran Adarsh of Bollywood Hungama gave 3 stars out of 5, saying that \"On the whole, COMPANY is amongst Ramgopal Varma's finest works. A stylishly narrated tale, the film will win plaudits and reap a rich harvest at the box-office for its hard-hitting content.\"[10]Ziya us-Salam of IdleBrain gave a \"thumbs-up\" rating and said, \"Watch Company for three reasons. Varma. Mohan Lal. Vivek Oberoi. Mohan Lal in his maiden Hindi film venture, is a class act. As a South Indian cop, his accent comes in handy. Nothing overboard, everything poised about him. Limited dialogues limitless gestures. Then watch Company for Vivek Oberoi. A star son of sorts - character artiste Suresh Oberoi is his father - never once does he give you an impression that he is making his debut here. His gaunt frame, hollow cheek bones and restlessness go well with his role of a new entrant into the underworld who knows no fear, respects no reputations and lives only on some tacit principles.\"[11]","box_office":"₹40 crore (US$5.9 million)","cinematography":"Hemant Chaturvedi","production_company":"Varma Corporation Vyjayanthi Movies","directed_by":"Ram Gopal Varma","Awards":"Filmfare AwardsIIFA AwardsBollywood Movie AwardsStar Screen Awards","Soundtrack":"The soundtrack features 8 songs composed by Sandeep Chowta, with lyrics by Nitin Raikwar, Taabish Romani and Jaideep Sahni.","narrated_by":"Makrand Deshpande","release_dates":"12 April 2002 (India) 14 October 2004 (Austin Film Festival)","produced_by":"Ram Gopal Varma C. Ashwini Dutt Boney Kapoor","starring":"Mohanlal Ajay Devgan Vivek Oberoi Manisha Koirala Seema Biswas Antara Mali Ashraful Haque","running_time":"155 minutes","company":"Film poster","Sequels":"It gained a prequel D, and the fourth installment in the series titled as Satya 2 was released in 2013.","music_by":"Sandeep Chowta","edited_by":"Chandan Arora","written_by":"Jaideep Sahni","budget":"₹10 crore (US$1.5 million)"}