{"country":"United Kingdom","Crew":"The film's opening credits also include 'Sun Tan Lo Tion' (sun tan lotion) as 'Technical Director'.This was the last film featuring Charles Hawtrey.The brothel keeper is played by Olga Lowe, one of the first actresses to work with Sid James when he arrived in the UK in 1946. Lowe was also the actress on stage with James on the night he died in Sunderland.","distributed_by":"The Rank Organisation","Plot":"The film opens with pub landlord and frequent holidaymaker Vic Flange (Sid James) openly flirting with the sassy saucepot Sadie Tompkins (Barbara Windsor) as his battleaxe wife, Cora (Joan Sims), looks on with disdain. Their twitching friend Harry (Jack Douglas) arrives and lets slip that the package holiday Vic has booked to the Mediterranean island Elsbels (a pun on the slang expression \"Hell's Bells\") also includes Sadie, much to Cora's outrage. Cora, who avoids holidays because she hates flying, suddenly decides to accompany her boorish husband on the trip, to ensure he keeps away from Sadie.The next day, Stuart Farquhar (Kenneth Williams), the nasally representative of Wundatours Travel Agency, and his seductive assistant, Moira Plunkett (Gail Grainger), welcome the motley passengers. Among them are the henpecked and love-starved Stanley Blunt (Kenneth Connor) and his prudish, overbearing wife, Evelyn (June Whitfield); a drunken, bowler-hatted mummy's boy, Eustace Tuttle (Charles Hawtrey); brash Scotsman Bert Conway (Jimmy Logan); young and beautiful friends Lily and Marge (Sally Geeson and Carol Hawkins respectively); and Brother Bernard (Bernard Bresslaw), a timid young monk who has difficultly fitting into his new path of life.Unfortunately, upon their arrival they discover their hotel is only half-finished; the builders have just quit suddenly for unspecified reasons, leaving the remaining five floors unfinished. Distraught manager Pepe (Peter Butterworth) desperately tries to run the place in myriad different guises – the manager, the doorman and the porter – and the chef is his shrewish wife, Floella (Hattie Jacques), who battles repeatedly with the temperamental stove while their Lothario son Georgio idles behind the bar. The hotel also hides an assortment of faults and Pepe is soon overrun with complaints: Evelyn finds Mr Tuttle in her bath, Vic discovers Sadie naked in his shower; Lily and Marge's wardrobe has no back to it, allowing them to be accidentally seen by Brother Bernard in the opposite room; sand pours out of Moira's taps; the lavatory drenches Bert. The phone system itself is faulty and the guests end up complaining to each other for much of the time. Nevertheless, Stuart is determined to ensure everyone has a good time.Dinner the first night is foul and made even more unpleasant by the arrival of mosquitos. Although agreeing to play leapfrog with Tuttle, Lily and Marge have their eyes on other things. Marge takes a shine to Brother Bernard, while Lily lures the dashing Nicholas (David Kernan) away from his jealous (and implied gay) friend, Robin (John Clive), and Marge and Bernard develop an innocent romance. Meanwhile, Stanley attempts to seduce Cora whilst his nagging wife is not present, but Cora is more interested in keeping Vic away from Sadie, who grows fond of Bert.While most of the party go off to the village, Stanley ensures his wife is left behind so that he can spend the day attempting to woo Cora. Vic samples a local drink, \"Santa Cecelia's Elixir\", which blesses the drinker with X-ray vision and he is able to see through women's clothing. However, the tourists are arrested for causing a riot at Madame Fifi's (Olga Lowe) local brothel after Vic, Bert and Eustace annoy the girls there; left-behind Evelyn is seduced by Georgio, which leads to her abandoning her frigid manners.In the local prison, Miss Plunkett seduces the Chief of Police, and the tourists are released. Back at the hotel, Mrs Blunt resumes her sex life with a surprised Stanley. The last night in the hotel starts as a success, with all the guests at ease with each other thanks to the punch being spiked with Santa Cecelia's Elixir. Midway through the night it begins to rain, and the hotel is shown to have been constructed on a dry river bed. As the hotel begins to collapse Pepe finally loses his patience and sanity with the guests, who party on, oblivious to the disintegrating hotel.The film then shifts forward an unspecified period of time, and shows an Elsbels reunion at Vic & Cora's pub. All the guests are happy and reminisce about the holiday they barely survived.","language":"English","cinematography":"Alan Hume","directed_by":"Gerald Thomas","carry_on_abroad":"Original UK quad poster","release_dates":"December 1972","produced_by":"Peter Rogers","starring":"Sid James Kenneth Williams Charles Hawtrey Joan Sims Bernard Bresslaw Barbara Windsor Kenneth Connor Peter Butterworth Jimmy Logan June Whitfield Hattie Jacques","running_time":"88 minutes","Filming and locations":"Interiors:Exteriors:","music_by":"Eric Rogers","edited_by":"Alfred Roome","written_by":"Talbot Rothwell","budget":"£225,000"}