{"country":"United States","distributed_by":"Orion Pictures","Plot":"Roberta (Rosanna Arquette) is an unfulfilled suburban housewife living in Fort Lee, New Jersey who is fascinated with a woman she only knows about by reading messages to and from her in the personals section of a New York City tabloid. This fascination reaches a peak when an ad with the headline \"Desperately Seeking Susan\" seeks a rendezvous in Battery Park with the man who regularly seeks her (i.e. Jim, played by Robert Joy). Roberta goes to Battery Park too, sees the woman (Madonna), and in a series of events involving mistaken identity, amnesia, and other farcical elements, Roberta goes from voyeur to participant in an Alice in Wonderland–style plot, ostensibly motivated by the search for a pair of stolen Egyptian earrings. With both of them trying to locate Roberta, her husband Gary (Mark Blum) encounters the wild Susan.","Stage musical":"The film has been developed into a stage musical which received its world premiere at London's Novello Theatre on November 15, 2007, following previews from October 16, 2007. The musical version features music and lyrics by Blondie and Deborah Harry, including a brand-new song written especially for the show. The production was directed by Angus Jackson, with book and concept by Peter Michael Marino, and sets and costumes by Tim Hatley. Produced by Susan Gallin, Ron Kastner, Mark Rubinstein and Old Vic productions, the musical starred Emma Williams as Susan and Kelly Price as Roberta, with Steven Houghton as Alex.[10] Marino presented his solo comedy Desperately Seeking the Exit, which is based on his experiences, at the 2012 Edinburgh Festival Fringe.[11]","language":"English","Critical reception":"The film holds an 85% \"Fresh\" rating at the review aggregator website Rotten Tomatoes, based on 23 reviews.[2] In her review for The New Yorker, critic Pauline Kael praised Madonna's performance as \"an indolent, trampy goddess.\"[3][4] The New York Times film critic Vincent Canby named the film as one of the 10 best films of 1985.[5]Rosanna Arquette won the BAFTA Award for Best Actress in a Supporting Role for her portrayal of Roberta; the fact that the award was for a \"supporting role\" reflected the surge in popularity that Madonna was experiencing at the time, since in terms of billing, number of scenes, lines of dialogue, and the plot, Arquette was the film's lead. She was nominated for a Golden Globe for Best Actress in a Comedy or Musical. Madonna also received positive reviews for her portrayal of Susan.[6]","box_office":"$27,398,584[1]","cinematography":"Edward Lachman","production_company":"Orion Pictures","directed_by":"Susan Seidelman","Soundtrack":"The soundtrack was released on both vinyl and CD together with the soundtrack to the film Making Mr. Right. The soundtrack does not feature any of the other songs in the film including Madonna's \"Into the Groove\" which can be found on the European 1985 re-release of her Like a Virgin album. The film captures the feel of the underground Bohemian/new wave scene of the early to mid-1980s New York City, a scene that in real life helped Madonna get her big break in the music business. Madonna recorded a song for the movie, titled \"Desperately Seeking Susan\". It ended up not being used in the film, and a demo she just finished at the time called \"Into the Groove\" was used instead. The demo version can only be heard in the movie. The song was a huge commercial success but was not included on the film's soundtrack, despite being heard in the film, due to licensing restrictions, which did involve Madonna's record label, that none of her songs was allowed to get mixed in with other artists. The music video for \"Into the Groove\" consists of clips from the film compiled by Doug Dowdle of Parallax Productions.Songs that appear in the film but not on the released soundtrack:","release_dates":"March 29, 1985 (1985-03-29)|||||","Production":"The filmmakers had initially wanted Diane Keaton and Goldie Hawn to play the roles of Roberta and Susan, but the director decided to cast newcomers Rosanna Arquette and Madonna instead and the studio wanted the film to have younger actors in order to appeal to younger filmgoers. Bruce Willis was up for the role of \"Dez\" and Melanie Griffith was up for the part of \"Susan\". Madonna barely beat out Ellen Barkin and Jennifer Jason Leigh for the part of Susan. Suzanne Vega also auditioned for the role of Susan, but was passed over.The Statue of Liberty can be seen in the film when it was still covered in scaffolding during its two-year renovation. The DVD commentary track for the film (recorded in 1996) noted that after Madonna's first screen test, the producers asked her to take four weeks of acting lessons and get screen-tested again. Although the second screen test was not much of an improvement, the director still wanted her for the role, as much for her presence and sense of style as for anything else. Costume designer Santo Loquasto designed Susan's pyramid jacket.The film was inspired in part by the 1974 film, Céline et Julie vont en bateau (Céline and Julie Go Boating).[7] The film also has an alternate ending included on the DVD, where Susan and Roberta are invited to Egypt after helping to return the earrings. They are depicted next to the pyramids on camels. The director cut this scene from the end saying that it was unnecessary and audiences at the test screenings thought the film should have already ended much earlier (as explained on the DVD). The 1964 science fiction film, The Time Travelers, is playing in scenes 6 and 23 (melts at the end of the movie). All the scenes featuring Dez (Aidan Quinn) working as a projectionist were filmed at Bleecker Street Cinema. The scene between Roberta and Gary in their kitchen show Roberta watching Alfred Hitchcock's Rebecca.The movie was filmed during the late summer and early fall in 1984, early in Madonna's rise to popularity, and was intended to be an R-rated feature. However, following the success of the singer's 1984–85 hits \"Like a Virgin\" and \"Material Girl\", the film was trimmed in content by Orion Pictures to get a PG-13 rating in order to market the film to Madonna's teenage fan base.[8]The interior/exterior shots of The Magic Club were filmed at the Audubon Ballroom in Harlem.[9] Some of the scenes were filmed in Danceteria, a club that Madonna frequented and which gave her a start in the music business.","produced_by":"Sarah Pillsbury Midge Sanford","starring":"Rosanna Arquette|Aidan Quinn|Madonna|Robert Joy|","running_time":"104 minutes","desperately_seeking_susan":"Theatrical release poster","music_by":"Thomas Newman","edited_by":"Andrew Mondshein","written_by":"Leora Barish Uncredited: Craig Bolotin","budget":"$4.5 million"}