{"Cast":"Willis originally wanted rapper Ludacris to play the part of Eddie Bunker.[2] This is the second film in which David Morse plays the villain to Bruce Willis as the protagonist; the first was Twelve Monkeys, in which Morse plays Dr. Peters.","country":"United States ; Germany","distributed_by":"Warner Bros. (USA) 20th Century Fox (Brazil) Sony Pictures (Australia)","Plot":"Jack Mosley (Bruce Willis) is an alcoholic, burned-out N.Y.P.D. detective. Despite a late shift the night before, his lieutenant orders him to escort a witness, Eddie Bunker (Mos Def), from local custody to the courthouse 16 blocks away to testify on a police corruption case before a grand jury at 10 a.m. Bunker tries to be friendly with Mosley, telling him of his aspirations to move to Seattle to become a cake baker with his sister whom he has never met, but Mosley is uninterested, and stops at a liquor store. They are suddenly ambushed by a gunman, and Mosley drags Bunker to a local bar to take shelter and call for backup. Mosley's former partner, Frank Nugent (David Morse), and several other officers arrive. Nugent and his men have ulterior motives, telling Mosley that Bunker is not worth defending as his testimony will likely out several officers, including Nugent, who are involved in the corruption scheme, and they try to frame Bunker for firing at an officer before they kill him. Mosley intervenes, rescuing Bunker and fleeing.Mosley briefly stops at his sister Diane's (Jenna Stern) apartment to retrieve guns and ammo, and learns the police have already approached her about his activities today. He and Bunker take steps to further elude the police, and Mosley is wounded in the process. They become cornered in a run-down apartment building as Nugent and his men search floor by floor. Mosley calls the district attorney to arrange for help, but purposely gives the wrong apartment number, suspecting there is a mole involved. Mosley and Bunker are able to escape onto a passenger bus, and as the police follow them, Mosley is forced to treat the passengers as hostages. The bus crashes into a construction site and is soon surrounded by the ESU. Aware that Nugent will likely order the ESU to raid the bus, risking the safety of the passengers, Mosley allows the passengers to go free, using their cover to allow Bunker to sneak off the bus in the confusion. Mosley finds a tape recorder in the discarded possessions on the bus, and prepares a farewell message to Diane.To his surprise, Bunker returns to the bus; while Nugent is ready to fire on him, Nugent is made to stand down by a superior officer. Bunker has come to see Mosley as his friend and wants to be there for him to see this through. Bunker's tenacity convinces Mosley to get to the courthouse, and he manages to drive the bus into an alley, temporarily blocking the police from following them. He finds that Bunker has been wounded, and calls Diane, a Paramedic, to bring an ambulance around to help, despite knowing she will be followed. Diane cares for Mosley and Bunker's wounds, though Bunker still needs further treatment at a hospital. As Diane's ambulance drives away, the police stop her but discover the ambulance is empty; she had a second ambulance pick up Mosley and Bunker that would not be under similar surveillance. Meanwhile, Mosley reveals to Bunker that should he testify, not only will Nugent be convicted but so would Mosley as one of the corrupt cops. Mosley gets off a block from the courthouse and wishes Bunker luck with his bakery, instructing the paramedic to take Bunker to the Port Authority and put him on a bus for Seattle. Bunker promises to send him a cake on his birthday.Mosley continues to the courthouse, where the police and ESU are waiting for him, as well as the district attorney. Mosley enters the courthouse building through the underground garage, encountering Nugent alone, who tries unsuccessfully to dissuade him from testifying in Bunker's place. Mosley enters the courthouse proper, where one of Nugent's men (David Zayas) tries to shoot Mosley but is killed by one of the ESU snipers. Mosley informs the district attorney that he will testify in exchange for Bunker having his record expunged, also revealing that he had recorded the conversation with Nugent in the garage on the tape recorder, which he submits as evidence.Two years later, Mosley is freed from prison from his reduced sentence, while Nugent and others wait out longer sentences. He celebrates his birthday with Diane and other friends, and is surprised to find that the cake had indeed come from Bunker, who has been successful in starting \"Eddie & Jack's Good Sign Bakery\" in Seattle.","16_blocks":"Promotional movie poster","language":"English","Reception":"Based on 158 reviews collected by Rotten Tomatoes, the film received a 55% approval rating from critics, with an average score of 5.9/10.[5] By comparison, Metacritic, which assigns a rating in the 0–100 range based on reviews from top mainstream critics, calculated a score of 63, based on 34 reviews, which indicates \"generally favorable reviews\".[6]Michael Atkinson of The Village Voice commented that \"the clichés come thick on the ground\" and called it \"a small movie trying to seem epic, or a bloated monster trying to seem lean.\"[7] Peter Travers of Rolling Stone magazine gave the film two-and-a-half out of four stars and called Willis and Mos Def \"a terrific team,\" concluding that \"Until Richard Wenk's script drives the characters into a brick wall of pukey sentiment, it's a wild ride.\"[8] Chicago Sun-Times critic Roger Ebert gave it three out of four stars and commended Mos Def for his \"character performance that's completely unexpected in an action movie,\" while calling the film \"a chase picture conducted at a velocity that is just about right for a middle-age alcoholic.\"[9]","box_office":"$65.6 million[1]","cinematography":"Glen MacPherson","production_company":"Alcon Entertainment Millennium Films Cheyenne Enterprises Emmett/Furla Films The Donners' Company Equity Pictures Nu Image Films Sunswept Entertainment","directed_by":"Richard Donner","release_dates":"March 3, 2006 (2006-03-03)|||||","Box office":"The film, released by Warner Bros., opened in the United States on March 3, 2006.In its opening weekend, the film grossed $12.7 million, which was the second-highest grossing film of the weekend. As of its May 15, 2006 closing date, the film grossed a total of $36.895 million in the U.S. box office. It made $65.6 million worldwide.[3] According to Box Office Mojo, production costs were around $55 million.[4] The film made $51.53 million on rentals, and remained on the DVD top 50 charts for 17 consecutive weeks.","produced_by":"Avi Lerner Randall Emmett John Thompson Arnold Rifkin Jim Van Wyck","starring":"Bruce Willis Mos Def David Morse","running_time":"110 minutes","music_by":"Klaus Badelt","edited_by":"Steven Mirkovich","written_by":"Richard Wenk","budget":"$55 million"}