{"Impact":"Along with Deep Throat, released the same year, the movie launched the \"porno chic\" boom[7] and started what is now referred to as the \"Golden Age of Porn\".[2] Along with Deep Throat it was the first hardcore porn film to reach a mass mixed-sex audience.[9] Prior to Behind the Green Door, most of the Mitchell Brothers' 200 or so films had only been shown in their O'Farrell Theater.[13] Made with a budget of $60,000, it achieved a nationwide theatrical release which earned over $1 million.[2][7] The movie ultimately grossed over $50 million[14][15] including its video release, which was controlled exclusively by the Mitchells out of their headquarters in the O'Farrell Theatre, San Francisco. It was the one of the biggest box office successes of the 1970s, alongside Deep Throat and The Devil in Miss Jones.[7] It was even screened at the Cannes Film Festival.[6] After its release, organized crime figures used extortion in an attempt to obtain the rights to the film.[16]Chambers was relatively unknown at the time; however, the film made her a star.[16][17] Immediately prior to the movie's release she was the \"Ivory soap girl\",[17] having modeled for the Ivory Snow soap and detergent packaging holding a baby.[6][16][17][18] The brand was sold under the slogan \"99 and 44/100's % pure\".[6][9] The Mitchell brothers saw a publicity opportunity, and distributed press releases describing Chambers as \"99 and 44/100's % impure\".[6] After the release of the movie, the advertising industry was scandalized,[9] and Procter & Gamble recalled all Ivory Snow products and advertising materials featuring her, unintentionally adding to the movie's hype. The staid Procter & Gamble subsequently required of all of their advertising agencies that they thoroughly screen the background of any female model employed for print advertisements or commercials. That Chambers's image was so well known from Ivory Snow boosted the film's ticket sales, and led to several jokes on television talk shows.[18] Critics have since debated whether she was really having orgasms in her scenes or just acting.[17]","country":"United States","distributed_by":"Mitchell Brothers Film Group","behind_the_green_door":"theatrical release poster","Plot":"A wealthy San Francisco socialite, Gloria Saunders (Chambers), is taken against her will to an elite North Beach sex club and loved \"as she's never been loved before\". There she engages in lesbian sex with a group of six women, for some reason all dressed in black, before being brought out wearing a white dress on stage through the green door.The silent, largely masked audience become increasingly aroused[3] as her white dress is removed and she is stroked, kissed and given cunnilingus by the women. Her first heterosexual sex is with the African-American boxer Johnnie Keyes, accompanied by a jazz soundtrack.[9][10] Over 45 minutes, he gives her more cunnilingus and then they have sexual intercourse, while Gloria continues to be stroked by the other women. When she has an orgasm, the sex stops and he is not shown to ejaculate.Gloria then mounts a trapeze contraption suspended from the ceiling and then engages in vaginal intercourse with one man as she performs oral sex on another and masturbates two others.[11] The audience become further aroused and begin having sex with each other in what becomes an orgy.[12] In a psychedelic key sequence, an ejaculation is shown with semen flying through the air for almost seven minutes. The film features several multicolored, optically printed, slow-motion close-ups of money shots.[9] This is the only ejaculation sequence in the film. The narrator then runs from the audience onto the stage and carries Gloria off through the green door.[9] The film ends with him and Gloria making love alone.[9]","Legal troubles":"The Supreme Court's 1973 Miller v. California decision adversely affected the mainstream release of porn films, including Behind the Green Door. The Miller decision redefined obscenity from that of “utterly without socially redeeming value” to that which lacks \"serious literary, artistic, political, or scientific value\" and substituted contemporary community standards for national standards, as some prior tests required. Miller continued to hold that obscenity was not protected by the First Amendment, which gave leeway to local judges to seize and destroy prints of films adjudged to violate local community standards.When Behind the Green Door opened in Suffolk County, New York in 1973, it was successfully prosecuted, as it was in New York City along with the 1973 porn film The New Comers. In addition to New York, Behind the Green Door was banned in California, Colorado, and Georgia.[22]","language":"English","Critical reception":"Upon its release the film received positive reviews in mainstream media.[16] According to writer Peter Michelson there is, \"a relatively small corpus of pornographic films – e.g., Deep Throat, The Devil in Miss Jones, and Behind the Green Door – that have a minimal but still sufficient artistic interest to distinguish themselves from the rest of the genre\",[19] and the film is \"more artful than most smut films\".[20] It was the second film to be inducted into the XRCO Hall of Fame, following Deep Throat.[21]","box_office":"$50 million[1]","Remake":"In 2012, adult film company Vivid produced a loose remake/reimagining entitled New Behind the Green Door. The updated film stars Brooklyn Lee as the main character Hope, a wealthy young woman drawn into a seedy underworld while on an erotic journey to find her birth mother. The movie also includes footage of the original Behind the Green Door as Hope describes a sexual fantasy that recalls the plot of the 1972 film. Other cast members include Dana DeArmond, Penny Pax, Bailey Blue, Steven St. Croix and James Deen, with special appearances by original cast member Johnnie Keys and original star Marilyn Chambers' daughter McKenna Taylor.","cinematography":"Jon Fontana","directed_by":"Artie Mitchell & Jim Mitchell","References":"NotesBibliography","release_dates":"December 17, 1972 (1972-12-17)|||||","produced_by":"Artie Mitchell","starring":"Marilyn Chambers|Johnnie Keyes|","running_time":"72 minutes","Sequel":"In 1986, the Mitchells made a sequel to this film, Behind the Green Door: the Sequel, directed by cabaret singer Sharon McNight. The movie featured no famous performers, and starred an Elisa Florez who billed herself as Missy Manners. (Florez was Artie Mitchell's girlfriend at the time, and she reportedly demanded the role from him.) It was the first \"safe sex\"-themed porn film, and was produced as a response to the 1980s AIDS outbreak in San Francisco.[6] Hence, in it, all the performers used condoms, birth control, and other protection.[23]But Behind the Green Door: the Sequel was a critical and commercial disaster, and it forced the Mitchells to eat hundreds of thousands of dollars in lost proceeds.[24][25] The O'Farrell Theatre contains a \"Green Door Room\" which is named for the two movies and was the principal set of the sequel.","music_by":"Daniel Le Blanc","edited_by":"Jon Fontana","written_by":"Elliot Wax (original story), Artie Mitchell (screen adaptation)","budget":"$60,000"}