{"country":"United States","distributed_by":"Universal Pictures","Plot":"Meet the Libner brothers: Marvin (Daniel Stern), the oldest, is a sergeant in the U.S. Air Force. Buddy (Arye Gross), the middle child, is a timid dreamer. Bobby (Patrick Dempsey), the youngest, is a handsome rebel in reform school. As kids, they fought a lot and as adults, they barely speak to each other. In the summer of 1963, their tough and eccentric father, Fred (Alan Arkin), gives them a task: to bring a 1954 Cadillac, bought for their mother, Betty (Rita Taggart), from Detroit to Miami. As the trip goes on, the three brothers fight and begin to reconnect with each other, while trying to keep the Caddy in mint condition.","language":"English","Release and reception":"Coupe de Ville received moderate reviews.[citation needed]Cadillac used the \"Coupe De Ville\" model name for the two-door hardtop for 1954, not the convertible. The Cadillac in the movie was actually a \"Series 62 Convertible.\"The film was a box office failure; in its opening weekend (March 9-11, 1990), it didn't even make the charts, only grossing $66,871. In the end, Coupe de Ville only opened in 170 theaters and made $715,983 in the US.[1]","Trivia":"A portion of the film was shot in Cape Coral, FL. When set director Richard Villalobos needed props for the Florida segments, he connected with the CEO of Goodwill Industries of Southwest Florida to acquire props for the film, purchasing $4,000 worth of gently-used items from the local Goodwill store.[2]","box_office":"$715,983","cinematography":"Reynaldo Villalobos","production_company":"Morgan Creek Productions","directed_by":"Joe Roth","release_dates":"March 9, 1990 (1990-03-09)|||||","produced_by":"James G. Robinson Mike Binder","starring":"Patrick Dempsey|Arye Gross|Daniel Stern|Annabeth Gish|Rita Taggart|Joseph Bologna|Alan Arkin|","running_time":"99 minutes","coupe_de_ville":"Film poster","music_by":"James Newton Howard","edited_by":"Paul Hirsch","written_by":"Mike Binder"}