{"country":"United States","distributed_by":"20th Century Fox","Plot":"Lifelong best friends Alice Marano and Darlene Davis take a trip after graduating from high school, giving their parents the impression that they're going to Hawaii. However, Alice talks Darlene into going to Thailand instead, after comparing the prices of both destinations. Darlene agrees, albeit with some reluctance. Once in Thailand, they meet a captivating Australian man who calls himself Nick Parks. Darlene is particularly smitten with Nick and convinces Alice to take Nick up on his offer to treat the two of them to what amounts to a day trip to Hong Kong. At the airport, the girls are seized by the police and shocked to discover that one of their bags contains heroin.The two girls are interrogated by the Thai police and Darlene signs a confession written in Thai, which she foolishly thinks is her verbatim statement. At their trial, they beg for mercy and are given a lenient 33-year sentence instead of the usual life sentence in prison. In prison, the girls are advised to seek out Henry Greene, aka \"Yankee Hank\", an expatriate American attorney living in Thailand.As the girls try to deal with the violence and squalor of prison, Hank begins work on their case. He tracks down another girl who had been used as an unwitting drug mule by Nick Parks, but is warned that the smuggler has friends in high places. Hank arranges a deal with a corrupt prosecutor whereby the girls will receive a pardon if they confess to having lied about Parks' involvement. However, the prosecutor reneges on the deal after the girls confess. Desperate, and realizing that Darlene will not survive their time in prison, Alice begs the King of Thailand to allow her to serve both of their sentences in exchange for letting Darlene go. The deal is accepted and Darlene is released, where she promises to continue working with Hank to try and free Alice.","language":"English, Thai","Reception":"Brokedown Palace received negative reviews from critics. Review aggregator Rotten Tomatoes rated the film \"Rotten\", with only 31% of 35 critics giving positive reviews, summarizing that the movie \"lacks credibility and tension\".[5]The film underperformed at the box office, failing to make back even half of its $25 million budget. [Questionable; The German Wiki page claims the movie had 4mUSD costs and 10mUSD at box office.]","brokedown_palace":"Theatrical release poster","box_office":"$10,115,013","directed_by":"Jonathan Kaplan","release_dates":"August 13, 1999 (1999-08-13)|||||","produced_by":"Adam Fields","starring":"Claire Danes Kate Beckinsale Bill Pullman Lim Kay Tong","running_time":"100 minutes","Controversy":"In 1998, just after the filming of Brokedown Palace in Manila, Danes was quoted in Vogue as saying that Manila was a \"ghastly and weird city\".[1] She further remarked in Premiere that the city \"smelled of cockroaches, with rats all over and that there is no sewage system and the people do not have anything—no arms, no legs, no eyes\".[1] Kim Atienza, son of then Mayor of Manila Lito Atienza, responded to the comments by saying, \"Those are irresponsible, bigoted and sweeping statements that we cannot accept\".[1] Her films were subsequently banned from being screened in the Philippines.[2] Joseph Estrada, then President of the Philippines, condemned her publicly,[3] and she was declared persona non grata.[4]","edited_by":"Don Zimmerman","written_by":"David Arata (screenplay) Adam Fields David Arata (story)","budget":"$25 million"}