{"country":"United States","distributed_by":"Loew's Inc.","Plot summary":"Katie Higgins (Williams) is the wholesome daughter of a dairy farmer. The entire family (Pa, Ma, Suzie, Katie, and Junior) start the day with a brisk song and morning swim. One day, Katie meets travelling salesman Windy Weebe (Carson) who is instantly smitten. Weebe sells an elixir that purports to turn the user into a peppy, fit-as-a-fiddle specimen, and upon noticing the entire family's strength in the water, suggests that they all attempt to swim the English Channel. The family and Weebe head off to England whereupon they learn that the distance to be conquered is 20 miles \"as the seagull flies\" but with the currents, can be up to 42 miles. Katie is the only one in the family strong enough to attempt this feat, so she begins training with Weebe as her coach.On a foggy day, Katie, in the water, is separated from Weebe, in a rowboat, and is rescued by a handsome Frenchman, Andre Lanet (Lamas). Lanet falls for the spunky American and begins trying to woo her. Katie tries to stay focused on her swim, but is being pulled in different directions by the two men. In a dream sequence, Katie does an underwater ballet with cartoon characters Tom and Jerry, as well as animated depictions of the different people in her life. The film ends happily with Katie's attempt to cross the Channel and the resolution of her gentlemen issues.","dangerous_when_wet":"Theatrical release poster","language":"English","box_office":"$3,255,000[1][2]","cinematography":"Harold Rosson","production_company":"Metro-Goldwyn-Mayer","directed_by":"Charles Walters","release_dates":"July 3, 1953 (1953-07-03)","Production":"In the underwater sequences in which Williams speaks to Tom and Jerry, Joseph Barbera had pink bubbles drawn coming out of her mouth for a cost of $50,000.[3]The film's ending was rewritten after an incident that occurred in real life during the shooting of the film when Johnny Weissmuller (Esther's old Aquacade partner) dove into the water to swim alongside Florence Chadwick, whom he was coaching.[3]Debbie Reynolds was originally slated for the role of Williams's little sister, Suzie.[4]Though Williams had heard of Lamas before his being cast as her love interest in the film, the two had never been formally introduced. In 1969, the two married, and remained so until Lamas's death in 1982. When asked whether she knew him when the studio suggested his name for a possible co-star, Williams mentioned that \"he starred in movies with Jane Powell, Greer Garson, and Lana Turner, and [she] knew he was romantically linked to Lana Turner. And [she] heard he could swim. Yes, Fernando Lamas sounded like good casting.\" Lamas initially turned down the role, stating he came to MGM to be a \"star\", and only wanted to act in \"important pictures\". Williams had to convince him that his part would be rewritten to be larger.[3]","produced_by":"George Wells","starring":"Esther Williams Fernando Lamas Jack Carson","running_time":"95 minutes","music_by":"Albert Sendrey George Stoll","edited_by":"John McSweeney Jr.","Release":"According to MGM records the film earned $2,230,000 in the US and Canada and $1,025,000 elsewhere recording a profit of $386,000.[1]Bosley Crowther wrote in a 1953 New York Times review the \"frolicsome item not only dumps you quite often in the drink, but also gives you some rather pleasant company to clown around with while on dry ground. As we say, there is nothing very special or spectacular about \"Dangerous When Wet,\" but it comes as relaxing entertainment at this torpid time of the year.\"[5]A review from Variety called it \"a light mixture of tunes, comedy, water ballet and Esther Williams in a bathing suit.\"[4]On July 17, 2007, Warner Home Video and Turner Entertainment released Dangerous When Wet on DVD as part of the Esther Williams Spotlight Collection, Volume 1. The 5-disc set contained digitally remastered versions of several of Williams's films including Bathing Beauty (1944), Easy to Wed (1946), On an Island with You (1948) and Neptune's Daughter (1949)[6]","written_by":"Dorothy Kingsley","budget":"$1,465,000[1]"}