{"mandarin":"Fēi yīng jǐ huá","Cast":"[2] [3]","country":"Hong Kong","Box office and reception":"Chan said in his biography that the film cost HK $115 million, or US $15 million, the most expensive Hong Kong film at the time. In its Hong Kong theatrical release, this film grossed HK $39,048,711. On 1,523 North American screens on its opening weekend, it grossed US $4,731,751 ($3,088 per screen), on track to a modest U.S. $10,405,394 final gross.[5]The film has received mostly positive reviews.,[6][7][8][9] with a 70% approval rating on Rotten Tomatoes.[10]","distributed_by":"Golden Harvest Media Asia","Plot":"Hong Kong treasure hunter Jackie, a.k.a. \"Asian Condor\", is summoned by Baron Bannon at his mansion in Madrid, Spain, where he is told of a story of a German commander named Hans von Katterling and his regiment burying 240 tons of gold at a secret base deep in the Sahara Desert in Africa before the end of World War II. The 18 soldiers involved in the operation disappeared under mysterious circumstances. By request from the United Nations, Bannon gives Jackie an unofficial mission to locate the base and recover the gold. Aside from acquiring the key to the base, he is partnered with Ada, an expert in African geography. Upon discovery of the gold, Jackie is promised one percent of the treasure, or roughly 2.5 tons of gold.One night, while snooping around the home of one of the base's caretakers, Jackie meets a young German woman named Elsa, after saving her from a couple of Arab men - Amon and Tasza - who are also searching for the gold. The next day, he goes to a renowned locksmith and learns that the key is intricately designed with a secret code; thus the need to find the last person who used it. After evading an army of black cars across town, Jackie is asked by Elsa to join him and Ada on their expedition, as she is in search of von Katterling, who was her grandfather.Upon their arrival in the Sahara Desert, the expedition team picks up Momoko, a Japanese woman who is searching for the meaning of death. However, their camp is attacked by black-veiled bandits who kidnap Elsa and Ada. Jackie and Momoko follow the bandits' trail to a slave market, where they save Elsa and Ada from being auctioned off as sex slaves. Meanwhile, the rest of the expedition team are executed by a group of mercenaries led by a wheelchair-bound man. The quartet return to their camp to discover their comrades slain, but Momoko recognizes a statue in one of Elsa's grandfather's pictures and leads them to an ancient temple.After bidding Momoko farewell, the trio enter the ruins, where they encounter a band of vicious tribesmen. While running for their lives, they fall through a loose floor of sand into an underground cavern, leading them to the secret Nazi base. They discover the mummified remains of Elsa's grandfather and look through his log book, revealing that the 18 soldiers under von Katterling ingested cyanide pills and died inside the base upon completion of their mission. However, the trio only counts 17 bodies, with one soldier missing. The wheelchair-bound man - arriving with his mercenaries and holding Momoko hostage - reveals himself as Adolf, the 18th soldier who murdered Elsa's grandfather after the latter crippled him.Upon arriving at the vault, Jackie uses the key and a secret code from Elsa's grandfather's dog tag and opens it, revealing the elevator leading to the gold. Upon their discovery of the gold, the mercenaries turn their backs on Adolf with the intent of keeping the treasure to themselves. Adolf locks all of the mercenaries, except for two who chase Jackie to an underground wind tunnel. While Jackie battles the two mercenaries, Elsa and Ada flip random switches in the control room, activating the tunnel's turbine fan. As the three men hang on for their lives, Elsa and Ada attempt to switch off the fan, but they accidentally trigger the base's self-destruct sequence. Adolf tells the quartet that they can escape by having the turbine blow them through the ventilation duct, but he decides to stay to atone for his sins. The quartet gather as much gold as they can, but the wind force only sends their bodies upward to the desert surface above before the base completely caves in.As the quartet walk across the desert, they once again encounter Amon and Tasza, who demand water from them. Jackie throws them his empty canteen before they finally overcome their differences and try to find water in the Sahara desert.","language":"Cantonese","cantonese":"Fei1 jing1 gai3 waak6","box_office":"$10.4 million[1]","cinematography":"Arthur Wong","armour_of_god_ii:_operation_condor":"Hong Kong film poster","directed_by":"Jackie Chan","traditional":"飛鷹計劃","Versions":"The film was originally released in Hong Kong in 1991 with a Cantonese soundtrack and a running time of approximately 106 minutes. An uncut export version of the film was released in the United Kingdom by Entertainment in Video. The VHS was released in 1993, and the DVD in 2001.In 1991, Dimension Films acquired the U.S. rights, but did not release the film theatrically until 1997 under the title Operation Condor, with a newly commissioned English dub/score and 15 minutes deleted from the final cut. This version was released on DVD in 1999.[11]In 2004, Intercontinental Video Limited released an uncut version in Hong Kong. The DVD is anamorphic and includes the Cantonese-language soundtrack with English subtitles.","simplified":"飞鹰计划","release_dates":"7 February 1991 (1991-02-07)|||||","Production":"Armour of God II: Operation Condor was filmed primarily in Madrid, Spain, and Morocco. While the opening scenes where Asian Hawk went Powered paragliding was shot in Tagaytay City over Taal Lake, Cavite, Philippines. The scene where he stole the gem from the cave tribe and escaped by zorbing was shot in Mount Macolod in Cuenca, Batangas.According to his book I Am Jackie Chan: My Life in Action, while filming the underground base chase scene, Chan was supposed to swing to a platform with a long chain, but he lost balance and fell to the ground face-first, dislocating his sternum.[4]","produced_by":"Raymond Chow Leonard Ho","starring":"Jackie Chan Carol Cheng Eva Cobo de Garcia Shoko Ikeda","running_time":"106 minutes","music_by":"Chris Babida","written_by":"Jackie Chan Edward Tang"}