{"based_on":"A Thousand Clowns  by Herb Gardner","a_thousand_clowns":"Theatrical release poster","country":"United States","distributed_by":"United Artists","screenplay_by":"Herb Gardner","Plot":"Unemployed television writer Murray Burns (Jason Robards) lives in a cluttered New York City studio apartment with his 12-year-old nephew, Nick (Barry Gordon). Murray has been unemployed for five months after quitting his previous job: writing jokes for a children's television show called Chuckles the Chipmunk. Nick, the illegitimate son of Murray's sister, was left with Murray seven years earlier.When Nick writes a school essay on the benefits of unemployment insurance, his school requests that New York State send social workers to investigate his living conditions. Investigators for the Child Welfare Board, Sandra Markowitz (Barbara Harris), and her superior and boyfriend Albert Amundson (William Daniels), threaten Murray with removal of the child from his custody unless he can prove he is a capable guardian.Murray charms and seduces Sandra. He convinces her to join him in his delusional charade, in which seeking work is a kind of joke used to keep the conventional, conformist, and inhumane state from his doorstep. Sandra rationalizes her growing relationship with Murray as encouragement for his attempts to seek employment. Although Murray tries to avoid actually getting a job, he finds himself in a dilemma: if he wishes to keep his nephew, he must swallow his pride and go back to work.Murray also feels that he can't let go of Nick until the boy has shown some \"backbone\". In a confrontation with his brother and agent Arnold (Martin Balsam), Murray expounds his nonconformist worldview: that a person must fight at all costs to retain a sense of identity and aliveness, and avoid being absorbed by the homogeneous masses. Arnold retorts that by conforming to the dictates of society, he has become \"the best possible Arnold Burns\".Murray agrees to meet with his former employer, the detested Chuckles host Leo Herman (Gene Saks). When Nick doesn't laugh at Leo's pathetic display of comedy, Leo insults Nick, who quietly but firmly puts Leo in his place. Nick becomes upset with Murray for tolerating Leo's insults, and Murray sees the boy has finally grown a backbone. Realizing that Nick has come of age, Murray resigns himself to going back to his old job, and the next morning he joins the crowds of people heading off to work.","language":"English","box_office":"$2.4 million (Rentals)[2]","cinematography":"Arthur Ornitz","directed_by":"Fred Coe","Awards":"Sandy Dennis won a Tony for the 1963 stage version.[3]","Music":"Music in the film ranges from rudimentary drum cadences to Dixieland arrangements of \"The Stars and Stripes Forever\". The song \"Yes Sir, That's My Baby\" is used in several places.Judy Holliday wrote the lyrics for the theme song \"A Thousand Clowns\". This was her last film credit, as the film was released after her death on June 7, 1965.","release_dates":"December 13, 1965 (1965-12-13)|||||","produced_by":"Fred Coe Herb Gardner Ralph Rosenblum","starring":"Jason Robards Barbara Harris Martin Balsam","running_time":"116 minutes[1]","Stage":"A Thousand Clowns premiered on the Broadway stage at the Eugene O'Neill Theatre on April 4, 1962 in previews, officially on April 5, 1962 and closed on April 13, 1963 after 428 performances. Directed by Fred Coe, the cast featured Jason Robards, Jr., (Murray Burns), Sandy Dennis (Sandra Markowitz), Gene Saks (Leo Herman), Barry Gordon (Nick Burns), William Daniels (Albert Amundson) and Larry Haines (Arnold Burns). Sets and lighting were by George Jenkins, and costumes were by Ruth Morley.The play received two 1963 Tony Award nominations: Featured Actor in a Play (Barry Gordon) and Best Play, and Sandy Dennis won the Tony Award for Featured Actress in a Play.[7]Walter Kerr, in his review for the New York Herald Tribune, wrote of Sandy Dennis: \"Let me tell you about Sandy Dennis. There should be one in every home.\"[8]","music_by":"Gerry Mulligan Don Walker","edited_by":"Ralph Rosenblum"}