{"based_on":"characters created by Brian Garfield","country":"United States","distributed_by":"Filmways Pictures (Original U.S. Distributor) Columbia Pictures (International Distributor) Trifecta Entertainment & Media (Television Distributor) Metro-Goldwyn-Mayer (Current U.S. and Japan Home Video Distributor)","death_wish_ii":"Theatrical release poster","Plot":"Paul Kersey (Charles Bronson) seems to have picked up the pieces of his life and moved on, and is now dating L.A. radio reporter Geri Nichols (played by Bronson's real-life wife Jill Ireland). They go to pick up Kersey's daughter Carol (Robin Sherwood) from the hospital, where her doctor says that despite traumatic catatonia, Carol has begun to speak again. Paul, Geri, and Carol spend the afternoon at a carnival. While waiting in line for ice cream, Paul gets pick-pocketed by five gang members, named Nirvana (Thomas F. Duffy), PunkCut (E. Lamont Johnson), Stomper (Kevyn Major Howard), Cutter (Laurence Fishburne III) and Jiver (Stuart K. Robinson). He catches up with Jiver, after a brief struggle, denies taking Paul's wallet. Paul lets him go.Geri leaves to do an interview while Carol and Paul go on a boat ride. At the same time, the muggers that stole Kersey's wallet go to his house. They break in and violently gang rape the maid, Rosario (Silvana Gallardo), then wait for Kersey to arrive. When Paul arrives home with his daughter, he is beaten unconscious. Rosario tries to call the police, but a mugger hits her with a crowbar, killing her. They kidnap Carol (fearing she will identify them) and take her with them to their hideout where they begin to rape her. Before they all are done, she jumps through a window in an attempt to escape, and dies after impaling herself on railings below.Paul regains consciousness as Geri arrives and they find Rosario's body. When the police arrive, Lt. Mankewicz (Ben Frank) asks for help identifying the muggers. Paul learns about the death of his daughter. He's asked to view mug-shots at the station, but refuses to do so. After the funeral, Paul takes a handgun to a low-rent inner city apartment as a base of operations. The next night he spots Stomper and follows him into an abandoned building as a drug deal is about to be made. Kersey kills one of the dealers, then orders the others out and proceeds to execute Stomper.The following night, patrolling the streets, he hears a scream from a couple being assaulted by several muggers in a parking garage. One of the muggers is Jiver, the mugger Kersey chased the day of his daughter’s death. They force the woman into a van where they plan to rape her. Before they can, Kersey intercedes, killing two and wounding Jiver; he is able to escape, but doesn't get far because Paul follows his blood trail, tracks him down and shoots him in the head, killing him.The LAPD hear about the murders, as does the NYPD. When Kersey falls under suspicion, NYPD Detective Frank Ochoa (Vincent Gardenia) is called in for fear that Kersey, when caught, will reveal that he was let go instead of prosecuted. The NYPD sends Ochoa to make sure that does not happen. Ochoa meets with Lt. Mankewicz, who suspects Frank is hiding something. Ochoa breaks into Geri’s apartment, then tells her about Paul's past and present vigilante spree. Geri confronts Paul but he denies it, ascribing the tale to Ochoa's imagination. Ochoa follows Kersey to a local square where Kersey spots the three remaining gang members who attacked him.Kersey follows the trio to an abandoned park, where a major arms and drug deal goes down. Ochoa follows and decides to help Paul when the criminals are about to spot him. Ochoa is shot, while Paul manages to kill Cutter (who vainly tries to shield his head with a boom box) and severely wound PunkCut. Paul kills the getaway driver and the seller of the firearms, where they plummet off of a cliff. The final mugger, Nirvana, gets away. Ochoa tells Paul he saved his life because he felt it was better to side with Paul than the criminals. He tells Paul to kill one for him, then Ochoa dies as the police arrive. Paul flees while PunkCut dies from his injuries.Paul later learns, from one of Geri's colleagues, that the police are preparing a tactical unit to capture Nirvana. Paul obtains a police scanner and begins monitoring the police radio traffic. He shortly finds out when and where the arrest is going to take place. He drives to the location to exact his own justice before the police can arrest him, but he is not successful.Nirvana gets tasered, but with no effect due to the influence of PCP. He is finally arrested after stabbing several officers and slashing Paul on the arm during a chase. Tried and found criminally insane, the young man is sent to a mental institution. Geri and Paul visit him, requesting an interview, but are turned down. While there, Paul steals a doctor's ID card. The next night, Paul uses his fake ID to confront him. They have a violent fight and Kersey is stabbed repeatedly with a scalpel. Kersey gains an advantage when Nirvana's hand smashes through an electroshock machine. Kersey turns the power on, fatally electrocuting him. Ronald Kay (Charles Cyphers), an orderly on duty, witnesses the hood's death but, because he sympathizes with Kersey, he gives him three minutes to escape before sounding the alarm.Geri goes to Paul's apartment, where she finds evidence of his making a fake ID. Upon hearing a news report of the hoodlum's death on the radio, she realizes that Paul really is the vigilante Ochoa claimed him to be. She places her engagement ring on the paper, packs her things into suitcases, and drives off. Paul arrives home minutes later to an empty apartment.A few months later, Paul is seen speaking about a new architectural design. His boss invites him to a party, and when Paul asked if he's free to attend, he answers: What else would I be doing?. We next see a shadowy figure walking in the night (presumably Kersey) continuing the vigilante hunt for more criminals.","language":"English","box_office":"$45 million (worldwide)","cinematography":"Thomas Del Ruth Richard H. Kline","production_company":"Cannon Films","directed_by":"Michael Winner","release_dates":"February 20, 1982 (1982-02-20)|||||","Production":"Brian Garfield, author of the original Death Wish novel, was so unhappy with the film version that he wrote his own sequel, Death Sentence. \"They'd made a hero out of him,\" said Garfield. \"I thought I'd shown that he'd become a very sick man.\"[1]The idea to produce a sequel to Death Wish (1974) originated with producers Menahem Golan and Yoram Globus, owners of Cannon Films. They reportedly announced their plans to do so prior to actually securing the rights to the franchise. Dino De Laurentiis co-producer of the original film, threatened them with a lawsuit unless they properly purchased the rights. He negotiated payments for himself, co-producers Hal Landers and Bobby Roberts, and original author Brian Garfield. The agreement included future payments for each prospective sequel. [2]Cannon did not want to use Garfield's book, preferring an original story by David Engelbach, Golan and Hal Landers. \"We think our story is a better film story,\" said Golan.[1]\"You cannot call a film exploitative just because it touches on disturbing issues,\" said Globus. \"Both Death Wish films are a valid comment on American society... the theme of street violence getting out of control is sadly more of a fact of life than it was seven years ago.\"[1]David Engelbach was then tasked with writing the screenplay. Bronson was offered $1.5 million to reprise the role. [2] Jill Ireland was cast in the film because Bronson, her husband, insisted on it. She serves as both the love interest to Kersey and the voice of opposition to the death penalty. [2]Cannon initially tasked Golan with directing the film, but Bronson insisted on instead recruiting Michael Winner, the director of the original. Winner had suffered a downturn in his career since the mid-1970s, with no box office hit since Death Wish. He agreed to return to the franchise and also took the initiative in revising Engelbach's script.[2] Winner recalled that De Laurentiis was having second thoughts about letting someone else produce the sequel, and offered to hire him to do the film for his own production company. Winner refused and De Laurentiis did not renege on his deal with Cannon. The producer did, however, start work on a \"clone\" of the film. The final result was Fighting Back (1982). [2]Winner said the sequel was pertinent because \"mugging is now a bigger issue in America. It's spread to towns where it was not a problem before. In Beverly Hills, instead of talking about other people's failed movies - thank God, something has stopped them at last - they talk about their muggings.\"[3]The film introduced significant changes for the character of Paul Kersey. One involved his modus operandi as a vigilante. In the original film, Kersey would shoot and kill every criminal in his vicinity. In the sequel, he is after five specific criminals who are responsible for the death of his daughter. His single-minded pursuit extends to ignoring other potential targets. He is seen to mostly ignore thieves, drug dealers, and one violent pimp.[2] Another change involves his abilities. In the first film, his activities as a vigilante rely only on his use of weapons. In the sequel he is able to beat up men considerably younger than himself. [2]Among the final revisions of the script was a change in location. The original script set the action in San Francisco, while the revision moved the setting to Los Angeles. [2]Winner said the film was \"the same, but different,\" to the original. \"That's what sequels are - Rocky II, Rocky III - you don't see Sylvester Stallone move to the Congo and become a nurse. Here the look of LA is what's different. Besides - rape doesn't date!\"[1]Screenwriter David Engelbach argued the film raised \"serious issues - namely, the deteriorating state of our criminal justice system. The actions of the Bronson character are dictated by the inability of the police to prevent crime, the preoccupation of the courts with technical rather than real justice, and the cancerous climate of fear in which we find ourselves today. Paul Kersey is no hero. In his pursuit of vengeance he loses the only emotional relationship of his life and by story's end has become as much a victim of crime as the thugs he leaves dead in his wake.\"[4]The film was shot on location and depicted actual \"sleazy\" areas of the city. Twenty off-duty men of the Los Angeles Police Department were hired to protect the film cast and crew from potential trouble. [2] A scene involving the abandoned and crumpling Hollywood Hotel was shot in an actual abandoned hotel, months before it was demolished. [2]Several of the extras of the film were various locals who were either hired to play a bit part or happened to be passing by during a shooting. Among them were drug addicts, a drag queen, Hare Krishnas and bikers. All included by the director in an attempt to get an authentic feel of the streets of Los Angeles. [2]Winner tried to keep the mood on the set lighthearted. \"Just because a film is terrifying, that doesn't mean the people making it have to be grim,\" he said.[1]Isaac Hayes was recommended along with the producers of the film to compose the score; however, Michael Winner chose former Led Zeppelin guitarist Jimmy Page (who was Winner's neighbour at the time). The opening credits bear Page's signature guitar tone, along with the heavy reverb-laden drum sound that he used with Led Zeppelin. The film's soundtrack was released in February 1982. Portions of the score were sampled by Twiztid in the song \"Spiderwebs\" from their album Heartbroken & Homicidal.","produced_by":"Menahem Golan Yoram Globus","starring":"Charles Bronson|Jill Ireland|Vincent Gardenia|J. D. Cannon|Anthony Franciosa|","running_time":"88 minutes","music_by":"Jimmy Page","edited_by":"Michael Winner Julian Semilian","Release":"Cannon Films was able to sell distribution rights to several interested buyers. Theatrical rights in the United States and Canada were purchased by Filmways. The company had recently acquired American International Pictures, known for its exploitation films, and the film would fit right in with their library of genre films.[2] Columbia Pictures purchased the international distribution rights. Paramount Pictures purchased the television broadcast rights for the domestic market. [2] The film was originally intended for release around the Christmas of 1981. Filmways decided to postpone release until February 1982, in order to face weaker competition for an audience. The strategy apparently worked, since the film became the top grossing film of its opening week. [2]The film grossed 16 million dollars in United States theatres, a rare box office hit for the ailing Filmways. The company still ended the year 1982 with losses of 52.7 million. It was subsequently purchased by Orion Pictures. [2]It made a $2 million profit for Cannon films[5] and made an extra $29 million worldwide.It has since earned further money at home and abroad through release for the video market. A poll for HBO noted Death Wish II to be higher in demand by paying viewers than Chariots of Fire (1981). [2]Death Wish II received mixed reviews from critics.[6] Roger Ebert famously gave it zero stars, stating that it was a horrible film that sullied the legacy of the original 1974 film (which he gave a positive 3-star review on).[7] Death Wish II currently holds a 29% \"Rotten\" rating on the review aggregate website Rotten Tomatoes.[8] The film has received some positive feedback, most notably from Rob Ager, a YouTube film analyser.The movie was nominated for a Stinkers Bad Movie Awards for Worst Picture.[9] The film was nominated for a Razzie Awards for Worst Musical Score.[10]","written_by":"David Engelbach","budget":"$8 million[1]"}