{"based_on":"the novel Ride the Nightmare  by Richard Matheson","country":"France / Italy","distributed_by":"Emerson","Plot":"During the Korean War, Joe Moran, a U. S. Army sergeant, was convicted for striking a colonel. He was imprisoned in Germany. In the military prison he encountered his former company commander Captain Ross, and a fellow soldier who served under Joe called Vermont. They had been imprisoned for black marketeering and hijacking army vehicles. Joe agrees to escape with them. The escape is organised by a former French Foreign Legionnaire named \"Katanga\". Things go according to plan until Katanga kills a curious German police officer. Frightened and disgusted by the murder, Joe escapes by himself, abandoning his friends and Katanga, who are recaptured.Years later, Joe is known as Joe Martin. He makes a legitimate living renting boats in the South of France. He lives with his wife, Fabienne, and 12-year-old daughter. Things are going fine for Joe. When Joe's picture appears in a local news story, Ross, Vermont and Katanga appear. Now wanted drug smugglers, they want revenge on Joe and use of his rental operation to move contraband. To ensure Joe's cooperation, they kidnap his wife and daughter and hold them hostage.","language":"English","cinematography":"Jean Rabier","directed_by":"Terence Young","release_dates":"June 14, 1970","Production":"The film was known for an extended car chase with an Opel Commodore GS/E I6 involving the Bronson character's attempt to get a doctor to a wounded drug dealer in exchange for his wife.[1]Matheson's novel had already been filmed in 1962 under its original title as an episode of the Alfred Hitchcock Hour with Hugh O'Brian and Gena Rowlands in the lead roles.A 1993 film starring Ben Cross, Adam Baldwin, and Shannon Tweed is not a remake of this film, although it has the same title.","produced_by":"Robert Dorfmann Maurice Jacquin","starring":"Charles Bronson Liv Ullmann James Mason Jill Ireland","running_time":"94 min.","music_by":"Michel Magne","written_by":"Dorothea Bennett Jo Eisinger Shimon Wincelberg"}