{"country":"United States","Inspiration":"The film is described as \"a post-modern, thinking man's throwback to the 'B' Movie/Exploitation films of the 1950s–70s as well as a loving, sly parody of the same.\"[14] The film is inspired by the Dragstrip Girl, Faster, Pussycat! Kill! Kill!, Kung Fu Nun, the pantheon of blaxploitation and other exploitation films which had a renewal in popularity after the cult success of Grindhouse in 2007.[15]","distributed_by":"Freestyle Releasing[2] IM Global Summit Entertainment (USA) Momentum Pictures (UK)","Plot":"Three girls, a down-and-out stripper named Trixie, a drug-running killer and ex-convict named Camero, and a corporate powerbroker nicknamed Hel, arrive at a remote desert hideaway to extort massive riches from a ruthless sword-wielding killer named Pinky, who is also a notorious underworld figure. None of the three women is who they appear to be: each has an ulterior motive.They kidnap a gangster called Gage and try to force him to reveal where the treasure is buried. He refuses, believing they will kill him anyway, but Hel promises he will not be harmed. Camero shoots him, against the wishes of Hel, saying she made no such promise. His phone rings, and they believe Gage is connected to Pinky.Things become more complicated when a police officer named Deputy Fuchs arrives. Unknown to them, he was in the audience five nights ago when Trixie performed as a stripper to seduce Gage. However, the three women hide the body and are able to convince Fuchs to leave. While digging for the treasure, Camero asks the girls about the best sex each has ever had, believing the answer tells her something important about their character. She admits her best sex ever was with a circus contortionist, although she did not even know the contortionist's name.During a water fight, Trixie falls onto something in the sand. They dig; however, instead of buried treasure they find the dead body of one of Hel's contacts. They are interrupted by Hot Wire and his girlfriend Kinki, whom Camero is familiar with. At gunpoint, the two abuse the women and force them to dig for the buried treasure. Deputy Fuchs returns and attempts to save the women, but instead creates a gunfight, which Hel ends with a high-powered machine gun found in the nearby trailer.Camero asks the meaning of the code Hel uses on the bunker \"75650\". At closer inspection it appears that the number 1 is associated with the letter A, 2 with BCD, 3 with E, 4 is with FGH, 5 is with IJK, 6 is with LMN, 7 is with OPQ, 8 is with RST, 9 is with UVW and 0 is with XYZ. With this info the code numbers spell \"PINKY\" Hel and Trixie find a concealed bunker full of goods stolen from Pinky, including a mysterious weapon, diamonds, and a beautiful sword, which Trixie takes. Camero, believing she is in the midst of a double-cross, fights Hel for the diamonds. Camero overcomes Hel and sets Trixie afire along with barrels of flammable liquids. Camero leaves Hel in chains while she attempts to drive away with the diamonds; however, Hel quickly uses the super-machine gun to free herself, and fires a rocket that destroys the car Camero was driving.Hel admits to Trixie that she is a secret agent who reports to a man named Phoenix, and that she is on a mission to retrieve the weapon they found in Pinky's lair. Camero returns and again fights Hel. After she beats Hel to the ground, Camero assumes she is dead and moves to kill Trixie. As Trixie will not fight back, Camero attempts to rape her, but stops when she sees a tattoo and realizes Trixie was the mysterious contortionist from her past. Before she can kill Trixie, Camero is shot in the back and killed by Deputy Fuchs, who managed to survive the explosion. However, instead of thanking him, Trixie kills Fuchs using a hidden throwing star. Hel awakens, having survived Camero's attack. Trixie then reveals that she, in fact, is Pinky, and concocted the entire plot to retrieve the sword she took from Gage's bunker, which he had taken from her six months previously.","language":"English","box_office":"$199,436[3]","cinematography":"Stuart Asbjornsen","production_company":"Epic Slap[1]","directed_by":"Rick Jacobson","Music":"John R. Graham composed the musical score and the CD was released in 2009; featuring 29 songs. The film also features songs by AM Conspiracy, Rebel Vengeance and Eagles of Death Metal.[6]","release_dates":"September 14, 2009 (2009-09-14) (Toronto International Film Festival)|||||","produced_by":"Eric Gruendemann Rick Jacobson","starring":"Julia Voth Erin Cummings America Olivo Michael Hurst Minae Noji Lucy Lawless Kevin Sorbo Renée O'Connor","running_time":"109 minutes","bitch_slap":"Theatrical release poster","music_by":"John R. Graham","edited_by":"Joe McFadden Corey Yaktus","Release":"The film was released in the United States on January 8, 2010 in theaters and video-on-demand. It received a limited run of three weeks in three theaters and closed January 21.The film grossed $17,365 at the domestic (US and Canada) box office and $199,436 foreign.[3]An unrated DVD was released on March 2, 2010 in the United States.[7]Metacritic gave the film a score of 19% based on a weighted average of 5 reviews, indicating \"Overwhelming dislike\" from critics.[8] Rotten Tomatoes gave the film a score of 31% based on 16 reviews, where ratings below 60% are considered \"Rotten\".[9]In Daily Variety, IM Global's Stuart Ford described Bitch Slap as \"a pure exploitation pic — chicks, boobs, guns and bad guys, in that order.\"[10] In Variety, Joe Leydon wrote \"Overblown and underwhelming, 'Bitch Slap' is a desperately unfunny attempt to satirically recycle cliches and archetypes from sexploitation actioners of the 1960s and '70s\".[11] Amy Biancolli of the San Francisco Chronicle wrote \"The idea is to amuse anyone who's not offended by all the over-baked violence, bad acting and slapping babeage, but it's so heavy-handed and hyper-stylized that any extant wit gets smacked into submission. It's just not any fun.\"[12] Mark Olsen in the Los Angeles Times noted that, \"Despite its obsession with décolletage, Bitch Slap is surprisingly puritanical (much teasing, no pleasing).\"[13]","written_by":"Eric Gruendemann Rick Jacobson"}