{"based_on":"Bringing Out the Dead  by Joe Connelly","country":"United States","distributed_by":"North America Paramount Pictures International Buena Vista International","screenplay_by":"Paul Schrader","Plot":"In Manhattan in the early 1990s, Frank Pierce (Cage) is a burned-out paramedic who works the graveyard shift in a two-man ambulance team with various partners. Usually exhausted and depressed, he has not saved any patients in months and begins to see the ghosts of those lost, especially a homeless adolescent girl named Rose whose face appears on the bodies of others. Frank and his first partner Larry (Goodman) respond to a call by the family of a man named Mr. Burke who has entered cardiac arrest. Frank befriends Mr. Burke's distraught daughter Mary (Arquette), a former junkie. Frank discovers Mary was childhood friends with Noel (Anthony), a brain-damaged drug addict and delinquent who is frequently sent to the hospital.After a few minor calls, one involving Noel, Frank and Larry respond to a shooting. As Frank tends to one of the surviving victims, he notices two small vials of a drug emblazoned with the \"Red Death\" symbol roll out from the victim's sleeve onto the pavement. \"Red Death\" is a new form of heroin that has started plaguing the streets of New York and caused the number of cardiac arrest calls to sky-rocket. While in the back of the ambulance with Frank and Noel, the victim repents his drug dealing ways but dies before they can reach the hospital.The next day Frank is paired with his second partner Marcus (Rhames), an eccentric and stoic, if not cynical, EMT. They respond to a call to go to the aid of a man in a goth club who appears to have suffered a heart attack. Frank soon learns from one of the victim's band-mates that he has in fact been snorting way too much \"Red Death.\" As Frank injects the man with an antidote, Marcus, seeing what Frank has done and clearly aware that any recovery will be the result of the medication Frank has administered, adopts the demeanor of a revivalist preacher and invites the lookers-on to join hands and invoke God to revive the man. Just as his preaching climaxes, the overdosed man bolts upright, conscious again. On the way back to the hospital Frank swings by Mary's apartment building to tell her that her father's condition is improving.Frank and Marcus then respond to a call to assist a young Puerto Rican man whose girlfriend is lying on an upper floor of an abandoned building obviously in great pain. It soon becomes evident that she is giving birth to twins despite the young man's claim that both he and his girlfriend are virgins and that the birth is a miracle. As Frank and Marcus attempt to carry the woman downstairs to their ambulance, one baby is born alive but the other emerges apparently dead. Frank rushes this baby to the hospital but it later dies. In a moment of near-desperate despair Frank demands Marcus give him a drink, which Marcus does and joins. In a moment of inattention at the wheel, Marcus swerves to avoid crashing into a taxi stopped in the middle of the street and instead crashes the ambulance into a parked car, flipping it over. However, both Frank and Marcus emerge from the overturned ambulance with minor injuries. Frank walks off down the street shouting that he is quitting.The following morning, Frank sees a stressed Mary leaving the hospital and follows her to an apartment block. There, she tells Frank that she's going to visit a friend and asks him to wait for her downstairs. Instead, Frank escorts her up in the elevator to the apartment. After a while waiting in the hallway, Frank knocks on the apartment door and barges his way in, only to discover it's in fact a drug den run by a friendly dealer named Cy Coates (Curtis). Mary has turned back to drugs to cope with her father's fluctuating condition. Frank tries to get her to leave but he is dissuaded by Cy who offers Frank a pill. In another moment of desperation he swallows the pill and begins to hallucinate, seeing more ghosts of patients and the moment when he tried to save Rose. He wakes up screaming from his dream/hallucination, and grabbing Mary, carries her out of the building. While visiting a comatose Mr. Burke in the hospital, Frank starts hearing Burke's voice in his head, asking Frank to let him die, but, obviously conflicted, he assists a nurse in Burke's resuscitates instead.On his next shift Frank is paired with his third partner, Tom Wolls (Sizemore), an EMS veteran who seems half-crazed and more than eager to go out in search of more bloodied victims of the night. Earlier Tom had shown that he himself was also willing to inflict bloody pain on others when he beats Noel in the back of Frank's ambulance while Frank was attempting to take Noel back to the hospital. At this point Frank seems slowly to be losing his mind; while tending to a suicidal junkie, Frank berates the junkie for having botched his own suicide and, instructing him in the right way to slit one's wrists, presents the junkie with a pen knife, urging him to try again. The man runs away out of the ambulance and off into the night. The pair are then called to Cy's drug den where another shooting has occurred, only to find Cy impaled on the railing surrounding the terrace of the apartment below his own. It seems he had attempted to jump to safety from his own terrace and missed. Frank holds on to Cy as the fire department personnel use a torch to cut the railing to free Cy, but Cy and Frank nearly plunge to their deaths as the railing suddenly gives way. The two are, however, pulled back up. Cy then thanks Frank for saving his life—the first patient Frank has saved in months.Afterwards Frank agrees to help Tom subdue Noel, whom they discover smashing the windows of parked cars with a bat. Frank approaches Noel gaining his attention while Tom sneaks up behind Noel and kneels down, waiting for Frank to trip Noel by pushing him over his kneeling body. Instead, Frank takes the bat from Noel and himself bashes in a car's window, whereupon Noel discovers Tom's presence and runs away into the basement of a nearby building. Tom and Frank go after Noel, each entering a different building's basement. We follow Frank as he cautiously explores the dark basement corridor and appears to discover a number of homeless people huddled in rags and paper. Soon, Frank hears a commotion and discovers Tom beating Noel who lies writhing on the ground with the same baseball bat. Frank intervenes and they take Noel, now seriously injured, to the hospital.Now in the hospital, Frank searches for Mr. Burke and finds him alone in a new location, in a curtained-off partition in the ICU. As Frank approaches Mr. Burke, he again hears Burke's voice begging Frank to let him die. This time Frank removes Burke's breathing apparatus causing him to enter cardiac arrest, ending his life. Frank then heads to Mary's apartment to inform her. She seems to accept, maybe even welcome her father's death. Frank is invited in and falls asleep at Mary's side.","language":"English","Reception":"The film was well received by critics and holds a 71% \"Certified Fresh\" rating on Rotten Tomatoes, based on 105 reviews. The site's consensus reads, \"Stunning and compelling. Scorsese and Cage succeed at satisfying the audience.\"[7] Roger Ebert gave it a perfect four-star rating, writing, \"To look at Bringing Out the Dead—to look, indeed, at almost any Scorsese film—is to be reminded that film can touch us urgently and deeply.\"[8]Bringing Out the Dead debuted at #4 in 1,936 theatres with a week-end gross of only $6,193,052. Produced at a budget of $32 million but generating a revenue of just $16.7 million, the film was a box office bomb.","box_office":"$16.8 million[2]","cinematography":"Robert Richardson","production_company":"Paramount Pictures Touchstone Pictures","directed_by":"Martin Scorsese","release_dates":"October 22, 1999 (1999-10-22)|||||","Production":"The film was part of a trio of films in the late 1990s starring Nicolas Cage that were coproductions of Paramount Pictures and Touchstone Pictures, with Face/Off (1997) with John Travolta and Snake Eyes (1998) with Gary Sinise. Screenwriter Paul Schrader intentionally removed the novel's religious tone to distance it from his previous collaborations with Martin Scorsese. He explains, \"I intentionally took out a lot of the religious references of the book we adapted, because I knew Marty and I had done this so much. It was time to lay off it, because it was going to find its way in anyway.\"[6] The opening song on the movie is \"T.B. Sheets,\" a lengthy blues-influenced song, about a young girl who lies dying in a hospital bed, surrounded by the heavy smell of death and disease. It was written by Van Morrison and included on his 1967 album, Blowin' Your Mind!. The song was originally to be used in Taxi Driver. The director, Martin Scorsese, and Queen Latifah provided the voice of the ambulance dispatchers.","produced_by":"Barbara De Fina Scott Rudin","starring":"Nicolas Cage Patricia Arquette John Goodman Ving Rhames Tom Sizemore Marc Anthony","running_time":"121 minutes","music_by":"Elmer Bernstein","bringing_out_the_dead":"Theatrical release poster","edited_by":"Thelma Schoonmaker","budget":"32 million[1]"}