{"country":"United States","distributed_by":"Universal Pictures","Plot":"Billy Madison is the 27-year-old heir to a Fortune 500 hotel company that his father, Brian, has created. He spends his days drinking with friends and creating disturbances across his father's estate. One day, Billy ruins a dinner meeting between his father and his associates by acting obnoxiously. Brian loses confidence in his son and chooses the conniving Eric Gordon as his successor. When Billy begs his father to reconsider his decision, Brian reveals that he secretly bribed Billy's school teachers to give him passing grades. The two finally compromise: Billy must complete all 12 grades in two week intervals to prove he is competent enough to manage the company.Shortly after enrolling into school, Billy becomes attracted to a teacher named Veronica Vaughn, who initially ignores him. Nevertheless, Billy successfully progresses through his first two grades. He finds himself as one of Veronica's students in the third grade and earns her respect by standing up for Ernie, his friend and classmate. Billy becomes popular among the third graders and misses them as he advances through school. Billy's progress alarms Eric, who becomes increasingly agitated as Billy completes each grade. Eric blackmails Billy's principal, Max Anderson, into claiming that Billy bribed him for passing grades.Brian swiftly terminates his agreement with Billy and renames Eric as his successor. Billy grows distraught and reverts to his carefree lifestyle. Veronica motivates him to return to school, while his grade school classmates convince Max to retract his bribery accusations. Brian agrees to give Billy another chance but Eric cites that Billy failed the challenge by taking more than two weeks to complete a grade. He then threatens to sue Brian if he does not pass the company onto him. Billy intervenes and challenges Eric to an academic decathlon to finally settle their feud.Both men excel in different activities but Billy manages to take a single-point lead before the contest's final event, a Jeopardy!-style academic test. Billy stumbles on the opening question in the event, and Eric is given the chance to win the contest by answering a question about business ethics. Eric is unable to withstand the pressure and breaks down. He brandishes a handgun, but Max tackles Eric before he can harm Billy. Eric recovers from the attack and attempts to shoot Veronica, but he is shot by Danny McGrath, a rifle-wielding madman whom Billy apologized to earlier for bullying him.At his graduation, Billy is delivering a speech. Billy announces he will pass the hotel business to Carl Alphonse, one of his father's more polite businessmen, and attend college in order to become a teacher. Eric watches on and fumes in frustration over Billy's decision.","billy_madison":"Theatrical release poster","language":"English","Reception":"Billy Madison received mixed to negative reviews. On Metacritic, the film has a rare score of 16 based on 13 reviews, stating \"overwhelming dislike\".[2] On the film review aggregator site Rotten Tomatoes, it received a 46% rating from reviews, with a consensus summary of \"Billy Madison is typical early immature fare from Adam Sandler, even if it finds moments of inspired lunacy\".[3]Richard Schickel panned the film, calling it \"one of the most execrable movies ever made\".[4] Peter Rainer of the Los Angeles Times commented; \"Sandler has a bad habit of thinking he is funnier than we are\".[5]\" On At the Movies, Gene Siskel and Roger Ebert both gave the film thumbs down, and Roger Ebert said of Sandler, \"...Not an attractive screen presence, he might have a career as a villain or a fall guy or the butt of a joke, but as the protagonist his problem is he creates the fingernails on the blackboard.\" Gene Siskel added \"...you don't have a good motivation for the character's behavior\". Owen Gleiberman also panned the film, saying \"By the end, you feel like a drill sergeant—you want to wipe that stupid grin off Sandler's face\".[6] Rita Kempley of The Washington Post said the film was trying to be \"A more kid-friendly version of 'Dumb and Dumber.' And there's even a moral: 'Yahoo for education,' though the movie doesn't really put any muscle behind it.\"[7]Janet Maslin of The New York Times gave the film a mixed review, saying \"It succeeds as a reasonably smart no-brainer. If you've ever had a yen to relive the third grade, this must be the next best thing.\"[8] Brian Lowry of Variety also gave the film a mixed review, saying \"There are a few bursts of sheer, irresistible idiocy—along the lines of 'Wayne's World' or even 'Pee-wee's Big Adventure'—but not enough to sustain the more arid stretches.\"[9]Billy Mowbray of Film4 gave the film a positive review, writing: \"When you get that Sandler's comedic persona is meant to be annoying, like Beavis and Butthead or Cartman, the laughs come thick and fast\".[10] Kevin N. Laforest said, \"Okay, the plot is inane, but it's the basis of a series of really funny scenes.\"[11]","box_office":"$26.4 million","cinematography":"Victor Hammer","directed_by":"Tamra Davis","release_dates":"February 10, 1995 (1995-02-10)","produced_by":"Robert Simonds","starring":"Adam Sandler Bradley Whitford Josh Mostel Bridgette Wilson Norm Macdonald Darren McGavin","running_time":"89 minutes","music_by":"Randy Edelman","edited_by":"John Gilroy Jeffrey Wolf","written_by":"Adam Sandler Tim Herlihy","budget":"$10 million"}