{"based_on":"characters created by Aurania Rouverol","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot summary":"Returning to his hometown of Carvel after several years' absence, Andrew \"Andy\" Hardy (Mickey Rooney), now a high-flying West Coast lawyer, reminiscences about his past (with flashbacks to his earlier filmed exploits alongside Judy Garland and Esther Williams et al) and reconnects with his mother, aunt, sister (returning co-stars Fay Holden, Sara Haden and Cecilia Parker respectively) and nephew Jimmy (Johnny Weissmuller, Jr.) as he attempts to convince the skeptical townsfolk to let his company build a factory there.When his plan to buy land from his old friend Beezy (now played by Rooney's TV co-star Joey Forman) runs into difficulty, Andy brings his wife, Jane, (Patricia Breslin) and two children, Andy Jr. (played by Rooney's real-life son Teddy) and Cricket, to bolster his resolve, and to help him live up to the lessons instilled in him by his late father.While all seems lost, the closing moments re-position the resurrected series for a new set of Andy Hardy movies, but these never materialized.[2]","language":"English","Reception":"According to MGM records, the movie earned $400,000 in the US and Canada and $210,000 elsewhere, making a loss to the studio of $5,000.[1]Before the film was released, Hutshing and Donley worked on a sequel about Andy Hardy as a judge called Andy Hardy Carries On.[9] There was also some talk of an Andy Hardy TV series.[10] In the early 1960s, a pilot was shot for a prospective Andy Hardy sitcom for NBC, with a totally different cast and with the character of Judge Hardy returning. But NBC did not pick it up as a series.","box_office":"$610,000[1]","cinematography":"William W. Spencer Harold E. Wellman","production_company":"Fryman Enterprises","directed_by":"Howard W. Koch","release_dates":"22 December 1958","Production":"Songwriter Robert Donley and journalist Edward Hushting wrote an original Andy Hardy synopsis on \"spec\" and brought it to Rooney's agent, Red Doff. He showed it to Rooney, who was enthusiastic, and they pitched the project to MGM as a co-production with Rooney's own company, Fryman Enterprises.[3][4] The studio, then under the control of Joseph Vogel agreed to make the film.[5][6]\"We feel it's time for another Hardy picture,\" said Doff. \"Time for a good, warm, wholesome family comedy - no violence, no monsters, no sex! There are millions who have seen and loved the Hardys - and who would like to see them again. And there are millions who never saw them on the big screen but who are being presold by seeing them on TV. People like things nostalgic. We believe they'll be curious to see a re-creation of what they loved 15 and 20 years ago.\"[3]Lewis Stone, who had played the beloved Judge Hardy in the earlier films, had died in 1953, and his character's passing was noted in the film. Fay Holden, Sara Haden and Cecilia Parker all reprised their roles. (The latter had been mostly retired since the series ended, devoting herself to raising her children.[7]) Mickey Rooney tried to persuade Ann Rutherford to return as Polly Benedict, Andy's on-and-off sweetheart in most of the original movies, but Rutherford refused.[8] In line with MGM's practice of introducing studio contract players in the series, contractee Pat Cawley was given a role.[3]Filming started 7 May 1958.[3]","produced_by":"Red Doff","starring":"Mickey Rooney Patricia Breslin Fay Holden","running_time":"80 min.","music_by":"Van Alexander","External links":"","edited_by":"John Baxter Rogers","written_by":"Edward Everett Hutshing Robert Morris Donley additional dialogue Harry Ruskin","budget":"$313,000[1]"}