{"based_on":"Game Brain  by Jeanne Marie Laskas","country":"United States","distributed_by":"Columbia Pictures","Plot":"In 2002, former Pittsburgh Steelers center Mike Webster is found dead in his pickup truck. Bennet Omalu, a forensic pathologist with the Allegheny County, Pennsylvania cororner's office, handles Webster's autopsy, and discovers that he has severe brain damage. He ultimately determines that Webster died as a result of the long-term effects of repeated blows to the head—a disorder he calls chronic traumatic encephalopathy (CTE). With the help of former Steelers team doctor Julian Bailes, fellow neurologist Steven T. DeKosky and county coroner Cyril Wecht, Omalu publishes a paper on his findings, which is initially dismissed by the NFL.Over the next few years, Omalu discovers that three other deceased former NFL players, Terry Long, Justin Strzelczyk and Andre Waters, had symptoms very similar to Webster's. He finally persuades newly appointed NFL commissioner Roger Goodell to allow him to present his findings before a committee on player safety. However, the NFL does not take him seriously and he is barred from the committee meeting, forcing Bailes to give the presentation in his place.Omalu is subjected to considerable pressure to back down from his efforts. Wecht is subjected to a politically motivated prosecution on corruption charges. Omalu's wife, Prema, suffers a miscarriage after being stalked. The Omalus are forced to leave their dream home outside Pittsburgh. They move to Lodi, California, where Omalu takes a job with the San Joaquin County coroner's office. However, he is vindicated when former NFL Players Association executive Dave Duerson commits suicide due to growing cognitive problems – in his suicide note, Duerson admits that Omalu was right. Omalu is allowed to address an NFLPA conference on concussions and CTE. Amid growing scrutiny from Congress, the NFL is forced to take the concussion issue more seriously.Omalu is offered a job as chief medical examiner for the District of Columbia, but turns it down in order to continue working hands-on with autopsies. The film concludes with the death of Junior Seau.","language":"English","Reception":"Concussion grossed $34.5 million in North America and $14.1 million in other territories for a worldwide total of $48.6 million, against a budget of $35 million.[3]In the United States and Canada, the film opened on December 25, 2015 alongside Daddy's Home, Joy, Point Break and the nationwide expansion of The Big Short. In its opening weekend, the film was projected to gross $8–10 million from 2,841 theaters.[17] It eventually grossed $10.5 million, finishing 7th at the box office.[18] Due to Smith's star status and the $35 million production budget, the film was considered a box office disappointment.[19][20]On Rotten Tomatoes, the film has a rating of 61%, based on 175 reviews, with an average rating of 6.1/10. The site's consensus reads, \"Concussion lands a solid, well-acted hit on its impressively timely subject matter, even if its traditional sports drama structure is a little too safe to deserve a full-on dance in the end zone.\"[21] On Metacritic, the film has a score of 55 out of 100, based on 39 critics, indicating \"mixed or average reviews\".[22] On CinemaScore, audiences gave the film an average grade of \"A\" on an A+ to F scale.[18]Will Smith's performance was praised for being \"sensitive [and] understated\" by The Denver Post.[23]","box_office":"$48.6 million[3]","cinematography":"Salvatore Totino","directed_by":"Peter Landesman","production_companies":"LStar Capital Village Roadshow Pictures Scott Free Productions The Shuman Company Cara Films The Cantillon Company","release_dates":"November 10, 2015 (2015-11-10) (AFI Fest)|December 25, 2015 (2015-12-25) (United States)||||","Production":"Ridley Scott's idea of an NFL concussion film was inspired by Dr. Bennett Omalu's study about former NFL stars Junior Seau and Dave Duerson, both of whom committed suicide after suffering from chronic traumatic encephalopathy (CTE). Scott was set to direct after his film Exodus: Gods and Kings, while he and Facio were looking for an A-list writer.[5] In November and December 2013, two more NFL concussion films were in development, first Game Time Decision with writer/director and former NFL wide receiver Matthew A. Cherry and actor Isaiah Washington,[6] and another film League of Denial with producers Walter Parkes and Laurie MacDonald.[7] Landesman had based his script on the 2009 GQ article Game Brain by Jeanne Marie Laskas.[8] Smith and Marsan previously appeared together in the 2008 superhero film Hancock.Principal photography started on October 27, 2014, in Pittsburgh, Pennsylvania, and filmed there through mid-January. One of the film's key scenes was shot in Altius Restaurant in the Mt. Washington section of Pittsburgh. Other area scenes were shot at a church in Pittsburgh's Hill District, the Braddock Carnegie Library,[9] and in downtown Pittsburgh.[10]James Newton Howard composed the score for the film. Klayton (frontman of Celldweller) provided synth programming for the score.[11] R&B singer Leon Bridges provided a new song, called \"So Long\".[12]","produced_by":"Ridley Scott|Giannina Facio|David Woltroff|Larry Shuman|Elizabeth Cantillon|","starring":"Will Smith|Alec Baldwin|Gugu Mbatha-Raw|Arliss Howard|Paul Reiser|Luke Wilson|Adewale Akinnuoye-Agbaje|David Morse|Albert Brooks|","running_time":"122 minutes[1]","concussion":"Theatrical release poster","Controversy":"Family members of Dave Duerson, a former NFL player who suffered from CTE, claimed the film portrayed Duerson in a bad light. In one scene, Duerson's character called Omalu's character a \"quack\" in addition to telling him \"to go back to Africa\" and \"get away from our game.\"[26] In another scene, Duerson is shown mocking former NFL player Andre Waters when he filed an application for benefits in connection with head injuries he sustained while playing in the NFL. Duerson's family members called these scenes false. In response, Landesman, the film's director, stated that the film was \"emotionally and spiritually accurate all the way through\".[26]Slate science writer Daniel Engber, who has been skeptical of the link between CTE and the deaths of players found to have had it,[27] called the film inaccurate in other ways, for example suggesting that Wecht's arrest on corruption charges was motivated by Omalu's paper, when in fact it was published three months afterwards. \"[The film] feeds into a pervasive myth at the center of the national discussion over football and head injuries,\" he charges.[28] In particular, he cites a 2012 National Institute for Occupational Safety and Health study[29] indicating that football players, on average compared to the population as a whole, live longer and generally healthier lives, though the study also indicates, as Engber points out, that former football players are also more likely to suffer, and die, from neurodegenerative disease.[28]","music_by":"James Newton Howard","edited_by":"William Goldenberg","Release":"Sony set the film to release on December 25, 2015.[13]The first trailer was released on YouTube on August 31, 2015 by Sony Pictures Entertainment.[14]Marketing includes advertisements for the film airing during NFL games.[15]Concussion was released on Digital HD on March 15, 2016, before being released two weeks later on DVD, Blu-ray and 4K Ultra HD on March 29, 2016.[16]","written_by":"Peter Landesman","budget":"$57 million[2]"}