{"country":"United States","distributed_by":"Orion Pictures","code_of_silence":"Promotional movie poster for the film","Plot":"October 17, 1984: It is late morning in Chicago's Uptown neighborhood where a sting operation is taking place. Sergeant Eddie Cusack (Chuck Norris) and his crack team of Chicago Police detectives take their positions, including Lieutenant Kobas (Joseph Kosala), stationed on a rooftop with Detectives Brennan (Ron Dean) and Music (Gene Barge) as lookouts, along with alcoholic Detective Cragie (Ralph Foody) and rookie Nick Kopalas (Joseph Guzaldo) in a cemetery. An undercover informant is about to meet a buyer at an 'L (or \"el\")' train stop. Cusack and partner Dorato (Dennis Farina) use a garbage truck to patrol beneath the train tracks.The carefully orchestrated sting is a basic meet-and-greet exchange set up by cocaine supplier Victor Comacho (Ron Henriquez). Victor is the younger brother of Luis Comacho (Henry Silva), leader of a vicious drug gang known as the Comachos. Everything goes horribly wrong when a rival gang led by mafia drug lord Tony Luna (Mike Genovese) infiltrates the sting as a crew of painters and mercilessly guns down the attendees. After money and cocaine are exchanged, the aftermath is grim; Cusack's informant is dead and Dorato is wounded. Kopalas is also eyewitness as Cragie accidentally guns down a teenager, then plants his backup weapon on the victim.Kopalas is partnered with Cusack, with Cragie put on a desk until a department hearing. Commander Kates (Bert Remsen) expresses disgust with the outcome of the sting, while Eddie notes that the Comachos won't take the hit on their gang lightly. Kates agrees. He releases Eddie with one warning: \"Find who burned the Comachos before they do.\"After learning that one of his gang members was shot by police, and that Victor Comacho survived, Tony Luna decides to leave town. He asks Lou Gamiani (Lou Damiani) to have someone guard his daughter, Diana Luna (Molly Hagan), a young artist. Gamiani feels he has put the entire outfit at risk.Apart from breaking in a new partner, and the introduction of the new Prowler police three-axle robot, Eddie is shunned by other officers for his refusal to sign a petition to have Cragie cleared. He bluntly tells Brennan: \"If Cragie doesn't get off the streets, he's gonna kill somebody else, or get somebody killed.\"Tailing Gamiani to the Lincoln Park Zoo, the detectives witness a tense exchange between him and Diana. Cusack discovers who Diana's father is. He and Kopalas stake out the Luna residence as the Comacho funeral procession comes through the neighborhood. They visit Tony Luna's uncle, Felix Scalese (Nathan Davis), to request he stop the imminent conflict.Responding to a DOA call in Lincoln Park, Brennan and Music identify the victim, who had been given a \"Colombian Necktie\", as Tony Luna's bag man. Brennan notes another call to Luna's restaurant, where the officers found the mutilated owner hanging from a meat hook. A car lot run by Tony Luna is firebombed and the owner burned alive. A vicious gang war has begun.Posing as food vendors, the Comachos brutally gun down every member of the Luna household. Cusack, knowing they will go after Diana to bring Luna out of hiding, tries to get to her first. Gamiani is stabbed to death. Cusack and Kopalas arrive on the scene. Cusack takes off after Diana, who is being chased by several Comacho gang members. In an alley. Cusack surprises them at gunpoint. One takes Diana hostage with a knife, but Cusack disarms the three remaining suspects and goes after the one with the girl. He follows them to the Randolph/Wells (CTA) elevated station and boards a train. A standoff ensues, leading to a fight on the roof of the eight-car train. At a bridge crossing, the gang member jumps into the Chicago River, where he is run over by a speedboat.Cusack then places Diana in a safe house with his old friend Pirelli (Allen Hamilton), a retired Chicago police officer who was the partner of Cusack's father. At a hearing, Kopalas decides to back Cragie's story. Other officers resent Cusack for his testimony, where it is revealed that he once documented a transfer order to have Cragie transferred out of his unit. Hence, a \"Code of Silence\" is in effect against Cusack, with his only confidant being Detective Dorato.Pirelli ends up dead and Diana missing. Cusack races toward the Comacho hangout and puts out a radio call for backup, but due to the hearing, other officers refuse to respond. He fights off Luis and other Comacho gang members by himself. Luis tells Cusack he wants Tony Luna, otherwise Diana dies, painfully and slowly.Dorato tips off Cusack that Tony Luna was lying low in Wisconsin, returning to Chicago that night by train. Eddie waits outside the station, watching as Luna climbs into Scalese's limousine. Scalese chastises his nephew for igniting a gang war. The driver notices Cusack following and a wild chase ensues. The limo strikes a stalled car and overturns onto its roof, with Luna and Scalese killed in the explosion. Cusack, in need of a partner, returns to police headquarters and retrieves the Prowler robot, single-handedly launching a full-scale attack on the Comachos' lair in East Chicago, Indiana.Other detectives berate Cusack for his actions. Kopalas, fed up, tells everyone off and confronts Cragie, stating that he will no longer lie for him. He reveals to the squadroom that Cragie planted the gun on the teen he killed.Cusack takes down the remaining Comacho members. Luis, wounded, enters a bathroom where Diana is bound. He raises a hammer, but Cusack shoots and kills him.Backup arrives at last. Cusack places Diana in the care of the CFD ambulance crew. Commander Kates asks will he come in the next day, and Cusack, finally having regained the respect from his fellow officers, agrees. Dorato gives him a ride back to headquarters.","language":"English","Reception":"The film received mixed to positive reviews.[4][5][6][7] It's considered by fans and critics as Chuck Norris's best film to date. Vincent Canby of The New York Times said \"it could well prove to be his breakout picture\".[8]Roger Ebert, in his Chicago Sun-Times review of May 3, 1985, wrote: \"This is a heavy-duty thriller, a slick, energetic movie with good performances and a lot of genuine human interest...a stylish urban action picture with sensational stunts.\" He gave the film three-and-a-half stars of a possible four. Gene Siskel in the Chicago Tribune also praised the film, writing: \"Chuck Norris takes a big leap in his film career with Code of Silence...it's been a long time between cop pictures that have any kind of gritty feel. Clint Eastwood's last two Dirty Harry films were cartoonish by comparison.\"Janet Maslin's review in the New York Times on the same day alluded to the film being \"Norris's bid for a wider audience, and it succeeds to a considerable degree.\"The film was released by Orion Pictures in early May 1985. It debuted at number 1[9] with a weekend total of $5,512,461.[10] The film went on to gross a total of $20,345,361, making it the second most successful Chuck Norris vehicle at the time behind Missing in Action (1984).","box_office":"$20,345,561","cinematography":"Frank Tidy","directed_by":"Andrew Davis","release_dates":"May 3, 1985 (1985-05-03)|||||","Production":"Screenwriters Michael Butler and Dennis Shryack originally wrote this in 1979 for Warner Bros. as Dirty Harry IV: Code of Silence.[2] When it wasn't made there, the script was briefly in the possession of Canadian producer Gene Slott, who was looking to make it in 1980.[3]","produced_by":"Raymond Wagner","starring":"Chuck Norris|Henry Silva|Bert Remsen|","running_time":"101 minutes","music_by":"David Michael Frank","edited_by":"Christopher Holmes Peter Parasheles Russ Kingston","written_by":"Michael Butler Dennis Shryack Mike Gray"}