{"based_on":"The Addams Family created by|Charles Addams|","country":"United States","distributed_by":"Paramount Pictures","Plot":"Gomez and Morticia Addams hire a nanny, Debbie, to take care of their new son Pubert. Unbeknownst to them, Debbie is a serial killer known as the Black Widow; she marries rich bachelors and murders them on their wedding night so she can collect their inheritances.After Debbie seduces Uncle Fester, Wednesday becomes suspicious. To get rid of her, Debbie tricks Gomez and Morticia into believing Wednesday and her brother Pugsley want to go to summer camp. They are sent to Camp Chippewa, run by the overzealous Gary and Becky Granger, where they are singled out for their macabre dress and behavior. Joel, a nerdy bookworm who also does not fit in, becomes interested in Wednesday.Debbie and Fester become engaged. At their bachelor and bachelorette parties, Debbie is horrified by the Addams family. On their honeymoon, she tries to kill Fester by throwing a radio in the bathtub, but he survives. Frustrated by his resilience, Debbie forces him to sever ties with his family; when they try to visit Fester at Debbie's mansion, they are removed from the premises. At home, the Addams find to their alarm that Pubert has transformed into a rosy-cheeked, golden-haired baby. Grandmama diagnoses this as a result of his disrupted family life, and Gomez becomes depressed.At camp, Wednesday is cast as Pocahontas in Gary's saccharine Thanksgiving play. When she refuses to participate, she, Pugsley and Joel are forced to watch upbeat Disney and family films. Afterwards, Wednesday feigns cheerfulness and agrees to the play. During the performance, she stages a coup d'etat, capturing Amanda, Gary and Becky, setting the camp on fire and sending it into chaos. As she, Joel and Pugsley escape, Wednesday and Joel share a kiss.Debbie tries to kill Fester by blowing up their mansion. When he again survives, she pulls a gun and tells him she is only interested in his money. Thing intervenes and Fester escapes. Fester apologizes to Gomez for his mistakes, and Wednesday and Pugsley return home, the family reunited. Debbie ties the family to electric chairs, explaining that she killed her parents and first two husbands for selfish and materialistic reasons. Upstairs, Pubert, who has returned to normal, escapes from his crib and is propelled into the room where the family is being held. Debbie throws the switch to electrocute the family, but Pubert manipulates the wires, reversing the current and electrocuting her.Months later, at Pubert's first birthday party, Fester laments Debbie's loss but is smitten with Mr. & Mrs. Itt's new nanny, Dementia. Wednesday tells Joel that Debbie was a sloppy killer, and she would instead scare her husband to death. As Joel lays flowers on Debbie's grave, a hand erupts from the earth and grabs him; he screams and Wednesday smirks.","language":"English","Critical reception":"Critics complimented the film with largely positive reviews. Rotten Tomatoes gives the film a 78% based on 46 reviews.[3][4] The site's consensus reads, \"New, well-developed characters add dimension to this batty satire, creating a comedy much more substantial than the original.\"Janet Maslin of The New York Times wondered if \"the making of this sequel was sheer drudgery for all concerned\", then answered herself by writing, \"There's simply too much glee on the screen, thanks to a cast and visual conception that were perfect in the first place, and a screenplay by Paul Rudnick that specializes in delightfully arch, subversive humor.\"[5] Leonard Klady was slightly less enthusiastic in his Variety review, noting, \"It remains perilously slim in the story department, but glides over the thin ice with technical razzle-dazzle and an exceptionally winning cast.\"[6]Richard Schickel, writing for Time magazine, called it \"an essentially lazy movie, too often settling for easy gags and special effects that don't come to any really funny point.\"[7]The film was nominated for an Academy Award in the category Best Art Direction (Ken Adam, Marvin March),[8] and Huston was nominated for the 1993 Golden Globe Award for Best Actress – Motion Picture Musical or Comedy for her performance as Morticia, a reprise of her Golden Globe-nominated performance in the 1991 original. The film won also a Golden Raspberry Award for Worst Original Song for the song \"Addams Family (Whoomp!)\".Addams Family Values was nominated for AFI's 100 Years...100 Laughs.[9]","box_office":"$48,919,043 (North America)[1]","cinematography":"Donald Peterman","directed_by":"Barry Sonnenfeld","Home media":"The film was released on DVD in 2000 with two theatrical trailers as special features. It was re-released in 2006 with the first film on a single disc, with no new features.In Australia, the film was released on VHS by Paramount Home Entertainment (Australasia) in 1994. In 2002 the film was released on DVD with theatrical trailers in the extra features.","release_dates":"November 19, 1993 (1993-11-19)|||||","Box office":"Addams Family Values opened at #1 at its initial weekend with a reported total of $14,117,545.[10] In its second week, the film dropped to #2 behind Mrs. Doubtfire, and in its third week to #3 behind Mrs. Doubtfire and A Perfect World.[11]Its final domestic box office take was $48,919,043,[12] a significant decline from the previous film's domestic total of $113,502,426,[13] but could still be considered successful overall internationally.","produced_by":"Scott Rudin","starring":"Anjelica Huston Raúl Juliá Christopher Lloyd Joan Cusack Christina Ricci Carol Kane Jimmy Workman Carel Struycken David Krumholtz","running_time":"94 minutes","music_by":"Marc Shaiman Ralph Sall","addams_family_values":"Theatrical release poster","edited_by":"Arthur Schmidt Jim Miller","written_by":"Paul Rudnick"}