{"country":"France","distributed_by":"ARP Sélection (France) Sony Pictures Classics (US)","Plot":"It is 1940. When the movie begins, film star Viviane Denvert sits in the audience of a premiere of her new movie and notices a man who keeps staring at her. She is disturbed, and when the film is over and the audience has finished praising her, she rushes home, discovering that she is pursued by that same man. He chases her into her apartment.An hour later, Frédéric Auger, a young writer, receives a call from Viviane, who was his childhood crush. Viviane, who has long used Frédéric's devotion, asks him to come to her apartment immediately.Upon arriving, he discovers a corpse, \"accidentally\" killed, which Viviane asks him to dispose of, claiming that the man had been harassing her and when she slapped him, he fell over the edge of the balcony. He agrees to help her and the two pack the corpse into the trunk of his car; however, as it is raining, he accidentally drives into a curb and hits a police signalling device. The trunk opens upon impact, revealing the dead body to the arriving police, and Frédéric is arrested and sent to prison. On the eve of the German occupation of Paris, all of the city's citizens evacuate, including the prisoners. Prisoners are paired up with another and handcuffed together. Frédéric and his cellmate Raoul take advantage of the confusion to escape. Frédéric takes the train to Bordeaux, where he learns that Viviane is. Raoul is also on the train and he leads Frédéric to a seat near another girl, Camille. Camille is a student of a physics professor; the two of them are guarding French stocks of heavy water that they want to ship to England before the Germans can get their hands on it.The remainder of the film traces the confused adventures of the characters as they evade the Germans and seek rest and companionship. Some decide to stay in France while others go underground or escape to London. In a very short scene, a quite recognizable General Charles de Gaulle is told \"Bon voyage\" by one of his aides.Frédéric eventually falls for Camille. At the end of the film, he returns from England and meets with Camille at an outdoor café. When the Germans see them, the couple flees and sneak into a movie theatre. When Frédéric sees one of the Germans enter the theater in search for them, he turns and kisses Camille. They stop once their pursuers leave. Frédéric looks up at the screen and is surprised to see Viviane singing and dancing. Frédéric turns to Camille, and they resume kissing as the film comes to a close.","language":"French","box_office":"$15 million [1]","cinematography":"Thierry Arbogast","directed_by":"Jean-Paul Rappeneau","release_dates":"16 April 2003 (France)","produced_by":"Laurent Pétin Michel Pétin","starring":"Isabelle Adjani Gérard Depardieu Peter Coyote Grégori Derangère","running_time":"114 min","music_by":"Gabriel Yared","written_by":"Jean-Paul Rappeneau Patrick Modiano","budget":"$27.3 million"}