{"country":"United Kingdom United States","distributed_by":"The Samuel Goldwyn Company","Plot":"Donny runs a junk shop in a city's sparsely populated and decaying neighborhood. Teach, who has no visible means of support, spends many hours each day at the shop, as does Bobby, a young man who is eager to please Donny in any way he can.Teach comes up with a scheme to rob the home of a man whose safe is said to contain rare coins. Bobby is often sent on errands for food or information. Teach's nerves are already on edge when Bobby suddenly returns to say that a third man involved in that night's robbery can't go through with it because he is in the hospital. Donny distrusts what he is hearing and is unable to locate the man in the hospital, whereupon Teach angrily turns on Bobby.","american_buffalo":"Theatrical release poster","language":"English","Reception":"Stephen Holden called it an \"ugly fable of American free enterprise at the bottom of the food chain,\" adding, \"With its staccato, profanity-laced language and metaphorically potent setting, American Buffalo folds a stylized parody of American gangster movies into a bleak Samuel Beckett vision that is wide enough to accommodate many interpretations....In filming American Buffalo, Mr. Corrente has taken as conventionally naturalistic an approach as the play permits, playing down its social metaphors to concentrate on the characters' psychology.\"[3] Lisa Schwarzbaum gave the film a \"B\", saying \"American Buffalo is about nothing less Mametian than commerce, friendship, betrayal, despair, and American hustle. Director Michael Corrente (Federal Hill) works at getting the story off the stage (it's set in a junk shop) by occasionally moving to an empty, decrepit city street. But mostly he just locks on to Hoffman and Franz.\"[4]Roger Ebert gave the film (2½ out of four stars), saying \"It is a cliché, but true, that some plays have their real life on the stage. American Buffalo is a play like that—or, at least, it is not a play that finds its life in this movie....Because the film never really brings to life its inner secrets, it seems leisurely, and toward the end, it seems long. It doesn't have the energy or the danger of James Foley's film version of Mamet's Glengarry Glen Ross. The language is all there, and it is a joy, but the irony is missing. Or, more precisely, the irony about the irony.\"[5]Two months later, upon the film's UK release, Anne Billson of The Daily Telegraph concluded \"The film's principal interest lies, as it always does with Mamet, in the hypnotic language; repeat your sentences about 20 times, shuffling the word order, repeat the first name of whomever you're talking to as though it were a mantra, add a judicious sprinkling of obscenities, and you've got the general idea. Franz, of television's NYPD Blue, is terrific, but Hoffman, performing in \"street\" mode, complete with long greasy hair, never allows you to forget that he's reciting lines. Eventually the hypnotic repetitiveness of the language and the total lack of action did their work, and the dreaded Sandman, who hovers constantly at the shoulder of all film reviewers, paid me one of his visits.\"[6]","box_office":"$632,054[1]","cinematography":"Richard Crudo","production_company":"Capitol Films Channel Four Films","directed_by":"Michael Corrente","Soundtrack":"The score was composed and orchestrated by Thomas Newman. In addition to Newman on piano, musicians included Steve Kujala (reeds); George Doering, Bill Bernstein, Rick Cox, (guitars); Harvey Mason (drums); and Mike Fisher (percussion).[7]It was released by Varèse Sarabande, paired with Newman's work for the unrelated 1994 film Threesome (tracks 12-20).[citation needed]","release_dates":"September 13, 1996 (1996-09-13)|||||","Production":"Al Pacino, who originated the role of Teach on Broadway, was the first choice to play the role in the adaptation; however, Pacino did not respond in a timely fashion so Corrente offered the role to Dustin Hoffman. The film was shot on location in Pawtucket, Rhode Island, Corrente's home town.[3]","produced_by":"Gregory Mosher","starring":"Dustin Hoffman Dennis Franz","running_time":"88 minutes","music_by":"Thomas Newman","edited_by":"Kate Sanford","written_by":"David Mamet"}