{"country":"United States","distributed_by":"Columbia Pictures","Plot summary":"In 1965, Peter Joseph \"Peejoe\" Bullis lives in a small town in Alabama during the height of the Civil Rights Movement. He becomes involved with a group of black students protesting the town's racially segregated municipal swimming pool, leading to a protest that explodes into deadly violence. A young black boy, Taylor Jackson, is killed by the town sheriff. Peejoe, the only witness, is pressured by the sheriff to keep it quiet. However, Peejoe has learned from the example of his free-spirited Aunt Lucille Vinson, who has killed her abusive husband and is headed for Hollywood, where she is convinced that television stardom awaits her.Lucille takes her husband's head everywhere she goes in a black hat box[1] and looks forward to Hollywood promises. When the head is discovered by the hostess of a party, Lucille tries to get rid of the head by throwing it off the Golden Gate Bridge. Two policemen, thinking she is about to jump over herself, open the hat box and discover the head inside. She is arrested and escorted back to Alabama for her trial, where she is given a warm welcome by her town.After being convicted of first-degree murder, Lucille is sentenced to twenty years in prison. However, the sentence is suspended, and she is put on a five-year probation with the condition that she seek psychiatric help. Lucille, her children, and all her friends joyfully exit the courtroom while the sheriff (through Peejoe's testimony) is put under arrest for Taylor's murder.","language":"English","Reception":"Crazy in Alabama received mixed though primarily poor reviews from critics, scoring a 30% approval rating on Rotten Tomatoes based on 56 reviews,[2] as well as a score of 46 out of 100 on Metacritic based on 27 reviews.[3] Melanie Griffith earned a Razzie Award nomination for Worst Actress for her performance in the film but lost out to Heather Donahue for The Blair Witch Project.[4] However, her performance in this film and Another Day in Paradise earned her the Sant Jordi Award for Best Foreign Actress. Lucas Black was nominated for the Young Artist Award for Best Performance in a Feature Film - Leading Young Actor and YoungStar Award for Best Young Actor/Performance in a Motion Picture Drama. The director, Antonio Banderas, won the 2000 ALMA award for Outstanding Director of a Feature Film,[5] the European Film Award for Outstanding European Achievement in World Cinema, and was nominated for a Golden Lion.","box_office":"$2,005,840","cinematography":"Julio Macat","directed_by":"Antonio Banderas","release_dates":"October 22, 1999 (1999-10-22)|||||","produced_by":"Debra Hill","starring":"Melanie Griffith David Morse Lucas Black Cathy Moriarty Meat Loaf Rod Steiger Richard Schiff John Beasley","running_time":"111 minutes","music_by":"Mark Snow","edited_by":"Robert C. Jones","written_by":"Mark Childress","budget":"$15 million"}