{"country":"Macedonia United Kingdom","distributed_by":"Mikado Film","Plot":"Set against the background of political turbulence in Macedonia and contemporary London, three love stories intertwine to create a powerful portrait of modern Europe in Milcho Manchevski’s Before the Rain.When a mysterious incident in the fabled Macedonian mountains blows out of proportion, it threatens to start a civil war, and brings together a silent young monk, a London picture editor, and a disillusioned war photographer in this tragic tale of fated lovers. Told in three parts, and linked by characters and events, Before The Rain explores the uncompromising nature of war as it ravages the lives of the unsuspecting, and forces the innocent to take sides.In the first episode, Words, we meet Kiril, a young monk who has taken a vow of silence, who stands up for Zamira, a young Albanian girl who is accused of murder and is on the run from a mob. For her sake, Kiril leaves the monastery and the two of them make their way through the Macedonian landscape, but their romance is heading towards a sudden and brutal end.Faces is set in bustling and trendy London. Anne, a picture editor, is torn between the love of her husband Nick and the attraction she feels for Aleksandar, a disillusioned war photographer. She is pulled into a series of tragic events by a shoot-out at a nearby restaurant.The third and final story, Pictures, brings the two previous stories together. It focuses on Aleksandar's return to Macedonia to settle. He learns that the war has divided his home village and that his Albanian neighbours are now seen as enemies. Hana, an Albanian woman he was, and apparently still is, in love with, asks him to take care of her daughter Zamira. While Aleksandar sets out to find the girl, a storm is building on the horizon, and the film returns us to its beginning.Upon watching the film, the viewer sees that the sequence of sections could have been any of three (Words, Faces, Pictures; Faces, Pictures, Words; or Pictures, Words, Faces). An intended inconsistency becomes apparent. The end of Words shows Zamira gunned down and killed by her family when she tries to escape them. Still photos of the scene are shown in Faces. Suddenly the reappearance of Zamira in Pictures, coupled with the ending, which returns to the beginning, could temporarily hoodwink the viewer that this is the first part of the film. But a close observation of the man lying dead at the beginning of Words shows he is Aleksandar Kirkov, while Zamira is running for her life after having killed one of the Macedonians. Faces, set in London, has a living Aleksandar Kirkov, whose close friend Anne is developing black-and-white pictures of a dead Zamira. The motto of the film was, \"The Circle is not Round.\" The message is written as graffiti on a wall shown in Pictures. The director suggests that in life, people and places may change, but overshadowing scenarios (such as conflicts) go backward and forward in a cycle.[citation needed]","Trailers":"Before the Rain - High Resolution TrailerBefore the Rain - International TrailerMaking of Before the Rain","language":"Macedonian English Albanian","Reception and box office":"The film grossed $763,847 in the US, which is much higher than box office performances of other Macedonian films. It has been praised by critics internationally, earning a 91% \"Fresh\" rating based on 34 reviews on Rotten Tomatoes[1]. The film critic Roger Ebert described Before the Rain as an \"extraordinary film. Work like this is what keeps me going, month after month and film after film ... This is a reminder of the nobility that film can attain.\"[2]The film was nominated for an Academy Award. It was also nominated for the Grand Prix of the Belgian Syndicate of Cinema Critics.The film also won the Golden Lion at the 51st Venice International Film Festival, alongside Vive L'Amour by Tsai Ming-liang.","box_office":"$763,847","cinematography":"Manuel Teran","directed_by":"Milcho Manchevski","Soundtrack":"The music for the film was written and performed by Anastasia. It was released on a CD in 1994 by Polygram records, and sold thousands of copies worldwide.","release_dates":"1 September 1994 (1994-09-01) (Venice)|||||","before_the_rain_пред_дождот":"Theatrical release poster","produced_by":"Marc Baschet","starring":"Katrin Cartlidge Rade Serbedzija","running_time":"113 minutes","music_by":"Anastasia","edited_by":"Nicolas Gaster","written_by":"Milcho Manchevskii"}