{"based_on":"Beware the Night  by Ralph Sarchie Lisa Collier Cool","country":"United States","distributed_by":"Screen Gems","screenplay_by":"Scott Derrickson Paul Harris Boardman","Plot":"The film opens in a 2010 firefight in a palm grove in the Diyala Province of Iraq. Three Marines discover an underground cavern and start to scream as their helmet video feed goes black. In The Bronx in 2013, veteran NYPD officer Ralph Sarchie (Eric Bana) stands over the corpse of an infant in a darkened alley. He and his partner Butler (Joel McHale) resume their nocturnal patrol for the 46th Precinct. A domestic disturbance call comes in over the radio. Sarchie probes the dispatcher for more information and finds out that the male at the address is a former Marine. He tells Butler that his \"radar\" is going off because maybe the former Marine still thinks he is fighting in the war.At the site of the complaint, Sarchie and Butler encounter the shirtless and heavily tattooed former Marine Jimmy Tratner (Chris Coy), who insists his wife is okay. When his wife lifts her head, the officers see that she has been badly beaten. They notice deep scratch marks on the floor and are wary of a dog as they make the arrest. Jimmy resists them ferociously, eventually drawing a knife on Butler and fleeing the house on foot. Sarchie catches up to Jimmy and makes the arrest; although, not without suffering a sizable wound to his forearm that will require stitches. The officers notice that Jimmy's fingernails are cracked and bleeding, and they assume that he is mentally ill or high on drugs.Sarchie and Butler are called to the Bronx Zoo after a woman has thrown her toddler into the moat surrounding the lion enclosure. They find the woman in a lemur pen. She is furiously scraping at the ground, and after they apprehend her, she rapidly recites the lyrics to \"Break On Through (To the Other Side)\". Sarchie notices a painter inside the lion enclosure. He enters the pen to interrogate the mysterious man, but he is attacked by the lions and barely escapes.When the deranged woman, Jane Crenna, is transferred from the precinct to a mental health facility, a Jesuit priest named Mendoza (Édgar Ramírez) arrives at the family's request. He asks the officers several pointed questions about Jane's behavior at the zoo. When another domestic disturbance call comes in, Sarchie notices the complaint makes reference to doors and decides that he and Butler will respond. At the house, the family of three have been staying in the living room after a series of strange disturbances. There is one area of the house where light bulbs instantly burn out and candles will not remain lit.The family explain that there were two painters working the basement, where most of the disturbances occurred. In the basement, Sarchie discovers the badly decomposing body of one of the painters, David Griggs. At Griggs' apartment, which is overrun by cockroaches and refuse, they find business cards for Alphonsus Painting company as well as a picture of Griggs with Jane Crenna and the child that she threw at the zoo. In another picture, Griggs is pictured in his Marine uniform with Jimmy Tratner and a third Marine named Santino (Sean Harris). They realize Santino must have been the painter at the zoo.Mendoza visits Sarchie at the precinct and asks to view the surveillance tapes of Jane at the zoo. He believes that Jane is possessed by demons, and he explains that there is secondary evil created by humans and primary evil which comes from demons. Sarchie is skeptical, but when he reviews the surveillance footage with Butler, he hears strange noises and sees things that Butler does not. Sarchie returns to Jimmy Tratner's house and finds a wall that was being painted in Jimmy's home office. He scrapes away the paint to find a pictograph of an owl. At Sarchie's home, his daughter lies in bed as a stuffed owl stares ominously at her from a shelf in her bedroom. She is awakened by strange noises and frightened.Back at Tratner's home, Sarchie has scraped off the paint from the rest of the wall to find a bizarre mix of Latin and ancient pictographs. Sarchie finds some hard drives with footage from Tratner's deployments and watches the full footage from the palm grove in Diyala. In the cave, the soldiers found a carving of the same message that is on the wall in Tratner's home. Sarchie revisits the basement where he found Griggs' body, scrapes off the paint from a wall, and finds the message again. He reviews the zoo surveillance footage and sees the same message was being painted over by Santino in the lion enclosure. With Mendoza, he visits Jane Crenna in the mental hospital and shows her the message from the cave. She savagely bites Sarchie's already wounded forearm.Mendoza decodes the message as a kind of bridge between Christian and pagan theology which would theoretically allow demons a door to the human world. He explains that certain people are more susceptible to such messages than others. He suggests that the voices and images Sarchie is seeing could be a result of his intuitive \"radar\", which means that he is also susceptible to the archaic message. Mendoza and Sarchie gradually share more of their personal histories with each other. Mendoza goes with Sarchie and Butler to an apartment building where they are attacked by Santino and Jimmy Tratner. Santino overwhelms and eventually kills Butler.At Sarchie's home, his daughter is once again awoken during the night. Her stuffed owl rolls off the shelf and advances towards her bed. As she runs screaming from the room, she sees Santino in the hallway. Sarchie arrives home to find Santino in his living room. Santino warns that he has abducted Sarchie's wife and daughter. Santino is brought to the precinct where Mendoza and Sarchie perform an exorcism on him. Sarchie's wife and daughter are located in an Alphonsus Painting van at a storage facility. The film ends with the baptism of the Sarchies' second child.","language":"English","deliver_us_from_evil":"Theatrical release poster","box_office":"$87.9 million[2]","cinematography":"Scott Kevan","production_company":"Jerry Bruckheimer Films","Marketing":"On December 23, 2013, the first photo from the film was released.[22] The film's first trailer was released on YouTube on March 7, 2014,[23][24] followed by another international trailer on April 10.[25] On May 14 another trailer was released.[26]","directed_by":"Scott Derrickson","release_dates":"July 2, 2014 (2014-07-02)|||||","Production":"On September 4, 2012, director Scott Derrickson signed on to direct a paranormal cop thriller film he co-wrote with Paul Harris Boardman, with Screen Gems producing.[3] On November 12, Jerry Bruckheimer signed on to produce the film with his Jerry Bruckheimer Films production company, which had begun developing a treatment of the Sarchie book years earlier. David Ayer, Bryan Bertino and Bruce C. McKenna also worked on the screenplay before Bruckheimer went back to Derrickson.[10] Screen Gems set a January 16, 2015, release date and announced it would start filming on May 20, in The Bronx, New York City.[11] On November 13, 2013, Sony Pictures changed the release date from January 2015 to July 2, 2014.[4] On December 7, the film was retitled from Beware the Night to Deliver Us from Evil.[12]The film features a completely original plot by Derrickson and co-writer Paul Harris Boardman,[13] while it draws on certain passages of Sarchie's book. Mendoza's explanation of primary and secondary evil is culled from the book's preface.[14] Many of the details from the scene where Sarchie and Butler encounter the family living in one room of a haunted house are taken directly from the first chapter of the book.[15]Initially, Mark Wahlberg was set to star.[3] On November 9, 2012 The Wrap posted that Eric Bana was in talks to join the film, playing the lead role as a New York cop.[5] On April 9, 2013 Bana confirmed his role in the film as a Catholic cop, and Olivia Munn and Édgar Ramírez were set to co-star as the cop's wife and a priest respectively.[6] On May 28, 2013 Joel McHale and Sean Harris also joined the film; McHale played Bana's partner, a tough and experienced cop.[7] Dorian Missick joined cast on June 5 to play the role of the cop Gordon.[9] Other cast members include Chris Coy, Rhona Fox, and Valentina Rendón.[8]Principal photography began on June 3, 2013 in New York City.[16] After wrapping up filming in New York in the end of July, production moved to Abu Dhabi at the start of August 2013.[17][18] Production filmed scenes at the Liwa Oasis desert in Abu Dhabi.[19][20] According to Empire State Development Corporation, Deliver Us from Evil spent more than $19 million in New York state over the course of its 34-day shoot in New York City and on Long Island. The production paid $7 million to New York residents, hiring some 700 cast and crew as well as more than 400 extras.[21]","produced_by":"Jerry Bruckheimer","starring":"Eric Bana Édgar Ramírez Olivia Munn Sean Harris Joel McHale","running_time":"118 minutes[1]","music_by":"Christopher Young","edited_by":"Jason Hellmann","Release":"The film was released on July 2, 2014 in 3,049 locations in the United States.[27]The film received mixed reviews from critics. While conceding the expertise of the film and its participants, and singling out Edgar Ramirez in particular for praise, most critics concluded that it covered familiar material and many complained about the length. The film currently holds a 27% rating on Rotten Tomatoes based on 118 reviews; the general consensus states: \"Director Scott Derrickson continues to have a reliably firm grasp on creepy atmosphere, but Deliver Us from Evil's lack of original scares is reflected in its shopworn title.\" On Metacritic, the film has a 40/100 rating sampled from 32 reviews, indicating \"mixed or average reviews\".[28]Critic Peter Keough echoed that sentiment in The Boston Globe, writing \"Though Derrickson offers some new twists on old tricks, and evokes a mood of menace with rainy streets, gloomy interiors, and the transformation of comforting everyday objects into something horrible, the story soon devolves into variations of many movies we have seen before.[29] Bilge Ebiri of New York Magazine called it \"a thoroughly generic exorcism film,\" and concluded, \"There are some half-decent scares...But the film’s real problem is that it’s somehow both one-note and convoluted.\"[30] Ben Sachs wrote in The Chicago Reader, \"Director Scott Derrickson demonstrates a knack for atmosphere but little sense of pacing; some sequences are effectively spooky (particularly one set at the Bronx Zoo), though just as many feel uninspired, and the longer dialogue scenes stop the movie dead in its tracks.\"[31] Moira Macdonald denounced the film in The Seattle Times and particularly complained about its length, stating \"this is a pretty routine and occasionally silly demonic-possession flick, which distinguishes itself by making us wait so long for the exorcism that heads may be spinning in the audience as well\" and added, \"Some of it’s shivery, but a lot of it is familiar from similar movies.\"[32] Rafer Guzman gave the film a mostly positive review in Newsday, writing \"Thanks to a fine cast, solid direction by Scott Derrickson and an idiosyncratic soundtrack by The Doors, the movie's mandatory cliches -- Latin invocations, gurgling demons -- are far more tolerable than usual.[33] Bill Stamets in The Chicago Sun Times stated, \"Director Scott Derrickson and his co-writer, Paul Harris Boardman, deliver a routine procedural with unremarkable frights\".[34]Deliver Us from Evil did well at the box office. It had earned $2.8 million on its opening day. In its opening weekend, the film earned $9.5 million ranking at number four at the box office in the United States. Behind the box office champion, Transformers: Age of Extinction.[2]","budget":"$30 million[2]"}