{"based_on":"Coneheads sketches from Saturday Night Live  by Lorne Michaels","country":"United States","distributed_by":"Paramount Pictures","Plot":"Upon discovering a UFO in American airspace, the National Guard sends fighter jets to investigate, and they fire on the craft when it doesn't respond. Activating a cloaking device too late, the spaceship crashes into the Atlantic ocean, near land. The aliens aboard, Beldar Clorhone and his life-mate Prymaat, survive and quickly adapt to our human way of life, despite standing out with their conical shaped heads. Beldar gets work as an appliance repairman, and when his grateful boss Otto discovers that Beldar has no documentation, he arranges for a false identity, which sends up a red flag that quickly alerts the INS. Meanwhile, after communicating with their world (Remulak) and discovering that a rescue vessel will not arrive for seven \"Zurls\" (many years), Prymaat informs Beldar that she is pregnant. They now need to completely adapt and safely blend in in order to raise their child among humans. Ambitious INS agent Gorman Seedling and his assistant Eli attempt to capture Beldar and Prymaat, but they are able to elude the two agents.Months later, Beldar has become a respected taxi driver, and the couple live in his boss's basement. After the birth of their daughter Connie, they buy a home and move to suburban Paramus, New Jersey, adopting the surname Conehead. Beldar begins a new career, this time as a driving instructor. Meanwhile, Gorman gets a promotion and decides to leave the Coneheads' case to the agent replacing him. His promotion, however, is soon held-up by the case's extreme expense, forcing Gorman to continue until it's closed.Now a teenager, all Connie Conehead wants to do is fit in with her peers, much to the objections of her father, especially when she begins seeing Ronnie, an auto mechanic. Beldar is preoccupied with winning a golfing trophy at his country club, while Prymaat becomes concerned about her attractiveness to Beldar. Gorman and Eli pose as Jehovah's Witnesses to gain entry to the Conehead home, but they are ejected quickly when Beldar receives word that their rescue vessel is on its way.At a costume party that night, Connie is told that they will be rescued soon. She disobeys her \"parental units\" by returning home with Ronnie. Once there Connie consummates their relationship using her parents \"senso-rings\". Beldar and Prymaat walk in on them, just as the INS shows up to take the Coneheads into custody. Their rescue vessel arrives just in time, and Gorman and Eli are taken aboard with Beldar, Prymaat, and Connie.On Remulak, Highmaster Mintot accuses Beldar of treason and sentences him to fight the ferocious Garthok. Beldar uses his Earthly golfing skills to save himself, killing the creature. For his victory, he is then granted a request: Beldar wishes to return to Earth to oversee its conquest, taking Gorman back with him as a minion. Mintot agrees, and Eli is left behind, becoming the Highmaster's personal lackey. Beldar leaves for Earth with Prymaat, Connie, and Gorman in tow. He soon demonstrates that Connie's feelings are more important to him than planetary conquest by quickly faking an Earth attack. Beldar orders his invasion force to retreat to Remulak, while making it look like his spaceship has been destroyed by a superior weapon. For sparing his life, Gorman agrees to give the Coneheads Green Cards in exchange for Beldar proving he has a marketable talent no other American citizen possesses, to which Beldar confidently agrees.Some time later, Ronnie arrives to take Connie to the prom. Beldar gives Ronnie 55 words of advice, and then uses a massive flash bulb arrangement on his home-built Polaroid camera to document the happy event. As Connie and a now-sunburned Ronnie depart, Beldar and Prymaat look at the over-sized photo, saying, \"Memories, we will enjoy them\".","language":"English","Reception":"The film debuted at No. 6 on its opening weekend, while its domestic box office grossed $7,100,501.[3] By the end of its domestic theatrical run, the film had grossed $21,274,717.[2]Coneheads received mostly negative reviews from critics. The review aggregator website Rotten Tomatoes gives the film a low score of 33%, based on 30 reviews.[4] Roger Ebert gave the film 1½ stars out of 4, describing Coneheads as \"dismal, dreary and fairly desperate\" and that the actors are unable to overcome an uninspired screenplay.[5] Janet Maslin of The New York Times said the film \"has its dopey charms\", and that it is suitable for people who found Wayne's World too demanding.[6]The Los Angeles Times called it \"an unusually companionable jape; in this world it makes perfect sense that the Coneheads' friends and neighbors never really register that there's anything terribly different about them. They're all-American eccentrics — even if they happen to come from the planet Remulak\".[7]","box_office":"$21.3 million[2]","cinematography":"Francis Kenny","production_company":"Lorne Michaels Productions NBC Films","directed_by":"Steve Barron","Soundtrack":"The soundtrack for Coneheads was released July 20, 1993 by Warner Bros. Records. It features the songs \"Tainted Love\" by Soft Cell, \"It's a Free World, Baby\" by R.E.M. \"Soul to Squeeze\" by the band Red Hot Chili Peppers which would go on to reach 22 on the US Billboard Hot 100.[8] The album itself would peak at 162 on the US Billboard 200 chart.[9]","release_dates":"July 23, 1993 (1993-07-23)|||||","Production":"While there are some differences, Coneheads mostly follows the same plot as in the animated special that was created ten years earlier. Similarities include the Coneheads being stranded on Earth, Beldar working as an appliance repair man, and Connie dating an earthling named Ronnie.The film mostly takes place in Paramus, New Jersey. Some scenes were filmed in New York City and the New Jersey towns of Jersey City and Wrightstown.","coneheads":"Theatrical release poster","produced_by":"Lorne Michaels","starring":"Dan Aykroyd Jane Curtin Michelle Burke","running_time":"87 minutes[1]","music_by":"David Newman","edited_by":"Paul Trejo","written_by":"Tom Davis Dan Aykroyd Bonnie Turner Terry Turner"}