{"country":"Canada","distributed_by":"Magnet Releasing[1] Mongrel Media","Plot":"In the 1960s, Dr. Arboria founded the Arboria Institute, a New Age research facility dedicated to finding a reconciliation between science and spirituality, allowing humans to move into a new age of perpetual happiness. In the 1980s, Arboria's work has been taken over by his protégé, Dr. Barry Nyle. Outwardly a charming, handsome scientist, Nyle is in fact a psychopath who has been keeping Elena, a young girl, captive in an elaborate prison that doubles as a hospital beneath the Institute. Elena demonstrates psychic capabilities, which Nyle can suppress, using a glowing, prismatic device.In an effort to understand Elena's abilities, Nyle subjects her to daily therapy sessions, which take the form of interrogations, during which Elena only communicates by way of telepathic demands to see her father. By night, Elena is kept in a brightly lit, completely white room, with only a television for companionship. Nyle spends his own nights at home with his wife, a docile, servile woman who gives Nyle endless praise and exists in a state of constant stupor. Nyle takes massive quantities of prescription medication and disguises his complete lack of hair and the color of his irises by way of an elaborate wig and contact lenses.Attempting to elicit an emotional response from Elena, Nyle presents her with a photograph of her deceased mother. Nyle then informs Elena's nurse, Margo, that Elena has somehow smuggled contraband into her room. When Margo attempts to forcibly take the photograph from Elena, Elena kills her by psychically causing her head to implode. Nyle, monitoring Elena's actions, is intrigued by this blatant display of psychic ability. He allows Elena to leave her cell, then activates the prism, causing her to convulse and pass out. While unconscious, Elena is approached by a massive entity in a red space suit (identified as a \"Sentionaut\"), who injects her with a syringe before walking off.Nyle goes to see Dr. Arboria, now aged, somewhere on the grounds of the Institute. Displaying signs of senility, Arboria remains either ignorant or indifferent of Nyle's psychosis, regarding him as his best protégé. A flashback to 1966 reveals that Elena's mother was Dr. Arboria's wife, who was present when Arboria himself led a young Nyle through a procedure meant to allow him to achieve transcendence. As a part of the procedure, Nyle was submerged in a vat of black liquid, providing him with hellish, otherworldly visions; Nyle emerged from the vat insane, fatally attacking Mrs. Arboria. An unperturbed Dr. Arboria is shown submerging the infant Elena in the black liquid. Back in the present, Nyle kills Arboria by administering a drug overdose. Meanwhile, Elena makes her torturous escape from the Aboria Institute, encountering a zombie-like \"mutant\" which attempts to eat her in an air shaft as well as an entire room full of Sentionauts, who are suspended immobile in a large, factory-like chamber.During Elena's escape, Nyle returns home and presents himself to his wife without his wig or contacts and tries torturously to explain his inner pain to her before crushing her head and collecting a ceremonial dagger he calls \"The Devil's Tear-Drop.\" Nyle, having dissolved his final contact to the material world, heads out in pursuit of Elena. While chasing her through the woods surrounding the Institute, he encounters a pair of \"heshers\", who he kills with his dagger after insisting one of them had sex with Elena.Nyle eventually corners Elena in a clearing and repeatedly implores her to \"Come to me\". Elena uses her psychic abilities to keep Nyle's feet planted in the ground. Trying to leap forward, Nyle flings his head fatally onto a rock. Free of her captor, Elena follows the light generated by a television set to a nearby town. Following the credits, the camera focuses on the floor of a living room with late 1970s–early 1980s decor; an action figure of a Sentionaut lies in the middle of the room. A static voice can be heard asking, \"Do you read me?\" twice before the film ends.","language":"English","Themes":"Director Cosmatos stated that he's interested in social control mechanisms, our own personal, internal controls and how religion affects our consciousness and society.[3] These philosophical ideas are present in Beyond the Black Rainbow, a film focused on issues of repression and control of emotions.[30] Cosmatos partly picked up these themes by reading the science fiction works of Beat novelist William S. Burroughs, books by and large dealing with societal control.[3]According to Cosmatos, the \"rigid geometric world\" of the Arboria Institute visually fits the movie's control theme. This is especially true for the Dr. Nyle character, someone \"very knowledged, trying to create a very controlled environment to give himself a feeling of power.\"[23] The light triangle, responsible for dampening Elena's psychic powers, is another control symbol.[31] The Institute's plethora of reflecting surfaces – the walls in the hallways, the giant piece of glass in the therapy room, the infinity-mirrored Sentionaut room, Margo's glasses[13] – might somewhat hint at this idea. To many ancient cultures, the mirror was a symbol of self-awareness, consciousness and intelligence, but also a source of pride and vanity.[32][33] The visual reference for Arboria Institute's interior design was THX 1138.[22]The film's control leitmotif is shown in a subtler way by reflecting North America's political climate in the 1980s. Beyond the Black Rainbow has been called a \"Reagan-era fever dream\".[16] Its paranoid, Cold War mood contains nods to the late U.S. president – through a clip of an ominous televised speech by Ronald Reagan himself – and former Panamenian general and convicted drug lord Manuel Noriega (Dr. Nyle's \"Noriega\" jacket).[34][35] The South American dictator had direct involvement in the \"Iran-Contra\" scandal. Noriega's fight against the Sandinistas, Nicaragua's left-wing guerrillas, was backed up by the CIA and the Pentagon. The CIA funded Noriega's military campaign with profits from the illegal sale of arms to Iran. The CIA also turned a blind eye to Noriega's drug trafficking.[36]Another of Beyond the Black Rainbows main themes is identity.[23] In the course of the movie Dr. Nyle experiences a radical change of personality whose roots lie in the terrifying drug experience he had in 1966, under Mercurio Arboria's supervision. Being exposed to his shadow side so intensely crippled not only his mind, but his body: Barry is forced to use appliances such as a wig and contact lenses.[37] Similar to many a Lovecraftian protagonist, Barry Nyle is ultimately a pathetic character: his far-reaching knowledge, restrained demeanor and carefully controlled work environment are unable to dominate the forces of irrationality and chaos burning in his mind. In the end, the doctor undergoes a physical and psychological transformation where he forfeits all control and gives in to madness.[38]Cosmatos admits a dislike for Baby Boomers' spiritual ideals, an issue he addresses in Beyond the Black Rainbow. For him, the Boomers' search for alternative belief systems made them dabble in the dark side of occultism, which in turn corrupted their quest for spiritual enlightenment.[14] The use of psychedelic drugs for mind-expansion purposes is also explored,[39] although Cosmatos's take on it is \"dark and disturbing\", a \"brand of psychedelia that stands in direct opposition to the flower child, magic mushroom peace trip\" wrote a reviewer.[40] UGO Networks's Jordan Hoffman noted both elements, stating in his review that in the movie some \"up-to-no-good new age scientists have let their experiments with consciousness-altering drugs mutate a young woman\"[21] – in this case, Elena. Cosmatos explains why Dr. Arboria's mission to create a superior human ultimately failed:","Reception":"Cosmatos noted that critical reception of the film was originally \"kind of muted, even downright negative\" at first, but it began picking up better reviews after Tribeca 2011.[22]The film has an approval rating of 50% on Rotten Tomatoes based on twenty-eight reviews and an average score of 5.7/10.[42] Negative reviews focused generally on the surreal inscrutability of the plot and accusations of shallow pastiche; Tony Norman of the Pittsburgh Post-Gazette called it \"all ambiance and no substance\",[43] and Joe Neumaier of The New York Daily News called it a boring failure.[44] Mark Feeney of The Boston Globe cited the atmosphere as initially being impressive but eventually becoming laughable, with the concept better suited to a short film.[45] Some mixed reviews, like William Goss of MSN, praised the film's surreal atmosphere and synth score, despite finding it \"not my cup of crazy\",[46] while Marjorie Baumgarten of the Austin Chronicle cited the movie as inexplicable and incomprehensible, while praising the visuals.[47] Jeannette Catsoulis of The New York Times also gave a mixed review, highlighting the appeal to fans of midnight movies.[48]Positive reviews highlighted the cult appeal, such as Matt Singer of Time Out, who welcomed the return of challenging, surreal midnight movies.[49] Alison Willmore of the A.V. Club rated it B+, praising its style and daring form.[50] Don R. Lewis of Film Threat also praised the film, saying, \"As a cinema fan I was blown away at the control and attention to detail Cosmatos showed.\"[51] Samuel Zimmerman of Fangoria said the film \"makes me lament that the general population of U.S. moviegoers isn't more adventurous\", rating it 3 out of 4 stars.[this quote needs a citation]","box_office":"$56,491 (US)[2]","cinematography":"Norm Li","production_company":"Chromewood Productions","directed_by":"Panos Cosmatos","release_dates":"December 3, 2010 (2010-12-03) (Whistler Film Festival)|||||","beyond_the_black_rainbow":"Theatrical release poster","Development":"As a child, Cosmatos frequented a video store named Video Addict. During these trips he would browse the horror film section looking at the boxes although he was not allowed to watch such films. During such times he would instead imagine what the film was. He would later reflect upon this experience when making Black Rainbow where one of his goals was \"to create a film that is a sort of imagining of an old film that doesn’t exist.\" The year 1983 was chosen for the story as it's the first year he went to Video Addict. Additionally he thought the idea of setting such a film one year before 1984 was funny. The film's genesis was an overlap between two projects Cosmatos wanted to do. One of these was a film about a girl trapped in an asylum while the other was an installation promoting a research facility that didn't exist. Eventually Cosmatos realized that he could use both ideas in the same project.[6]The presence of his parents haunts \"every frame of this film\",[7] said the Rome-born filmmaker.[8] His father was film director George P. Cosmatos (whose credits include Rambo: First Blood Part II and Cobra), deceased in April 2005,[9] and his mother Swedish sculptor Birgitta Ljungberg-Cosmatos,[7] who died in July 1997 after a lengthy battle with cancer.[10] Unable to deal with his mother's death, Panos \"drifted into a slow motion mode of self-destruction and binge drinking\". When elder Cosmatos died, the grief he felt compounded. After that the aspiring writer/director started therapy and decided he wanted to make a film as part of the healing process.[11] Cosmatos felt that his \"filmmaking sensibility is a weird hybrid of both of them\" - his father's \"popcorn movies\" and his mother's haunting, experimental art.[3]Beyond the Black Rainbow was financed by DVD residuals from Tombstone (1993), directed by Panos' father.[12] The film was shot in three weeks using a modified Panavision 35 mm camera.[3] This was suggested by cinematographer Norm Li, for he noted that Panos' references – mostly films from the '70s and '80s – \"were all grainy, colorful, and full of texture\", and he felt the 35 mm format was \"the only way to shoot.\"[13]","produced_by":"Oliver Linsley|Christya Nordstokke|","starring":"Michael Rogers|Eva Allan|Scott Hylands|Marilyn Norry|Rondel Reynoldson|","running_time":"110 minutes","Style":"Beyond the Black Rainbow has been praised for its visual style. Cosmatos declared that his \"modernist\" use of color was influenced by Michael Mann's Manhunter (1986) and The Keep (1983).[14] The blue hue cinematography – the \"night mode\" as Cosmatos dubbed it – was inspired by the freezer room scene in John Carpenter's Dark Star (1974).[8] Norm Li cited other references: Daft Punk's Electroma (2006), Dario Argento's Suspiria (1977), and George Lucas' THX 1138 (1971).[13] A number of reviewers noted similarities between BtBR and Stanley Kubrick's 2001: A Space Odyssey (1968) and A Clockwork Orange (1971).[15] \"I love Stanley Kubrick, and have seen, and probably internalized, all of his work, but any similarity was not my intent\", explained Cosmatos.[16] Critics have also compared Beyond the Black Rainbow to Andrei Tarkovsky's Solaris (1972),[17][18][19] Ken Russell's Altered States (1980),[20][21] and Gaspar Noé's Enter the Void (2010).[21] Of the latter, the director deemed it \"a very interesting, very beautiful film.\"[3]The 1966 flashback segment of the movie was inspired by E. Elias Merhige's experimental horror film Begotten (1990). Begotten was entirely shot in high-contrast black-and-white, which for Cosmatos \"was a perfect look for the flashback because I wanted it to feel like a fading and decayed artifact.\" The young Barry Nyle's acid trip in that segment of Beyond the Black Rainbow was inspired by the \"Battle of the Gods\" sequence in Jean-Luc Godard's Contempt (1963).[22]Cosmatos also takes influence from other visual media. The director declared his love for Heavy Metal magazine and the work of French comics artist Jean \"Moebius\" Giraud. Fantasy art was also an influence, especially Frank Frazetta's paintings.[3] Norm Li stated that both he and the director \"also looked at abstract paintings, photographs, and architectural design books\" for inspiration.[13]One of Beyond the Black Rainbow notable characteristics is its deliberately slow, hypnotic pace. According to Cosmatos, Beyond the Black Rainbow belongs to what he dubbed the \"trance film\" subgenre.[22] Cosmatos mentioned Francis Ford Coppola's Apocalypse Now (1979), Alain Resnais' Last Year at Marienbad (1961) and Saul Bass's Phase IV (1974) as cinematographic blueprints for his debut film.[23][24] Cosmatos explained the rationale behind his screen-writing, which downplays the \"very concrete story at the heart of it\" in favor of an \"atmospheric\" approach:Jeremy Schmidt, keyboard player for Vancouver-based rockers Black Mountain, was invited by Cosmatos to compose the film's soundtrack. \"Evil Ball\", a track from Schmidt's solo project, Sinoia Caves, was used by the movie's director on a private screening held for Schmidt. A mutual appreciation for Tangerine Dream, John Carpenter soundtracks and Giorgio Moroder's music for Midnight Express (1978) and American Gigolo (1980) cemented their bond.[25] Schmidt also pointed out the background music from The Shining (1980) and Risky Business (1983) as musical blueprints for the Beyond the Black Rainbow score.[26]Regarding the impact of The Shining's soundtrack on his score, Schmidt singled out the compositions by György Ligeti and Krzysztof Penderecki as sonic touchstones.[27] Their music had already been featured the sci-fi and horror genres, two of Cosmatos main cinematic obsessions when young.[12] Ligeti pieces \"Lux Aeterna\" and \"Atmosphères\" had been featured in 2001: A Space Odyssey,[28] and Penderecki's \"Polymorphia\" and a portion of \"The Devils of Loudun\" was used in The Exorcist (1973).[29]For his analogue synthesizer score, Schmidt used the following equipment: a Prophet 5, two Oberheims, Moog Taurus bass pedals, a Korg CX-3 organ and a Mellotron. An extensive use of the Mellotron can be heard on the flashback sequence, where Cosmatos had been using Pink Floyd's \"Set the Controls for the Heart of the Sun\" as a temp track.[27] All in all, \"the chosen palette of sounds definitely harkens back to 'The New Age of Enlightenment'\", said Schmidt.[26] The music was mixed by Joshua Stevenson at Otic Sound, Vancouver, Canada.","music_by":"Sinoia Caves","edited_by":"Nicholas T. Shepard","written_by":"Panos Cosmatos","budget":"$1.1 million[2]"}