{"Cast":"Voice Cast","country":"United States","distributed_by":"20th Century Fox","Plot":"A meteor shower rockets through open space. Four glowing pods are seen hiding behind the meteor shower. Suddenly the meteor shower makes a hard right and heads towards a distant planet Earth.In a Chicago suburb, Stuart Pearson (Kevin Nealon) and his wife Nina (Gillian Vigman) head a family that includes 7-year-old Hannah (Ashley Boettcher), 17-year-old hormonal sister Bethany (Ashley Tisdale), who has just come back from a secret outing with her boyfriend Ricky Dillman (Robert Hoffman), and 15-year-old techno-geek Tom (Carter Jenkins) whose high school grades are low. Deciding the family needs some good old-fashioned togetherness, Stuart takes them to a holiday home in the middle of nowhere. Joining them is Uncle Nate (Andy Richter), Nate's 14-year-old son Jake (Austin Butler), Nana Rose (Doris Roberts), and identical 12-year-old twins Art (Henri Young) and Lee (Regan Young). Ricky also arrives unexpectedly and talks his way into staying overnight, by giving them the impression that his car has broken down and needs to be repaired so he can spend time with Bethany, plus saying he is 18 years old.That night dark storm clouds swirl around the house. Suddenly, the four glowing pods land on the roof. An alien crew emerges, made up of Skip (J. K. Simmons), the tough commander, Tazer (Thomas Haden Church), a muscle-bound dude armed to the teeth, Razor (Kari Wahlgren), a lethal female alien soldier, and Sparks (Josh Peck), a four-armed techie, who is the only non-threatening intruder. Since the aliens knocked over the satellite dish Ricky and Tom are sent to fix it. Ricky then reveals to Tom that he lied about his car breaking down, and his age; Ricky is actually in college and is 21 years old, five years older than Bethany. Ricky makes Tom fix the satellite dish by himself but it is beyond repair. Investigating further, Tom and Jake (who unexpectedly shows up on the roof) discover the aliens. Ricky is captured and implanted with a mind control device. The aliens, called \"Zirkonians\", lay claim to the planet. Like a puppet, Ricky grabs the boys – but Tom and Jake break free and get back in the house.It is not long before all five kids have seen the aliens, with the exception of Bethany. Tom takes charge and they discover the mind control device doesn't work on children, giving them a fighting chance. They realize they have a responsibility to protect the adults by keeping the aliens' existence a secret. The kids create makeshift weapons, like a homemade potato spud gun. They repel the first alien attack from the attic and obtain Ricky's remote control and turn him against the aliens.The kids orchestrate a scheme to get the adults out of the house and then ambush the aliens as they try to reach the basement, causing the gentle tech Sparks to become separated. He meets Hannah and they become friends. Unlike his alien cohorts, Sparks hates battle; he just wants to return home to his family, and he helps by making weapons for them. He also reveals the aliens want a device hidden under the basement which will make them grow giant. The kids forgot about their grandmother, and the aliens mind control her, which gives her superhuman strength and agility, and she fights with Ricky in a scene reminiscent of a fighting video game. However, the aliens manage to capture Jake and hold him hostage in exchange for Sparks, whom they need to complete their mission.The kids finally reveal to Bethany the events that are taking place. Ricky then breaks up with Bethany because she always talks about feelings and family and leaves. The five of them rescue Jake, but Skip succeeds in using the enlarging machine, growing to 30 feet tall, and calls the Zirkonian invasion ships. They defeat him and shrink him again. Tazer and Razor flee, while Skip is shrunk to a tiny size by the machine. Sparks calls off the invasion and returns home. The rest of the vacation goes back to normal, except the kids grew closer to each other during their adventure. In the distance, Skip appears, bent on revenge, but meets his demise when a crow flies over and grabs him.In a mid-credits scene, Bethany and Tom take revenge on Ricky for breaking up with Bethany by making him look like a fool in front of his new girlfriend, using the alien mind control device. Bethany comments \"I am so keeping this\".","language":"English","box_office":"$57.9 million[1]","cinematography":"Don Burgess","production_company":"Regency Enterprises Josephson Entertainment Dune Entertainment","directed_by":"John Schultz","Home media":"The film was released on DVD and Blu-ray on November 3, 2009.","Video game":"A video game based on the film was released August 4, 2009, developed by Revistronic and published by Playlogic. The game features the storyline of the film and is available for Wii, PlayStation 2, Nintendo DS and Windows. The game also offers players two different gameplay perspectives depending upon which video game platform players choose.[30] The game allows the player to play as Tom, Hannah, Jake, Art, Lee, Bethany or The Four Alien Explorers across 15 levels.","release_dates":"July 31, 2009 (2009-07-31)|||||","Production":"The script was written by Mark Burton and Adam F. Goldberg. The film is co-financed by Fox and Regency while being distributed by Fox.[3][4] Fox snapped up the script in March 2006.[4] Marc Resteghini was overseeing for Fox while Kara Francis Smith shepherds for Regency. Barry Josephson was confirmed as the main producer while Thor Freudenthal was hired to direct principal production.[5] The principal production began in March 2007.[5] The film was originally titled They Came from Upstairs but later changed to Aliens in the Attic while the first title is instead used as the film's tag line.[4] Ashley Tisdale's involvement in the film was confirmed in January 2008 as she was cast as Bethany Pearson.[3] Robert Hoffman, Carter Jenkins and Austin Butler were later cast in the film. Doris Roberts was signed on to the film in February 2008.[6] MTV confirmed that Josh Peck joined the cast as the voice of the alien Sparks.[7] John Debney composed the original score for the film. Tisdale recorded a song titled \"Switch\" for the film, which is also included in her second album, Guilty Pleasure. The original motion picture soundtrack was released on August 18, 2009.[8]Principal photography began at the end of January 2008 in Auckland, New Zealand.[3][9] Auckland-based production company New Upstairs Productions said filming would run for 30–40 days from January 28 to April 18, 2008 with no filming in weekends.[10] The film was set in a rambling old villa transported from Remuera to a farm in North Auckland. The main set was an old manor and they spent $700,000 restoring the house.[10] The main shooting ended in mid-March 2008.[11] Tisdale, Butler and Jenkins went back to the set to shoot last-minutes scenes for the film in April 2009.[12]","produced_by":"Barry Josephson","starring":"Carter Jenkins Austin Butler Ashley Boettcher Ashley Tisdale Henri Young Regan Young Josh Peck J. K. Simmons Kari Wahlgren Thomas Haden Church","running_time":"86 minutes","music_by":"John Debney","edited_by":"John Pace","Release":"The film was released on July 30, 2009, in Russia and Malaysia; July 31, 2009 in United States, Canada, and Bulgaria; August 12 in the United Kingdom; September 3, 2009 in Australia. The film's original release date was in January 2009 but it was pushed back for unknown reasons.[13] The UK release also coincided with a charity auction for Save the Children which teamed up with eBay and 20th Century Fox where various celebrities, including several actors from the movie, sold items from their attics to raise money for the charity.[14]Reviews of Aliens in the Attic were mixed to negative; the film holds a 31% \"rotten\" rating on Rotten Tomatoes based on 71 reviews, with the consensus stating \"Inoffensive and kid-friendly, this mundane family comedy is light on imagination.\"[15] Metacritic gives the film a score of 42 based on 10 reviews.[16]Entertainment Weekly described the film as \"a pointless and harmless family adventure that doesn't mentally assault the 12-and-over set and looks like a lot of fun\",[17] while San Francisco Chronicle has described the movie as being unoriginal and crowd pleasing.[18]Variety stated the film doubtless would appeal primarily to a more narrow demographic of tweens and pre-teens and despite Tisdale's presence, it’s difficult to imagine many ticket buyers between the ages of 12 and 18[19] while The New York Times described Jenkins and Butler as the actors with more personality and Hoffman as the actor who provides the film’s occasional funny moments and stated that even though she is credited as one of the main characters, Tisdale spends most of the film off screen.[20]The Los Angeles Times said the film is \"an enjoyable kid-friendly film but not an out-of-this-world classic\" and also mentioned the film belonged to Hoffman[21] and Kirk Honeycutt of The Hollywood Reporter said the director John Schultz played everything for laughs and earns a more than a few but tech effects deliver a fair number of those laughs and described the film as an \"amusing family comedy\".[22] Radio Times gave the film a three out of five stars rating, saying that the film is \"a thrilling children's yarn with enough pop-culture references to hold grown-ups' interest\".[23]The Dove Foundation praised the film, saying it is \"one of those movies that you find to be better than anticipated\" and also said the film draws on realism in family dynamics.[24] Lara Martin of Digital Spy described the film as a \"kid-friendly mix of Men in Black crossed with Gremlins with a healthy dose of Home Alone-style violence\" and also mentioned that one of the biggest disappointments in the movie is the lack of screen time given to Tisdale, billed as one of the leading actors, who gets a promising start as she rebels against her parents and struts around in her bikini, but she's quickly relegated to background fodder purely there to provide excess opportunities for the alien-controlled Ricky to shine and concluded saying it seems \"a bizarre and sad waste of her obvious comedic talent\".[25] However, The Miami Herald gave a mixed to negative review, saying the film is a \"children's movie mix of live-action and animation, it has a few positive messages, a few laughs and a few comic throwdowns\".[26]Aliens in the Attic was a minor box office success. In the US, the film was distributed by 3,106 theaters and grossed $8 million its opening weekend, resulting in No. 5 in the box office.[1] The film has grossed the equivalent of US$1.3 million in Russia, US$10 million in the United Kingdom, and a total of US$57 million worldwide total.[1][27]","aliens_in_the_attic":"Theatrical release poster","written_by":"Mark Burton Adam F. Goldberg","budget":"$45 million[1]"}