{"country":"United States","distributed_by":"The Jerry Gross Organization Compass International Pictures","Plot":"In the opening scene, a woman named Ruth is walking her dog on Los Angeles, California's Venice Beach, and is suddenly pulled under the sand of the deserted beach by an unseen force. The woman's screams for help are heard by Harry Caulder, a harbor patrol officer who is swimming nearby. Harry reports Ruth's disappearance to two LAPD detectives, Royko and Piantadosi, who claim that without a body. there little they can do. The next day, Ruth's estranged daughter, Catherine, arrives from San Francisco after Harry calls her regarding her mother's disappearance.Meanwhile, the mysterious and crazed Mrs. Selden, who resides in an abandoned section of the Santa Monica Amusement Pier, witnesses the attack and disappearance (and others throughout the film), but does not come forward.That night, while staying in Ruth's house, Catherine hears Ruth's dog barking on the beach near the location where Ruth disappeared. Catherine investigates and finds the dog beheaded, near a small sinkhole. Royko and Piantadosi, as well as Harry, are called to the scene, but police pathologist Dr. Dimitrious cannot accurately determine a cause of death for the dog. Royko and Piantadosi believe it to be the work of a serial killer, due to reports of other disappearances over the past few months.The next morning, a teenage girl is buried in the sand at the beach, and begins screaming. Her friends pull her out of the sand, only to see that her legs have been injured from an attack by an unseen creature. The police, led by Capt. Pearson, begin an investigation by digging up various sections of the beach at night, but find nothing. The next morning, people visit the beach, which the local media have dubbed \"blood beach\".The following night, Harry's co-worker Hoagy is closing up the harbor patrol office for the night when his girlfriend ventures under the pier to investigate a noise and is assaulted by a man. After being knocked to the ground by the girl, the would-be-rapist is attacked by the unseen creature who literally castrates him in bloody fashion.An evening or two later, Marie, a French airline stewardess who is living with Harry, chases after her hat when it is blown by wind onto the beach. She too is grabbed by the unseen creature and pulled under the sand. The next morning, Harry sees Marie's hat on the beach, along with a small sinkhole which he recognizes as similar to the hole at the scene of Ruth's disappearance and the death of the dog. Harry calls the police, who dig up the area around the sinkhole and find Marie's disembodied eyeball.Searching for the unknown creature's home, Harry ventures to an abandoned section of the pier and finds an access tunnel leading to an underground storage facility. After finding nothing, he leaves the tunnel, not noticing a movement in a collapsed section of the wall. Harry and Catherine go out to a nightclub, where they try to rekindle their romance. Meanwhile, a man with a metal detector is walking under the pier looking for metal objects when he is attacked and pulled under the sand by the still-unseen creature. The man's wife, Mrs. Hench, reports him missing. The next day, Royko and Piantadosi find Mr. Hench emerging from a sewer manhole in a Venice street after escaping from the creature's lair, but he is in a state of shock after being horribly mangled and cannot explain what happened to him.Hoagy is the next victim, after he visits the pier to try and persuade Mrs. Selden to leave the area. He too is pulled under the sand by the underground creature while she watches stoically.Having been told by Harry about the access tunnel, Catherine visits the storage facility under the pier to look around just as Harry brings Piantadosi with him to investigate. They find all 16 of the creature's partially eaten victims, including Ruth's severed head, parts of Marie's body and Hoagy's fresh corpse. Capt. Pearson arrives with the police, who remove all of bodies. Pearson orders the officers to use a backhoe and equipment to track the monster down. Increased attention from the local news media lead the police to attempt to kill the creature as quickly as possible, and Pearson orders the installation of motion detectors, heat-sensing cameras and explosives.That evening, the huge creature emerges from the sand and is caught on camera; (it resembles a worm-like Venus flytrap). Without hesitation, Royko activates the detonator and the creature is blown to pieces. Dr. Dimitrios points out that they still do not know anything about the monster's origins or abilities. Since it resembled a giant worm, and some worms have the capability to regenerate, Dimitrios wonders what will happen to \"each piece\".The next morning, Harry leaves with Catherine to drive her home to San Francisco while the beach reopens to the public, now that the subterranean creature is dead. In the final scene over the end credits, as the beach becomes crowded again, new small sinkholes begin to appear unnoticed all over the sand, implying that Dr. Dimitrios was correct in his theory that the creature has the ability to regenerate from its severed pieces.","language":"English","Reception":"A Tom Buckley review in the New York Times called it \"a cut or two above the recent run of low-budget horror films\" and praised the work of \"an attractive and professional cast, a rarity in the genre\", but noted that it was \"undermined by plodding direction and a talky and incoherent script that is short on action, suspense and even the gore that the title promises\". Buckley also criticized the cinematography, which he called \"oddly blurry, as though someone had coated the lens with vaseline\".[3]AllMovie's negative review said, \"The potential for campy fun in this premise is defeated by a completely straight, plodding detective story\".[4] Scott Weinberg of eFilmCritic.com also gave the film a negative review, writing, \"Gore-less and bizarre, it's a tough one to track down. If you do search this one out, you should probably be out looking for a job\".[5]","Remake":"In 2014, Allegra Pictures and Scatena & Rosner Films produced a remake of the film, titled The Sand. It was directed by Isaac Gabaeff from a screenplay by Alex Greenfield and Ben Powell.[6] The remake starred Nikki Leigh, Mitchel Musso, Dean Geyer and Jamie Kennedy.[7]","cinematography":"Steve Poster","directed_by":"Jeffrey Bloom","release_dates":"January 23, 1981 (1981-01-23)|||||","produced_by":"Steven Nalevansky Sir Run Run Shaw","starring":"David Huffman Marianna Hill Burt Young John Saxon","running_time":"92 minutes","music_by":"Gil Melle","Release":"The film was given a limited theatrical release twice in the United States: by the Jerry Gross Organization in January 1981, and by Compass International Pictures in 1982.[citation needed]The film was released in the U.S. on VHS by Media Home Entertainment. As of 2012, the film had only been officially released on DVD in Germany.Alamo Drafthouse Cinema re-released the film in a limited 35mm screening on March 14, 2015 as part of the \"NY! Hudson Horror Show\" event at the Alamo Drafthouse in Yonkers,[1] promoted by a new theatrical poster by artist Stephen Romano.[2]","written_by":"Jeffrey Bloom from a story by Jeffrey Bloom and Steven Nalevansky"}