{"based_on":"A Few Good Men  by Aaron Sorkin","a_few_good_men":"Original theatrical release poster","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Aaron Sorkin","Plot":"U.S. Marines Lance Corporal Harold Dawson and Private Louden Downey are facing a court-martial, accused of killing fellow Marine Private William Santiago at the Guantanamo Bay Naval Base in Cuba. Santiago compared unfavorably to his fellow Marines, had poor relations with them, and failed to respect the chain of command in attempts at being transferred to another base. An argument evolves between base commander Colonel Nathan Jessup and his officers: while Jessup's executive officer, Lieutenant Colonel Matthew Markinson, advocates that Santiago be transferred immediately, Jessup regards this as akin to surrender and orders Santiago's commanding officer, Lieutenant Jonathan James Kendrick, to train Santiago to become a better Marine.When Dawson and Downey are later arrested for Santiago's murder, naval investigator and lawyer Lieutenant Commander JoAnne Galloway suspects they carried out a \"code red\" order, a violent extrajudicial punishment. Galloway asks to defend them, but instead, the case is given to Lieutenant Daniel Kaffee, an inexperienced and unenthusiastic U.S. Navy lawyer. Initially, friction exists between Galloway, who resents Kaffee's tendency to plea bargain, and Kaffee, who resents Galloway's interference. Kaffee and the prosecutor, his friend Captain Jack Ross (USMC), negotiate a bargain, but Dawson and Downey refuse to go along. They insist they were ordered by Kendrick to shave Santiago's head, minutes after Kendrick publicly ordered the platoon not to touch the would-be victim, and did not intend their victim to die. Kaffee is finally won over by Galloway and takes the case to court.In the course of the trial, the defense manages to establish the existence of \"code red\" orders at Guantanamo and that Dawson specifically had learned not to disobey any order, having been denied a promotion after helping out a fellow Marine who was under what could be seen as a \"code red\". However, the defense also suffers setbacks when a cross-examination reveals Downey was not actually present when Dawson and he supposedly received the \"code red\" order. Markinson reveals to Kaffee that Jessup never intended to transfer Santiago off the base, but commits suicide rather than testify in court because he feels that he had failed to do the right thing by protecting a Marine under his command.Without Markinson's testimony, Kaffee believes the case lost and returns home in a drunken stupor, having come to regret he fought the case instead of arranging a plea bargain. Galloway, however, convinces Kaffee to call Jessup as a witness despite the risk of being court-martialled for smearing a high-ranking officer. Jessup initially outsmarts Kaffee's questioning, but is unnerved when the lawyer points out a contradiction in his testimony: Jessup had stated he wanted to transfer Santiago off the base for his own safety, but if he ordered his men to leave Santiago alone and if Marines always obey orders, Santiago would have been in no danger. Under heavy pressure from Kaffee and unnerved by being caught in one of his own lies, an enraged Jessup extols his and the military's importance to national security, and eventually reveals that he ordered the \"code red\". As he justifies his actions, Jessup is arrested; Kendrick would later be arrested for his actions, too.Soon afterwards, Dawson and Downey are cleared of the murder charge, but found guilty of \"conduct unbecoming a United States Marine\" and dishonorably discharged. Dawson accepts the verdict, but Downey does not understand what they had done wrong. Dawson explains they had failed to stand up for those too weak to fight for themselves, like Santiago. As the two prepare to leave, Kaffee tells Dawson he does not need a patch on his arm to have honor. Dawson, who had previously shown contempt for Kaffee for not understanding the Marine ethos, recognizes him as an officer and renders a salute.","language":"English","Reception":"The film premiered at the Odeon Cinema, Manchester, England[21] and opened on December 11, 1992, in 1,925 theaters. It grossed $15,517,468 in its opening weekend and was the number-one film at the box office for the next three weeks. Overall, it grossed $141,340,178 in the U.S. and $101,900,000 internationally for a total of $243,240,178.[22]A Few Good Men received positive reviews on its release and has a \"certified fresh\" score of 81% on Rotten Tomatoes based on 57 reviews with an average rating of 7 out of 10. The critical consensus states \"An old-fashioned courtroom drama with a contemporary edge, A Few Good Men succeeds on the strength of its stars, with Tom Cruise, Demi Moore, and especially Jack Nicholson delivering powerful performances that more than compensate for the predictable plot.\"[23] The film also has a score of 62 out of 100 on Metacritic based on 21 critics indicating \"generally favorable reviews.\"[24] CinemaScore reported that audiences gave the film a rare \"A+\" grade.Peter Travers of Rolling Stone magazine said, \"That the performances are uniformly outstanding is a tribute to Rob Reiner (Misery), who directs with masterly assurance, fusing suspense and character to create a movie that literally vibrates with energy.\"[25] Richard Schickel in Time magazine called it \"an extraordinarily well-made movie, which wastes no words or images in telling a conventional but compelling story.\"[26] Todd McCarthy in Variety magazine predicted, \"The same histrionic fireworks that gripped theater audiences will prove even more compelling to filmgoers due to the star power and dramatic screw-tightening.\"[27] Roger Ebert was less enthusiastic in the Chicago Sun-Times, giving it two-and-a-half out of four stars and finding its major flaw was revealing the courtroom strategy to the audience before the climactic scene between Cruise and Nicholson. Ebert wrote, \"In many ways this is a good film, with the potential to be even better than that. The flaws are mostly at the screenplay level; the film doesn't make us work, doesn't allow us to figure out things for ourselves, is afraid we'll miss things if they're not spelled out.\"[28]","box_office":"$243.2 million[1]","cinematography":"Robert Richardson","production_company":"Castle Rock Entertainment","directed_by":"Rob Reiner","Awards and honors":"The film was nominated for four Academy Awards:[17]The film was nominated for five Golden Globe Awards:The film was recognized twice by the AFI 100 Years... series. In 2005, Nicholson's reading of the line \"You can't handle the truth!\" was voted the 29th greatest American film quote of all time[18] and in 2008 the film was voted the fifth best Courtroom Drama.[19]","release_dates":"December 11, 1992 (1992-12-11)|||||","Production":"Screenwriter Aaron Sorkin got the inspiration to write the source play, a courtroom drama called A Few Good Men, from a phone conversation with his sister Deborah, who had graduated from Boston University Law School and signed up for a three-year stint with the U.S. Navy Judge Advocate General's Corps. She was going to Guantanamo Bay to defend a group of Marines who came close to killing a fellow Marine in a hazing ordered by a superior officer. Sorkin took that information and wrote much of his story on cocktail napkins while bartending at the Palace Theatre on Broadway.[3] His roommates and he had purchased a Macintosh 512K, so when he returned home, he would empty his pockets of the cocktail napkins and type them into the computer, forming a basis from which he wrote many drafts for A Few Good Men.[4]In 1988, Sorkin sold the film rights for his play to producer David Brown before it premiered, in a deal reportedly \"well into six figures\".[5] Brown had read an article in the New York Times about Sorkin's one-act play Hidden in This Picture, and he found out Sorkin also had a play called A Few Good Men that was having off-Broadway readings.[6]William Goldman did an uncredited rewrite of the script that Sorkin liked so much, he incorporated the changes made into the stage version.[7]Brown was producing a few projects at TriStar Pictures, and he tried to interest them in making A Few Good Men into a film, but his proposal was declined due to the lack of star-actor involvement. Brown later got a call from Alan Horn at Castle Rock Entertainment, who was anxious to make the film. Rob Reiner, a producing partner at Castle Rock, opted to direct it.[6]The film had a production budget of $33,000,000.[8]Nicholson would later comment of the $5 million he received for his role, \"It was one of the few times when it was money well spent.\"[9]The film starts with a performance of \"Semper Fidelis\" by a U.S. Marine Corps marching band, and a Silent Drill (performed by the Texas A&M University Corps of Cadets Fish Drill Team).[10]Several former Navy JAG lawyers have been identified as the basis for Tom Cruise's character Lt. Kaffee. These include Don Marcari (now an attorney in Virginia), former U.S. Attorney David Iglesias, Chris Johnson (now practicing in California), and Walter Bansley III (now practicing in Connecticut.) However, in a September 15, 2011, article in the The New York Times, Sorkin was quoted as saying, “The character of Dan Kaffee in A Few Good Men is entirely fictional and was not inspired by any particular individual.”[11][12][13][14][15]Wolfgang Bodison was a film location scout when he was asked to take part in a screen test for the part of Dawson.[16]","produced_by":"Rob Reiner David Brown Andrew Scheinman","starring":"Tom Cruise Jack Nicholson Demi Moore Kevin Bacon Kevin Pollak James Marshall J. T. Walsh Kiefer Sutherland","running_time":"138 minutes","music_by":"Marc Shaiman","edited_by":"Robert Leighton","budget":"$33–40 million[1][2]"}