{"distributed_by":"Gramercy Pictures","Plot":"Drayton \"Dray\" Jackson (Bill Bellamy) is a playboy with only one goal in his life: to have sex with as many women as possible. He dreamt that he got caught cheating on his girlfriend, Lisa, (Lark Voorhies) only to wake up for the dream to remind him not to get caught. The women he sleeps with are all a secret from Lisa, who comes over to his house for a bit to see him, before heading off from work. Dray's sister, Jenny, (Natalie Desselle-Reid) also came by to his house to remind him about the cookout, Dray becomes fascinated with Jenny's friend Katrina (Mari Morrow), he also invited her to a party his friend was hosting, but she told him she was busy.Jenny couldn't stand Dray's ways of how he treats women. As soon as Dray leaves, she and Katrina snoop around and finds Dray's mobile black book of his women. Jenny plans to set Dray up at the party in a hostile environment, hoping that Dray, if he gets caught, will change his ways in the form of reform. As soon as Jenny and Katrina call the women and receive their numbers, they both leave out.After Dray makes his daily rounds of having sex with his women three of which are his main ones which includes: Robin a married woman, (Beverly Johnson) Amber a sexy thespian, (Amber Smith) and Sherri a freaky dominatrix, (Stacii Jae Johnson) Dray goes to the cookout for a bit before heading to the party. When he sees all of his women there, including Jenny and Katrina in which he found out that he was set up by them, he figures out a way get all of his women out of the party, without them noticing about each other and confrontation about Dray. He succeeds then heads to Jenny and Katrina to give a hindsight that when a player is put in a hostile environment, a player doesn't reforms he adapts to the situation. Dray leaves to go home because he would be there to wait for Lisa to come see him after a long day at work.Dray was ready for Lisa but at the last minute, Katrina showed up to apologize, yet she becomes fascinated with Dray in which this entire time she also fantasized about him. Before leaving she made a move on Dray and they ended up having sex, in which she ended up having her fantasy fulfilled. Lisa returns and Katrina was able to leave without her noticing. However as Lisa changed into her nightwear she sees a dress and heels with smears of lipstick conveying in a message: \"Busted Adapt.\" It was clear that Katrina left those behind to set Dray up as Dray realizes that he finally got caught.","language":"English","box_office":"$14 million","production_company":"Def Jam Pictures","release_dates":"August 6, 1997 (1997-08-06)|||||","produced_by":"Todd R. Baker Mark Burg Preston L. Holmes Russell Simmons","starring":"Bill Bellamy Natalie Desselle-Reid Lark Voorhies Mari Morrow Pierre Edwards Jermaine 'Huggy' Hopkins Anthony Johnson Max Julien Beverly Johnson Gilbert Gottfried and Bernie Mac","running_time":"93 minutes","music_by":"Darren Floyd","External links":"","written_by":"Mark Brown Demetria Johnson","budget":"$12 million"}