{"based_on":"Beyond the Poseidon Adventure  by Paul Gallico","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Nelson Gidding","Plot":"The capsized luxury liner, S.S. Poseidon is still afloat after six survivors have been rescued via helicopter.Tugboat captain Mike Turner (Michael Caine) discovers the shipwreck. Accompanied by second mate Wilbur (Karl Malden) and passenger Celeste Whitman (Sally Field), he heads out to claim salvage rights, as the tugboat Jenny lost her cargo in the same tsunami that capsized the Poseidon.They are soon followed by Dr. Stefan Svevo (Telly Savalas) and his crew, who claim to be Greek Orthodox medics who received the ship's SOS. They board the doomed vessel through the bottom hull opening left by the Greek rescue team, and become trapped after the entrance collapses. The group with Turner also encounters the ship's nurse, Gina Rowe (Shirley Jones), a passenger named Suzanne Constantine (Veronica Hamel), and war veteran Frank Mezzetti (Peter Boyle) who is searching for his missing daughter (Angela Cartwright), whom they soon find along with the elevator operator Larry Simpson (Mark Harmon) and as well as a \"billionaire\" named \"Tex\" (Slim Pickens). Later they find the blind Harold Meredith (Jack Warden) and his wife Hannah (Shirley Knight), who were waiting to be rescued.Water continues to submerge decks and more explosions occur. Turner and his group find the purser's office, where Svevo decides he and his men will continue their search for other survivors. Turner agrees, and Svevo and his men leave in another direction. Another explosion causes the safe in the purser's office to fall through the bulkhead and open, revealing gold coins (each worth 100 times its weight in gold) and cash. Turner and Wilbur excitedly gather it and start looking for another way out of the ship. Unknown to Turner and the survivors, Suzanne was actually working with Svevo and took a list containing information about a cargo of crates from the purser's office. She gives it to Svevo but decides she no longer wants to go through with his plan. Svevo apologizes and orders Doyle, one of his men, to kill Suzanne. He shoots her, but she strikes him with an axe, killing him, before she dies.After climbing up a few decks, Turner and his group find Svevo and his men gathering a cargo of plutonium. Svevo reveals that his real intention for boarding the Poseidon was to retrieve his lost shipment of plutonium, adding that he can't let Turner and his group go now. However, before they can kill Turner and his group, another explosion occurs, allowing them to escape through another cargo room full of cars, where another of Svevo's men is killed. Water floods the deck as Turner's group proceed up to the next deck, but Hannah falls into the rising water and drowns. Turner also loses all of his salvaged gold. Svevo and his one remaining gunman head back up to the ship's stern, where the rest of Svevo's team attempt to use a crane to raise the plutonium up to the hull of the ship, which is still above water but is slowly sinking.In another section of the ship, Turner and the survivors exit the ship through an underwater side door, but due to shortage of scuba tanks, Wilbur (unknown to Turner and his group) sacrifices himself by swimming underwater and disappearing. Turner and Celeste swim to the tugboat Jenny and move it closer to the Poseidon as the remaining survivors swim towards it. Svevo's men see them and open fire, killing Tex, who willingly holds onto a bottle of champagne as he goes down. Turner's group makes it to his boat, and they sail away. Water continues to flood the Poseidon and cause the on-board boilers and then the plutonium cargo to explode. Svevo and his men are all killed as the entire Poseidon explodes.On board Turner's boat, Turner accepts that his tugboat Jenny will be taken from him when they get to port, but Celeste reveals a diamond she salvaged from the Poseidon. Celeste asks Turner, \"Are you going to kiss me now?\" and Turner replies, \"I was going to kiss you anyway.\" They kiss and the tugboat Jenny sails away into the sunset with the survivors.","Characters":"Salvage TeamGreek Salvage TeamPoseidon PassengersPoseidon Crew","beyond_the_poseidon_adventure":"Original film poster by Mort Künstler","language":"English","Relationship of Gallico's novels to the films":"Paul Gallico's novel The Poseidon Adventure had ended with the ship's sinking. The original film changed much of the novel's plot and ended with the ship still afloat. After the huge success of the film, Gallico was asked to write a novel that would be a sequel not to his first novel, but to the film. It would feature a new group of people entering the still capsized ship and could be made into a second film. In response, Gallico wrote Beyond The Poseidon Adventure, which was published in 1978. However, once again the film that followed ended up bearing little resemblance to his book. Instead of sinking, the ship explodes.[citation needed]","cinematography":"Joseph F. Biroc","directed_by":"Irwin Allen","Abandoned film sequel premise":"In 1973, soon after the first film came out, producer Irwin Allen proposed a sequel that would have had the survivors testifying in a hearing on the disaster in Austria, the country of the Poseidon's parent company. While on a train to the hearing, a miles-long mountain tunnel would collapse, leaving the survivors of the train trapped inside, struggling to make their way out. This premise was eventually used in the 1996 Rob Cohen film Daylight with Sylvester Stallone.[3]","Media releases":"A region one DVD version was released on August 22, 2006. A digital version is available for rental and purchase on the PlayStation Network for the PlayStation 3, it is also up for purchase and rental on the iTunes Store. Warner Brothers re-released the DVD via their Warner Archive Collection in April, 2014.","release_dates":"May 18, 1979 (1979-05-18)|||||","produced_by":"Irwin Allen","starring":"Michael Caine Telly Savalas Sally Field Karl Malden Shirley Jones Jack Warden Peter Boyle Slim Pickens Mark Harmon","running_time":"114 minutes","music_by":"Jerry Fielding","edited_by":"Bill Brame"}