{"country":"India","story_by":"Jeevanprabha M. Desai (story) Pushpa Sharma (story idea)","Plot":"Kishanlal (Pran), a chauffeur, takes the blame for a fatal hit-and-run accident committed by his mob boss employer, Robert (Jeevan), on the assurance that his family's income will be tripled and their welfare looked after. He returns from prison to find his wife Bharati (Nirupa Roy) suffering from tuberculosis and his three sons starving. Seeking help from Robert for the sake of his family, he is ridiculed, humiliated and repudiated, until he turns on Robert and tries to kill him. Making his escape, Kishanlal inadvertently takes a car containing a shipment of gold bullion. Robert's goons give chase.Kishanlal goes home to rescue his family – only to find his wife's suicide note. Unknown to him, she fails and is struck blind. He leaves his sons in a public park (at the foot of a statue of Gandhi) while he draws off the pursuing goons. In the car chase that follows he crashes, is thrown clear of the wreck, and discovers the gold. But by the time he returns to the park with his riches, his three children have vanished. Amar, the oldest, has been adopted by a Hindu policeman; a Muslim tailor adopts the youngest and names him Akbar; and a Catholic Priest (Nazir Hussain), finding the middle son asleep on the steps of his church, fosters him and names him Anthony.In revenge, Kishanlal kidnaps Robert's daughter Jenny and raises her as his niece, using the gold to destroy Robert's business and set himself up as mob boss instead.Amar (Vinod Khanna) becomes a policeman; Akbar (Rishi Kapoor) becomes a singer; the middle brother, Anthony (Amitabh Bachchan), becomes a likable, socially conscious scamp who runs quasi-legal operations and makes God his 'partner' by donating half his income to charity. The three meet when they donate blood for an accident victim, unaware that they are related – or that the recipient is their biological mother Bharati.Their lives become entangled in an incredible web of coincidences and furious action sequences — interspersed with songs – when Amar's adopted father is seriously wounded and Anthony falls in love with Jenny, Robert's long-lost daughter. Because of it his adoptive father, the priest, is murdered. In their pursuit of justice their paths cross again until, combining efforts, the brothers discover both the culprit and their mutual heritage.In addition to the ongoing feud between Robert and Kishanlal, each son meets and courts – with greater or lesser difficulty – their love interests. When the grieving mother regains her sight at a Diwali festival in honor of Sai Baba. She ends up at the Muslim tailor's place once again. He recognizes her as the woman he saved one day. When she asks about the young boy he had found that same day and how he's doing now, Akbar says he is the boy the tailer had found that day. He shows her a photograph from his childhood. Bharati recognizes the boy in the photograph as her own son. Thus, one by one the family is re-united and Robert, who caused their suffering, is finally imprisoned.","Themes and allusions":"Desai's magnum opus extends religious pluralism, secular nationalism and also clear secularism motifs albeit complete with Bollywood masala. Three children were separated from their father on the Independence Day (15 August) who leaves them in a park under a statue of Mahatma Gandhi. These kids are subsequently raised by different parents, one grows up to become Anthony Gonsalves (Amitabh Bachchan), a Goan Christian, Amar Khanna (Vinod Khanna), a Hindu police officer, while the third and youngest child raised by Muslim parents, becomes Akbar Allahabadi (Rishi Kapoor), a Qawwali-singer. Their reunion in the end, completes the nationalistic allegory.[5][11][12]In a crucial scene on the opening titles appear, three brothers of different religions, unknowingly donated blood to a blind woman, who is their mother, and are all united in the end, suggesting what was lost at independence, can be gained.[13] The final dance number, \"Honi Ko Anhoni Karde\", which leads to films' climatic sequence, shows a masquerade song with the entire cast at villain's den. It highlighting that three religions are \"pillars of the nation\" and when they work together, they can beat any evil, their common villain in this case.[14]The stereotype of suffering and self-sacrificing mother is also highlighted by some authors, played by actress Nirupa Roy, who regularly played such roles during the period. However, in her self-sacrificing streak, when she is afflicted to tuberculosis, she tries to commit suicide so that she doesn't become a burden to her family. However, this transgression of attempting to abandon her three young sons calls for a suitable punishment in the narrative and she loses her eyesight.[15]","language":"Hindi","Reception":"Amar Akbar Anthony was Desai's first film as an independent film producer,[20] it grossed ₹155 million (US$2.3 million) at the box office, was declared a blockbuster, and subsequently became highest grossing Bollywood film at the Indian Box Office for the year 1977.[1]","box_office":"₹155.0 million (US$2.3 million)[1]","cinematography":"Peter Pereira","directed_by":"Manmohan Desai","Release and promotion":"The Emergency period declared in 1975, delayed the release of Desai's films, as a result in 1977, when Emergency was lifted, four of films, were released in the same year, this included, Dharam Veer, Chacha Bhatija, Parvarish and Amar Akbar Anthony.[19][20] Incidentally, all of them were amongst the top grossing films of the year.[1]Film expert Rajesh Subramanian explains one of the earliest film merchandising strategy started with Amar Akbar Anthony. Three large Erasers with the photographs of Vinod Khanna, Rishi Kapoor and Amitabh Bachchan, was sold in the market. It was a rage among school students. Posters, postcards and song booklets of the film adorned the shops. Men started sporting a metal cross around their neck. Even colourful vests, worn by Amitabh Bachchan in the film) became a vogue.","Soundtrack":"The soundtrack was composed by Laxmikant-Pyarelal, and the lyrics were penned by the veteran Anand Bakshi. The soundtrack of the movie proved as popular and successful as the movie itself. The vocals of the songs again have been given by some of the biggest names in the Indian music industry: Mohammed Rafi, Mukesh, Kishore Kumar, Mahendra Kapoor, Lata Mangeshkar, Shailender Singh and Amitabh Bachchan (sang in the song \"My Name is Anthony Gonsalves\"). For the song, \"Humko Tumse Ho Gaya Hai\" four leading playback singers, Mohammed Rafi, Lata Mangeshkar, Kishore Kumar, and Mukesh sang together for the first and only occasion.[4] The film also features a comical qawwali, \"Parda Hai\" (There is Veil) sung by Mohammed Rafi.[17] Desai had originally settled for the name \"Anthony Fernandes\" for Christian character to be played Amitabh Bachchan, though when he met lyricist Anand Bakshi, and the song \"My name is Anthony Fernandes\" was written, it didn't go well with music directors, Laxmikant-Pyarelal. That is when composer, Pyarelal recalling his violin teacher, composer Anthony Gonsalves, suggested an alternative Anthony Gonsalves, which was finalised.[4][18]Shahid Khan of Planet Bollywood gave 9 stars stating, \"Overall, Amar Akbar Anthony is one of the finest examples of an album where the list of playback singers matches the star-power in the film\".[16]The vinyl record was released on Polydor and was the first coloured LP: It was pink.","amar_akbar_anthony":"Theatrical release poster","release_dates":"27 May 1977","Production":"\"You see the whole country of the system is juxtapositioned by the haemoglobin in the atmosphere, because you are a sophisticated rhetorician intoxicated with the exuberance of your own verbosity.\"Prayag Raaj wrote the film's screenplay, with Kader Khan writing the dialogues.[8] In a famous sequence, Anthony Gonsalves' jumps out of a large easter egg, wearing a black tuxedo complete with a top hat, monocle and umbrella. He speaks one of the most famous nonsensical dialogues in a mock accent, \"you are a sophisticated rhetorician intoxicated with the exuberance of your own verbosity,\"[7] This was in part taken from 1878 speech by British politician Benjamin Disraeli, who made it while referring to another politician, W. E. Gladstone.[4] The character Anthony Gonsalves played by Amitabh Bachchan was named after noted music arranger by the same name, whose pupils included R D Burman and Pyarelal of Laxmikant-Pyarelal, the composer duo of the film.[4][9]The film was scheduled in such a way that the entire cast, which included the leading stars of time, didn't have to shoot together, except for the climax sequence and the title song, \"Anhony Ko Honi\", where they all performed together. It was shot over a period of a month at Ranjit Studios in Mumbai. However, the shooting went beyond this period, so Rishi Kapoor and Shabana Azmi had to leave towards the end for other films, hence their scenes were shot separately.[8]The film's \"mirror band-aid\" scene was shot while director Manmohan Desai was absent. When Amitabh Bachchan was rehearsing the scene, Desai was committed to shooting the climax of Parvarish in another part of the same studio. He returned to find the scene shot.[4] Some of the crucial scenes were shot at Mount Mary Church in Bandra, Mumbai.[10]","produced_by":"Manmohan Desai","starring":"Vinod Khanna Rishi Kapoor Amitabh Bachchan Shabana Azmi Neetu Singh Parveen Babi Nirupa Roy Pran Jeevan Nazir Hussain Ranjeet Helen","running_time":"185 mins","music_by":"Laxmikant-Pyarelal Anand Bakshi (lyrics)","edited_by":"Kamlakar Karkhanis","written_by":"Kader Khan(dialogue) Prayag Raj (screenplay) K.K. Shukla (scenario)"}