{"country":"United States","distributed_by":"Warner Bros.","a_star_is_born":"Theatrical release poster","Plot":"Esther Hoffman, an aspiring singer/songwriter, meets John Norman Howard, a famous, successful and self-destructive singer/songwriter rock star, whom, after a series of coincidental meetings, she finally starts dating. Believing in her talent, John gives her a helping hand and her career begins to eclipse his.Writer and director Frank Pierson, in his New West magazine article \"My Battles With Barbra and Jon\" summarized it this way:\"An actress is a little more than a woman, an actor a little less than a man (Oscar Wilde) ... The woman in our story is ambitious to become a star, but it is not necessary: it can make her happier and richer, but she could give it all away and not be a better or worse person. With stardom she is only a little more than a woman. For the man, his career is his defense against a self-destructive part of himself that has led him into outrageous bursts of drunkenness, drugs, love affairs, fights and adventures that have made him a legend. His career is also what gives him his sense of who he is. Without it, he is lost and confused; his demons eat him alive. That's why he is a little less than a man. And it is not that her success galls him, or that she wins over him; the tragedy is that all her love is not enough to keep alive a man who has lost what he measures his manhood with; his career.\"[2]And so the conclusion is measured by the theme. He takes his life in the mistaken belief that he will then not drag her down with him.","language":"English","Reception":"The film grossed $80 million at the U.S box office,[1] making it the 3rd highest grossing picture of 1976.A Star Is Born maintains a 31% \"Rotten\" rating on Rotten Tomatoes based on 16 reviews.[6] Roger Ebert gave the film two and 1/2 stars.[7] Paul Mavis, reviewing Warner's 2006 disc release of A Star is Born for DVD Talk, wrote, \"There is something of value in A Star is Born--one thing--and that's Kris Kristofferson's amazingly adept, heartfelt performance as the doomed rock star, self-destructing despite the love of an up-and-coming singer (Streisand). There's not a wrong note in his performance. Unfortunately, the remainder of A Star is Born is an unmitigated disaster that has the megalomaniac fingerprints of Barbra Streisand and her hairdresser/producer boyfriend, Jon Peters, all over it.\"[8]The film won the Academy Award for Best Original Song for \"Evergreen\" with the award shared by its songwriters, Streisand and Paul Williams, and was also nominated in the categories of Best Cinematography (Robert Surtees), Best Sound (Robert Knudson, Dan Wallin, Robert Glass and Tom Overton) and Original Song Score (Roger Kellaway).[9]It won five Golden Globe Awards for Best Motion Picture – Musical or Comedy, Best Actress – Motion Picture Musical or Comedy (Streisand), Best Actor – Motion Picture Musical or Comedy (Kristofferson), Best Original Score (Paul Williams and Kenny Ascher) and Best Original Song, (Streisand and Williams for \"Evergreen\").In the two previous versions, Gaynor and Garland were each depicted on screen as winning an Oscar, yet neither won for their film in real life (though Gaynor won an Oscar before, as did Streisand). In this film, Streisand is instead depicted as winning a Grammy, and in real life the film's song \"Evergreen\" won her both a Grammy (for Song of the Year) and an Oscar.According to at least one Streisand biography[vague], unhappy with a few of Frank Pierson's scenes, Streisand later directed them herself (a claim also made for 1979's The Main Event), adding to the rumors that she and Pierson clashed constantly during production.","box_office":"$80 million[1]","cinematography":"Robert Surtees","production_company":"First Artists","directed_by":"Frank Pierson","Home media":"In 2006, the Region 1 DVD was released in North America in Dolby Digital 5.1 sound with extras including a full length commentary by Barbra Streisand, 16 minutes of never before seen and additional footage and the original wardrobe test. In 2007 the Region 2 DVD with the same extras was released in Germany. In 2008 the Region 4 DVD was released in Australia, the content of which appears to be the same as the Region 1 edition. The DVD has yet to be released in any other region.Warner Bros. released the film worldwide on the Blu-ray format on February 6, 2013.","Soundtrack":"The soundtrack album to the film was released by Columbia Records in 1976.","Remakes":"A Star Is Born, was the second remake of 1937 film. The film was remade in Bollywood as Aashiqui 2 in 2013.","release_dates":"December 8, 1976 (1976-12-08)|||||","Production":"Directed by Frank Pierson, the film updates the original story and screenplay of William A. Wellman and Robert Carson with additional contributions by Pierson, John Gregory Dunne and Joan Didion. It also features Gary Busey and Sally Kirkland. Venetta Fields and Clydie King perform as Streisand's backing vocalists \"The Oreos\". Kristofferson's then wife Rita Coolidge and Tony Orlando appear briefly as themselves.The earlier films had portrayed the behind-the-scenes world of Hollywood film making. However, this version adapted the story to the music business. For example, the 1937 and 1954 films each portrayed the lead female character winning an Academy Award, while the 1976 version depicted the heroine winning a Grammy Award instead.A Star Is Born was co-produced by Streisand and her then-partner Jon Peters for Barwood Films and Warner Brothers with Peters as the main producer and Streisand as executive producer. Among the actors considered for the male lead were Neil Diamond and Marlon Brando. Both Streisand and Peters wanted Elvis Presley for the role: they met with Elvis and discussed the film, and he was interested in taking on the part, thinking it would revive his film career. Elvis' manager, Colonel Tom Parker, insisted that Elvis have top billing and asked for a substantial sum of money for the role, even though he had not had an acting role since 1969, and people were unsure of what kind of box office draw he would be, which effectively ended Elvis's involvement with the project. Parker also did not want to have Elvis portrayed as having a show business career that was in decline. This in fact was far from the truth, with Elvis playing to packed auditoriums wherever he toured in the States. Diamond, who knew Streisand and had attended high school with her at Erasmus Hall High School in Brooklyn, was also very seriously considered but had to decline due to his extensive concert commitments - he was at the time, just as he is today, one of the biggest concert performers in the world - and Kristofferson later got the part of John Norman Howard.The film cost around $6 million to produce. Its soundtrack album was also an international success reaching number 1 in many countries and selling nearly 15 million copies worldwide. It featured the ballad \"Evergreen (Love Theme from A Star Is Born)\", which became one of the biggest hits of Streisand's career, spending three weeks at number one in the United States, and peaking at number three in the United Kingdom. The filming locations included many in Arizona such as downtown Tucson, Tucson Community Center, Sonoita and Tempe.[3]Streisand's character's (Esther Hoffman Howard) clothing was straight out of Streisand's own closet. The actual credit reads: Miss Streisand's clothes from... her closet.The film was choreographed by David Winters of West Side Story fame, who worked closely with Streisand to perfect the movie's dancing sequences.[4][5]","produced_by":"Jon Peters Barbra Streisand","starring":"Barbra Streisand Kris Kristofferson Gary Busey","running_time":"140 minutes","music_by":"Kenny Ascher Rupert Holmes Roger Kellaway Kenny Loggins Leon Russell Paul Williams Barbra Streisand","written_by":"Frank Pierson William A. Wellman Robert Carson John Gregory Dunne Joan Didion","budget":"$6 million"}