{"country":"United States","distributed_by":"Warner Bros. Pictures Summit Entertainment","Plot":"Sawyer Nelson, a lonely 11-year-old, has fallen behind in school since being abandoned by his father five years earlier. His only friend is his cousin Kyle (Austin Stowell), a champion swimmer who hopes to compete in the Olympics. Kyle leaves to spend time in the army.One day Sawyer finds a fisherman attempting to help an injured dolphin tangled in a crab trap. The dolphin is taken for treatment to Clearwater Marine Hospital (CMH), run by Doctor Clay Haskett. Clay's daughter Hazel names the dolphin Winter, following the theme of two prior dolphins, Summer and Autumn, who were successfully treated and returned to the ocean. Sawyer sneaks in to see Winter (with an assist from Hazel) and later starts visiting daily, being harassed by a roof-dwelling pelican named Rufus. Their respective parents object at first (Clay because Sawyer has no experience with marine animals, and Sawyer's mother, Lorraine, because Sawyer is skipping summer school without permission to visit Winter); but they realize that the fact that the friendship seems to benefit both Winter and Sawyer (Winter feels better with Sawyer's presence, and Sawyer is becoming more confident and strong). Dr. Clay allows the visits to continue, and Lorraine withdraws Sawyer from summer school and lets him volunteer at CMA giving him a new wet suit as well.However, Winter's tail is damaged and must be amputated. Winter learns to swim without a tail by developing a side-to-side motion like a fish, but after an x-ray Clay notices the unnatural motion is causing stress on her spine; if continued the motion will cripple and eventually kill her.The news comes that Kyle has been injured in an explosion and is coming home for treatment. Sawyer is excited to see him, but devastated when Kyle, depressed, skips his own welcome-back party and stays at the local Department of Veterans Affairs Medical Center, where Doctor Cameron McCarthy is developing a prosthetic leg for Kyle. Sawyer and his mother visit Kyle there but Kyle asks them to leave, which shocks and infuriates Sawyer. Kyle takes Sawyer on a walk for a deeper talk about his leg. Sawyer then asks Dr. McCarthy if he can work on making a prosthetic tail for Winter. McCarthy agrees to do so and convinces his prosthetic supplier Hanger Prosthetics and Orthotics to supply the parts at no cost. Dr. McCarthy manufactures a \"homemade\" model tail while waiting for the real one to arrive; however, Winter rejects it and destroys it by banging it against the pool wall.Meanwhile Kyle gets more depressed when his friend and swimming partner, Donovan Peck, beats Kyle's old swimming records. McCarthy hears about it and persuades Kyle to go home.Then CMA, already in financial peril, is damaged by a hurricane. The board of directors agree to close CMA, sell the land to a real estate developer, and find homes for all the animals except Winter, who due to her condition is not wanted by anyone and may have to be euthanized. Kyle visits CMA and sees that Winter is like him, with a damaged limb. However, inspired by a girl with a prosthetic limb from Atlanta, Georgia who - inspired by Winter's story of overcoming disability - comes to visit Winter, Sawyer envisions an event called \"Save Winter Day\" to save the facility. Clay is not sold on the idea, but reconsiders after talking with his father, Reed. Kyle agrees to a race against Donovan Peck and persuades Bay News 9 to cover the event.The Hanger-supplied tail finally arrives; however, Winter rejects it as well. Sawyer then figures out what the real problem is: the plastic base for the tail is irritating her skin. So McCarthy develops an alternative gel-like sock which he calls \"Winter's Gel\" (the real-life name of the Hanger product used to attach prosthetic limbs, which was developed during its research with Winter). Winter finally accepts this newest prosthetic tail.At Save Winter Day, the work with Winter impresses everyone. Sawyer's teacher gives him school credit, allowing him to pass summer school. The fisherman who found Winter on the beach comes by as well. Also, the real estate developer decides to keep CMA open and financially support it. With Winter's help, Kyle then wins a swimming race against Donovan.The ending shows documentary footage from Winter's actual rescue. It then shows several of the prosthetic tails that Winter has worn, and scenes from real amputees who have visited Winter at the Clearwater Marine Aquarium.","language":"English","Reception":"The film opened at #3 with $19.2 million behind the 3D re-release of The Lion King and Moneyball.[11] In its second weekend, the film reached the #1 spot, dropping only 27%, and grossed $13.9 million.[12] As of January 5, 2012, the film has grossed $72,286,779 in the United States and Canada as well as $23,117,618 internationally bringing its worldwide total to $95,404,397.[3]The film received positive reviews from critics. Review aggregator Rotten Tomatoes reports that 82% of 106 critics have given the film a positive review, with a rating average of 6.5 out of 10.[13] Metacritic, which assigns a weighted average score out of 100 to reviews from mainstream critics, gives the film a score of 64 based on 31 reviews.[14]","box_office":"$95.9 million[3]","dolphin_tale":"Theatrical release poster","cinematography":"Karl Walter Lindenlaub","production_company":"Alcon Entertainment Arc Productions","Differences between the movie and real-life events":"In the film, Winter is stranded on Honeymoon Island Beach in Dunedin near Clearwater. She is found by a nearby fisherman sitting on the shore (and then rescued with Sawyer's assistance). In real life, Winter was found in Mosquito Lagoon south of New Smyrna Beach―part of the Cape Canaveral National Seashore. The fisherman who discovered her was in the lagoon as well. Winter was first taken to the local Marine Discovery center and then transferred to Clearwater, which is on the opposite side of the state.[7] In the movie it is mentioned that Winter's tail was amputated due to infection caused by the tail being caught in the rope. In real life, the loss of blood supply to the tail (from being caught in the rope) caused most of the tail to naturally fall off, with only a small piece being amputated.[8] In the movie the process of developing Winter's tail takes place over a few weeks by a Veteran's Administration doctor working during his vacation. In real life, the process of developing (and attaching) a suitable tail took a number of months by Kevin Carroll and Dan Strzempka from Hanger Clinic.[7][9]","directed_by":"Charles Martin Smith","release_dates":"September 23, 2011 (2011-09-23)|||||","Production":"Dolphin Tale was filmed in native 3D. Filming began in 2010. The film was shot primarily in Pinellas County, Florida with the principal location centering on Winter's home, the Clearwater Marine Aquarium. Additional locations featured in the film include: Admiral Farragut Academy, Honeymoon Island, Tarpon Springs, and local news station Bay News 9.[10]","produced_by":"Richard Ingber Broderick Johnson Andrew A. Kosove","starring":"Nathan Gamble Harry Connick, Jr Ashley Judd Kris Kristofferson Cozi Zuehlsdorff Morgan Freeman","running_time":"113 minutes[1]","Sequel":"A sequel titled Dolphin Tale 2 was released on September 12, 2014.","music_by":"Mark Isham","edited_by":"Harvey Rosenstock","Release":"Dolphin Tale was released theatrically on September 23, 2011 in North America by Warner Bros. Pictures and Alcon Entertainment. The film was released in RealD 3D as well as 2D.The movie was released on DVD and Blu-ray on December 20, 2011.","written_by":"Karen Janszen Noam Dromi","budget":"$37 million[2]"}