{"country":"United States[2][3]","distributed_by":"Columbia Pictures","Plot":"Andy Bowman persuades her sister Laura to go on a trip to Burma after Laura’s husband and son are killed in a home invasion and Laura had gone into a deep depression. One night, unable to sleep because of nightmares, Laura leaves her hotel in Rangoon and gets caught up in an anti-government protest. She is very impressed by the bravery of Aung San Suu Kyi. When her tour group leaves the country, Laura cannot leave with them as her passport was stolen the previous night. While staying behind waiting for her new passport, she meets U Aung Ko, who acts as an unofficial tour guide and drives an ancient Chevy. He takes Laura out into the countryside to a Buddhist monastery. The car develops problems, but fortunately they are able to coast to the house of some of Ko’s friends and former students. Laura learns that Ko used to be a college professor, who was banned from teaching for supporting anti-government activity led by his former student Min Han. She has a breakdown and tells Ko what happened to her family. The next morning they learn that the 8888 uprising began the previous day. Ko takes Laura to a station to get train back to Rangoon. She sneaks on board, but the soldiers start beating Ko and when Min Han intervenes, Han is shot and killed. Laura gets Ko into the car and they leave, pursued by the soldiers, but Ko is shot and wounded. They end up crashing into the Irrawaddy river, but get away from the soldiers. They get on a raft taking bamboo to Rangoon. Laura, who is a doctor operates on Ko to remove the bullet. The next day the raft stops at a village. Laura goes to find drugs to treat Ko. She reluctantly accepts a pistol from one of the crew. At a clinic Laura finds the drugs she needs, but has to shoot a soldier to keep from being raped. When they arrive in Rangoon, the city is in the throes of a full-scale revolt. When Laura attempts to get into the US embassy the military tries to arrest her for helping Ko. The student demonstrators rescue her and Ko. After they witness soldiers killing civilians they get put on a truck heading for the border. Near the border the group has to abandon their truck and make run through the jungle. They meet up with a group of Karen rebels. Laura has a dream where her son Danny tells her she has to let him go. Ko urges Laura to do so, telling her, \"All things pass, Laura. They are shadows as we are shadows. Briefly walking the earth, and soon gone.\". The next day, Laura and her group of refugees make a harrowing river crossing into Thailand under mortar fire and reach a refugee camp. Having found a new purpose in life Laura begins helping at the camp’s hospital.","beyond_rangoon":"Theatrical release poster","language":"English","Reception":"Critical reaction was mixed. Time, Rolling Stone, and Entertainment Weekly wrote negative reviews, while the critic for The New Yorker called the film a \"fearless masterpiece\" and Andrew Sarris declared himself \"awestruck\" by the film.[citation needed] The film was a financial success only in France (where it opened number one and gained 442,793 visitors), though it was screened in many European countries. Film critic Tullio Kezich compared the film to Rossellini's classic, Paisà, regretting that it was marred by certain directorial touches.[citation needed] Beyond Rangoon currently holds a 38% rating on Rotten Tomatoes based on 32 reviews.","box_office":"$5,750,110","cinematography":"John Seale","production_company":"Castle Rock Entertainment","directed_by":"John Boorman","Soundtrack":"Beyond Rangoon is also an original soundtrack music album that features in the film of Beyond Rangoon. The majority of the soundtrack was composed by the German composer Hans Zimmer and the album was released in 1999.","release_dates":"30 June 1995 (1995-06-30) (United Kingdom)|25 August 1995 (1995-08-25) (United States)||||","produced_by":"John Boorman Sean Ryerson Eric Pleskow Barry Spikings","starring":"Patricia Arquette Frances McDormand U Aung Ko Johnny Cheah Adelle Lutz","running_time":"99 minutes [1]","music_by":"Hans Zimmer","edited_by":"Ron Davis","written_by":"Alex Lasker Bill Rubenstein","budget":"$23 million"}