{"based_on":"My Posse Don't Do Homework  by LouAnne Johnson","country":"United States","distributed_by":"Buena Vista Pictures","screenplay_by":"Ronald Bass","Plot":"LouAnne (Michelle Pfeiffer), a discharged U.S. Marine, applies for a teaching job in High School, and is surprised and pleased to be offered the position with immediate effect. Showing up the next day to begin teaching, however, she finds herself confronted with a classroom of tough, sullen teenagers, all from lower-class and underprivileged backgrounds, involved in gang warfare and drug pushing, flatly refusing to engage with anything. They immediately coin the nickname \"White Bread\" for LouAnne, due to her race and apparent lack of authority, to which LouAnne responds by returning the next day in a leather jacket and teaching them karate. The students show some interest in such activities, but immediately revert to their former behavior when LouAnne tries to teach the curriculum.Desperate to reach the students LouAnne devises classroom exercises that teach similar principles to the prescribed work, but using themes and language that appeal to the streetwise students. She also tries to motivate them by giving them all an A grade from the beginning of the year, and arguing that the only thing required of them is that they maintain it. In order to introduce them to poetry, LouAnne uses the lyrics of Bob Dylan's 'Mr. Tambourine Man' to teach symbolism and metaphor; once this is achieved, she progresses on to Dylan Thomas's 'Do not go gentle into that good night'. LouAnne rewards the students liberally, using candy bars, reward incentives, and a trip to a theme park. Her methods attract the anger of the school authorities, George Grandey (Courtney B. Vance) and Carla Nichols (Robin Bartlett), who try to force her to remain within the curriculum.Particular individual students attract LouAnne's attention for their personal problems. Callie Roberts (Bruklin Harris) is an unusually bright girl who excels at English, but is removed from the school halfway through the semester when she becomes pregnant. LouAnne visits her outside of school hours to try to persuade her to continue with further education. Raúl Sanchero (Renoly Santiago) is a well-meaning boy who is frequently involved in gang warfare and street crime. LouAnne tries to encourage him to focus by paying a special visit to his family to congratulate him on his work, and going to dinner with him as a way of instilling confidence and self-respect. Emilio Ramírez (Wade Domínguez) is her most troublesome personal project, as he believes strongly in a sense of personal honor that prevents him from asking for help. When LouAnne discovers that his life is in danger because of a personal grudge held by a recently released thug, she tries to protect him. She advises him to seek help from Principal Grandey. The next day, Emilio visits Grandey, but Grandey (not realizing that Emilio is in serious danger) instantly dismisses him because he neglected to knock on Grandey's door before entering his office. Feeling rejected, Emilio leaves the school and is subsequently killed by his enemy. LouAnne is outraged that his life was lost due to something as trivial as forgetting to knock on a door.Heartbroken by her failure to protect Emilio and angry at the indifferent school system for contributing to his death, LouAnne announces to the class her intention to leave the school at the end of the academic year. The students immediately break down, begging her not to leave. Overwhelmed by their unbridled display of emotion, she decides to stay.","dangerous_minds":"Theatrical release poster","In popular culture":"In 2009, the comedy website CollegeHumor released a trailer for the non-existent film Dangerous Wands, a parody of the film. The plot featured an adult Hermione Granger, a character from the film series based upon J. K. Rowling's acclaimed Harry Potter books, going to teach at 'the worst wizard school around.'[17][18]","language":"English Spanish","Television series":"The commercial success of the film prompted the creation of a spin-off television series, Dangerous Minds, featuring Annie Potts in the role of LouAnne Johnson. The series premiered on ABC on September 30, 1996 and ended on March 15, 1997, after one season of seventeen episodes.[16]","box_office":"$179,519,401[1]","cinematography":"Pierre Letarte","production_company":"Hollywood Pictures Simpson/Bruckheimer Via Rosa Productions","directed_by":"John N. Smith","release_dates":"August 11, 1995 (1995-08-11) (USA)|September 28, 1995 (1995-09-28) (AUS)|January 19, 1996 (1996-01-19) (UK)|||","Production":"Dangerous Minds was one of the last films of producer Don Simpson.[2] Andy García filmed scenes as Michelle Pfeiffer's love interest, but these were cut before the film's release.[2] The actual school at which LouAnne Johnson taught, Carlmont High School in Belmont, California, was considered as a filming location, but most filming was completed in Burbank, California at Warner Brothers.[3] Burlingame High School in San Mateo was used as the filming location for all the outside scenes. The amusement park scene was done in Santa Cruz California, at the Santa Cruz Beach Boardwalk","produced_by":"Don Simpson Jerry Bruckheimer","starring":"Michelle Pfeiffer|Wade Dominguez|","running_time":"99 minutes","music_by":"Wendy & Lisa","edited_by":"Tom Rolf","Release":"Dangerous Minds was released on August 11, 1995, in the United States.[4] It was an immediate box office success, grossing a total of $179,519,401 worldwide.[1]The film is ranked as \"rotten\" on Rotten Tomatoes with a 29% positive approval rating (with 11 out of 38 critics giving a positive reviews).[5] On Metacritic, the film holds a score of 47 out of 100, indicating mixed-to-negative reviews.[6]Janet Maslin in the New York Times[7] wrote: \"There aren't many things that would look better on paper than on Michelle Pfeiffer, but the role of LouAnne Johnson is one of them... False and condescending films in this genre are nothing new, but Dangerous Minds steamrollers its way over some real talent. Ms. Pfeiffer is a vastly better actress than this one-dimensional character allows her to be... Never mind the complaints that could be made about LouAnne's teaching methods: she rewards students with bribes, flirts patronizingly and inflicts cruel and unusual punishment while analyzing the subtext of 'Mr. Tambourine Man'... The kids turn out to be angels, straight from central casting... Performances are as lifelike as the material allows, but Ronald Bass's screenplay doesn't trade heavily in surprises.\"Kenneth Turan in the Los Angeles Times[8] wrote: \"While films are admired for making fantasy real, some manage a reverse, unwanted kind of alchemy, turning involving reality into meaningless piffle. It is that kind of regrettable transformation that Dangerous Minds achieves... none of it, with the exception of Pfeiffer's performance, seems even vaguely real. This is especially true of the film's excessively melodramatic climactic events, a bogus tragedy that does not occur in the book and has contrived written all over it... Given how few the opportunities are for women to carry a motion picture, and with the chance to be a positive role model thrown into the bargain, it's not surprising to find Pfeiffer starring in Dangerous Minds, and she is as believable as the film allows her to be. But if this trivialization of involving subject matter is the best a star of her considerable abilities can latch onto, today's actresses have it worse than we've imagined.\"Roger Ebert in the Chicago Sun-Times[9] wrote: \"We have seen this basic story before, in Stand and Deliver, Lean On Me, Teachers, Dead Poets Society, and so on. This version is less than compelling... Pfeiffer, who is a good actress, does with this material what she can... The real Miss Johnson used not Dylan but the lyrics of rap songs to get the class interested in poetry... What has happened in the book-to-movie transition of LouAnne Johnson's book is revealing. The movie pretends to show poor black kids being bribed into literacy by Dylan and candy bars, but actually it is the crossover white audience that is being bribed with mind-candy in the form of safe words by the two Dylans. What are the chances this movie could have been made with Michelle Pfeiffer hooking the kids on the lyrics of Ice Cube or Snoop Doggy Dogg?\"Terrence Rafferty in The New Yorker[10] wrote: \"Thanks to Pfeiffer’s inventive acting, John N. Smith’s movie does a fairly entertaining job of capturing the unscrupulous, guerrilla-like cunning of a good teacher in a bad school. But the cut-to-the-enlightenment dramaturgy of Ronald Bass’s screenplay feels desperate and false. And in the final scenes the movie gets as sticky as To Sir With Love. It canonizes the heroine needlessly: Pfeiffer looks plenty good without a halo.\"Peter Travers in Rolling Stone[11] wrote: \"The young and mostly unknown cast is outstanding. And Pfeiffer gives a funny, scrappy performance that makes you feel a committed teacher's fire to make a difference. The film also benefits from the sly touch of Elaine May, who collaborated with Ronald Bass (Rain Man) on this screen adaptation of Johnson's 1992 memoir, My Posse Don't Do Homework... Maybe producers Don Simpson and Jerry Bruckheimer (Bad Boys, Crimson Tide) don't know how to let a strong female character carry the ball. Dangerous Minds often unspools like a hokey update of Sidney Poitier's To Sir With Love. Still, in a summer when most women are forced to play dumb and strip to thrill or kill, Pfeiffer does herself and her endangered species proud.\"Kevin McManus in the Washington Post[12] wrote: \"Unhappily, Dangerous Minds, which tells the story of such a [charismatic] teacher, merits only a C. And if it weren't for Michelle Pfeiffer, we'd surely be looking at a more dismal grade... writer Ronald Bass sprinkles the script with saccharine lines that sound plain dumb coming from high schoolers. \"But you can't leave us,\" one kid whines as Pfeiffer gets set to quit. \"You're our Tambourine Man!\"... Pfeiffer and the students (played by talented unknowns) make sections of the movie quite watchable. When their wisecracks fly back and forth in class, it sounds right. When sequences depict school corridors and city streets, it looks right. If only the filmmakers had used some subtlety in telling the story, they could have done right by the real LouAnne Johnson.\"Edward Guthmann in the San Francisco Chronicle[13] wrote: \"It's contrived, it's hokey, but in Dangerous Minds, a Michelle Pfeiffer vehicle, it works surprisingly well... She's playing with a bag of clichés, but she's so plucky and likable, you overlook the hokum.\"Time Out[14] wrote: \"Actually it's quite a respectable piece of work, with an impressive tough-love performance from Pfeiffer, but Ronald Bass's hackneyed screenplay is all carrot and no stick.\"The soundtrack and its lead single 'Gangsta's Paradise' enjoyed major success, and received nominations for the Grammy Award for Record of the Year and the NAACP Image Award for Outstanding Soundtrack Album. Coolio won the Grammy Award for Best Rap Solo Performance for his vocals.[15]At the MTV Movie Awards 1996, Dangerous Minds was nominated in four categories: Best Movie, Best Female Performance (Michelle Pfeiffer), Most Desirable Female (Michelle Pfeiffer) and Best Movie Song (Coolio).[15]The music video for 'Gangsta's Paradise', featuring Michelle Pfeiffer, won the MTV Music Video Award for Best Rap Video and the MTV Music Video Award for Best Video from a Film.[15]Michelle Pfeiffer won the Blockbuster Entertainment Award for Favorite Actress - Drama.[15]","budget":"$29 million"}