{"based_on":"\"In the Town of Berdichev\"  by Vasily Grossman","country":"Soviet Union","Plot":"During the Russian Civil War (1918–1922), a female commissar of the Red Army cavalry Klavdia Vavilova (Nonna Mordyukova) finds herself pregnant. Until her child is born, she is forced to stay with the family of a poor Jewish blacksmith Yefim Magazannik (Rolan Bykov), his wife, mother-in-law, and six children. At first, both the Magazannik family and \"Madame Vavilova\", as they call her, are not enthusiastic about living under one roof, but soon they share their rationed food, make her civilian clothes, and help her with the delivery of her newborn son. Vavilova seemingly embraces motherhood, civilian life, and new friends.Meanwhile, the frontline advances closer to the town and the Jews expect a pogrom by the White Army as the Red Army retreats. Vavilova attempts to console them with a Communist dream: \"One day people will work in peace and harmony\", but the dream is interrupted with a vision of the fate of the Jews in the coming world war. She rushes to the front to rejoin her army regiment, leaving her newborn behind.","language":"Russian","cinematography":"Valeri Ginzburg","production_company":"Gorky Film Studio","commissar":"Film poster (1987)","directed_by":"Aleksandr Askoldov","release_dates":"1967 (1967)|||||","starring":"Nonna Mordyukova","running_time":"110 minutes","History of the film":"It was shot in the political climate of the post-Khrushchev Thaw. From the outset of the production, Goskino censors forced the film director Aleksandr Askoldov to make major changes; 1967 was the 50th anniversary of the October Revolution and the events were to be presented in the Communist Party-mandated style of heroic realism.After making the film, Askoldov lost his job, was expelled from the Communist Party, charged with social parasitism, exiled from Moscow, and banned from working on feature films for life. He was told that the single copy of the film had been destroyed.[2] Mordyukova and Bykov, major Soviet movie stars, had to plead with the authorities to spare him of even bigger charges. The film was shelved by the KGB for twenty years.In 1986, due to glasnost policies, the Conflict Commission of the Soviet Film-makers Union recommended the re-release of the movie, but Goskino refused to act. After a plea from Askoldov at the Moscow Film Festival, when the dissolution of the Soviet Union was imminent,[citation needed] the film was reconstructed and finally released in 1988. The film is set in Ukraine, and those who know the language will spot the Ukrainisms in Bykov's lines.The film won the Silver Bear - Special Jury Prize at the 38th Berlin International Film Festival in 1988,[3] four professional Nika Awards (1989), including one to composer Alfred Schnittke, and other awards. The film was selected as the Soviet entry for the Best Foreign Language Film at the 61st Academy Awards, but was not accepted as a nominee.[4]","music_by":"Alfred Shnitke","written_by":"Aleksandr Askoldov"}