{"country":"Iran","Awards and nominations":"^[I] Each date is linked to the article about the awards held that year wherever possible.","distributed_by":"Filmiran (Iran) Sony Pictures Classics (US)","a_separation":"Theatrical release poster","Plot":"Nader and Simin have been married for 14 years and live with their 11-year-old daughter Termeh in Tehran. The family belongs to the urban middle-class and the couple is on the verge of separation. Simin wants to leave the country with her husband and daughter, as she does not want Termeh to grow up under the prevailing conditions. This desire is not shared by Nader. He is concerned for his elderly father, who lives with the family and suffers from Alzheimer's disease. When Nader decides to stay in Iran, Simin files for divorce.The family court judges the couple's problems insufficient to warrant divorce and rejects Simin's application. Simin leaves her husband and daughter and moves back in with her parents. On the recommendation of his wife, Nader hires Razieh, a young, deeply religious woman from a poor suburb, to take care of his father while he works at a bank. Razieh has applied for the job without consulting her hot-tempered husband Hodjat, whose approval, according to tradition, would have been required. Her family is financially dependent on the work, and she takes her daughter to the house with her.Razieh soon becomes overwhelmed by taking care of Nader's father, which is physically and emotionally demanding. She finds the work very heavy, especially as she is pregnant.One day, Nader and Termeh return to discover her grandfather lying unconscious on the floor in his bedroom, with one of his arms tied to the bed. Razieh is nowhere to be found. When Razieh returns, Nader accuses her of neglecting his father and of having stolen money from his room (unbeknownst to Nader, Simin used the money to pay movers). Razieh protests her innocence and requests her payment for the day's work. Outraged, Nader shoves Razieh out of the apartment. She falls in the stairwell on the way out of the building. Hodjat's sister later calls Simin to inform her that Razieh is in the hospital because she has suffered a miscarriage.A court is assigned to determine the cause of the miscarriage and Nader's potential responsibility for it. If it is proved that Nader knew of Razieh's pregnancy and caused the miscarriage, he could be sentenced to one to three years imprisonment for murder. Nader accuses Razieh of neglecting his father. The hot-headed and aggressive Hodjat physically confronts Nader on several occasions, and threatens him, his family, and Termeh's teacher, who testifies on Nader's behalf. When Hodjat is sent out of a court hearing for an outburst, Razieh reveals that her husband is deeply depressed, and that he is taking antidepressants for these issues. Nader learns from Razieh's young daughter that the reason she was absent the day Nader came home early was because she had gone with Razieh to see a doctor, which Razieh had avoided revealing earlier. This news, combined with Hodjat's explosive temper, causes Nader to wonder if Hodjat is physically abusive to Razieh and had caused her miscarriage.Termeh protects her father with a false statement and Simin, fearing for her daughter's safety, attempts to arrange a financial deal with Razieh and Hodjat, to pay blood money for the loss of their unborn child. Nader is initially outraged by Simin's suggestion that they pay Razieh and Hodjat, as he feels that it would be an admission of guilt. But he also must admit that he lied about his knowledge of Razieh's pregnancy. However, Razieh has serious doubts as to whether Nader's actions caused the miscarriage; she had earlier been hit by a car while retrieving Nader's father when he had wandered out of the apartment and had first experienced symptoms of the miscarriage that night. At one point, Simin plans to come back and live with Nader, knowing that she cannot go anywhere as long as her daughter still stays here. However, after another full-blown argument, Simin changes her mind and forces Termeh to leave with her.Later, at the family court, Nader and Simin have filed for a divorce once again. Their mourning clothes indicate his father has died. The judge makes their separation permanent, and asks Termeh about which parent she chooses to live with. She tearfully says that she has made a decision, but asks that the judge tell her parents to wait outside in the hallway before she tells him. Nader and Simin wait in the hallway, separated by a glass partition.","language":"Persian English","box_office":"$24.4 million[3]","cinematography":"Mahmoud Kalari","directed_by":"Asghar Farhadi","release_dates":"15 February 2011 (2011-02-15) (Berlin)|16 March 2011 (2011-03-16) (Iran)||||","Production":"The concept came from a number of personal experiences and abstract pictures which had been in Asghar Farhadi's mind for some time. Once he decided to make the film, about a year before it premiered, it was quickly written and financed. Farhadi described the film as the \"logical development\" from his previous film, About Elly. Like Farhadi's last three films, A Separation was made without any government support. The financing went without trouble much thanks to the success of About Elly.[8] The production was granted US$25,000 in support from the Motion Picture Association's APSA Academy Film Fund.[9] In September 2010, Farhadi was banned from making the film by the Iranian Ministry of Culture and Islamic Guidance, because of an acceptance speech held during an award ceremony where he expressed support for several Iranian film personalities. Notably he had wished to see the return to Iranian cinema of Mohsen Makhmalbaf, an exiled filmmaker and Iranian opposition profile, and of the imprisoned political filmmaker Jafar Panahi, both of whom had been connected to the Iranian Green Movement. The ban was lifted in the beginning of October after Farhadi claimed to have been misperceived and apologized for his remarks.[10]","produced_by":"Asghar Farhadi","starring":"Leila Hatami Peyman Moaadi Shahab Hosseini Sareh Bayat Sarina Farhadi Merila Zarei","running_time":"123 minutes [1]","music_by":"Sattar Oraki","edited_by":"Hayedeh Safiyari","Release":"The film premiered on 9 February 2011 at the 29th Fajr International Film Festival in Tehran.[11] Six days later it played in Competition at the 61st Berlin International Film Festival.[12] Farhadi had previously competed at the festival's 2009 edition with About Elly, for which he had received the Silver Bear for Best Director.[10] A Separation was distributed in Iran through Filmiran.[13] Distribution rights for the United Kingdom were acquired by Artificial Eye.[14]As of 17 April 2014, A Separation has grossed worldwide over $22 million on an estimated budget of $500,000, making it a box-office success.[2][15][16]The film has been met with universal acclaim from film critics, currently holding a 99% \"fresh\" rating on Rotten Tomatoes, based on 152 reviews with an average rating of 8.9/10 and the site's consensus: \"Morally complex, suspenseful, and consistently involving, A Separation captures the messiness of a dissolving relationship with keen insight and searing intensity\",[17] as well as a score of 95 on Metacritic based on 41 reviews,[18] making it the best-reviewed film of 2011.[19]Deborah Young of The Hollywood Reporter wrote from the Berlinale:Just when it seemed impossible for Iranian filmmakers to express themselves meaningfully outside the bounds of censorship, Asghar Farhadi's Nader and Simin, A Separation comes along to prove the contrary. Apparently simple on a narrative level yet morally, psychologically and socially complex, it succeeds in bringing Iranian society into focus for in a way few other films have done.Young noted how Farhadi portrayed Iran's social and religious divisions, and complimented the film's craft:As in all the director's work, the cast is given top consideration and their realistic acting results in unusual depth of characterization. All five main actors stand out sharply in Mahmood Kalari's intimate cinematography. Though the film lasts over two hours, Hayedeh Safiyari's fast-moving editing keeps the action tensely involving from start to finish.[20]In a strongly positive review from Screen Daily, Lee Marshall wrote:Showing a control of investigative pacing that recalls classic Hitchcock and a feel for ethical nuance that is all his own, Farhadi has hit upon a story that is not only about men and women, children and parents, justice and religion in today's Iran, but that raises complex and globally relevant questions of responsibility, of the subjectivity and contingency of \"telling the truth\", and of how thin the line can be between inflexibility and pride – especially of the male variety – and selfishness and tyranny.[21]Alissa Simon from Variety called it Farhadi's strongest work yet and described it:Tense and narratively complex, formally dense and morally challenging... The provocative plot casts a revealing light on contempo Iranian society, taking on issues of gender, class, justice and honor as a secular middle-class family in the midst of upheaval winds up in conflict with an impoverished religious one.[22]David Thomson for The New Republic wrote:You cannot watch the film without feeling kinship with the characters and admitting their decency as well as their mistakes. The American films made this year that deal with the internal detail and difficulty of family life – like The Descendants — are airy, pretty and affluent compared with A Separation. With the best will in the world, George Clooney cannot discard his aura of stardom, yet the actors in the Iranian film seem caught in their characters’ traps.[23]The film won the Fajr Film Festival's Crystal Simorghs for Best Director, Best Screenplay, Best Cinematographer and Best Sound Recorder. It also received the Audience Favourite Film award.[24] It won the top award, the Golden Bear for Best Film, at the Berlinale Film Festival. The actress ensemble received the Silver Bear for Best Actress, and the actor ensemble the Silver Bear for Best Actor. In addition it received the Competition Prize of the Ecumenical Jury and the Berliner Morgenpost Readers' Prize.[25] Isabella Rossellini, the Jury president of the Berlinale Festival, said that the choice of Farhadi's film for the Golden Bear was \"pretty unanimous\".[5] Farhadi commented that he never would have thought he would win the Golden Bear, and that the film's victory offered \"a very good opportunity to think of the people of my country, the country I grew up in, the country where I learned my stories – a great people\".[26] Ahmad Miralaii, the director of Iran's Farabi Cinematic Foundation, said that \"Iranian cinema is proud of the awards\", as he welcomed Farhadi at the airport upon the director's return from Berlin.[13]A Separation was voted the second best film of 2011 in the annual Sight & Sound critic poll,[27] as well as in the LA Weekly Film Poll 2011.[28] The film was also voted No. 3 in the annual indieWire critic survey for 2011,[29] No. 4 in the 2011 poll by Film Comment,[30] and was ranked No. 5 on Paste Magazine's 50 Best Movies of 2011.[31] Roger Ebert ranked the film No. 1 on his The Best Films of 2011 list and wrote: \"A Separation will become one of those enduring masterpieces watched decades from now\".[32]The film has appeared on numerous critics' top ten lists for 2011,[33] some notable of which are the following:","written_by":"Asghar Farhadi","budget":"$500,000[2]"}