{"based_on":"Death Wish  by Brian Garfield","Cast":"Character actor Robert Miano had a minor role as a mugger in the film. Lawrence Hilton-Jacobs, who would later co-star on the highly successful TV show Welcome Back, Kotter, had an uncredited role as one of the Central Park muggers near the end of the film. Denzel Washington made his screen debut as an uncredited alley mugger. Actress Helen Martin, who had a minor role, subsequently appeared in the television sitcoms Good Times and 227. Sonia Manzano, 'Maria' from Sesame Street, has an uncredited role as a supermarket checkout clerk. Christopher Guest makes one of his earliest film appearances as a young police officer who finds Kersey's gun.","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Wendell Mayes","Plot":"Paul Kersey is an architect living in Manhattan with his wife Joanna and daughter Carol Toby. One day, Joanna and Carol are followed home from D'Agostino's by three thugs who invade the apartment by posing as deliverymen. They fatally injure Joanna and sexually assault Carol.After his wife's funeral in Connecticut during a snowstorm and shortly following his return to work, Paul's boss gives him an extended business vacation, and he flies to Tucson, Arizona to meet a client, Ames Jainchill. While working in Tucson, Paul witnesses a mock gunfight at Old Tucson, a reconstructed Western frontier town used as a movie set. A few days later while he is working late at Ames's offices Paul is invited to dinner by Ames at Ames's club. It is a gun club. At the gun club, Ames is impressed when Paul shoots with near bulls-eye accuracy. Paul reveals that he was a conscientious objector during the Korean War who served as a combat medic. Paul had been taught to handle firearms at a young age by his father, who was a skilled hunter and shooter, but after his father was killed in a hunting accident Paul decided to forswear the use of firearms for any purpose. After Paul makes substantial improvements to Ames' plans for a residential development, a thoroughly pleased Ames drives Paul back to the Tucson airport, and presents Paul with a gift, which he places into Paul's checked luggage.Back in Manhattan, Paul learns from his son-in-law that his daughter is severely depressed from the trauma of the assault. Paul visits his daughter, who is now catatonic, at the hospital. Heartbroken, Paul and his son-in-law have his daughter committed to a mental hospital on Long Island for intensive treatment. Later upon his return to Manhattan, he opens his suitcase and discovers that Ames' gift is a nickel-plated .32 Colt Police Positive revolver. He loads the revolver, places it into his overcoat, and takes a late night stroll. Paul encounters a mugger, an ex-convict named Thomas Leroy Marston, who attempts to rob him at gunpoint with a .38 Smith & Wesson Model 36 revolver. Paul then shoots Marston with his own revolver, killing him.Shocked that he just killed a human being, Paul runs home and is violently ill and vomits. But motivated by his desire for revenge, he continues to walk city streets at night looking for violent criminals. The following night, Paul again deliberately walks through the city in order to invite an attack. He guns down three more men who are robbing a defenseless old man in a vacant alley. A few nights later, two muggers see Paul on a subway. They attempt to rob him at knife-point but Paul shoots them both with the revolver.The next scene has Paul sitting in a sleazy Times Square coffee shop surrounded by prostitutes and assorted street people. He pays his bill to the cashier purposely revealing a wallet full of cash. He leaves followed by two thugs who have taken the bait. Yet again a robbery attempt is made. Paul shoots one but the other manages to stab him in his shoulder. As a wounded Paul stumbles off, the one who stabbed him gets away mortally wounded, dying at a hospital.NYPD Lt. Frank Ochoa investigates the vigilante killings. His department narrows a list to men who have had a family member recently killed by muggers and who are war veterans. The public, meanwhile, is happy that somebody is doing something about crime. Ochoa soon suspects Paul. He is about to make an arrest when the District Attorney intervenes and tells Ochoa to \"let him loose\" in another city instead. The D.A. and the Police Commissioner do not want the fact to get out that street crime in New York City has dropped dramatically since Paul became a vigilante. Ochoa doesn't like the idea, but relents. Ochoa says that he will try to \"scare him off.\"Paul shoots two more muggers before being wounded by a third mugger with a M1911A1 pistol at a warehouse. His gun is discovered by a young patrolman, Jackson Reilly, who hands it to Ochoa, who tells him to forget that he ever saw it and additionally tells the press that the wounded Paul is just another mugging victim. Hospitalized, Paul is ordered by Ochoa to leave New York, permanently. Ochoa tells Paul to have his company transfer him to another city and Ochoa will dump Paul's Colt revolver in the river. As Ochoa walks out of Paul's hospital room, Paul replies, \"By sundown?\".Paul arrives in Chicago Union Station by train. Being greeted by a company representative, he notices a group of hoodlums harassing a young woman. He excuses himself and helps the woman. The hoodlums make obscene gestures, but Paul points his right hand like a gun and smiles, suggesting that his vigilantism will continue.","language":"English","Critical reception":"Death Wish received mixed to extremely negative reviews upon its release, due to its support of vigilantism, but it had an impact on U.S. audiences and began widespread debate over how to deal with rampant crime. The film's graphic violence, particularly the brutal rape scene of Kersey's daughter as well as the explicit portrayal of Bronson's premeditated slayings, was considered exploitative, but realistic in the context of an urban U.S. atmosphere of rising crime rates.[8][9]Many critics were displeased with the film, considering it an \"immoral threat to society\" and an encouragement of antisocial behavior. Vincent Canby of the New York Times was one of the most outspoken writers, condemning Death Wish in two extensive articles.[10][11][12] Roger Ebert gave the film a positive review, while not agreeing with the film's philosophy.[13]Garfield was also unhappy with the final product, calling the film \"incendiary\", and even stated that the following sequels are all pointless and rancid, since they all advocate vigilantism, unlike his two novels, which are the exact opposite. The result of this film, led him to write a follow-up titled Death Sentence, which was published a year after the film's release. In later years, the film would be liked for its disturbing, serious view of one man's violent war on crime. Bronson defended the film: he felt it was intended to be a commentary on violence and was meant to attack violence, not romanticize it. Many critics rate the original film higher than the sequels, which were more exploitative and contrived.[citation needed]The film holds a 67% rating based on 24 reviews with an average rating of 5.8/10 on the review aggregate website Rotten Tomatoes.[14]","death_wish":"Theatrical release poster","box_office":"$22 million[2][3]","Remake":"In 2006, Sylvester Stallone announced that he would be directing and starring in his Death Wish remake of the 1974 classic. Stallone stated:“I’d like to get your feedback on the idea of remaking DEATH WISH with a slightly different slant”, Sly begins, “Instead of the Charles Bronson character being an architect; my version would have him as a very good cop who had incredible success without ever using his gun. So when the attack on his family happens, he’s really thrown into a moral dilemma in proceeding to carry out his revenge.”[18][19]On December 20, 2006, however, Stallone officially announced that he will not be making the Death Wish remake, but there are still more crew and ideas on doing the remake of the 1974 classic movie.[20]In late January 2012, The Hollywood Reporter stated that a remake was confirmed and would be written and directed by Joe Carnahan.[21] Carnahan left the film in 2013 and director Gerardo Naranjo was then attached to the project. This version also never came into fruition.In March 2016, Paramount and MGM announced that Aharon Keshales & Navot Papushado will direct the remake, with Bruce Willis starring.[22] In May, Keshales and Papushado quit the project after the studio failed to allow their script rewrites. In June, Eli Roth signed on to direct.[23]","cinematography":"Arthur J. Ornitz","directed_by":"Michael Winner","Home media":"The film was first released on VHS and LaserDisc in 1980. It was later released on DVD in 2001 and 2006. Currently, the VHS, laserdisc, and DVDs are out of print. A 40th Anniversary Edition was released on Blu-ray in 2014.[17]","Soundtrack":"Multiple Grammy award winning Jazz musician Herbie Hancock produced and composed the original score for the soundtrack to the original Death Wish movie. This would be his third film score, behind the 1966 movie Blow-Up and 1973's The Spook Who Sat By The Door. Michael Winner said, \"[Dino] De Laurentiis said 'Get a cheap English band.' Because the English bands were very successful. But I had a girlfriend who was in Sesame Street, a Puerto Rican actress (Sonia Manzano), who played a checkout girl at the supermarket [in Death Wish], and she was a great jazz fan. She said, 'Well, you should have Herbie Hancock. He's got this record out called Head Hunters.' She gave me Head Hunters, which was staggering. And I said, 'Dino, never mind a cheap English band, we'll have Herbie Hancock.' Which we did.\"Hancock's theme for the film was quoted in \"Judge, Jury and Executioner,\" a 2013 single by Atoms for Peace (band). The title of the song is apparently a reference to a phrase on the theatrical release poster for Death Wish, shown above, and the bassline of \"Judge, Jury and Executioner\" strongly resembles that of the movie's main theme.","release_dates":"July 24, 1974 (1974-07-24)|||||","Production":"The film was based on Brian Garfield's 1972 novel of the same name, who was inspired to use the theme of vigilantism following incidents in his personal life. In one incident, the purse of his wife was stolen; in another, his car was vandalized. His initial thought each time was that he could kill \"the son of a bitch\" responsible. He later considered that these were primitive thoughts, contemplated in an unguarded moment. He then considered the idea of writing a novel about a man who entered this way of thinking in a moment of rage and then never emerged from it.[6] The original novel received favorable reviews but was not a best seller. Garfield sold screen rights to both Death Wish and Relentless to the only film producers who approached him on the subject, Hal Landers and Bobby Roberts. He was offered the chance to write a screenplay adapting one of the two novels, and chose Relentless. He simply considered it the easier of the two to turn into a film.[6]Wendell Mayes was then hired to write the screenplay for Death Wish. He preserved the basic structure of the novel and much of the philosophical dialogue. It was his idea to turn police detective Frank Ochoa into a major character of the film.[6] His early drafts for the screenplay had different endings than the final one. In one, he followed an idea from Garfield. The vigilante confronts the three thugs who attacked his family and ends up dead at their hands. Ochoa discovers the dead man's weapon and considers following in his footsteps.[6] In another, the vigilante is wounded and rushed to a hospital. His fate is left ambiguous. Meanwhile, Ochoa has found the weapon and struggles with the decision to use it. His decision left unclear.[6]Originally, Sidney Lumet was to have directed Jack Lemmon as Paul and Henry Fonda as Ochoa.[7] Lumet bowed out of the film project to direct Serpico (1973), requiring a search for another director.[6] Several were considered. United Artists eventually chose Michael Winner, due to his recent track record of gritty, violent action films. The examples of his work considered included The Mechanic (1972), Scorpio (1973), and The Stone Killer (1973).[6]The film was rejected by other studios because of its controversial subject matter, and the perceived difficulty of casting someone in the vigilante role. Winner attempted to recruit Bronson, but there were two problems for the actor. First, his agent Paul Kohner considered that the film carried a dangerous message. Second, at this point the screenplay followed the original novel in describing the vigilante as a meek accountant—hardly a suitable role for Bronson.[6]The film project was dropped by United Artists after budget constraints forced producers Hal Landers and Bobby Roberts to liquidate their rights. The original producers were replaced by Italian film mogul Dino De Laurentiis.[7] De Laurentiis convinced Charles Bluhdorn to bring the project to Paramount Pictures. Paramount purchased the distribution rights of the film in the United States market, while Columbia Pictures licensed the distribution rights for international markets. De Laurentiis raised the 3-million-dollar budget of the film by pre-selling the distribution rights.[7]With funding secured, screenwriter Gerald Wilson was hired to revise the script. His first task was changing the identity of the vigilante to make the role more suitable for Bronson. \"Paul Benjamin\" was renamed to \"Paul Kersey\". His job was changed from accountant to architect. His background changed from a World War II veteran to a Korean War veteran. The reason for him not seeing combat duty changed from serving as an army accountant to being a conscientious objector.[6] Several vignettes from Mayes' script were deemed unnecessary and were therefore deleted.[6]Winner himself asked for several revisions in the script. Both the novel and the original script had no scenes showing the vigilante interacting with his wife. Winner decided to include a prologue depicting a happy relationship, so the prologue of the film depicts the couple vacationing in Hawaii.[6] The early draft of the script had the vigilante being inspired by seeing a fight scene in the Western film High Noon. Winner decided on a more elaborate scene, involving a fight scene in a recreation of the Wild West, taking place in Tucson, Arizona. The final script had the vigilante making the occasional reference to Westerns. While confronting an armed mugger, he asks him to draw. When Ochoa asks him to leave town, he asks if he has until sundown to do so.[6] The killing in the subway station was supposed to remain off-screen in Mayes' script, but Winner himself decided to turn this into an actual, brutal scene.[6]A minor argument occurred when it came to a shooting location for the film. Bronson asked for a California-based location so he could visit his family in Bel Air, Los Angeles. Winner insisted on New York City and De Laurentiis agreed. Ultimately, Bronson backed down.[6] Death Wish was shot on location in New York City, during the winter of 1973-1974.[6] Death Wish was first released to American audiences in July 1974. The world premiere took place on July 24 in the Loews Theater of New York City.[6]","produced_by":"Dino De Laurentiis|Hal Landers|Bobby Roberts|","starring":"Charles Bronson|Hope Lange|Vincent Gardenia|William Redfield|Steven Keats|","running_time":"94 minutes[1]","Impact and influence":"Death Wish was a watershed for Bronson, who was 53 years old at the time and who was better known in Europe and Asia at the time mostly due to his role in The Great Escape. Bronson became an American film icon who experienced great popularity over the next twenty years.","music_by":"Herbie Hancock","edited_by":"Bernard Gribble","budget":"$3 million"}