{"country":"United States[2][3]","distributed_by":"Columbia Pictures","Plot":"In response to a record high crime rate in Johannesburg, the South African government purchases a squadron of state-of-the-art, armour-plated attack robots from weapons manufacturer Tetravaal, developed by Deon Wilson. A competing project is the remotely controlled MOOSE, developed by soldier-turned-engineer Vincent Moore. Deon is praised for Tetravaal's success but Vincent grows jealous when the police are unwilling to give his heavy weapons platform equal attention. At home, Deon creates a prototype artificial intelligence that mimics a human mind to the point of feeling emotions and having opinions, but Tetravaal CEO Michelle Bradley refuses to let him test the A.I. on a police robot. Undeterred, Deon steals a recently damaged robot before it is destroyed and puts it in his van, along with the \"guard key\" needed to update the robot's software. On his way home, he is kidnapped by a group of gangsters, Ninja, Yolandi, and Amerika, who threaten to kill him unless he reprograms a police robot to fight for them. Deon installs the new software into the damaged robot, which responds with childlike terror upon powering up. Deon and Yolandi calm the robot, teaching it words and naming it \"Chappie\". Despite Deon wanting to stay with the robot, Ninja forces him out of their hideout.Ninja's gang only has a few days to pay a debt of 20 million rand to Hippo, a powerful gangster. Yolandi sees Chappie as a child and wants to mother him, but Ninja grows impatient with his development due to both the impending deadline for the debt and Chappie's irreplaceable battery running out, giving him days to live. Ninja tries to train Chappie to be a gangster by leaving him to fend for himself in a dangerous neighborhood. After being wounded by thugs, he is followed by Vincent, who plans to deactivate all Tetravaal weapons except for MOOSE. Vincent successfully extracts the guard key for his own use, but the traumatised Chappie escapes and returns to the hideout. Yolandi scolds Ninja for this mistreatment, but he manages to earn Chappie's forgiveness by training him in martial arts and weapon handling. Ninja and Amerika trick Chappie into stealing cars for them, and lie about needing the money to replace his dying body.At Tetravaal, Vincent uses the guard key to upload a virus shutting down all police robots including Chappie. Johannesburg's criminals immediately start rioting in the streets, and Deon brings Chappie to the Tetravaal factory to fix him. After being restarted, Chappie notices a helmet used to control MOOSE. At the hideout, he re-engineers it to allow him to transfer his consciousness into a computer, so he can change bodies when his current one dies. Ninja's gang uses Chappie to raid a police van and steal money, which is caught on the news, prompting Tetravaal to pursue him. When Chappie learns that Ninja's plan to acquire the body was a lie, he prepares to kill Ninja for betrayal. However, Deon arrives to warn them that Michelle Bradley has ordered that Chappie be destroyed. At that moment, the MOOSE robot (controlled remotely by Vincent) is launched to assassinate Deon and Chappie at the hideout, at the same time that Hippo arrives to collect his debt. Amerika and Hippo are killed in the ensuing battle, while Deon is mortally wounded. When Ninja is about to be killed, Yolandi sacrifices herself to save him and Chappie destroys MOOSE by detonating a bomb.Enraged by Yolandi's death, Chappie drives Deon to the factory, storms into an office, and fiercely beats Vincent close to death. He then transfers the dying Deon's consciousness into a spare robot through the modified MOOSE helmet. As Chappie's battery dies, the now-robotic Deon wirelessly transfers Chappie's consciousness into a deactivated police robot nearby. Deon and Chappie go into hiding as the police discontinue their contract with Tetravaal. The grieving Ninja finds a flash drive marked \"Mommy's Consciousness Test Backup\", which contains a copy of Yolandi's consciousness that Chappie took while testing the device on her. Chappie hacks into Tetravaal's manufacturing facility, builds a robot resembling Yolandi, and uploads the drive's contents.","language":"English","box_office":"$102.1 million[4]","cinematography":"Trent Opaloch","production_company":"Media Rights Capital Kinberg Genre","directed_by":"Neill Blomkamp","Possible sequels":"In March 2015, Blomkamp said he \"wrote [Chappie] as a trilogy. So, I haven't written the other two, but I wrote treatments for the other two, so I kind of think I know what happens with the next two, but… but I don't know if I want to say what happens.\" Regarding whether he would want to make them, he answered, \"I think so. Yeah, I think, I mean, I love the movie, like I feel really proud of the movie. I don't know what audiences will say, I don't know if it will be economically feasible to make more, but I think I would like to make more.\"[36]","chappie":"Theatrical release poster","release_dates":"March 4, 2015 (2015-03-04) (New York premiere)|March 6, 2015 (2015-03-06) (United States)||||","Production":"Chappie is Blomkamp's third feature-length film as director. He wrote the screenplay along with his wife Terri Tatchell, who also co-wrote District 9. It was unofficially based on Blomkamp's 2004 short film Tetra Vaal.[9] They wrote Chappie in two weeks, while Blomkamp was doing Elysium.[10] Filming began at the end of October 2013 in Johannesburg, South Africa.[11][12] One scene was shot at the Ponte building.[13] Filming was completed in February 2014.[14] Re-shooting for the film took place in British Columbia, Canada in April 2014.[15] The film was shot with Red Epic cameras, using Panavision anamorphic primes.[16] Richard Muller said:Lighting was handled by Kino Flo Celebs.[13] The visual effects company was Image Engine, located in Vancouver.[16] The name of the weapons company in Chappie – \"Tetravaal\" – is a reference to Blomkamp's 2003 short film of the same name, which centers on a police robot in Johannesburg with a similar design to Chappie. Blomkamp has said that Chappie is \"basically based\" on Tetra Vaal.[18] Blomkamp also employed a robot with a similar design in his 2005 short Tempbot, and both Tempbot and his 2006 short/advertisement Yellow deal with a thinking and learning robot which tries to assimilate into society.","produced_by":"Neill Blomkamp|Simon Kinberg|","starring":"Sharlto Copley|Dev Patel|Ninja|Yolandi Visser|Jose Pablo Cantillo|Sigourney Weaver|Hugh Jackman|","running_time":"120 minutes[1]","music_by":"Hans Zimmer","edited_by":"Julian Clarke|Mark Goldblatt|","Release":"On February 6, 2015, IMAX Corporation and Sony announced that the film would be digitally re-mastered into the IMAX format and released into IMAX theatres domestically on March 6, 2015.[19] The film made its New York premiere on March 4, 2015.[20] The film was released in the United States on March 6, 2015.[5]Chappie grossed $31.6 million in North America and $70 million in other territories for a total gross of $102.1 million, against a budget of $49 million.[4]The film earned $4.6 million in its opening day, $5.3 million on its second day, and $3.5 million on its third day, totaling $13.4 million in its opening weekend, while playing in 3,201 theaters. It had a $4,155 per-theater average and finished first at the box office.[21]Review aggregator website Rotten Tomatoes reported a 31% approval rating, based on 188 reviews, and a rating average of 4.9/10. The site's critical consensus reads, \"Chappie boasts more of the big ideas and visual panache that director Neill Blomkamp has become known for — and, sadly, more of the narrative shortcomings.\"[22] On Metacritic, which assigns a normalized rating, the film has a score of 41 out of 100, based on 39 critics, indicating \"mixed or average reviews\".[23] According to CinemaScore, audiences gave the film a grade of \"B\" on an A+ to F scale.[24]Justin Chang of Variety wrote, \"Intelligence, artificial or otherwise, is one of the major casualties of Chappie, a robot-themed action movie that winds up feeling as clunky and confused as the childlike droid with which it shares its name.\"[25] Todd McCarthy of The Hollywood Reporter wrote, \"With unappealing one-note characters, retread concepts and implausible motivations, Chappie is a further downward step for director Neill Blomkamp.\"[26] Tim Grierson of Screen International wrote, \"...despite his ambitions, Chappie is a bucket of bolts, Blomkamp's desire to say meaningful things outdistancing his ability to say them compellingly.\"[3] Manohla Dargis of The New York Times wrote that Blomkamp \"struggles with the material\" but \"even at his shakiest, Mr. Blomkamp holds your attention\".[27] Kenneth Turan of the Los Angeles Times called it \"cartoonish and preposterous, and not in a good way\".[28]Mick LaSalle of the San Francisco Chronicle rated it three out of four stars and wrote of Blomkamp, \"It's hard to say how much he's doing consciously and how much he's doing through intuition, but he's doing really interesting things in Chappie, and right from the beginning.\"[29] Tom Huddleston of Time Out London rated it four out of five stars and wrote that \"this hugely entertaining oddity could never be mistaken for the work of any other filmmaker\".[30] Ryan Lambie, from denofgeek.com, gave the film a positive review stating, \"Despite the ragged edges of its story, Chappie nevertheless has real heart beating under its shabby exterior. If you liked the director's previous films, you owe it to yourself to see this one too.\"[31] IGN reviewer Josh Lasser also gave Chappie a positive review, with a 'Good' score of 7.6 out of 10. He praised Sharlto Copley's performance and the \"big questions\" it asks, but criticized its failure to answer those questions.[32] Several reviewers compared the Chappie character unfavorably to Jar Jar Binks of Star Wars.[33] Sameen Amer of The Express Tribune opined that the film disregards logic as certain \"existential quandaries\" are randomly thrown in without straightening out any of the themes before moving on to the next.[34]","written_by":"Neill Blomkamp|Terri Tatchell|","budget":"$49 million[4]"}