{"country":"United Kingdom","distributed_by":"Palace Pictures (UK) Orion Pictures (USA)","absolute_beginners":"Theatrical release poster","Plot":"The film takes place in 1958, a time in which pop culture is transforming from 1950s jazz and early rock to a new generation on the verge of the 1960s. London is post-World War II, but pre-Beatles/Stones. The storyline incorporates elements of the 1958 Notting Hill race riots.Young photographer Colin falls in love with aspiring fashion designer Crepe Suzette but she's only interested in her career. Colin tries to win her affections by taking a crack at the big time himself. Meanwhile, racial tensions heat up in Colin's neighbourhood of London.","language":"English","Reception":"Writing in The New York Times, film critic Caryn James was largely unmoved by the film and remarked upon the \"uneveness\" of Temple's adaptation, and its \"erratic\" results.[5] Elsewhere Pauline Kael declared that, despite Temple's bona fides, the musical is \"peculiarly unlyrical and ephemeral\".[6] Comparing it unfavorably to MacInnes' novel, she wrote: \"The film has a glossy immediacy, and you can feel the flash and determination that went into it. What you don't feel is the tormented romanticism that made English adolescents in the '70s swear by the novel the way American kids had earlier sworn by The Catcher in the Rye.[6] Jeremy Allen in The Guardian praised Bowie's theme song but described the film as \"an overbudget turkey of huge proportions\".[7] Corey K. Creekmur stated in The International Film Musical that although the film \"failed to deliver on the critical expectations surrounding it\", it remained \"a deeply interesting, if flawed, attempt to harness the contemporary musical in the services of politics and social equality\".[8]","box_office":"£1.8 million (UK)[2] $930,211 (USA)","cinematography":"Oliver Stapleton","production_company":"Goldcrest Films Virgin Films","directed_by":"Julien Temple","Soundtrack":"Absolute Beginners: The Original Motion Picture Soundtrack was concurrently released to promote the film. Aside from the plethora of music from contributing artists, the musical score was composed by Gil Evans. David Bowie's title track, Ray Davies' \"Quiet Life\" and the Style Council's songs were released as singles. Tracks 11-18 were exclusive to the CD version.Track listingA double length cassette (Virgin TCVD 2514) was also released that featured four more tracks: B6 and B8-B10.Track listing:","release_dates":"18 April 1986 (1986-04-18)|||||","Production":"$2.5 million of the film's budget came from Orion and £2.5 million from Goldcrest.[4]","starring":"Eddie O'Connell|Patsy Kensit|David Bowie|James Fox|Ray Davies|Eve Ferret|Anita Morris|Steven Berkoff|Sade Adu|","running_time":"108 minutes","edited_by":"Gerry Hambling","written_by":"Richard Burridge","budget":"£8.4 million[1]"}