{"country":"United States","distributed_by":"Paramount Pictures","Plot":"At a young age, Jackie Kallen learns about boxing with her father and uncle in a small gym. Later, she becomes the assistant to a Cleveland boxing promoter. Her boss then begins doing business with Sam LaRocca, a sports manager, during a middleweight championship fight.LaRocca asks afterward what she thought of the fight. Obviously unimpressed with Jackie's knowledge of boxing, LaRocca offers her the loser's contract for a dollar. She goes to visit the fighter at home, only to find him addicted to drugs.Enter Luther Shaw, a small-time hood. Kallen watches in horror and fascination as Shaw pummels the former middleweight champ. She offers to manage him professionally. Shaw is at first hesitant, but he eventually signs on with her.Because of LaRocca's influence, Kallen can't find Shaw a fight anywhere in Ohio, so the two are forced to go on the road until Shaw makes a name for himself. Jackie begins to get swept up in all the attention she gets for being the first female boxing manager. Her attention eventually shifts from Shaw to her own media persona as her fighter's number of wins continues to climb.Finally realizing that she is not paying enough attention to her only client, Kallen agrees to sell Shaw's contract to LaRocca on the condition that he be given a championship fight. LaRocca agrees, setting Shaw up for a shot at the title before he could be ready. Kallen arrives at the fight and stands in Shaw's corner as he pulls off an upset and wins the championship.","language":"English","Reception":"Against the Ropes was a box office bomb, grossing only $6,614,280, with an estimated budget of $39,000,000. It opened up at No. 8 at the box office, grossing $3,038,546 in the opening weekend. The film was released on February 20, 2004 to 1,601 theaters (widest release) gathering an average of $1,897 per theater. The film closed its box office run after seven weeks, gathering a total of $5,884,190 from the domestic market and $730,090 from overseas for an international total of $6,614,280.[2]Critical reception of the film was negative. Rotten Tomatoes reports a \"Rotten\" rating of 12% based on 121 reviews and an average rating of 4.2 out of 10, summarizing it as \"a bland, dumbed-down package of sports cliches.\"[3] However, the film did receive some positive reviews; Roger Ebert gave it 3 stars out of 4, remarking:","box_office":"$6,614,280","cinematography":"Jack N. Green","directed_by":"Charles S. Dutton","release_dates":"February 20, 2004 (2004-02-20)|||||","against_the_ropes":"Promotional poster for Against the Ropes","produced_by":"Robert W. Cort Mike Drake Jackie Kallen Scarlett Lacey David Madden Jonathan Pillot Steven Roffer Sharon Seto","starring":"Meg Ryan Omar Epps Tony Shalhoub Tim Daly Kerry Washington and Charles S. Dutton","running_time":"111 minutes","music_by":"Michael Kamen","edited_by":"Eric L. Beason","written_by":"Cheryl Edwards","budget":"$39 million"}