{"country":"United States","distributed_by":"Universal Pictures","Plot":"Devon Butler (Golden) is an eight-year-old boy who lives in Tampa and dreams of being a cop. He watches police TV shows, knows police procedures and plays cops and robbers with his friend Ray. One day, while snooping around in a warehouse, he witnesses a murder. He goes to the police, who want the information, but he refuses to give it unless they make him a cop. They then team him with veteran cop (and child hater) Nick McKenna (Reynolds), and they team up in a comic series of events to find the killer. They eventually come to a mutual understanding in order to bring the killer to justice.","cop_and_a_half":"Theatrical release poster","language":"English","Reception":"The film holds a 17% approval rating at the film review aggregator site Rotten Tomatoes, where two reviews out of the twelve polled are positive.[4][5]Film critic and historian Leonard Maltin wrote, \"A hemorrhoid-and-a-half to whoever sits through this abjectly painful comedy, which does for Burt Reynolds' career what Stop! Or My Mom Will Shoot did for Sylvester Stallone's.\" Critic Gene Siskel also excoriated the film, seeing it as indicative of \"artistic bankruptcy\" on Burt Reynolds' part, and singled out Norman D. Golden II's performance as \"awkward\". Siskel later called it the worst movie of 1993. Siskel speculated that NBC thought little of the film when they aired it in its broadcast-network debut, pointing out that they scheduled it opposite the 1997 Super Bowl.[6] However, Roger Ebert gave the film a positive review, giving it a thumbs up. He also gave it 3 stars out of a possible 4, saying, \"There isn't much that's original in Cop and a Half, but there's a lot that's entertaining, and there's a winning performance by a young man with a big name, Norman D. Golden II, who plays little Devon Butler, a kid who dreams of someday wearing the shield.\"[7]The film debuted at No.1.[8] In its second week it dropped to number 3.[9]","box_office":"$41 million[2]","cinematography":"Bill Butler","production_company":"Imagine Films Entertainment","directed_by":"Henry Winkler","Soundtrack":"Joey Lawrence's \"Nothin' My Love Can't Fix\" is used as the end title song.","release_dates":"April 2, 1993 (1993-04-02)|||||","produced_by":"Paul Maslansky","starring":"Burt Reynolds|Norman D. Golden II|Ray Sharkey|Ruby Dee|Holland Taylor|Frank Sivero|Marc Macaulay|Tom McCleister|Ralph Wilcox|Rocky Giordani|","running_time":"93 minutes","music_by":"Alan Silvestri","edited_by":"Daniel P. Hanley|Carroll Timothy O'Meara|Roger Tweten|","written_by":"Arne Olsen","budget":"$4 million[1]"}