{"country":"United States","distributed_by":"Overture Films","Plot":"Bobby \"Carlo\" Powers and Detective Salvatore \"Sal\" Procida are having a conversation in a car when Sal unexpectedly shoots Carlo, grabs a bag of money from Carlo's lap and flees, then confesses to a priest, asking for help with his dire situation; his wife is pregnant with twins, in a house too small for their four children and has wood mold, which jeopardizes his family's health. Desperate to move, Sal has arranged to purchase a larger home through a woman who owes him a favor. The down payment is due the following Tuesday, and Sal is still short. Sal is a highly skilled and accomplished narcotics detective, but has begun to pocket drug money from raids.Officer Edward \"Eddie\" Dugan is a week from retirement after 22 years of unremarkable service to the force. He is assigned to oversee rookies in the tough neighborhoods. His life in shambles; he swills whiskey in the morning to get out of bed and his only friend is Chantal, the prostitute he frequents.Detective Clarence \"Tango\" Butler is an undercover cop working the drug beat. After losing himself in his role as a drug dealer, he is tired of the kind of attention that a black man in a black car attracts. Having been promised a promotion and a desk job for years, he is finally offered a way out by betraying a close friend Casanova \"Caz\" Phillips, a known criminal recently released from federal prison. Federal Agent Smith instructs Tango to set up the drug deal that will ensure the arrest of Caz and his return to federal prison.Eddie's first rookie assignment is a former Marine, who becomes disgusted with Eddie's lack of professionalism and cynical outlook, and asks to be reassigned only to be killed on his next assignment. Eddie takes a liking to his second rookie assignment, who then accidentally fires his gun near a teenager during a petty theft investigation causing him to go deaf, leaving the NYPD facing a public relations nightmare. During the investigation, Eddie is remorseful for what happened, but refuses to play along with his superiors' attempts to imply that the teenager was a drug dealer.When Tango goes to warn Caz to abort their upcoming drug deal, they are ambushed and Caz is shot, under orders from Red, a gangster Tango had humiliated previously. After Agent Smith makes a racist remark and refuses to pursue Red, Tango lunges at her, but is restrained by fellow officers.Sal's latest raid on the complex was cancelled, but he decides to go to the location and rob the money he needs for his house. One of his team members, Detective Ronny Rosario, tries to stop him but fails. As he approaches the building, Sal passes Tango, who has come there to kill Red. Sal raids the apartment. After killing three people and finding their stockpile of cash, Sal is shot in the back and killed by a young man who became suspicious when he saw Sal enter the building. Tango gets his vengeance on Red, but is mistaken for a gangster and is shot by Rosario. Only after shooting Tango does Rosario realize he has shot another law officer. Rosario, still determined to stop Sal, is forced to continue his search for him. He witnesses the young man who shot Sal running away from the crime scene and is devastated when he finds Sal's body in the drug dealers' apartment.Eddie retires and visits Chantal, who declines his offer to move to Connecticut. On his way home, Eddie sees a woman, who was reported missing, being shoved into a van. He follows the van to the Van Dyke housing projects, where he locates a sex slave dungeon in the basement. Eddie apprehends one of the men and is confronted by a second. Eddie tells the second man to get down, but is forced to shoot him in the chest, resulting in a violent fight that ends with Eddie strangling his opponent with a zip tie. Eddie finds redemption by rescuing the missing girls.","language":"English","box_office":"$36.4 million[1]","cinematography":"Patrick Murguia","production_company":"Millenium Films Thunder Road Pictures Nu Image","directed_by":"Antoine Fuqua","release_dates":"January 16, 2009 (2009-01-16) (SFF)|March 5, 2010 (2010-03-05) (United States)||||","Production":"The film was filmed in the three New York City boroughs of Manhattan, Queens, and Brooklyn in July 2008.[2][3][4] In Brooklyn, locations included Brownsville and there, among others, the Van Dyke Houses. In Queens, locations included Rego Park.[5] Michael C. Martin's script originally took place primarily in the Louis H. Pink Houses in East New York, which were near where the writer and a couple of his friends grew up.[6]The total budget for the film was in the $17 million range, and many of the actors took large pay cuts to make the movie.[5] The part of Man Man was given to Zaire Paige, a gang member from the neighborhood; three months after filming, he was involved in the murder of Lethania Garcia, for which he was sentenced to 107 years to life in prison.[7]Michael C. Martin, the writer of the screenplay, went to South Shore High School, where a film appreciation course sparked his interest and an ACL injury derailed a possible future basketball career. He went on to study film at Brooklyn College. He originally wrote the Finest script for a screenwriter's contest after having been injured in a car accident in 2005. He did not win the contest but his second prize included a subscription to the IFP news letter. The script also continued to gain attention. Martin found an agent interested in him writing a New Jack City sequel, and finally, interested in producing the original script. Martin was paid $200,000 for the script.[5]In an interview at the time of the movie's release, Martin detailed the development of the film: \"Jeanne O’Brien-Ebiri and Mary Viola are responsible for getting this movie made. Jeanne was the first person in the industry to read the script and she was responsible for getting me an agent and the staff job (as a staff writer on the Showtime series Sleeper Cell). And once the script was out there, it came across Mary Viola’s desk at Thunder Road Pictures as a writing sample for New Jack City 2. Mary, a native New Yorker, worked like hell to sell it to the head of Thunder Road, Basil Iwanyk. Basil was an executive on Training Day, he had a great relationship with Antoine. And once Antoine attached himself to the script Richard Gere, Don Cheadle, Wesley Snipes, and Ethan Hawke followed. Within weeks it received a green light.\"[6]By way of inspirations for the Finest script, Martin named three Italian neorealist films, Nights of Cabiria, Umberto D., and Bicycle Thief, and two directors, Vittorio De Sica who directed Umberto and Thief among others, and Jim Jarmusch.[6]In the interview, Martin identified his South Shore film teacher as Mr. Braun.[6]","produced_by":"Elie Cohn|Basil Iwanyk|John Langley|John Thompson|","starring":"Richard Gere|Don Cheadle|Ethan Hawke|Wesley Snipes|","running_time":"132 minutes","brooklyn's_finest":"Theatrical release poster","music_by":"Marcelo Zarvos","edited_by":"Barbara Tulliver","Release":"Brooklyn's Finest premiered at the Sundance Film Festival in January 2009, and was picked up by Senator Distribution with a price \"in the low seven figures\".[8] Due to some financial distress, Senator Distribution was not able to fund its release in 2009.[9] The film was sold again to Overture Films at the 66th Venice Film Festival in September,[9] and was released in North America on March 5, 2010.The film was met with mixed reviews. It holds a 43% approval rating based on 131 reviews collected by Rotten Tomatoes and has an average rating of 5.4/10.[10] The film received a score of 43% at Metacritic based on 33 reviews from mainstream critics.[11]In his review for the Chicago Sun-Times, Roger Ebert gave the film three stars out of four, concluding that \"The film has a basic strength in its performances and craft, but falls short of the high mark Fuqua obviously set for himself.\"[12] Mick LaSalle of the San Francisco Chronicle praised the actors for \"bringing dimension to these stock characters\", but criticized the film for being \"a melodrama about three cliches in search of a bloodbath.\"[13]A. O. Scott of the New York Times also gave the film a mixed review, stating that \"the sheer charismatic force of much of the acting keeps you in the movie\", but \"Mr. Fuqua and Mr. Martin dig themselves into a pulpy predicament, and then find themselves unable to do anything but shoot their way out.\"[14] The Los Angeles Times reviewer commented that \"Brooklyn's Finest is an old style potboiler about desperate cops in dire straits that overcooks both its story and its stars.\"[15]In its debut weekend in the United States, Brooklyn's Finest opened at #2 behind Alice in Wonderland with $13,350,299 in 1,936 theaters, averaging $6,896 per theater.[1][16] As of September 3, 2010, the film has grossed $27,163,593 in the United States theatrically,[1] a good result for its United States distributor Overture Films which paid less than $3 million to acquire this film's United States rights.[17] The film also grossed $36,440,201 in theaters worldwide,[1] and achieved eleventh place on Box Office Mojo's \"Dirty Cop\" genre ranking, 1973–present.[18]Brooklyn's Finest was released on DVD and Blu-ray in July 2010,[19] and topped the United States home video charts for its first week of release ended July 11.[20]","written_by":"Michael C. Martin","budget":"$17 million[1]"}