{"directed_by":"Jaime Chávarri","country":"Spain","Plot":"In Madrid, the family of Don Luis, his wife Dolores and their children, Manolita and Luisito, share the daily life of the Civil War with their maid and neighbours. Despite having failed his exams, Luisito wants his father to buy him a bicycle. However, the situation forces them to delay the purchase and the delay, like the war itself, is to last much longer than expected.The movie, and the play it was drawn from, show how daily life was conducted during the war. Unexpected things happen, but people find ways to survive. Above all, it is a story of survival and adaptation.","starring":"Amparo Soler Leal Agustín González Victoria Abril Alicia Hermida Patricia Adriani","running_time":"103 minutes","language":"Spanish","Main characters":"Luis (Luisito): Luisito is the son of Don Luis and Doña Dolores and best friends with Pablo. Luisito begins the play as a child, carefree and with his whole life ahead of him. He aspires, not unlike his father, to be a writer. However, the war dashes these hopes and dreams and leaves him as the head of his family, having to abandon his education and childhood.Don Luis: Don Luis is the husband of Doña Dolores and the father of Manolita and Luisito. Don Luis provides most of the comic relief in what would otherwise be a solely tragic play. He provides encouragement and optimism to his family and neighbours throughout the play, despite the suffering they undergo. Although the play is left open ended, it seems likely that Don Luis will end up in a concentration camp because of his republican sympathies and the fact that he created a trade union at the 'bodega' where he worked during the war.Doña Dolores: Doña Dolores is more conservative than her liberal husband. Whilst she is easily persuaded by her husband, she often disapproves of the direction her daughter's career is taking at the beginning of the play and enjoys her traditional way of life.Manolita: Manolita is the outspoken, aspiring-actress that is the daughter of Doña Dolores and Don Luis. Like her brother, at the outset of the play her life seems full of promise. However, by the play's end, Manolita has a baby with a soldier who dies; has had to give up her career; and is doomed to a life of subservience at the hands of the Franco regime.Julio: Julio is one of the sons of Don Luis's neighbour, Doña Antonia. Julio and his family are very conservative. Yet despite Julio's very traditional background he falls in love with Manolita. Although she does not return his affections, after the father of Manolita's baby dies Julio asks to marry Manolita saying that he will love her and provide for her as he has a stable job. Manolita agrees. However, Julio dies after a bombing in Madrid.Doña Antonia: The neighbour of Don Luis and Doña Dolores. At the beginning of the play she seems jealous of the other family's wealth, however, this soon changes and the two families come to rely on each other for food and support. She is very conservative and disapproves of Julio's love for Manolita.Pablo: the best friend of Luisito. Pablo lives with his sister and maid after his parents become stuck in a different part of Spain. Pablo also loses much of his childhood but is able to live with his parents in a privileged franquista area of Spain.","written_by":"Fernando Fernán Gómez Enrique Paradas Lola Salvador (as Salvador Maldonado) Rafael Sepúlveda","cinematography":"Miguel Ángel Trujillo"}