{"a_private_function":"Theatrical release poster","country":"United Kingdom","language":"English","box_office":"$2,527,088[1]","Synopsis":"In a small Northern English town in 1947 the citizens endure continuing food rationing. Some local businessmen want to hold a party to celebrate the royal wedding of Princess Elizabeth to Prince Philip and illegally decide to raise a pig for that occasion. However, the pig gets stolen by Gilbert Chilvers (Michael Palin), who was encouraged to do so by his wife Joyce (Maggie Smith). Meanwhile a food inspector is determined to stop activities circumventing the food rationing.","cinematography":"Tony Pierce-Roberts","production_company":"HandMade Films","directed_by":"Malcolm Mowbray","Awards":"The film won three BAFTA Film Awards: best actress for Maggie Smith, best supporting actress for Liz Smith and best supporting actor for Denholm Elliott. It was also nominated for Best Original Screenplay (Alan Bennett) and Best Film.","Musical adaptation":"A musical based on the film opened in the West End in April 2011, under the new title Betty Blue Eyes. It was produced by Cameron Mackintosh and ran for several months at the Novello Theatre. It starred Reece Shearsmith (of The League of Gentlemen fame) as Gilbert, and actress Sarah Lancashire as Joyce.[5]","release_dates":"November 1984 (1984-11)|||||","Production":"Three pigs were used in the filming of A Private Function, all named Betty. Producer Mark Shivas was advised by Intellectual Animals UK that the pigs used should be female and six months old so as to not be too large or aggressive. However, the pigs were \"unpredictable and often quite dangerous\". During filming of one of the kitchen scenes, Maggie Smith was hemmed in by one of the pigs and needed to vault over the back of it in order to escape.[4]","produced_by":"George Harrison Denis O'Brien Mark Shivas","starring":"Michael Palin|Maggie Smith|Denholm Elliott|Richard Griffiths|Tony Haygarth|Bill Paterson|John Normington|Liz Smith|Alison Steadman|","running_time":"94 minutes","music_by":"John Du Prez","edited_by":"Barrie Vince","written_by":"Alan Bennett Malcolm Mowbray","budget":"£1.2million"}