{"based_on":"Cruising by Gerald Walker","country":"United States","Awards and nominations":"1st Golden Raspberry AwardsNominated: Worst Picture (winner: Can't Stop the Music)Nominated: Worst Director – William Friedkin (winner: Robert Greenwald for Xanadu)Nominated: Worst Screenplay (winner: Can't Stop the Music)","distributed_by":"Lorimar Productions/United Artists (theatrical release) Warner Bros. (DVD release)","screenplay_by":"William Friedkin","Legacy":"A deluxe collector's edition DVD, distributed by Warner Home Video, was released in Region 1 on September 18, 2007 and Region 2 on 25 Feb 2008. This release is not in its original director's cut, but does include some extra scenes not seen in the original VHS release and additional visual effects added by Friedkin. Friedkin also added a commentary track to accompany the DVD. The only visible omission in this re-release, as compared to the theatrical and VHS releases, is the absence of the disclaimer at the beginning of the film stating that Cruising depicts a gay S&M subculture and is not representative of mainstream gay life. The DVD also includes two featurettes entitled 'The History of Cruising' and 'Exorcising Cruising', the latter being about the controversy the film provoked.In 2013, filmmakers James Franco and Travis Mathews released Interior. Leather Bar., a film in which they appear as filmmakers working on a film which reimagines and attempts to recreate the 40 minutes of deleted and lost footage from Cruising.[23] The film is not actually a recreation of the footage, however; instead, it uses a docufiction format to explore the creative and ethical issues arising from the process of trying to film such a project.[23]","Plot":"In New York City during the middle of a hot summer, body parts of men are showing up in the Hudson River. The police suspect it to be the work of a serial killer who is picking up homosexual men at West Village bars like the Eagle's Nest, the Ramrod, and the Cock Pit, then taking them to cheap rooming houses or motels, tying them up and stabbing them to death.Officer Steve Burns (Al Pacino), who resembles the victims, is sent deep undercover by Captain Edelson (Paul Sorvino) into the urban world of gay S&M and leather bars in the Meatpacking District in order to track down the killer. He rents an apartment in the area and befriends a neighbor, Ted Bailey (Don Scardino), a struggling young gay playwright. Burns's undercover work takes a toll on his relationship with his girlfriend Nancy (Karen Allen), due to both his refusal to tell her the details of his current assignment and Burns building a close friendship with Ted, who himself is having relationship problems with his jealous and overbearing dancer boyfriend Gregory (James Remar).Burns mistakenly compels the police to interrogate a waiter, Skip Lee (Jay Acovone), who is intimidated and beaten to coerce a confession before police discover Skip's fingerprints don't match the killer's. Burns is disturbed by this police brutality, and tells Captain Edelson he didn't sign on for this so that they can arrest anyone just because he's gay. Exhausted by his undercover assignment, Burns is close to quitting, but is convinced by Edelson to continue with the investigation.Following a new lead, Burns investigates Columbia University students who studied with one of the previous victims, a college professor. At the film's conclusion, Burns thinks that he has found the serial killer, Stuart Richards (Richard Cox), a gay music graduate student with schizophrenic disorder who attacks him with a knife in Morningside Park. Burns brings the man into custody, but shortly afterward Ted's mutilated body is found. The police dismiss the murder as a lover's quarrel turned violent and put out an arrest warrant for Gregory, with whom Burns earlier had a fight over his relationship with Ted.With the police under the impression that the murders have been solved, Burns moves back in with Nancy. In an ambiguous finale, Burns begins shaving his beard in the bathroom while Nancy secretly inspects clothes that he left on a chair: a leather peaked cap, aviator frames, and a leather jacket that all look very similar to the outfit the killer wore. Burns, meanwhile, wipes off his shaving cream and looks directly at the camera.","language":"English","Reception":"Upon the film's release, critical reaction was highly negative and gay activists had public protests against the film. However, critical opinion of it has warmed somewhat over the years as the film has been reassessed. As of April 2016, the film holds a 50% \"rotten\" rating at Rotten Tomatoes based on 42 reviews.[15] Upon its original release, Roger Ebert gave Cruising two and a half out of four stars, describing it as well-filmed and suspenseful yet it \"seems to make a conscious decision not to declare itself on its central subject\" — the true feelings of Pacino's character about the S&M subculture, which are never explored to Ebert's satisfaction.[16]Critic Jack Sommersby's comments typified the contemporary criticism directed at non-political matters such as character development and the changes made when the film was transferred from a novel to a film:[17]The second major criticism of the film at its release came from gay activists who felt that the film had a homophobic political message, and that it portrayed gay men as being attracted to violence, which could in turn justify homophobic hate crimes. Ebert, however, argued that \"The validity of these arguments is questionable.\"[16] But several critics have also taken issue with its portrayal of gay men. TV Guide's Movie Guide, for example, noticed that the gay scene is portrayed in the movie \"as irredeemably sick and violent\", with \"virtually nobody [being] portrayed sympathetically\".[18] Brian Juergens, Associate Editor with gay culture website AfterElton, contended that that the movie \"viciously exploited\" the gay community, arguing that gay male sexuality does not seem to serve any purpose in the plot of the movie other than being a prop to shock heterosexual audiences. Though the movie contains a disclaimer saying that it does not intend to be \"an indictment of the homosexual world\", Juergens states that certain elements in the plot — especially the fact that it is hinted in the movie that several gay male killers are operating simultaneously — \"makes a clear statement (however unintended the filmmakers may maintain it is) about a community as a whole\".[12]Vito Russo wrote that, \"Gays who protested the making of the film maintained that it would show that when Pacino recognized his attraction to the homosexual world, he would become psychotic and begin to kill,\"[9] with at least one critic agreeing that Burn's \"willingness to sleep with a man is [portrayed as] the ultimate descent into depravity.\"[19] However, in Exorcising Cruising, a behind-the-scenes documentary on the Cruising DVD, Friedkin alleges that the film was supported by much of New York City's leather/S&M community, who appeared by the dozens as extras in the nightclub scenes.Raymond Murray, editor of Images in The Dark (an encyclopedia of gay and lesbian films) writes that \"the film proves to be an entertaining and (for those born too late to enjoy the sexual excesses of pre-AIDS gay life) fascinating if ridiculous glimpse into gay life - albeit Hollywood's version of gay life.\" He goes on to say \"the film is now part of queer history and a testament to how a frightened Hollywood treated a disenfranchised minority.\"[20]","cruising":"Original film poster","box_office":"$19,798,718","cinematography":"James A. Contner","production_company":"CiP-Europaische Treuhand Lorimar Film Entertainment","directed_by":"William Friedkin","release_dates":"February 8, 1980 (1980-02-08)","Production":"Philip D'Antoni, who had produced Friedkin's 1971 film The French Connection, approached Friedkin with the idea of directing a film based on New York Times reporter Gerald Walker's 1970 novel Cruising, about a serial killer targeting New York City's gay community. Friedkin was not particularly interested in the project. D'Antoni tried to attach Steven Spielberg, but they were not able to interest a studio. A few years later Jerry Weintraub brought the idea back to Friedkin, who was still not interested. Friedkin changed his mind following a series of unsolved killings in gay leather bars in the early 1970s and the articles written about the murders by Village Voice journalist Arthur Bell. Friedkin also knew a police officer named Randy Jurgenson who had gone into the same sort of deep cover that Pacino's Steve Burns did to investigate an earlier series of gay murders, and Paul Bateson, a doctor's assistant who had appeared in Friedkin's 1973 film The Exorcist, who had confessed to some of those murders. All of these factors gave Friedkin the angle he wanted to pursue in making the film.[2] Jurgenson and Bateson served as film consultants, as did Sonny Grosso, who had earlier consulted with Friedkin on The French Connection. Jurgenson and Grosso appear in bit parts in the film.In his research, Friedkin worked with members of the Mafia, who at the time owned many of the city's gay bars.[3] Al Pacino was not Friedkin's first choice for the lead; Richard Gere had expressed a strong interest in the part, and Friedkin had opened negotiations with Gere's agent. Gere was Friedkin's choice because he believed that Gere would bring an androgynous quality to the role that Pacino could not.[4]The Motion Picture Association of America originally gave Cruising an X rating. Friedkin claims he took the film before the MPAA board \"50 times\" at a cost of $50,000 and deleted 40 minutes of footage from the original cut before he secured an R rating.[2] The deleted footage, according to Friedkin, consisted entirely of footage from the clubs in which portions of the film were shot and consisted of \"[a]bsolutely graphic sexuality....that material showed the most graphic homosexuality with Pacino watching, and with the intimation that he may have been participating.\"[3] In some discussions, Friedkin claims that the missing 40 minutes had no effect on the story or the characterizations,[2] but in others he states that the footage created \"mysterious twists and turns (which [the film] no longer takes)\", that the suspicion that Pacino's character may have himself become a killer was made more clear and that the missing footage simultaneously made the film both more and less ambiguous. When Friedkin sought to restore the missing footage for the film's DVD release, he discovered that United Artists no longer had it. He believes that UA destroyed the footage.[2] Some obscured sexual activity remains visible in the film as released, and Friedkin intercut a few frames of gay pornography into the first scene in which a murder is depicted.This movie represents the only film soundtrack work by the seminal Los Angeles punk rock band the Germs. They recorded six songs for the film, of which only one, \"Lion's Share\", appeared. The cut \"Shakedown, Breakdown\" was written and recorded especially for the film by Toronto cult band Rough Trade.[5]Friedkin asked noted gay author John Rechy, some of whose works were set in the same milieu as the film, to screen Cruising just before its release. Rechy had written an essay defending Friedkin's right to make the film, although not defending the film itself. At Rechy's suggestion, Friedkin deleted a scene showing the Gay Liberation slogan \"We Are Everywhere\" as graffiti on a wall just before the first body part is pulled from the river, and added a disclaimer:[6]\"This film is not intended as an indictment of the homosexual world. It is set in one small segment of that world, which is not meant to be representative of the whole.\"[7]Friedkin later claimed that it was the MPAA and United Artists that required the disclaimer, calling it \"part of the dark bargain that was made to get the film released at all\" and \"a sop to organized gay rights groups\".[8] Friedkin claimed that no one involved in making the film thought it would be considered as representative of the entire gay community, but gay film historian Vito Russo disputes that, citing the disclaimer as \"an admission of guilt. What director would make such a statement if he truly believed that his film would not be taken to be representative of the whole?\"[9]Throughout the summer of 1979, members of New York's gay community protested against the production of the film. Protests started at the urging of gay journalist Arthur Bell — precisely the writer whose series of articles on unsolved murders of gay men inspired the film.[10] Gay people were urged to disrupt filming, and gay-owned businesses to bar the filmmakers from their premises. People attempted to interfere with shooting by pointing mirrors from rooftops to ruin lighting for scenes, blasting whistles and air horns near locations, and playing loud music. One thousand protesters marched through the East Village demanding the city withdraw support for the film.[11] As a result of interference, the movie's audio was largely overdubbed in order to remove the noise caused by off-camera protesters.[12]Al Pacino said that he understood the protests but insisted that upon reading the screenplay he never at any point felt that the film was anti-gay. He said that the leather bars were \"just a fragment of the gay community, the same way the Mafia is a fragment of Italian-American life\", referring to The Godfather, and that he would \"never want to do anything to harm the gay community\".[13]","produced_by":"Jerry Weintraub","starring":"Al Pacino Paul Sorvino Karen Allen Richard Cox Don Scardino","running_time":"102 minutes","music_by":"Jack Nitzsche","Connection with hate crimes":"Two months after the film's release, a bar prominently displayed in the movie came under attack by a man with a sub-machine gun, killing two patrons and wounding twelve others. Friedkin refused to comment on the attack.[21]In The Celluloid Closet, Ron Nyswaner, Philadelphia screenwriter, recounts how he and his boyfriend narrowly escaped a beating by a group of college jocks citing Cruising to justify the attack.[22]","edited_by":"Bud S. Smith","Release":"Cruising was released February 15, 1980 in the United States and had a domestic box office take of $19,784,223.[14]"}