{"based_on":"Deepwater Horizon's Final Hours by David Barstow","country":"United States","deepwater_horizon":"Theatrical release poster","distributed_by":"Summit Entertainment (USA) Lions Gate Entertainment (world-wide)","screenplay_by":"Matthew Michael Carnahan Matthew Sand","story_by":"Matthew Sand","language":"English","cinematography":"Enrique Chediak","production_company":"Di Bonaventura Pictures Lions Gate Entertainment Participant Media","directed_by":"Peter Berg","release_dates":"September 30, 2016 (2016-09-30)|||||","Production":"On March 8, 2011, it was announced that Summit Entertainment, Participant Media and Image Nation acquired the film rights to the New York Times' article Deepwater Horizon's Final Hours written by David Barstow, David S. Rohde and Stephanie Saul, released on December 25, 2010, about the 2010 Deepwater Horizon explosion and subsequent oil spill.[3] Matthew Sand was set to write the screenplay while Lorenzo di Bonaventura was in talks to produce the film with his Di Bonaventura Pictures banner.[3] Summit and Participant Media/Imagenation were also said to be financing the film. On acquiring the article to develop a film, President of Participant Media, Ricky Strauss said,On July 24, 2012, Ric Roman Waugh was in talks with the studios to direct the film, Mark Vahradian was also set to produce the film along with Bonaventura, Lions Gate Entertainment also joined the project to produce and distribute.[5] On July 11, 2014, it was announced that All Is Lost's director J. C. Chandor had been hired to direct the film, whose screenplay's first draft was written by Sand and then Matthew Michael Carnahan wrote the second draft.[6] In early October, it was confirmed that Summit would distribute the film, not Lionsgate.[7] On January 30, 2015, it was reported that Lone Survivor director Peter Berg had replaced Chandor to re-team with Wahlberg for the film. Chandor exited due to some creative differences.[8]On August 19, 2014, casting began with actor Mark Wahlberg added for the lead role in the film.[9] Gina Rodriguez was set on March 18, 2015 to play the female lead role in the film, where Wahlberg would play Mike Williams, an electrician on the Deepwater Horizon oil rig, while Rodriguez was set to play Andrea Fleytas, who noticed a blazing at the rig and tried to contact the Coast Guard.[10] Dylan O'Brien was in talks to play Caleb Holloway reported by Deadline on April 10, 2015.[11] Kurt Russell also joined the film on the same day O'Brien was in talks, Russell's role was unspecified yet.[12] Soon after, John Malkovich was confirmed cast as a BP representative who underestimates the dangers of working on the rig.[13] Kate Hudson was announced as a cast member in May, 2015, and will play the wife of Wahlberg's character; her role will be the first on-screen pairing of Hudson and Russell, who raised her as a child.[14] Wahlberg's character was revealed in May 2015, that he would be playing the real-life hero Mike Williams.[2]Principal photography on the film began on April 27, 2015. [15] It was later officially announced by Lionsgate on May 18, 2015, that the filming had begun in New Orleans, Louisiana. Scenes at the BP offices are to be filmed in Liverpool, England in September 2015, as it also often doubles as New York.[2]","produced_by":"Lorenzo di Bonaventura Mark Vahradian David Womark","starring":"Mark Wahlberg Kurt Russell John Malkovich Gina Rodriguez Dylan O'Brien Kate Hudson","music_by":"Steve Jablonsky","edited_by":"Colby Parker Jr.","Release":"On October 6, 2014, Summit Entertainment set Deepwater Horizon for a wide release on September 30, 2016.[7]","budget":"$150 million[1]"}