{"country":"Denmark","distributed_by":"Nordisk Film Distribution","Plot":"Company commander Claus M. Pedersen and his men are stationed in the Helmand province. Meanwhile, back in Denmark Claus' wife Maria is trying to hold everyday life together, with a husband at war and three children missing their father. During a routine mission, the soldiers are caught in heavy crossfire and in order to save his men, Claus, without proper Intel, decides to call in an airstrike. After being sent back home, he is charged for killing 11 people by that airstrike. The grave consequences of these accusations shake him and his family back home. He explains to the court the requirement of this critical decision under attack. A second point-man of Claus' gives a false statement and Claus is acquitted by the judge and co-committee based on the evidence. Claus stays with his wife and kids engagingly.","a_war":"Film poster","language":"Danish","Reception":"A War received critical acclaim. On Rotten Tomatoes, the film has a 90% \"Certified Fresh\" score based on 72 reviews, with an average rating of 7.7/10. The site's consensus states: \"Tense, intelligent, and refreshingly low-key, A War is part frontline thriller, part courtroom drama -- and eminently effective in both regards.\"[7] Metacritic reports an 81 out of 100 rating based on 29 critics, indicating \"universal acclaim\".[8] Olly Richards from Empire magazine gave the film four out of five stars saying \"It’s a riveting, complex film that asks one simple question: what do you do when there’s no right answer?\".,[9] while Clayton Dillard from Slant Magazine gave it a mixed review: two out of four stars saying \"Tobias Lindholm stages his claims through clunky dramaturgical scenarios, with the seams exposed at every turn.\"[10]","box_office":"$880,073[2]","cinematography":"Magnus Nordenhof Jønck","production_company":"AZ Celtic Films Nordisk Film Production","directed_by":"Tobias Lindholm","release_dates":"27 August 2015 (2015-08-27)|||||","Production":"The film was produced by Nordisk Film with support from DR TV and received eight million Danish kroner from the Danish Film Institute. Filming took place in Copenhagen, in Konya, Turkey and in Almeria, Spain. It ended in January 2015. With the exception of the main characters, the soldiers are played by actual Danish soldiers who had served in Afghanistan.[3]","produced_by":"René Ezra|Tomas Radoor|","starring":"Pilou Asbæk|Søren Malling|","running_time":"115 minutes[1]","edited_by":"Adam Nielsen","written_by":"Tobias Lindholm","budget":"8 million Danish krone|(USD$1.2 million)|"}