{"country":"United States","distributed_by":"Warner Bros. Pictures","Plot":"A Los Angeles County Sheriff's Deputy is shot down on Christmas Eve when he stumbles upon a robbery-homicide at a convenience store. A down-on-his-luck L.A. County Sheriff's Dept. homicide detective, Jerry Beck (Johnson), is assigned to the case. As with every case, he takes this one very emotionally, because \"the job\" is the last thing left in his life, and vows to get the perpetrator no matter what.The slain officer's widow further complicates the issue when she entices Beck into a one-night stand, in the hope that Beck will not only find but kill her husband's murderer. During the investigation Beck learns that the murder of the deputy sheriff was just the tip of the iceberg, as he finds the roots of the suspect are in a White Supremacist, Neo-Nazi group.Detective Beck pursues the killer across several states and uncovers that the killer is involved with a White Supremacist, Neo-Nazi group that is involved in many violent crimes. Eventually Detective Beck tracks the killer to a Neo-Nazi compound in rural Colorado. Beck, with the assistance of a local police chief and his officers, corners the killer in an underground tunnel complex concealed under the neo-nazis' compound. Beck kills the suspect with his .357 Colt Python revolver in a shootout when the killer fires on Detective Beck and the local police with a 9mm Browning Hi-Power pistol.","dead_bang":"Theatrical release poster","language":"English","box_office":"$8,125,592 (domestic)","cinematography":"Gerry Fisher","production_company":"Lorimar Film Entertainment","directed_by":"John Frankenheimer","release_dates":"March 29, 1989 (1989-03-29) (U.S.)|July 14, 1989 (1989-07-14) (Sweden)|July 28, 1989 (1989-07-28) (Norway)|August 26, 1989 (1989-08-26) (Finland)||","Production":"\"Jerome Beck\" is listed in the film's closing credits as walk-on character Detective John, and also as the film's technical police advisor. Don Johnson later recalled:That was amazing, because it was a real-life character. It was an actual cop, and he wrote the script. John Frankenheimer was the director... and I was excited to work with him. Jerry was a homicide cop in L.A., and he had curly hair, so I permed my hair, which was a, uh, very interesting choice. Because I kind of looked like a… It’s kind of odd. I don’t really know how to describe it. I don’t know if you know a lot about perms, but if you do them, they relax after about two or three weeks. So my hair goes through these amazing transitions of being really tight and really wavy and sort of goofy-looking. [Laughs.][1]According to director Frankenheimer, Connie Sellecca was originally chosen for the part that went to Penelope Ann Miller. Johnson refused to work with Sellecca, so she was fired and paid off.[2]","produced_by":"Stephen J. Roth Robert L. Rosen","starring":"Don Johnson|Penelope Ann Miller|William Forsythe|Bob Balaban|Tim Reid|","running_time":"102 min.","music_by":"Gary Chang Michael Kamen","edited_by":"Robert F. Shugrue","written_by":"Robert Foster"}