{"based_on":"Born on the Fourth of July  by Ron Kovic","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Ron Kovic Oliver Stone","Plot":"The film begins with Ron Kovic's childhood during the summer of 1956 in Massapequa, Long Island, New York, just one year after the Korean War broke out. He plays war in the woods, attends a Fourth of July parade, plays and wins at a local neighborhood baseball game, and watches President John F. Kennedy's inaugural address,[3] which later inspires him to enlist in the Marines (it appears to be a chronological inconsistency that the introductory scenes bridge a period of five years, 1956-1961, while Ron and his friends seem to linger in the same childhood age).Years later, Ron Kovic has become of age and attends an impassioned lecture about the Marine Corps. He decides to enlist and misses his prom because he is unable to secure a date with his love interest, Donna. He confronts her at the prom and has a dance with her on his last night before leaving.The film then moves to Kovic's second Vietnam tour in October 1967. Now a Marine sergeant and on patrol, his unit kills a number of Vietnamese civilians in a village, believing them to be enemy combatants. During the retreat, Kovic becomes disoriented and accidentally shoots one of the new arrivals to his platoon, a younger Marine private first class, named Wilson. Despite the frantic efforts of the Navy Corpsmen present who try to save him, Wilson later dies from his wounds, leaving a deep impression on Kovic. Overwhelmed by guilt, Kovic appeals to his executive officer (XO), who merely tells him to forget the incident. The meeting has a negative effect on Ron, who is crushed at being brushed off by his XO.The platoon goes out on another hazardous patrol in January 1968. During a firefight, Kovic is critically wounded and trapped in a field facing sure death, until a fellow Marine rescues him. Paralyzed from the mid-chest down, he spends several months recovering at the Bronx Veterans Administration hospital. The hospital living conditions are deplorable: rats crawl freely on the floors, the staff is generally apathetic to their patients' needs, doctors visit the patients infrequently, drug use is rampant (among both the staff and patients), and equipment is too old and ill-maintained to be useful. He desperately tries to walk again with the use of crutches and braces, despite repeated warnings from his doctors. However, he soon suffers a bad fall that causes a compound fracture of his femur. The injury nearly robs him of his leg, and he vehemently argues with the doctors who briefly consider resorting to amputation.In 1969, Ron returns home, permanently in a wheelchair, with his leg intact. From the start, he notices how all his family and friends treat him differently now that he is paralyzed. He begins to alienate them, complaining about students staging anti-war rallies across the country and burning the American flag. Though he tries to maintain his dignity as a Marine, Ron gradually becomes disillusioned, feeling the effects of his paralysis on his life, and realizes that all the things he was taught from birth, like honor, patriotism, and courage, were illusions that he would give up any day to be able to walk again. In Ron's absence, his younger brother Tommy, played by Josh Evans, has already become staunchly anti-war, remarking to Ron what the war had done to him, leading to a rift between them. His religious mother also seems unable to deal with Ron's new attitude as a resentful, paralyzed veteran. His problems are as much psychological as they are physical and he becomes alcoholic and belligerent.During an Independence Day parade, he shows signs of post-traumatic stress when firecrackers explode; when he is asked to give a speech, a baby in the crowd starts crying. Ron is reminded of a crying baby left alive in the Vietnamese village, and is unable to finish the speech. After being wheeled off stage, he reunites with his old high school friend, Timmy Burns, who is also a wounded veteran, and the two spend Ron's birthday sharing war stories. Later, Ron goes to visit Donna at her college in Syracuse, New York. The two reminisce and she asks him to attend a vigil for the victims of the Kent State shootings. However, he cannot do so, because his chair prevents him from getting far on campus because of curbs and stairways. He and Donna are separated after she and her fellow students are captured and taken away by the police at her college for demonstrating a protest against the Vietnam War.After returning home drunk one night after having a barroom confrontation with a Korean War veteran who expresses no sympathy to Ron, Ron's disillusionment grows severe enough that he has an intense fight with his mother, yelling at her that there was no God and that they murdered civilians in Vietnam in disregard of Christian morals. Ron travels to a small town in Mexico (\"The Village of the Sun\") that seems to be a haven for paralyzed Vietnam veterans. He has his first sexual experience with a prostitute whom he believes he loves. Ron wants to ask her to marry him but when he sees her with another customer, the realization of real love versus a mere physical sexual experience sets in, and he decides against it. Hooking up with another wheelchair-bound veteran, Charlie, who is furious over a prostitute's mocking his lack of sexual function due to his paralysis, the two travel to what they believe will be a friendlier village. After annoying their taxicab driver, they end up stranded on the side of the road. They quarrel and fight about what each of them had really done in Vietnam, knocking each other out of their wheelchairs. Eventually, they are picked up by a man with a truck and driven back to the \"Village of the Sun\".On his way back to Long Island, Ron makes a side trek to Georgia to visit the parents and family of Wilson, the Marine he accidentally killed during his tour. He tells them the real story about how their son died and confesses his guilt to them. Wilson's widow, now the mother of the deceased Marine's toddler son, admits that she cannot find it in her heart to forgive him for killing her husband, but adds that maybe God can. Wilson's parents, however, are more forgiving and even sympathetic to his predicament and suffering, because Wilson's father fought in the Pacific Theater during World War II and is disillusioned with the war in Vietnam. In spite of the mixed reactions he receives, the confession seems to lift a heavy weight from Ron's conscience.Ron joins Vietnam Veterans Against the War (VVAW) and travels to the 1972 Republican National Convention in Miami. He and his compatriots force their way into the convention hall during Richard Nixon's acceptance speech and cause a commotion that makes it onto the national news. Ron tells a reporter about his negative experiences in Vietnam and the VA hospital conditions, that the Vietnam war is wrong, and that the Vietnamese people are a proud people fighting against the US for their independence, fueling rage from the surrounding Nixon supporters. His interview is cut short when guards eject him and his fellow vets from the hall and attempt to turn them over to the police. They manage to break free from the police, regroup, and charge the hall again, though not so successfully this time. The film ends with Kovic's speaking at the 1976 Democratic National Convention, shortly after the publication of his autobiography, Born on the Fourth of July.","born_on_the_fourth_of_july":"Theatrical release poster","language":"English","Reception":"The film was released on December 20, 1989, grossing $766,942 during its opening week, in limited release. Over the course of its second week, the film grossed $1,464,345. At its third week of release, now in wide release, it grossed $5,343,453, ranking #1 at the box office. The film remained in the number one position up until its sixth week of release. The film stayed in the #11 position of the top ten grossing films of 1990 until its last week of release. The film grossed $70,001,698 domestically and $161,001,698 worldwide,[1] significantly surpassing its $14 million budget.Reviews of the film were extremely positive. On Rotten Tomatoes, the film holds a score of 90% of positive reviews by critics, based on 37 reviews.[5] Roger Ebert gave the film four out of four stars.[6] Metacritic reported that the film had an average score of 75 out of 100. The New York Times says: \"It is a film of enormous visceral power with, in the central role, a performance by Tom Cruise that defines everything that is best about the movie.\" Peter Travers of Rolling Stone says: \"Stone has found Cruise the ideal actor to anchor the movie with simplicity and strength. Together they do more than show what happened to Kovic. Their fervent, consistently gripping film shows why it still urgently matters.\" Many critics also praised Tom Cruise's performance and Oliver Stone's direction of the film. Stone would later be awarded with an Oscar and a Golden Globe for directing while Tom Cruise received the Golden Globe Award for Best Actor.Notable critics who gave the film negative reviews include Jonathan Rosenbaum, who said: \"[T]he movie's conventional showbiz finale, brimming with false uplift, implies that the traumas of other mutilated and disillusioned Vietnam veterans can easily be overcome if they write books and turn themselves into celebrities.\" Hal Hinson of the Washington Post called the film \"hysterical and overbearing and alienating.\" Sheila Benson of the Los Angeles Times wrote: \"[T]he director has lost the specificity that made Platoon so electrifying. In its place he uses bombast, overkill, bullying.\"","box_office":"$161 million[1]","cinematography":"Robert Richardson","directed_by":"Oliver Stone","Home media":"The film was released on VHS in 1990 and on DVD in 1998. The DVD contains commentary by director Oliver Stone. The special edition DVD was released on October 19th, 2004. The DVD contains commentary with Director Oliver Stone and the original NBC documentary of the making of Born on the Fourth of July. In 2007, the film was released on the HD DVD format. On September 1, 2011 Universal Australia released the film on Blu-ray Disc. It was released in the US on July 3, 2012.[9]","release_dates":"December 20, 1989 (1989-12-20)|||||","Production":"Oliver Stone, also a Vietnam veteran, read Ron Kovic's best-selling autobiography Born on the Fourth of July and was stunned to learn what Kovic had suffered after the war. He bought the rights to the autobiography, and wanted to make it into a film. After buying the rights, Stone had to find a distributor for the film. Stone offered the project to Universal Pictures and they accepted. Stone then had to find a producer for the film. Eventually, he along with A. Kitman Ho became the producers. Tom Cruise was cast as Ron Kovic while Stone directed. Stone met with Ron Kovic and they discussed their experiences in Vietnam. Kovic wrote the screenplay with Stone, and appears in the film himself during the opening parade sequence as a soldier who flinches at the sound of exploding firecrackers—a reflex Cruise's Kovic will adopt himself later in the film.Stone wanted to film the movie in Vietnam, but since the relationship between Vietnam and the United States had not been resolved, Stone decided instead to film it in the Philippines (where Stone had previously filmed Platoon). Other scenes which do not include combat were filmed in the U.S., particularly Dallas, Texas. The film was cinematographer Robert Richardson's first experience shooting in the anamorphic format.[4] Of the stars he worked with in this film, Stone worked again with both Tom Berenger and Willem Dafoe, who originally starred in Platoon. Another star, Frank Whaley, would join Stone for the 1991 films The Doors and JFK.","produced_by":"A. Kitman Ho Oliver Stone","starring":"Tom Cruise|Kyra Sedgwick|Raymond J. Barry|Jerry Levine|Frank Whaley|Willem Dafoe|","running_time":"145 minutes","music_by":"John Williams","edited_by":"Joe Hutshing David Brenner","budget":"$14 million"}