{"country":"United States","distributed_by":"Warner Bros.","Plot":"After giving a guest lecture on criminal psychology at a local university, Dr Helen Hudson (Weaver), a respected field expert on serial killers, is cornered in a lavatory by one of her previous subjects, Daryll Lee Cullum (Harry Connick, Jr.), who kills a police officer and brutally attacks her. Helen becomes severely agoraphobic as a result, sealing herself inside an expensive hi-tech apartment, conducting her entire life from behind a computer screen and assisted by a friend, Andy (John Rothman).When a new series of murders spreads fear and panic across her home city of San Francisco, Inspector M.J. Monahan (Hunter) and her partner Reuben Goetz (Dermot Mulroney) solicit Helen's expertise. Initially reluctant, Helen soon finds herself drawn into the warped perpetrator's game of wits.As the murders continue, Helen realizes that the elusive assailant draws inspiration from notorious serial killers, including Albert DeSalvo, The Hillside Strangler, David Berkowitz, Jeffrey Dahmer, and Ted Bundy. When the murderer begins contacting and even stalking Helen, she and M.J. realize that he is after them, and they enlist the aid of Cullum, who tells them what he knows about the killer. Helen soon realizes that the Copycat Killer has been following the list of serial killers in the same order as she had presented them in her lecture at the university on the night of her attack, and the two work to figure out where and when he will strike next. Unfortunately, Reuben is later killed in an unrelated shooting incident at the police station, leaving only M.J. to continue the search for the serial killer.After Andy is killed in a manner reminiscent of Jeffrey Dahmer, M.J. deduces the killer to be Peter Foley (William McNamara). After leading a failed attempt to catch Foley at his house, M.J. discovers that he has kidnapped Helen and taken her back to the scene of Daryll Lee's attempt at killing her—the restroom of the lecture hall. Once she gets there, M.J. finds Helen bound and gagged in the same manner that Cullum did before, but she is ambushed and shot by Foley, rendering her unconscious. As Foley prepares to kill M.J., Helen desperately attempts to save her by ruining Foley's carefully replicated crime scene the only way she can—by attempting to hang herself. Foley panics and cuts Helen down, and Helen is able to get away and escape to the building's roof. Her agoraphobia kicks in again, and Helen finds herself cornered. Accepting her fate, she turns to face Foley. However, just as he is about to kill her, M.J. shoots him in the brachial nerve, giving him one last chance to surrender. When he pulls his gun back on her, however, she shoots him dead.Some time later, Daryll Lee writes a letter to another serial killer, instructing him on how to kill Helen, revealing that he had been aiding Foley all along.","language":"English","Reception":"The film received positive reviews from critics and holds a 75% rating on Rotten Tomatoes, making it \"fresh\",[citation needed]Roger Ebert of the Chicago Sun-Times awarded it three-and-a-half stars out of a possible four, and a thumbs up on Siskel & Ebert, citing Holly Hunter's character as \"one of the most intriguing and three-dimensional characters of the year\".[2]","box_office":"$32,051,917 (domestic)[1]","cinematography":"László Kovács","production_company":"Regency Enterprises","directed_by":"Jon Amiel","Soundtrack":"All tracks composed by Christopher Young, unless otherwise noted.","copycat":"Theatrical release poster","release_dates":"October 27, 1995","produced_by":"Arnon Milchan, Mark Tarlov","starring":"Sigourney Weaver Holly Hunter Dermot Mulroney Harry Connick, Jr. William McNamara","running_time":"123 minutes","music_by":"Christopher Young","edited_by":"Jim Clark","written_by":"Ann Biderman, David Madsen","budget":"$20 million"}