{"based_on":"A Bridge Too Far  by Cornelius Ryan","country":"United Kingdom United States[1]","distributed_by":"United Artists","screenplay_by":"William Goldman","William Goldman's Story of A Bridge Too Far":"To promote the film, scriptwriter William Goldman wrote a book titled Story of A Bridge Too Far, published in December 1977. It falls into three sections:Goldman explains he wrote the books as a favour:Joseph E. Levine was very kind to me and I had a great experience on A Bridge Too Far. It was my first movie with Richard Attenborough and he's a marvelous human being. A lot of movies are shit, the experience is just terrible, and Bridge was wonderful and Mr Levine wanted something to publicize the movie so I wrote that for him. It was just something like I've never done, but it was as a favour for Mr Levine.[40]","Plot":"The film begins with a montage of archival film footage narrated by a Dutch woman, Kate ter Horst, describing the state of affairs in September 1944. The Allied advance is being slowed by overextended supply lines. A Dutch family, part of the Dutch resistance underground, observes the German withdrawal toward Germany. The Germans in the Netherlands have few resources in men or equipment and morale is very poor.U.S. General George S. Patton and British Field Marshal Bernard Montgomery have competing plans for ending the war quickly, and being the first to get to Berlin. Under political pressure, Supreme Allied Commander Dwight D. Eisenhower chose Montgomery's Operation Market Garden.Operation Market Garden envisions 35,000 men being flown 300 miles from air bases in England and being dropped as much as 64 miles behind enemy lines in the Netherlands. The largest airborne assault ever attempted, with Lieutenant-General Frederick Browning saying, \"We're going to lay a carpet, as it were, of airborne troops\"[6] over which armored divisions of XXX Corps can pass and confidently suggests that \"We shall seize the bridges - it's all a question of bridges - with thunderclap surprise, and hold them until they can be secured\".[7]Two divisions of U.S. paratroopers, the 82nd & 101st Airborne divisions, are responsible for securing the road and bridges as far as Nijmegen. A British division, the 1st Airborne, under Major-General Urquhart is to land near Arnhem, and take and hold the far side of the bridge at Arnhem, backed by a brigade of Polish paratroopers under General Sosabowski. XXX Corps are to push up the road to Arnhem, as quickly as possible, over the bridges captured by the paratroopers, and reach Arnhem two days after the drop.After the Market Garden command briefing, General Sosabowski voices his deep doubts that the plan can work. American commander Brig. General Gavin of the 82nd worries about parachuting in daylight.British commanders brief that they are badly short of transport aircraft and the area near Arnhem is ill-suited for a landing. They will have to land in an open area eight miles (13 km) from the bridge. The British officers present at that briefing do not question the orders, but Sosabowski walks up to check the RAF briefing officer's uniform insignia and says \"Just making sure whose side you're on.\" Later, when General Urquhart briefs his officers, some of them are surprised they are going to attempt a landing so far from the bridge, but they have to make the best of it. General Urquhart tells them that the key for the eight mile distance from the drop zone to the bridge, is the use of gliders to bring in reconnaissance Jeeps. Browning lays out that if any one group fails, the entire operation fails.The consensus among the British top brass is that resistance will consist entirely of \"Hitler Youth or old men on bicycles\",[8] but young British intelligence officer, Major Fuller, brings reconnaissance photos to General Browning showing German tanks at Arnhem. Browning dismisses the photos, and also ignores reports from the Dutch underground. Browning does not want to be the one to tell Montgomery of any doubts because many previous airborne operations have been cancelled. Major Fuller's concerns are brushed off and he is removed from duty, sent on 'sick leave'.British officers note that the portable radios are not likely to work for the long distance from the drop zone to the Arnhem Bridge amid the water and trees of the Netherlands. They choose not to rock the boat and do not convey their concerns up the chain of command.At the XXX Corps briefing, the overall plan is outlined by Lt. Gen. Brian Horrocks, laying out the bridges that will be taken by the paratroopers, held and then secured by ground forces. Speed is the vital factor, as Arnhem must be reached within 2–3 days. It is the crucial bridge, the last means of escape for the German forces in the Netherlands and an excellent route to Germany for Allied forces. The road to Arnhem, however, is only a single highway linking the various key bridges - trucks and tanks have to squeeze to the shoulder to pass. The road is also elevated causing anything moving on the road to stand out. The XXX Corps column would be led by the Irish Guards, under Col. 'Joe' Vandeleur.The airborne drops catch the Germans totally by surprise, and there is little resistance. Most of the men come down safely and assemble quickly, but the Son bridge is blown up by the Germans, just before the 101st Airborne secures it. German Field Marshal Model, thinking that the Allies are trying to capture him, panics and retreats from Arnhem. However, soon after landing, troubles beset Urquhart's division. Many of the Jeeps either don't arrive by gliders at all or are shot up in an ambush. Their radio sets are also useless, meaning no contact can be made with either paratroopers moving into Arnhem under Lt. Col. John Frost or XXX Corps. Meanwhile, German forces reinforce Nijmegen and Arnhem. Meanwhile, US Sergeant Eddie Dohun is driving his jeep searching for his commanding officer, Captain Glass. He finds the captain with a bullet in his head and thinking he is alive decides to take him to medical care. He encounters German troops but manages to avoid them. Arriving at the hospital, Dohun takes the captain to an Army physician (Medical Corps Colonel) who refuses to look at the captain until Dohun threatens to shoot him. The medic manages to get the bullet out of the captain's skull and says he'll possibly live. He places Dohun under arrest for 10 seconds as punishment for pointing a gun at him.XXX Corps' progress is slowed by German resistance, the narrowness of the highway and the need to construct a Bailey bridge to replace the destroyed bridge at Son. XXX Corps is able to move onto the Grave bridge without much resistance, but is halted at Nijmegen. There, soldiers of the 82nd Airborne Division perform a dangerous daylight river crossing in flimsy canvas-and-wood assault boats. Ultimately, despite heavy casualties the river crossing is successful, and the Nijmegen bridge is captured. The Germans close in on the isolated British paratroopers occupying part of Arnhem at the bridge. Urquhart is separated from his men, and the supply drop zones are overrun by the Germans. German attacks on the paratroopers at the bridge are repelled. British armour continues to fight its way up the corridor, but is delayed by strong German resistance.After securing Nijmegen Bridge, XXX Corps waits several hours for its infantry to secure the town. Finally, Sosabowski's troops enter the battle, yet they are unable to effectively reinforce the British at Arnhem. The Germans, now on full alert, intercept and gun down numerous Poles during their drop; only a handful survive to reinforce the British. After days of house-to-house fighting at Arnhem, pitted against crack SS infantry backed by panzers, the outgunned paratroops are captured or forced to withdraw. Arnhem itself is indiscriminately razed. [9] Although Operation Market Garden is determined by Montgomery and his High Command to be 90% successful, most of those who actually carried it out feel quite differently. Urquhart escapes Arnhem with fewer than a fifth of his original 10 thousand crack troops; those who were too badly injured to flee stay behind and cover the withdraw, then give themselves up. Urquhart confronts Browning about his personal sentiments regarding the operation: does Browning think it was as well as Montgomery estimates? Browning's reply (and the film's last line of dialogue, not counting the Allied prisoners who sing Abide With Me en route to the German POW camp) contradicts his earlier optimism for Market Garden: \"Well, as you know, I always felt we tried to go a bridge too far.\"In the film's final scene, Kate ter Horst (Liv Ullman) and her children are forced to abandon their bombed-out residence. Placing their belongings in a cart which is drawn by Dr. Jan Spaander (Laurence Olivier), they pass through their front yard - which has been converted to a cemetery for fallen Allied troops - and trek across the countryside to an uncertain future. One of the children brings up the rear, marching with a rifle-shaped branch he has found.","language":"English German Dutch","Reception":"The film received mixed to positive reviews from critics. According to a \"making-of\" documentary included in a special edition DVD of A Bridge Too Far, at the time of its release, \"the film was shunned by American critics and completely ignored at Oscar time for daring to expose the fatal inadequacies of the Allied campaign.\"[35] Review aggregator Rotten Tomatoes reports that 73% of 11 critics have given the film a positive review, with a rating average of 6.8 out of 10.[36] While critics agreed that the film was impressively staged[37] and historically accurate, many found the film too long and too repetitive.[38] James Caan[38] and Anthony Hopkins were cited by many critics for the excellence of their performances in a film filled with hundreds of speaking roles and cameos by many of the period's top actors.The film was a box office disappointment in the US but performed well in Europe.[39]","box_office":"$50,750,000[3]","cinematography":"Geoffrey Unsworth, BSC","production_company":"Joseph E. Levine Productions","directed_by":"Richard Attenborough","a_bridge_too_far":"original film poster","Cast and roles":"Source: A Bridge Too Far at the Internet Movie DatabaseSource: A Bridge Too Far at the Internet Movie DatabaseSource: Goldman, William Goldman's Story of a Bridge Too Far","release_dates":"June 15, 1977","Production":"Air filming was done in the first weeks of September 1976, culminating in a series of air drops of a total of 1,000 men,[citation needed][29] together with the dropping of supplies from a number of Dakota aircraft. The Dakotas were gathered by the film company Joseph E. Levine Presents Incorporated. All aircraft were required to be CAA (Civil Aviation Authority) or FAA (Federal Aviation Administration) registered and licensed to carry passengers. An original deal for the purchase of ten fell through when two airframes were rejected as passenger configured without the necessary jump doors. Eleven Dakotas were procured. Two Portuguese, ex-Portuguese Air Force, 6153, and 6171, (N9984Q and N9983Q), and two Air International Dakotas, operating from Djibouti in French Somaliland, F-OCKU and F-OCKX, (N9985Q and N9986Q) were purchased by Joseph E. Levine. Three Danish Air Force, K-685, K-687, and K-688, and four Finnish Air Force C-47s, DO-4, DO-7, DO-10 and DO-12, were loaned for the duration of the parachute filming.Aircraft 6171 doubled as the camera ship on most formations, with a camouflaged Piper Aztec, G-AWDI. A camera was mounted in the astrodome, one on the port upper mainplane surface, with a third camera on the outside of the forward port cabin window and a fourth under the aircraft centre section. In addition, centre escape hatches were removed to make additional camera ports available, provided that no troops were aboard during filming. A second Aztec, G-ASND, was a back-up camera ship on some shots, but it was not camouflaged. An Alouette, G-BDWN, was also employed. After a mishap with G-AWDI, two locally hired Cessna 172s, PH-GVP and PH-ADF, were also used. Ten Horsa glider replicas were built, but a wind storm damaged almost all of them. Seven or eight were hastily repaired for the shoot. The replica gliders were tail-heavy and required a support post under the rear fuselage, with camera angles carefully chosen to avoid revealing this. Dakota 6153 was fitted with tow gear and Horsa replicas were towed at high speed, though none went airborne. A two-seat Blaník sail-plane, provided by a member of the London Gliding Club, Dunstable, was towed aloft for the interior take-off shots.Four Harvards portrayed American and German fighters. Their original identities were PH-KLU, PH-BKT, B-64 and B-118, the latter two aircraft loaned by the Royal Netherlands Air Force. These were flown by members of the Gilze Rijen Aero Club, which also provided an Auster III, PH-NGK, which depicted an Auster V, RT607, in wartime camouflage. Spitfire Mk. IX, MH434, depicting a photo reconnaissance variant, coded AC-S, was lent by the Hon. Patrick Lindsay, and was flown by aerobatic champion Neil Williams.[30]The scenes around the 'Arnhem' bridge were actually shot in Deventer, where a similar bridge over the IJssel was still available. Although a replica of the original road bridge in Arnhem still existed, it was, by the mid-1970s, sitting in modern urban surroundings which could not be used to portray a 1940s city. A few scenes were shot in Zutphen, where the old municipality house (a white building which in the film featured the Nazi command centre) and the main church can be seen.The film includes some distortions of military history that are not present in the book; in particular, the reasons for the delay in XXX Corps reaching the Arnhem bridge (leading to the failure of the attack) differ considerably from those given in Cornelius Ryan's text.An episode of the Dutch TV history programme Andere Tijden[31] (English: Different Times) about the making of this movie stated that producer Joseph E. Levine told the Deventer town government that their town would host the world premiere for A Bridge Too Far, on June 14, 1977. This never came to be, though, and Deventer even missed out on the Dutch premiere, which was held in Amsterdam.","produced_by":"Joseph E. Levine Richard P. Levine","starring":"Dirk Bogarde James Caan Michael Caine Sean Connery Edward Fox Anthony Hopkins Gene Hackman Hardy Krüger Laurence Olivier Robert Redford Maximilian Schell","running_time":"176 minutes","music_by":"John Addison","edited_by":"Antony Gibbs","budget":"$25 million[2]"}