{"country":"USA","distributed_by":"Live Entertainment","language":"English","cinematography":"M. David Mullen","production_company":"The Image Organization, Ventana Productions","directed_by":"Martin Kitrosser","Plot Details":"The film details the adoption of an eleven-year-old girl named Jody (Gabrielle Boni) by a loving couple, Don (William Katt) and Barbara Mitchell (Michele Greene). Jody develops an obsession with her father and paranoia and jealousy about others spending time with him. This leads her to become psychopathic and so envious of his relationships with other people she sets out to remove these people from her father's life.Early in the movie, she kills her principal, Mrs. Hemp (Ruth Manning) when the latter suggests that Jody may need to be placed in a state-run boarding school, where she will only see her father on weekends, because of her behavior problems the past school year. Jody goes to the school when only Mrs. Hemp is there and tricks her into standing on a chair to retrieve a book from a high shelf. Jody then pushes the chair out from under her principal, and proceeds to tip the bookcase over onto her prostrate form.Jody's father and mother are having problems due to the fact that Barbara is forced to be the breadwinner since Don is working as a toy designer but his projects are not selling. Jody's maternal grandmother (Peggy McCay), Jacqueline, advises Barbara to divorce Don and take full custody of Jody. In response to this, Jody pours drain cleaning fluid into her juice one day when Jacqueline is at their house for brunch. She tries to trick Jacqueline into drinking by toasting her father as a great toy designer, but Jacqueline refuses to drink to this. So, later, Jody goes to her house and suggests playing a game of hide-and-seek with her so they can grow closer. Intuitively, Jody places a cassette recording of her crying out for help in an ocean at the base of the stairs. Jacqueline, already having ventured up the stairs after failing to find Jody on the first level, becomes alarmed when she hears Jody's cries and hurries to the threshold of the staircase, calling to Jody.Jody takes her carefully orchestrated opportunity to shove her grandmother down the stairs. Jacqueline survives the fall, but goes into a coma. She is later killed in the hospital when Jody sabotages her ventilator after waking up from her coma. Later, Jody kills her mother's friend, Rachel, as Jody had overheard Rachel advising Barbara to consider divorcing Don.During the course of the film, Jody's adoptive cousin, Karen (Roxana Zal), a college student who has been staying with the family for the summer, becomes suspicious of Jody's behavior. She begins investigating Jody's past, despite Barbara's insistence that she mind her own business, and discovers that as a toddler, Jody witnessed the murder of her biological father by her biological mother, and that she had been removed from her previous foster home when her foster father was convicted of fraud after his wife was killed by being a nag, suspiciously similar to that of Jody's recently deceased adoptive grandmother. This causes Karen to alert social services.At the end of the film, Jody pushes Barbara over the edge of a balcony upon discovering that she is on the verge of finding out about Jody's crimes, but this does not kill her. When the social worker arrives at Jody's home, Jody bludgeons him with a heavy meat tenderizing mallet, then tries to pin it on Karen. Don, having successfully sold a toy design, arrives home to find the body of the social worker and his wife injured on the ground. Karen calls 911 after finding the social worker's body.After discovering all that she has done and disgusted at her mental derangement, Don refuses to comfort the crying, begging child. The movie closes with Jody crying that everyone is against her, wanting her father to love her and comfort her, but he does not and she will likely now be placed in a mental facility.","release_dates":"VHS: December 23, 1996","produced_by":"Richard Brandes, Pierre David","starring":"William Katt, Michele Greene, Roxana Zal","running_time":"95 minutes","music_by":"Parmer Fuller","edited_by":"Julian Semilian","written_by":"Steve Pesce"}