{"country":"United Kingdom","distributed_by":"Warner-Pathé (UK) Warner Bros.-Seven Arts (USA)","DVD and Blu-Ray release":"On 6 November 2007, the film was released as part of a DVD four-pack along with Dracula, Taste the Blood of Dracula, and Dracula A.D. 1972.[2]On 6 October 2015, the film was released on Blu-ray of a Hammer collection pack with The Mummy (1959 film), Frankenstein Must Be Destroyed, and Taste the Blood of Dracula. It was also released on Blu-ray separately.","dracula_has_risen_from_the_grave":"U.S. release poster","language":"English","Critical reception":"The Hammer Story: The Authorised History of Hammer Films called the film \"a minor triumph of style over content\", writing that the film \"succeeds by virtue of Francis' adventurous direction\".[1] The film currently holds 79% on Rotten Tomatoes.","cinematography":"Arthur Grant","production_company":"Hammer Films","directed_by":"Freddie Francis","release_dates":"7 November 1968","Production":"This Hammer Dracula production was shot at Pinewood Studios situated in Iver Heath, Buckinghamshire, approximately 32 kilometers, 20 miles west of central London. Notably missing are the approach road, coach path and moat seen in front of Castle Dracula in 1958's Dracula and 1966's Dracula: Prince of Darkness. Those films were made at Bray Studios.The film was photographed by Arthur Grant using colored filters belonging to director Freddie Francis, also a cameraman by trade, who used them when photographing The Innocents (1961). Whenever Dracula (or his castle) is in a scene, the frame edges are tinged crimson, amber and yellow.Initially Terence Fisher was to direct the film, but dropped out due to illness; Freddie Francis stepped in.In Australia, the film was the first Hammer Dracula to be passed by the censors; the previous films Dracula (1958) and Dracula: Prince of Darkness (1966) were banned. The film was slightly censored and ran for a three-week season at Sydney's Capitol theater in January 1970.","produced_by":"Aida Young","starring":"Christopher Lee Rupert Davies Veronica Carlson Barbara Ewing","running_time":"92 min.","Storyline":"The story opens in 1905 in an East European village. A young altar boy (Norman Bacon) makes his way up to the bell-tower. He is about to ring the bell when blood drips on his cheek from above. He climbs into the bell chamber, where he discovers the corpse of a young woman crammed inside the church bell, another victim of Dracula.A year later in 1906, following the events of the previous film, Dracula has been destroyed. Monsignor Ernest Mueller (Rupert Davies) comes to the village on a routine visit only to find the altar boy is now a frightened mute and the priest (Ewan Hooper) has lost his faith. The villagers refuse to attend Mass at the Catholic church because the shadow of Dracula's castle touches it. To bring to an end the villagers' fears, Mueller climbs to the castle to exorcise it.The terrified priest follows only partway up the mountain, and Mueller continues alone. As he exorcises the castle, attaching a large metal cross to its gate, a thunderstorm occurs. The priest flees, stumbles, and is knocked unconscious when his head strikes a rock. The blood from the head wound trickles into a frozen stream through a crack in the ice, and onto the lips of Count Dracula, reviving him. Mueller returns to the village, reassures the villagers, and returns to his home city of Kleinenberg where he lives with his widowed sister-in-law, Anna (Marion Mathie).Unknown to Mueller, Dracula takes control of the priest. Furious that his castle is now barred to him, Dracula forces the enslaved priest to reveal the name of the exorcist. The priest desecrates a coffin to provide a sleeping place for the Count, and leads Dracula to Kleinenberg, where the Count takes his revenge on the Mueller's beautiful niece, Maria (Veronica Carlson). Dracula enslaves Zena the tavern girl (Barbara Ewing). Zena almost succeeds in bringing Maria under Dracula's power, but Maria's boyfriend Paul (Barry Andrews), who lives and works in the bakery beneath the tavern, rescues her. Dracula punishes Zena by killing her. Dracula orders the priest to burn Zena's corpse in the bakery ovens before she turns into a vampire. The priest then helps Dracula locate Maria. Dracula climbs over the rooftops of nearby buildings, enters Maria's room, and bites her.Mueller enters Maria's room just after Dracula has bitten the girl and pursues a fleeing figure across the rooftops. He is knocked down by the priest. Paul (also in pursuit of the attacker) discovers Mueller, who with his dying breath begs Paul to help. Paul enlists the priest. Unable to break free from Dracula's influence, the priest attacks Paul one night as they watch over Maria. Paul defeats the priest, and forces him to lead the way to Dracula's lair. They try to stake Dracula through the heart, but the faithless priest and the atheist Paul cannot complete the rite. They believe Dracula is dead, but the Count wakes after they leave and removes the stake himself. He kidnaps Maria and flees to Castle Dracula, pursued by Paul and the priest.At the castle, Dracula orders Maria to remove the cross from the door. She throws it over the parapet into the ravine below. Paul fights Dracula on the parapet and throws him over the side. Dracula is impaled on the cross. The priest, freed from the vampire's influence, recites the Lord's Prayer and Count Dracula perishes, dissolving into dust. Reunited with Maria and having regained his Christian faith, Paul crosses himself while viewing Dracula's remains.","music_by":"James Bernard","edited_by":"Spencer Reeve","written_by":"Anthony Hinds"}