{"based_on":"The Hundred and One Dalmatians by Dodie Smith","country":"United Kingdom United States","distributed_by":"Buena Vista Pictures Distribution, Inc.","screenplay_by":"John Hughes","Plot":"American video game designer Roger Dearly (Jeff Daniels) lives with his pet dalmatian, Pongo, in London. One day, Pongo sets his eyes on a beautiful female dalmatian named Perdita. After a frantic chase through the streets and into St. James's Park, Roger and Pongo discover that Perdita likes Pongo. Her owner, Anita Campbell-Green (Joely Richardson), falls in love with Roger when they meet. After they both end up falling into the lake as a result of their dogs, they return to Roger's home, and Anita accepts his proposal. They get married along with Perdita and Pongo.Anita works as a fashion designer at the House of de Vil. Her boss, the pampered and very glamorous Cruella de Vil (Glenn Close) has a deep passion for fur, going so far as to have a taxidermist, Mr. Skinner, skin a white tiger at the London Zoo to make into a rug for her. Anita, inspired by her dalmatian, designs a coat made with spotted fur. Cruella is intrigued by the idea of making garments out of actual dalmatians and finds it amusing that it would seem as if she was wearing Anita's dog.Anita soon discovers that Perdita is pregnant, and is then informed that she is too, much to her shock. Some time later, Cruella visits their home, and expresses contempt upon meeting Roger. Her initial disgust at them having a baby turns to excitement when she finds out Perdita is expecting too. Several weeks later, she returns when a litter of 15 puppies are born and offers Roger and Anita £7,500 for them, but they refuse. She dismisses Anita and vows revenge against her and Roger. She has her henchmen, Jasper and Horace (Hugh Laurie and Mark Williams) break into their home and steal the puppies while Roger and Anita are gone for a walk at the park taking Pongo and Perdita with them. Along with 84 others that were previously stolen, they deliver them to her ancient country estate, De Vil Mansion. She also hires Mr. Skinner to kill and skin them to create her coat.With the family devastated at the loss of their puppies, Pongo uses the Twilight bark to carry the message via the dogs and animals of London, while Roger and Anita notify the Metropolitan Police Service. A dog who had witnessed the stolen puppies follows Jasper and Horace to the mansion, and finds all of them inside before helping them escape under the duo's noses. They make their way to a nearby farm, where they are later joined by Pongo and Perdita. Cruella arrives at the mansion and soon discovers what has happened. Furious, she decides to carry out the job herself, whilst Jasper and Horace attempt to search for them also.After several mishaps, Jasper and Horace discover nearby police on the hunt for Cruella and her henchmen and hand themselves in, joining Mr. Skinner who was beaten earlier while trying to kill Lucky, who had been left behind. Meanwhile, Cruella tracks the puppies to the farm where they are hiding and tries to retrieve them. However, they outwit her and cause her to fall into a vat of molasses and get thrown through a window into a pigpen. Shortly after, the fleeing dalmatians (including Lucky) are found and sent home via the Suffolk Constabulary, while those looking for Cruella arrive at the farm to arrest her. In the police van, she belittles Jasper, Horace, and Skinner for their incompetence before they are sprayed by a skunk which she had mistaken for her bag. Pongo, Perdita, and their puppies are reunited with Roger and Anita. After being informed that the remaining 84 puppies have no home to go to since they have not been claimed, they decide to adopt them, bringing the total to 101. Roger designs a successful video game featuring dalmatian puppies as the protagonists and Cruella as the villain, and they move to the English countryside with their millions.","Spin-off":"On September 30, 2013, The Hollywood Reporter confirmed a live-action Cruella de Vil film titled Cruella is in development by Disney.[15] Screenwriter Aline Brosh McKenna most known for writing The Devil Wears Prada was set to write it for Disney, with Andrew Gunn as producer.[16] Glenn Close will be executive producer.[citation needed] On January 6, 2016, The Hollywood Reporter announced that Kelly Marcel, who wrote the script for Saving Mr. Banks and Fifty Shades of Grey will instead write the film, while Emma Stone was in talks for the role.[17] On April 25, 2016, it was confirmed that Stone accepted the role.[18]","language":"English","Release and reception":"The UK première of the film was held on 4 December at the Royal Albert Hall, London and the exterior of the Hall was lit with dalmatian spots. It performed very well at the box office, earning $136,189,294 in the United States and $320,689,294 worldwide.[9][10]The film received generally mixed reviews : on review aggregate Rotten Tomatoes, it has a \"rotten\" rating of 39%, with an average rating of 5.4 out of 10 from 33 reviews, with a lot of criticisms devoted towards its plot and use of slapstick humour (akin to Hughes' Home Alone films and his later Disney remake, Flubber, a year later). However, along the essential faithfulness of the original classic, Close's performance as Cruella de Vil was universally praised.[11]Animal rights organizations protested the film's release, noting that after the premiere, Dalmatian sales shot up, due to children asking for one after seeing the film with their parents. Dalmatians, however, are difficult dogs to take care of, and many were eventually dropped off at pounds and put down.[12]","box_office":"$320.6 million[2]","cinematography":"Adrian Biddle","production_company":"Walt Disney Pictures Great Oaks Productions","directed_by":"Stephen Herek","Video game":"A video game based on the film entitled, 101 Dalmatians: Escape from DeVil Manor was released in 1996.","release_dates":"November 27, 1996 (1996-11-27)|||||","Production":"The role of Cruella had been previously offered to Sigourney Weaver (Close took it after finishing her run in the musical Sunset Boulevard). Cathy Moriarty was briefly considered for the role, but was later deemed too frightening for a children's film after doing a screen test.[6] The animatronic creatures used in the film are provided by Jim Henson's Creature Shop.[7]Minster Court was used as the exterior of Cruella De Vil's fashion house.[8] Sarum Chase was used as the exterior of her home.[8]","Home media releases":"The film was released on VHS for the first time on May 6, 1997,[13] and on DVD on December 12, 2000.[14] Due to the high sales of the One Hundred and One Dalmatians Platinum Edition DVD, Disney re-released it on September 16, 2008, in the U.S., along with its sequel, 102 Dalmatians, and that to the original 1961 animated version, 101 Dalmatians II: Patch's London Adventure.101 Dalmatians was re-released on DVD and is part of the 4-Disc Special Collector's Edition line along with Who Framed Roger Rabbit, All Dogs Go to Heaven, and The Rescuers Down Under.","101_dalmatians":"Theatrical release poster","produced_by":"John Hughes Ricardo Mestres","starring":"Glenn Close Jeff Daniels Joely Richardson Joan Plowright Hugh Laurie Mark Williams John Shrapnel","running_time":"103 minutes","Sequel":"A sequel, 102 Dalmatians, taking place three years after the first film's events was released on November 22, 2000. The film's early working title was 101 Dalmatians Returns. It received mostly negative reviews from critics,[citation needed] but was a commercial success.[citation needed]","music_by":"Michael Kamen","edited_by":"Trudy Ship","budget":"$75 million[1]"}