{"based_on":"The stage play by Harry Kurnitz L'Idiote by Marcel Achard","country":"United States","distributed_by":"United Artists","screenplay_by":"Blake Edwards William Peter Blatty","Plot":"Inspector Clouseau (Peter Sellers) is called to the country home of millionaire Benjamin Ballon (George Sanders) to investigate the murder of his chauffeur Miguel Ostos. The chauffeur was having an affair with one of the maids, Maria Gambrelli (Elke Sommer) and attacked her in her bedroom after she broke off with him. Miguel was shot and killed in her bedroom and Maria was found with the smoking gun in her hand, but claims no knowledge of how it got there as she maintains she was knocked unconscious. All evidence points to Maria as the killer, but Clouseau is convinced of her innocence because he has developed an immediate attraction to her. Realizing Clouseau has been inadvertently assigned to a high profile case, Commissioner Dreyfus (Herbert Lom) has him removed and personally takes charge of the investigation.Dejected, Clouseau returns home. He is awakened in the early hours of the morning by an apparent attempt on his life by a Chinese assassin. When the phone rings, the life or death struggle ceases and it becomes apparent his assailant is his valet, Cato (Burt Kwouk), to whom Clouseau has given instructions to attack him when he least expects it to keep his senses sharp. The Inspector is reinstated to the Ballon case and immediately orders Maria Gambrelli's release from prison, as he is convinced she is shielding the real killer, who Clouseau suspects is Ballon himself.A series of additional murders of the Ballon staff follows. Each time the evidence points to Maria, who is continually arrested, only to have Clouseau release her again despite the growing number of murder charges laid at her feet. Clouseau's actions embarrass the Surete in the press, but Commissioner Dreyfus is unable to remove him from the case because Ballon has exerted political influence to keep the unorthodox and seemingly incompetent detective assigned to the investigation. As Clouseau continues to bungle the case, Commissioner Dreyfus becomes increasingly unhinged and suffers a nervous breakdown that reduces him to a delusional psychotic. He stalks Clouseau in order to assassinate him, but accidentally kills a series of innocent bystanders instead and adds further notoriety to the case.When Clouseau confronts the Ballon household to unmask the murderer, it is revealed that Ballon, his wife (Tracy Reed), and three members of the staff are all guilty, as each of them has killed at least one earlier victim due to crimes of passion or subsequent blackmail attempts. Only Maria is innocent of any crime. As a massive row breaks out between employers and staff, the lights are cut, and the guilty take the opportunity to pile into Clouseau's car and escape. They are all killed when the car is destroyed by a bomb set by Commissioner Dreyfus. Having witnessed the explosion, Dreyfus is reduced to an animalistic fury and is taken away. Clouseau and Maria celebrate the clearing of her name with a long and passionate kiss - which is swiftly interrupted by another sneak attack by Cato.","language":"English","Reception":"The movie was one of the 13 most popular films in the UK in 1965.[5]The film was well received by critics. As of September 2012[update], it has 93% favourable reviews on review aggregator Rotten Tomatoes out of 29 reviews counted. The average rating given by critics is 8 out of 10.[6]","box_office":"$12,368,234[1]","cinematography":"Christopher Challis","production_company":"The Mirisch Corporation","directed_by":"Blake Edwards","a_shot_in_the_dark":"Theatrical release poster","Awards and honors":"American Film Institute recognition","release_dates":"June 23, 1964","Production":"Sellers was attached to star in the adaptation of Harry Kurnitz's Broadway hit before the release and success of The Pink Panther, but was not pleased with the script by Alec Coppel and Norman Krasna. Walter Mirisch approached Blake Edwards and asked him to take over as director of A Shot in the Dark from Anatole Litvak. Edwards declined initially, but eventually relented under pressure on the condition he could rewrite the script and substitute Inspector Clouseau for the lead character and choreograph comic scenes on the fly as he and Sellers had successfully done for their previous film.[3] The relationship between Edwards and Sellers deteriorated to such a point that at the conclusion of the film they vowed never to work together again. They eventually reconciled to collaborate successfully four years later on The Party, and on three more \"Pink Panther\" films in the 1970s.As with most of the other Clouseau films, A Shot in the Dark featured an animated opening titles sequence produced by DePatie-Freleng Enterprises featuring an animated version of Inspector Clouseau. This film and Inspector Clouseau are the only Clouseau films not to feature the Pink Panther character in the opening titles. Henry Mancini's theme for this film serves as opening theme and incidental music in The Inspector cartoon shorts made by DePatie-Freleng from 1965 to 1969.Fran Jeffries sang the song \"Shadows of Paris\" (lyrics by Robert Wells). She also sang the song called \"Meglio Stasera (It Had Better Be Tonight)\" in the film The Pink Panther.[4]","produced_by":"Blake Edwards","starring":"Peter Sellers Elke Sommer George Sanders Herbert Lom","running_time":"102 minutes","music_by":"Henry Mancini","edited_by":"Bert Bates Ralph E. Winters"}