{"country":"United Kingdom","distributed_by":"Eagle-Lion Films (UK) United Artists (US)","Plot":"In this philosophical coming-of-age film, an aging Julius Caesar takes possession of the Egyptian capital city of Alexandria, and tries to resolve a feud between young Princess Cleopatra and her younger brother Ptolemy. During the resulting sometimes-murderous court intrigues, Caesar develops a special relationship with Cleopatra, and teaches her how to use her royal power.","language":"English","Reception":"According to trade papers, the film was a \"notable box office attraction\" at British cinemas.[10]The film earned US$1,363,371 in the United States, making it one of the most popular British films ever released there.[11] It did however fall short of initial expectations.[12]Variety estimated that Rank lost $3 million on the film.[3]","box_office":"$2,250,000 (US rentals)[4] 815,007 admissions (France)[5] $1.4 million (UK)[3]","cinematography":"Jack Hildyard","production_company":"Gabriel Pascal Productions","directed_by":"Gabriel Pascal","release_dates":"1945 (UK) 1948 (France)","Production":"Filmed in Technicolor with lavish sets, the production was reported to be the most expensive film ever made in Britain at the time, coming to £1,278,000.[8]Pascal ordered sand from Egypt to get the right cinematic color. The production also ran into delays due to being filmed during the Second World War.[9] During the shoot, Vivien Leigh tripped and miscarried.[1]The film was described as a \"box office stinker\" at the time, and almost ended Pascal's career. It was the first Shaw film made in colour, and the last film version of a Shaw play during his lifetime. After Shaw's death in 1950, Pascal went on to produce one more Shaw derived film, Androcles and the Lion (1952).","produced_by":"Gabriel Pascal","starring":"Claude Rains Vivien Leigh","running_time":"123 minutes","caesar_and_cleopatra":"Theatrical release poster","music_by":"Georges Auric","edited_by":"Frederick Wilson Joan Warwick","written_by":"George Bernard Shaw","budget":"$5.2 million[1] or £1.3 million[2][3]"}