{"based_on":"A Farewell to Arms  by Ernest Hemingway","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Ben Hecht","Plot":"Frederick Henry (Rock Hudson) is an American officer serving in an ambulance unit for the Italian Army during World War I. While recovering from a wound in a British base hospital in northern Italy, he is cared for by Catherine Barkley (Jennifer Jones), a Red Cross nurse he had met earlier, near the front, and they engage in an affair. Frederick's friend, the doctor, convinces the army that Frederick's knee is more severely wounded than it actually is and the two continue their romance but never get married.Catherine discovers she is pregnant but after sneaking alcohol into the hospital for Frederick, the head nurse Miss Van Campen (Mercedes McCambridge) discovers the duplicity and separates them. She informs Frederick's superiors that he has fully recovered from his wounds and is ready for active duty. During their separation, Catherine comes to believe Frederick has abandoned her.Following the Battle of Caporetto, Frederick and his close friend Major Alessandro Rinaldi (Vittorio De Sica) assist the locals in fleeing the invading German/Austrian armies. Along the forced march, several people die or are left behind due to exhaustion. When the two ambulance drivers are finally able to report to a local army base, the commandant assumes they are both deserters from the front. Rinaldi is executed by the Italian military; enraged, Frederick knocks out the kerosene lamps and flees, jumping into the river.Wanted by the Italian army, Frederick evades capture and meets up with Catherine. They flee Milan to hide out on a lake on the Italian-Swiss border (Lake Lugano or Lake Maggiore). Fearing arrest by the police, Catherine persuades Frederick to flee to Switzerland by rowboat; after some adventures, they land successfully in Switzerland. Claiming to be tourists trying to evade the war, the two are allowed to remain in neutral Switzerland. Catherine's pregnancy progresses but due to the conditions around them, the pregnancy becomes complicated and Catherine is hospitalized. Their child is stillborn, and Catherine dies shortly afterward. Frederick leaves, shocked, and wanders the empty streets.","language":"English","Reception":"Hemingway's intuition proved correct as A Farewell To Arms opened to low box office receipts and harsh negative reviews after it premiered in 1957. The film would be forgotten by the moviegoing public as an epic in later years. In his review in The New York Times, Bosley Crowther noted, \"Mr. Selznick's picture . . . lacks that all-important awareness of the inescapable presence and pressure of war. That key support to the structure of the theme has been largely removed by Ben Hecht's script and by a clear elimination of subtle thematic overtones . . . [it] is a tedious account of a love affair between two persons who are strangely insistent upon keeping it informal . . . as a pure romance . . . it has shortcomings. The essential excitement of a violent love is strangely missing in the studied performances that Rock Hudson and Jennifer Jones give in the leading roles. Mr. Hudson is most noticeably unbending, as if he were cautious and shy, but Miss Jones plays the famous Catherine Barkley with bewildering nervous moves and grimaces. The show of devotion between two people is intensely acted, not realized. It is questionable, indeed, whether Mr. Hudson and Miss Jones have the right personalities for these roles.\"[9]TV Guide calls it \"an overblown Hollywood extravaganza that . . . hasn't improved with age . . . the chief virtue of this hollow epic is the stupendous color photography of the Italian Alps . . . also enjoyable is Vittorio De Sica's inspired performance as the wily Maj. Rinaldi, but it's not enough to offset the flagrant overacting by Jones and the woodenness of Hudson.\"[10]Time Out New York describes it as an \"inflated remake\" with \"surplus production values and spectacle\" and adds, \"A padded Ben Hecht script and Selznick's invariable tendency to overkill are equally to blame.\"[11]In his review of the DVD release, Jeremiah Kipp of Slant Magazine awarded the film two out of a possible five stars and stated, \"To those willing to endure A Farewell To Arms: Don't be a hero! . . . We have David O. Selznick to blame for this bloated two-hour-plus Technicolor remake, announcing from the larger-than-life opening credits set against epic shots of sunsets, mountains, and valleys that he's aiming for another Gone with the Wind . . . without compelling lovers at the heart of his grand-scale love story, it's all just a meaningless protracted spectacle.\"[12]After this film, David O. Selznick left the movies completely, producing no other films.The movie earned an estimated $5 million in North American rentals[13] and by the end of 1958 had made worldwide rentals of $6.9 million.[2] Fox made some money on the movie but Selznick did not recover his costs.[2]Vittorio De Sica was nominated for the Academy Award for Best Supporting Actor but lost to Red Buttons for Sayonara.","box_office":"$20 million (worldwide)[2]","cinematography":"Oswald Morris","production_company":"Selznick International Pictures","directed_by":"Charles Vidor","Production notes":"For many years, David O. Selznick had wanted to film the Hemingway novel, but Warner Bros. owned the property and refused to sell it to him. He found himself in an advantageous bargaining position when Warner Bros. bought the remake rights to A Star is Born, to which he owned the foreign rights. Without them, the studio could not release their intended remake with Judy Garland overseas. Selznick offered to relinquish his rights to Star in exchange for the rights to Farewell, and Warner Bros. agreed.[4]On October 25, 1956, Selznick contacted director John Huston at the Blue Haven Hotel in Tobago and enthusiastically welcomed him to the project. He advised him his contract with 20th Century Fox called for severe financial penalties if the film went over schedule and/or budget, and urged him to concentrate wholly on the film until principal filming was completed.[5] Selznick's concerns increased as Huston began to tinker with the script and spend an inordinate amount of time on pre-production preparations, and on March 19, 1957, he sent the director a lengthy memo outlining the problems he foresaw arising from Huston's lack of cooperation.[6] Two days later, Huston announced he could not agree with Selznick on any of the issues he had raised and quit the project. Based on correspondence to Charles Vidor, it appears the producer's relationship with Huston's replacement was acrimonious as well.[7] The producer later said the film was \"not one of the jobs of which I am most proud.\"[8]The film was shot on location in the Italian Alps, Venzone in the Province of Udine in the region of Friuli-Venezia Giulia, Lazio, and Rome. It was budgeted at $4,353,000, and grossed little more than that.According to Carlos Baker's 1969 biography Ernest Hemingway: A Life Story, the Nobel Laureate was informed by Selznick that he would receive a $50,000 bonus from any profits the movie made. Unhappy at Selznick's nepotistic decision to cast his nearly 40-year-old wife as a character intended to be in her early 20s, he wrote back \"If, by some chance your movie, which features the 38-year-old Mrs. Selznick as 24-year-old Catherine Barkley, does succeed in earning $50,000, I suggest that you take all of that money down to the local bank, have it converted to nickels, and then shove them up your ass until they come out your mouth.\"","a_farewell_to_arms":"Theatrical release poster","release_dates":"December 14, 1957 (1957-12-14) (United States)|||||","produced_by":"David O. Selznick","starring":"Rock Hudson Jennifer Jones Elaine Stritch","running_time":"152 minutes","music_by":"Mario Nascimbene","edited_by":"John M. Foley Gerard Wilson","budget":"$4,100,000[1] or $4,353,000[2]"}