{"country":"United States","distributed_by":"New Line Cinema","Plot":"The film begins on a prison set on an asteroid, from which a group of 'Crites' are set to be transported to another station. When the Crites kill two guards and injure three, hijack a ship from the station, and escape, the commander of the station hires two shape-changing bounty hunters to pursue them.On Earth, the Brown family are living in a rural Kansas town: the father, Jay; the mother, Helen; the teenage daughter, April; and the son, Brad, who keeps company with mechanic Charlie McFadden. When he and Brad are outside, shooting off homemade fireworks and playing with Brad's slingshot, Charlie accidentally hits April with a slingshot pellet, and Brad assumes the blame on himself to protect his friend (one of his apparent only friends throughout the movie). When on the roof later, Brad mistakes the Crites' spaceship for a meteorite. The ship thereafter lands, causing the ground to shake. Investigating, Jay discovers Brad in a tree, and allows him to come along.Devouring the majority of a cow, the Crites are interrupted by Jay and Brad's discovery of the carcass. The Crites thereafter consume a police officer, and later approach the farm and cut its electrical connection. Jay, Helen, and Brad go to check the circuit breaker, and Jay is attacked by one of the Critters. The Critters reveal they can shoot quills laced with a fast acting venom that tranquilizes their targets, rendering the limb or body temporarily numb or useless, and hit Jay in the right leg with one as his family struggles to pull him out of the basement. In the barn, April is attempting sexual intercourse with her boyfriend Steve when he is killed by the Crites, and Brad then kills one of them by tricking it into eating a cherry bomb firecracker he had in his pocket. Meanwhile, the two bounty hunters search the town, causing a ruckus at the town church, and then the local bowling alley. They are later recruited by Brad.The Critters return to their ship when the bounty hunters arrive, with their leader having kidnapped April, and start the ship up to fly away and escape the bounty hunters as well as firing the ships weapons to destroy the family's house out of pure malice; only then do they realize that Charlie and Brad were able to get April out of the ship before it took off, and Brad has thrown a homemade bomb made from Charlie's bottle of whiskey into the ship, causing a fire which lights off both the homemade bomb and the additional fuel the ship was carrying, the explosion supposedly killing all the Critters. The bounty hunters leave in their ship after giving Brad a hand held device that they say to \"call them\" by, and also by which the family's house is restored. At the very end, Critter eggs can be seen in the barn inside a chickens nest that seem to be ready to hatch.","language":"English","Reception":"According to Rotten Tomatoes, 57% of reviewers gave the film a positive review.[5]","critters":"Theatrical release poster","box_office":"$13,167,232 (US)[1]","cinematography":"Tim Suhrstedt","directed_by":"Stephen Herek","Web series":"Warner Bros. have announced their plans to produce a web series based on the Critters franchise.[6]","release_dates":"April 11, 1986 (1986-04-11)|||||","produced_by":"Robert Shaye","starring":"Dee Wallace-Stone|M. Emmet Walsh|Billy Green Bush|Scott Grimes|Nadine Van der Velde|Don Opper|Terrence Mann|","running_time":"82 minutes","music_by":"David Newman","edited_by":"Larry Bock","Release":"The film was released theatrically in the United States by New Line Cinema in April 1986. It turned out to be a modest hit for the company, grossing $13,167,232 at the box office.[1]The film was released on VHS and laserdisc by RCA/Columbia Pictures Home Video the same year. In September 1997, New Line Home Video re-released the film on VHS.In 2003, New Line Home Entertainment released the film on DVD. The film's distribution rights were transferred to Warner Bros. in 2008. The film was re-released in a set containing all 4 Critters films on DVD by Warner Bros. in 2010.","written_by":"Stephen Herek Domonic Muir Don Keith Opper","budget":"$2 million"}