{"country":"United States","distributed_by":"Relativity Media","21_&_over":"Theatrical release poster","Plot":"Friends since high school, Casey and Miller are both over 21 and want to take their best friend Jeff Chang out for his 21st birthday. Jeff insists he can't, citing the important medical school interview he has to be ready for at 8am the next morning. Miller threatens to make a lot of noise, keeping Jeff up all night, if he refuses to come out. Jeff eventually accepts, but only for one drink.At the bar, Jeff accidentally hits a boy named Randy with a dart. Randy gets aggressive, and the trio have to flee, which interrupts a nice chat that Casey is having with a girl named Nicole. Excited that he is now allowed to enter bars, Jeff drinks too much and becomes unresponsive. Casey and Miller decide to take him home, but they cannot remember where he lives. Because Nicole knows Jeff, they attempt to find her to ask her where he lives. They sneak into the sorority house that they think Nicole lives in, but it is the wrong house, and is instead filled with Latina students.Along the way, they encounter two blindfolded women preparing to be paddled as part of their sorority initiation ritual. Miller has the women make out with each other, but they and the other women of the house are furious when they discover the intrusion. Once again, the boys have to flee, and Casey and Miller throw Jeff from a balcony onto a pool cover in order to escape. Jeff bounces off the cover into a rose garden, and the two worry that they killed him. They find him uninjured. Surprisingly, he is still willing to party.They finally find Nicole, but she does not know Jeff's address, and instead refers them to her boyfriend, who turns out to be Randy, the boy whom Jeff had hit with a dart earlier. Randy refuses to look up the address in his phone, so Miller threatens him (using a gun that they found in Jeff's pocket), trying to steal the phone. Miller shoots into the air, panicking a buffalo and prompting it to attack people, including Randy. At the address taken from Randy's phone they discover that Jeff no longer lives there, and that there is a party being thrown. They join in on party games in order to access a boy who may know Jeff's current address. The party games include a drinking game against a group of Serbian party-goers.When they finally find the boy who may know Jeff's address, they are disappointed to discover that he does not actually know it. They leave Jeff in the care of two stoners who undress him for fun, write \"Douchebag\" on his forehead, dress him in a lacy bra and glue a teddy bear to his penis. After leaving the party, Jeff goes out on the street still naked except for the teddy bear and the bra. Casey and Miller go after him to get him dressed, but he evades them and is apprehended by the police after running atop several cars and being a public disturbance. Casey and Miller go to the campus police station where they are told that Jeff has been transferred to the psychiatric unit. A woman offers to escort them to the hospital, but it is actually a trap set by the Latina sorority. They take revenge on Casey and Miller, who leave with buttocks branded and bruised by spanking. They have to walk across campus wearing nothing but socks on their penises until they get new clothes. In the mental health facility, Casey and Miller ask if they can take Jeff home, but the hospital refuses citing that Jeff is on a 24-hour hold. Instead, they smuggle him out the window throw him atop a car from the third floor. They worry that they killed him again, but somehow Jeff avoids injury. Awakened by the fall, Jeff steals the car on which he has landed (which turns out to be Randy's). The three boys flee with Jeff driving recklessly. During their reckless driving, police catch up to their tail but the trio manage to evade the police with Jeff steering the car over an overpass. Miraculously, they land without injury.The boys finally arrive to Jeff's apartment with minutes to spare to get him ready for his medical school interview. They pull the teddy bear off (accidentally circumcising him in the process), shower and dress him. Randy goes to Jeff's home to destroy the room, but Jeff's father arrives and apprehends him. Encouraged by Casey and Miller, Jeff confesses to his father, who pressured him into going to medical school, that he does not actually want to. His father cannot accept this, so Miller hits him. Randy admires Jeff for standing up to his father, and the two reconcile.Three months later, Miller, who is intelligent but lazy, improves his grades and wants to go to university. The night before his admissions interview, he is at a music festival with Casey, Nicole (who is now dating Casey), and Jeff. He has a wild night and arrives to the professor's office with red hair, a broken leg, and a coroner's uniform profusely apologizing for his current state. The professor turns out to be the \"Chief\" that they repeatedly saw dancing alone in the street on the night of Jeff's 21st birthday.","language":"English","Reception":"The film opened on 2,771 screens and grossed $8.7 million during its opening weekend. It took in a $45.5 million worldwide total.[3]21 & Over has received negative reviews from critics. Review aggregation website Rotten Tomatoes gives a 27% rating based on 97 reviews, with the site's consensus stating: \"Though it strives to mimic The Hangover, 21 & Over is too predictable, too unabashedly profane, and too inconsistently funny to carry the torch.\"[8] On Metacritic, the film holds a 34% rating, indicating \"generally unfavorable\" reviews.[9]Relativity Media has been criticized by civil rights advocates for shooting part of the comedy 21 & Over in the city of Linyi, Shandong province in China, and choosing to ignore the area's bleak human rights records, notably the treatment suffered by activist lawyer Chen Guangcheng, who was being held under house arrest in a nearby village.[10]","box_office":"$48.1 million[3]","cinematography":"Terry Stacey","production_company":"Virgin Produced Mandeville Films SkyLand Entertainment","directed_by":"Jon Lucas Scott Moore","release_dates":"March 1, 2013 (2013-03-01)[1]|||||","Production":"Jon Lucas and Scott Moore had worked together previously as writers on multiple films, including The Hangover, The Change-Up and Ghosts of Girlfriends Past.Principal photography was scheduled to begin on September 22, 2011, at the University of Washington.[5][6] Key scenes were filmed in Lewis Hall, the University of Washington Medical Center, the Ave, the Greek fraternities and sororities on 17th Ave NE, and Red Square. The music festival scene was filmed at The Gorge Amphitheatre, which is located in George, Washington. The film was released on March 1, 2013.For the version of the film shown in China, the directors included additional scenes in the beginning and at the end of the film. The Chinese-American lead is changed to a Chinese student who briefly transfers to an American college. According to Jon Lucas, the Chinese version will be about \"a boy who leaves China, gets corrupted by our wayward, Western partying ways and goes back to China a better person.\"[7]","produced_by":"David Hoberman Ryan Kavanaugh Todd Lieberman","starring":"Justin Chon Miles Teller Skylar Astin Sarah Wright","running_time":"93 minutes[2]","Connection to Documentary film Twinsters":"Samantha Futerman acts in the film and appears in the trailer. Anaïs Bordier a French student studying in London, who like Futerman was born in South Korea and adopted as a baby, saw the trailer on YouTube and struck by the striking resemblance between herself and the actor both physically and in their mannerisms researched further. After discovering that the two of them also shared a date of birth she reached out to Futerman via facebook and the documentary Twinsters covers their journey of exploration of a new start in life as identical twins separated at birth and raised on separated continents.","music_by":"Lyle Workman","edited_by":"John Refoua","written_by":"Jon Lucas Scott Moore","budget":"$13 million[3]"}