{"based_on":"Dragon Ball  by Akira Toriyama","Development and production":"Early in July 2012, Weekly Shōnen Jump's official website had already opened a teaser page with a countdown to a \"surprise\" on Saturday, July 14, the release date of its 33rd issue of the year. On July 14, the magazine and website, now changed to show Shenlong appearing and then disappearing, revealed some minor information of the upcoming film; including the premiere date, staff information, and companies involved in the production (Fox International Productions Japan, Shueisha, Fuji TV, Toei Animation, Bandai, Bandai Namco Games, and Bird Studio). The film's director is Masahiro Hosoda, who directed several Dragon Ball Z episodes back in 1992, the screenplay was written by Yūsuke Watanabe, who has written manga adaptations before (namely the 20th Century Boys and Gantz live-action films), and the lead animation director is Tadayoshi Yamamuro, who has worked on the series since the Dragon Ball anime.[5]The magazine and official website also published a comment by Akira Toriyama about the movie. The Dragon Ball series creator notes that the adaptation will mark the first time he has been so deeply involved in the production of an anime, in this case as early as the screenwriting stages. Toriyama also said that the film will retain the atmosphere of the original while adding small amounts of modern flavor.[5] Toei Animation released a press statement on July 17, 2012, saying it would be set \"between the animation series Z and GT, or in other words from the blank decade between the end of the battle with Majin Boo in chapter 517 of the manga and chapter 518\" and calling it part of \"the official history of Dragon Ball.\"[6]In September, it was announced that the film was one of four that year, and the only animated one, to receive money from the Japanese government as part of the non-profit organization UNIJAPAN's \"Co-production Certification Program\".[7][8] Toei received 50 million yen (roughly US$636,000) from the Agency for Cultural Affairs, whose aim is to promote Japanese arts and culture, with the United States named as the film's partner country.[7][8]This time in particular, we had a request from sensei to leave in not only the action, but also some truly enjoyable... the truly enjoyable aspects of Dragon Ball; Dragon Ball's chaotic feeling, and the action of Gohan's battles and of the Z Fighters are mixed together very well, so I believe that has also helped make it an enjoyable movie.The December issue of Ultra Jump elaborated on Toriyama's involvement in the movie, stating he came up with the movie's story and character designs.[9] On December 2, the official website was updated with the movies' cast and entire staff.[4] The following day, a brief introduction to the film's story was leaked from accessing an unlinked section of the website.[4]In January 2013, it was announced that Olympic gold medalist in judo Kaori Matsumoto and singer/tarento Shoko Nakagawa will have roles in the film.[10] Nakagawa is a well-known otaku and Matsumoto is a fan of the series as well.[10] Matsumoto voices a policewoman modeled after herself, while Nakagawa plays the Yogen-gyo (予言魚) who first leads Beerus to Goku.[10] The Fuji TV announcer Shin-ichi Karube also has a small part in the movie.The April issue of V Jump teased about a new Super Saiyan transformation being in the film, titled \"Super Saiyan God\" (超サイヤ人ゴッド, Sūpā Saiya-jin Goddo), saying: 39 years ago, the Oracle Fish told Beerus that the Super Saiyan God would appear before him. And that this is the beginning of the movie's story.[11] In Weekly Shōnen Jump issue #14 of 2013, Toriyama said that the plot for Battle of Gods began two years ago with ideas for the God of Destruction and Super Saiyan God, and that he got deeply involved in the story in order to keep it in-line with the series' original tone so kids could enjoy it.[12] In the following week's issue, he revealed that Beerus' design is based on a cat and his clothes based on Egyptian garments.[13]A live greeting by cast members and Toriyama, followed by a preview screening of the film took place across Japan on Tuesday, March 12, 2013, with a limited number of attendees determined from a Jump lottery. The lottery tickets were included in 22 different Shueisha magazines (including Weekly Shōnen Jump, V Jump, Jump SQ, and Ultra Jump) and 884 pairs (1768 people) were invited. There were five screenings, all the same day and at 6:30 p.m: Shinjuku Wald 9 cinema in Tokyo (428 people), Umeda Burg 7 theater in Osaka (440 people), 109 Cinemas in Nagoya (256 people), T-Joy Hakata in Fukuoka (322 people), and Sapporo Cinema Frontier in Sapporo (322 people).[14] The special cast greeting at the Tokyo venue was beamed live to the other locations before the screening.[15] A second preview screening with an on-stage greeting and a special guest took place at Differ Ariake Arena on March 16, 2013, with 250 pairs (500 people) invited (determined with lottery tickets included in V Jump, Weekly Shōnen Jump, and Saikyō Jump).[15]The music in Battle of Gods was composed by Norihito Sumitomo. Its theme song is a cover of Hironobu Kageyama's \"Cha-La Head-Cha-La\", the original opening theme of Dragon Ball Z, by the rock band Flow.[16] The band members commented that they were excited about the opportunity as they have been fans of the series since they were in elementary school.[16] The cover and the film's insert song, \"Hero ~Song of Hope~\" (HERO~希望の歌~, Hīro ~Kibō no Uta~), were released as a double A-side single on March 20, 2013.[17] It reached number 24 on the Oricon Weekly Singles Chart.[18] The film's original soundtrack, containing 43 tracks, was released on March 27, 2013.[19] Due to licensing agreements, the international editions of the film use English-language versions of Flow's \"Cha-La Head-Cha-La\" and \"Hero ~Song of Hope~\".The music to the trailers in Japan was composed by Immediate Music whom specialize in providing trailer music for films, such as Avatar, the Matrix films and the Harry Potter films.[20] The trailers use the pieces \"Prologue to Conquest\" (Trailerhead: NU EPIQ) and \"Emergence of Empires\" (Trailerhead: Saga), both composed by Yoav Goren with the latter based on \"Conquest of Kingdoms\" from Epic Choral Action #1 and \"Rising Empires\" from Themes for Orchestra & Choir 2: Abbey Road respectively. Pfeifer Broz. Music supplied \"Evil Island\" for Funimation's promotions and trailers in North America.","country":"Japan","distributed_by":"Toei Company 20th Century Fox","screenplay_by":"Yūsuke Watanabe Akira Toriyama","Plot":"Whis (ウイス, Uisu) wakes Beerus, the God of Destruction (破壊神ビルス, Hakaishin Birusu), from his long slumber and tells him that Freeza was defeated by a Saiyan. Thirty-nine years earlier, the Yogen-gyo (予言魚) foretold that a mighty opponent would appear before Beerus, the Super Saiyan God (超サイヤ人ゴッド, Sūpā Saiya-jin Goddo). Beerus, with Whis, then tracks down the Saiyan warrior Goku, who defeated Freeza. On Kaiō-sama's planet, Goku proceeds to challenge Beerus, but ultimately is overwhelmed and defeated in two strikes; despite having powered up to Super Saiyan 3. Disappointed by the subsequent lack of challenge, Beerus departs in order to seek out more powerful adversaries on Earth.Beerus' arrival interrupts Bulma's 38th birthday party. Vegeta, who already knew about Beerus, because of a warning from Kaiō-sama, casts his pride aside in order to put Beerus in a good mood. Meanwhile, Pilaf, Mai, and Shu sneak into the party in order to steal the Dragon Balls, but are not recognized as they have been turned into children; before the events of the film, they gathered all the Dragon Balls themselves and wished for youth, but Shenlong made them a little too young. Discovering the three of them, Trunks mistakes Pilaf for a monkey and fibs to Goten that Mai is his girlfriend, which leads to the trio being brought in front of the party-goers. When Mai accidentally drops the Dragon Ball she stole, she takes Trunks hostage, but no one seems concerned. A drunk Gohan dares Mai to shoot him; he deflects the bullets with one finger, but one of them hits Videl's leg and another one hits Beerus' forehead. Dende heals Videl and discovers that she is pregnant with Gohan's child. Videl has been hiding the fact to surprise Gohan later and they do not reveal it to the others yet. When Beerus asks Mr. Boo for one or two of the puddings he has, Boo eats all of them, angering the God of Destruction who decides to destroy the Earth. Boo, Android 18, Tenshinhan and Piccolo attempt to fight Beerus, but are easily defeated. Gohan powers up and attacks Beerus only to be taken down by a heavy kick. Vegeta tries his hand at defeating Beerus, but he is also taken down. Goten and Trunks fuse into Gotenks and attempt to fight Beerus but are quickly defeated as well.Bulma becomes annoyed at the fighting ruining her birthday party and yells at Beerus before slapping him. When Beerus slaps her back, it sends Vegeta into a fit of rage, becoming even stronger than Goku, however, he is still defeated. Goku appears, having been watching Vegeta's fight and summons Shenlong to ask what a Super Saiyan God is. A Super Saiyan God once appeared on planet Vegeta to stop evil Saiyans, but failed because of the form's time limit. The dragon also reveals that they need the power of six pure-hearted Saiyans for one of them to reach the Super Saiyan God form. Goku transforms into a Super Saiyan God, a form far stronger than even the Super Saiyan 3, thanks to the power of himself, Vegeta, Gohan, Trunks, Goten, and Pan (from inside her mother Videl), fulfilling the prophecy once stated by the Oracle Fish. Goku confronts Beerus again and they wage an intense battle in space, right above planet Earth. The form gives Goku the power to resist Beerus, but he reverts to his regular Super Saiyan form due to its time limit. However, he learns the form's godlike feeling, which allows him to use some amount of Super Saiyan God power against Beerus. The two seem to be equally strong, but Beerus eventually decides to use his strongest attack. Goku stops the energy sphere, barely holding it back, but after Chi-Chi and Goku's friends appear in Goku's mind he is able to absorb the energy sphere and briefly transform into a Super Saiyan God once again. However, Goku is overwhelmed with exhaustion, and at Beerus' suggestion, finally admits defeat. Beerus recognizes Goku's effort and reveals that he was the second strongest person he had ever fought, after Whis, who is also his martial arts master and is even stronger than he is. Back on Earth, Beerus decides to spare the planet and takes his leave with Whis after bidding farewell to Goku and his friends, who return to Bulma's birthday party. It is revealed by Whis that Beerus only used 70% of his power while fighting Goku.","language":"Japanese","Release and reception":"Battle of Gods is the first-ever Japanese film to be screened at IMAX Digital Theaters, screening at all 16 IMAX Digital Theater locations across Japan.[40][41] However, it was not shown in 3D.[42]Madman Entertainment announced they had acquired the Australasian rights to the film and screened the movie at the 2013 Japanese Film Festival in Australia from October to December.[43] On May 30, 2014, Funimation announced that they had acquired the North American rights to the movie and gave the film a limited theatrical run in North America from August 5–7 and 9, 2014.[44] Funimation held a red carpet premiere for Dragon Ball Z: Battle of Gods in Los Angeles on July 3. The 8:00 p.m. red carpet and 9:00 p.m. screening was at the Regal LA Live Stadium 14 Theaters.[45] Madman screened Funimation's dub at a handful of Australasian theaters on August 30, 2014.[46] Manga Entertainment, the United Kingdom's distributor of the series, announced at the MCM Manchester Comic Con that they licensed the film and would give it a limited theatrical release, including an appearance at the 2014 Scotland Loves Anime convention.[47]In Latin America, the movie was released by Diamond Films during the last days of September and first days of October of 2013 (depending on the country) with almost every member of the original cast from the Mexican Spanish dub of the series. In Brazil, Battle of Gods was released by Diamond Filmes on October 11, 2013, with the original cast from the Brazilian Portuguese Dragon Ball Z dub.[48] In Italy the movie entered theaters on February 1, 2014.In Spain, the movie was released in theaters on May 30, 2014 in Castilian Spanish, Catalan and Basque languages, with the former bringing back almost every member of the original cast from the Castilian Spanish Dragon Ball Z dub while the latter two feature the respective Catalan and Basque voice casts from Dragon Ball Kai (the Catalan voice cast also being essentially the same one from Dragon Ball Z). The extended version home release also featured a Valencian dub with almost every member of the original cast from the Valencian Dragon Ball Z dub.In Philippines, the movie was released subtitled in English by Pioneer Films during the month of April 2013, making it the second Dragon Ball film to be shown in the country. The Filipino dub of the movie will be released on January 4, 2015 by ABS-CBN TV Network.Dragon Ball Z: Battle of Gods opened at number one in the Japanese box office, earning US$7,307,760 with 561,098 tickets sold in its first two days.[49][50] The movie's showings at all 16 of the IMAX Digital theaters in Japan that weekend earned US$450,000, with an average of US$28,000 per screen.[51] It was ranked number five in the overseas box office chart by Variety, making it the top-grossing non-American film on the chart.[51][52] While the top four films are playing in over 50 territories each, Battle of Gods' performance is based only on 328 screens in Japan.[52] By its fifth day, the film had made over US$12,000,000 with 988,790 tickets sold.[53] As a result, the film was projected to sell more than 1 million tickets by its sixth day, making it the fastest film to reach that milestone so far that year in Japan.[53] It was number one in its second week as well, with a total of 1,488,518 tickets sold and an estimated US$19,017,008 total earnings.[54][55] The film was number one for a third week, raising its total to US$23,618,327 with 1,823,141 tickets sold, making it the fastest-grossing film of 2013 in Japan.[56][57] It dropped to fourth place the subsequent weekend of April 20–21, but total tickets sold passed the two million mark and its total revenue climbed to US$26,419,641.[58][59] The film dropped to eighth during Golden Week, which is when many new movies open in theaters and is the film industry's best week in Japan, while the box office gross grew to US$28,162,444 and tickets reached 2,181,328.[60][61] The following week it held on to the eighth place, with tickets sold increasing to 2,346,726 and its gross to US$29,172,291.[62][63]Toei aimed for Battle of Gods to earn a domestic Japanese box office take of ¥3 billion (about US$30 million).[64] In December 2013, Oricon listed Battle of Gods as the Japanese box office's eleventh highest-grossing film of the year earning a box office take of ¥3 billion.[65] The film earned US$2.8 million in North American theaters in 8 days,[66] placing it eleventh on a list of the highest-grossing theatrically released anime in North America of all time according to Box Office Mojo.Richard Eisenbeis writing for Kotaku called the film \"a great nostalgic trip from beginning to end.\"[67] He noted that it was focused on lighthearted moments, but that the \"comedic moments were not only funny but also true to the series, and the fight scenes were excellent one and all.\"[67] He particularly praised the animation as the best of the series, due to technological advancements since the early 1990s, and declared that the highlight of the movie was how in the end the villain was undoubtedly the winner over Goku in a \"complete reversal of the standard DBZ formula\".[67] Otaku USA's Matt Schley agreed that it is a comedy heavy film \"more reminiscent of the original Dragon Ball than Z\".[68] He speculates that the viewer's enjoyment of the movie depends on what they expect; \"If you want epic Dragon Ball Z story worthy of the title Battle of Gods, this film may disappoint. But if you’re just happy to see your favorite characters performing a few animated hijinx again after all these years, this film certainly delivers.\"[68]Leah B. Jackson of IGN gave the English dub of the movie a 7.5 out of 10, praising the animation and fight scenes, particularly the final battle. She was pleased to see Funimation's voice actors return, but criticized the movie for the lack of iconic techniques and having too much \"filler\".[69] Theron Martin of Anime News Network (ANN) praised the movie for its humor, use of main and supporting cast, the introduction of Beerus and Whis and the overall light-hearted nature and plot. But also criticized the movie for its inconsistent animation, uninspiring fight scenes and use of CGI, stating, \"Ultimately Battle of Gods is entirely a movie for long-established fans, as it has too many in-jokes that those not familiar with wide swaths of the franchise would get. It is not a stellar addition to the franchise but is a worthwhile and at least moderately entertaining one, provided that one does not go into it expecting an action magnum opus.\"[70] Kyle Mills Of DVD Talk highly recommended the movie, praising the dub and the perfect balancing of the humor elements from the first Dragon Ball anime with the action elements of Dragon Ball Z. He finished with, \"Dragon Ball Z: Battle of Gods is one hell of a fun flick. For any fan of the Dragon Ball franchise, you need to check it out.[...] [It is] a film full of nostalgia, fun characters, legitimate laugh out loud moments, and slick action sequences. It's a film that showcases perfectly why the Dragon Ball franchise has such long lasting popularity.\"[71]The film was released in Japan in standard and limited edition DVD and Blu-ray formats on September 13, 2013.[72] In addition to the design material and trailer collections included in the regular edition, the limited edition includes behind the scenes footage, interviews, and the 2008 short film Dragon Ball: Yo! Son Goku and His Friends Return!!, as well as a figure, booklet, and special postcards. The home video release of Battle of Gods sold approximately 50,381 copies in its first week.[73][74] By the end of the year, it had sold 46,761 DVDs and 33,737 Blu-rays.[75][76] The extended TV version of the film was released on DVD and Blu-ray on March 13, 2015,[77] selling approximately 1,666 copies in its first week.[78][79]Funimation released the theatrical and extended TV versions in North America on DVD and Blu-ray on October 7, 2014.[80] A similar set was released in the United Kingdom by Manga Entertainment on November 10, 2014.[81] Madman Entertainment released the film in Australia and New Zealand on DVD and Blu-ray on November 26, 2014.","box_office":"$51.2 million[2]","production_company":"Toei Animation","Marketing":"The July 14, 2012 issue of Weekly Shōnen Jump published the first promotional images for the film; featuring Goku, Gohan, Piccolo, Kuririn, Goten, Trunks, Vegeta, and Shenlong, with the tagline \"The mightiest make their move\" (最強、始動, Saikyō, Shidō), followed by \"All humanity has been waiting. For excitement like none before...\" (全人類待望。かつてない興奮へー, Zen jinrui taibō. Katsute nai kōfun e).[5][21] On July 21, 2012, a short teaser trailer announcing the film was shown at the Saikyō V Jump Festa, and later that month shown on television.[22] The teaser trailer was added to the movie's official website in August 2012. In less than a week the video was viewed over 3.5 million times.[23]With the movie title revealed in November 2012, a special pre-sale collaboration ticket with the One Piece Film: Z movie was made to commemorate the release of the two films. The dual-ticket good for both films has a special new illustration by both Eiichirō Oda (author of One Piece) and Akira Toriyama.[24] Limited to 8,989 across Japan, the tickets went on sale on November 23, 2012, for ¥2,600 (US$31.51) apiece.[24] The film's poster and two new characters' names and voice actors were officially revealed in December 2012 in Weekly Shōnen Jump's first issue of 2013; Beerus, the God of Destruction voiced by Kōichi Yamadera and the mysterious Whis voiced by Masakazu Morita.[25] The film poster displays Super Saiyan Goku combating the God of Destruction Beerus, with Whis floating showered in light in the background.[25] Various other characters from the series are also featured on the poster (Mr. Satan, Mr. Boo, Videl, the shrunken Pilaf gang, Super Saiyan Goten, Super Saiyan Gohan, Super Saiyan Vegeta, Super Saiyan Trunks, Bulma, Piccolo, Tenshinhan, Kuririn, Yamcha and Puar).[25]The first full trailer for the film was aired on Fuji TV on December 7, 2012, during the morning show Mezamashi TV.[26] A 30-minute Battle of Gods discussion panel was held at Jump Festa 2013; on the Jump Super Stage, on December 22, 2012. Along with the voice actors Masako Nozawa, Mayumi Tanaka, Toshio Furukawa, the film director Masahiro Hosoda, V Jump editor-in-chief Akio Iyoku, and Toei Animation producer Gyarmath Bogdan took part at the discussion which was overseen by former YBS TV announcer Mariko Nakagomi. The second full trailer for the film began being streamed on Cinema Today's website on February 27, 2013.[27] In late March 2013, Cinema Today's website began streaming a TV ad for the movie that features Frieza (Ryūsei Nakao) and Cell (Norio Wakamoto); Cell questions why he isn't in the film and Frieza brags that he is, Cell then remarks that Frieza only has a non-speaking appearance.[28]During the 30th Prize Fair, which took place in Tokyo on November 7, 2012, Bandai showcased some of their new Dragon Ball figures for winter 2012, as well their World Collectable Figure line produced in conjunction with the 2013 movie. The latter is a set of eight figures around 7 cm tall that covers characters that appear in the movie; along with Vegeta and Super Saiyan 3 Goku, the three members of the Pilaf gang were among the figures revealed.In February 2013, several collaborative projects between Dragon Ball Z: Battle of Gods and KFC in Japan began. On the seventh, the restaurants began selling \"Smile Sets with Strongest Battle Goods — Parents and Kids Play Together!\", which came with Dragon Ball Z games such as reversi and playing cards.[29] On the fifteenth, the KFC restaurants in Sapporo, Sendai, Ebisu, Sakae, Osaka, Hakata and Okinawa dressed their Colonel Sanders statues as Goku, with each one holding a different starred Dragon Ball.[30] They began selling \"Strongest Sets\" that come with \"Light Up! Dragon Bottles\" or \"Dream Dragon Radar detectors\" on February 28, and a TV ad featuring Goku began airing.[30][31]As part of a collaboration with the Japanese J. League Division 1 football team Albirex Niigata, a special poster unveiled on the official Battle of Gods website on February 20, 2013, was displayed across Niigata Prefecture in promotion of their match with the defending league Division 1 champions Sanfrecce Hiroshima on March 3, 2013.[32] The poster is based on the Battle of Gods poster, with the movie characters replaced by the football team's players: the figure in the background replacing Whis is the team's manager Masaaki Yanagishita, Beerus has been replaced by the Sanfrecce Hiroshima goalkeeper Shūsaku Nishikawa, and Goku is replaced by the team's forward Bruno Lopes. All supporters at the match wore orange, Goku made an \"appearance\" at the stadium, and the Dragon Ball Z theme song was used.From March 5 to April 8 the Lawson convenience stores sold special Battle of Gods inspired food items, such as Dragon Ball pizza balls, Super Saiyan fries, Demon King Piccolo's Green Tea Cream Puffs, Majin Boo Milk Pudding and Vegeta's Green Salad.[33]The March 2013 issue of V Jump revealed that Beerus would appear in the Dragon Ball Heroes arcade game as a boss battle,[15] and subsequently in its Nintendo 3DS version titled Dragon Ball Heroes: Ultimate Mission. It also announced the Dragon Ball Z Festival at Toei Kyoto Studio Park from March 16 to September 8 in celebration of Battle of the Gods.[15] Starting on March 30, Beerus appeared in the Dragon Ball arcade game Zenkai Battle Royale. Beerus, Whis, and Goku's Super Saiyan God form are all playable characters in the video game Battle of Z.[34]A manga adaptation of Battle of Gods ran in the April 2013 issue of Saikyō Jump, which went on sale on March 4, 2013.[35] Drawn by Naho Ōishi, who currently draws the Dragon Ball SD series in the magazine and previously Dragon Ball: Episode of Bardock in V Jump, it depicts the beginning of the film. An anime comic version, more commonly known as \"ani-manga\" in the west, of Battle of Gods was released on October 4, 2013.[36]Battle of Gods received its television debut on Fuji TV on March 22, 2014 at 9:00pm.[37] Toei Animation producer Gyarmath Bogdan confirmed through Twitter that the broadcast included up to twenty minutes of extra scenes and additional footage.[1] The broadcast earned an average household rating of 13.1%.[38]The 2015 Dragon Ball Z: Resurrection 'F' film is a sequel to Battle of Gods and features Beerus and Whis.[39]The first story arc of Dragon Ball Super is a retelling of sorts of Battle of Gods, though some events are altered or expanded in the series' version of events.","directed_by":"Masahiro Hosoda","release_dates":"March 30, 2013 (2013-03-30) (Japan)|||||","produced_by":"Rioko Tominaga Gyarmath Bogdan","starring":"Masako Nozawa Kōichi Yamadera Masakazu Morita Masaharu Satō Hiromi Tsuru Mayumi Tanaka Ryō Horikawa Toshio Furukawa Tōru Furuya Takeshi Kusao Jōji Yanami","running_time":"85 minutes (theatrical) 105 minutes (Fuji TV)[1]","dragon_ball_z:_battle_of_gods":"Japanese release poster","music_by":"Norihito Sumitomo","edited_by":"Shinichi Fukumitsu"}