{"country":"United States","down_periscope":"Theatrical release poster","distributed_by":"20th Century Fox","screenplay_by":"Hugh Wilson Andrew Kurtzman Eliot Wald","story_by":"Hugh Wilson","Plot":"Lt. Commander Thomas Dodge (Kelsey Grammer), a capable yet unconventional US Navy submariner, is about to be passed over a third time for command of his own nuclear submarine because of his unorthodox methods and a notorious genital tattoo (\"Welcome Aboard!\") received after getting drunk and passing out while on shore leave. Failure to secure a command will result in Dodge being dropped from the Navy's command program and an assignment to a desk job, and that means he will retire from the Navy. During his career, Dodge has made an enemy of Rear Admiral Yancy Graham (Bruce Dern), who strongly speaks out against Dodge's fitness for command.Vice-Admiral Dean Winslow, ComSubLant (Rip Torn), who likes Dodge and his unorthodox methods, finds the perfect use for the Commander. Winslow plans a war game to test the Navy's defenses against possible attack by older Soviet diesel-powered submarines in the hands of enemies of the United States. Among the defenses being tested is the Los Angeles-class submarine USS Orlando, commanded by Commander Carl Knox (William H. Macy), Dodge's former commanding officer. For this purpose, Dodge is selected to put the World War II-era Balao-class diesel sub, the USS Stingray, SS-161 back in commission as the Opposing Force in the war game. Winslow tells Dodge to \"think like a pirate\" and stick to his unorthodox methods, while promising that if he can win the exercise, including sinking a target ship positioned in Norfolk Harbor, Dodge will be considered for command of a nuclear submarine.Graham, however, motivated by his dislike for Dodge and his own ambition for promotion, arranges to make Dodge's mission much more difficult. Graham handpicks a crew for the Stingray, \"the crew from Hell\" as Dodge initially refers to them: hot-tempered, uptight Lt. Martin Pascal (Rob Schneider) as the Executive Officer; crusty Chief Engineer Howard (Harry Dean Stanton), a civilian contractor hired for the job because no active duty Navy engineers are familiar with a Balao-class's diesel-electric engine system; rebellious Engineman 1st Class Brad Stepanek (Bradford Tatum); sharp-eared Sonarman 2nd Class E.T. \"Sonar\" Lovacelli (Harland Williams); compulsive gambler Seaman Stanley \"Spots\" Sylvesterson (Jonathan Penner); former college basketball player Seaman Jefferson \"R.J.\" Jackson (Duane Martin), aka \"Stoneball Jackson,\" who has dreams of playing in the NBA; shock-prone (and shock-addled) Electrician's Mate Nitro (Toby Huss); and not-so-culinary Culinary Specialist Second Class Buckman (Ken Hudson Campbell) as the ship's cook.To further frustrate Dodge, Graham also uses the Stingray as a Navy pilot program to evaluate the feasibility of women serving on submarines, knowing the cramped diesel boat is unsuitable for mixed-gender living. Surface Warfare Officer Lt. Emily Lake (Lauren Holly) joins the crew as Diving Officer. Although she is proficient on the training simulators, Captain Dodge points out that \"No one ever talks about brave men and their proud simulators.\"Using unorthodox tactics to offset their huge technological disadvantage, Dodge and the Stingray crew achieve their first objective by sneaking into and setting off signal flares in Charleston Harbor. Desperate to defeat Dodge, Graham then cuts the war game containment area in half without Winslow's authorization.Running into trouble on their first attempt at Norfolk Harbor, Dodge leaves the reduced containment area and heads out to sea. Irate at this lapse in protocol, the always strident and by-the-book Pascal, for whom the crew has no respect, attempts to take command of the Stingray; none of the crew supports his action. Dodge then charges Pascal with mutiny and, in mock pirate fashion, forces his blindfolded XO to \"walk the plank\" ... into the raised fishing net of a waiting trawler that will take him ashore.During the Stingray's second attempt at penetrating Norfolk, Graham assumes personal control of the Orlando. Dodge uses an incredibly dangerous maneuver to sneak past the ships, aircraft and submarines protecting Norfolk, but the Orlando is eventually able to locate and chase her down. However, before the Orlando's shooting solution is obtained, Dodge fires two live torpedoes into the anchored target ship at Norfolk, which wins the war game for the Stingray.Upon his return to port, Admiral Winslow chastises Graham and denies his promotion. He welcomes Dodge back and confides that Engineman Stepanek is actually his son, using his mother's name. The Admiral then informs Dodge that he will not get his own Los Angeles-class submarine, as the two had previously discussed, but instead a new Seawolf-class submarine (the US Navy's most advanced attack submarines), plus a proper crew to man her. Dodge respectfully requests that the entire Stingray crew be transferred with him to his new boat, which Admiral Winslow agrees to do. After the Stingray's crew is dismissed to begin a well-earned shore leave, Lt. Lake poses a query to Dodge now that the two are shipmates and have come to know each other: \"What exactly is this 'tattoo' I keep hearing about?\"","language":"English","Reception":"Critical reception was generally negative; the film holds a 12% positive rating from the film review aggregator website Rotten Tomatoes.[6] Despite this, the film has been called an accurate depiction of life on board a submarine by a US Navy submarine officer. [7]","box_office":"$37,553,752[2]","cinematography":"Victor Hammer","directed_by":"David S. Ward","Production notes":"The name of the film is a play on the title of the 1959 World War II drama Up Periscope and spoofs several titles in the submarine film subgenre, including Cold War drama The Hunt for Red October.[3]Down Periscope began shooting on May 6, 1995 and finished on July 27.[4]USS Pampanito, a Balao-class submarine from World War II, now a museum ship and memorial in San Francisco, played the part of the USS Stingray. The nearby Suisun Bay Reserve Fleet played the part of Naval Station Norfolk.The film makes use of both standard US Navy stock footage as well as scenes shot specifically for the film. The scenes of the fictional USS Orlando were taken of the USS Springfield, home-ported at the New London Submarine Base in Groton, Connecticut, during a one-day VIP cruise for the christening committee of the USS Seawolf.[5]The target ship that is torpedoed and sunk, ending the film's war-game, is both naval stock footage of the USS Fletcher and a prop shooting miniature. The Fletcher is one of the most decorated ships in US Navy history.Over the closing credits a music video is shown of the Village People and the film's cast performing \"In the Navy\" aboard the Stingray.","release_dates":"March 1, 1996","produced_by":"Robert Lawrence","starring":"Kelsey Grammer Lauren Holly Rob Schneider Harry Dean Stanton Bruce Dern William H. Macy Rip Torn","running_time":"93 minutes","music_by":"Randy Edelman","edited_by":"William M. Anderson Armen Minasian","Release":"Down Periscope had its US theatrical release on March 1, 1996.[4] The film grossed $25,785,603 domestically and $37,553,752 worldwide; it currently sits at the position of 2,315 for all-time domestic gross.[citation needed] The film was released five months later on home video on August 6, 1996.[4]","budget":"$31 million[1]"}