{"Cast":"& (alphabetical order)","country":"France Poland West Germany","distributed_by":"Gaumont","Plot":"The film begins in the spring of 1794, when the Reign of Terror was in full swing. On the borders of Paris, any vehicles entering Paris, including the carriage of Danton, who has just ridden in, are being searched. Robespierre, meanwhile, is sick in his bed. His landlady's daughter, Éléonore Duplay, attempts to comfort him, but is unable to. Her nephew, whom she is taking care of, is meanwhile being made to memorize lines from the Declaration of the Rights of Man and Citizen. Back in the streets of Paris, starving lines of people, waiting for bread, discuss the possible reasons for the lack of it. Whether or not it is an enemy plot, the people do know that they are hungry, and that hunger leads to revolt. Once the bread store actually opens, and they finally begin to receive their bread, they are distracted by their other source of faith and hope in life: Danton. As Robespierre is watching, Danton is swarmed by a mob of supporters and fans, who all cry out for help. Robespierre, in his flat, is visited by Heron, the chief of the secret police, and instructs him to destroy the print shop of Camille Desmoulins, who is publishing pro-Dantonist circulars.As the shop is being attacked, Robespierre is having his wig powdered. His friend Saint-Just comes in, and urges him to have Danton guillotined, but Robespierre ignores him. Later, when Robespierre meets with the other members of the Committee of Public Safety, they push the same point. Robespierre resists for various reasons, mainly because Danton is a brilliant and highly popular statesman and orator, but also because Danton is his personal friend. Before the National Convention commences for the day, Danton discusses with general Westermann about a coup to overthrow Robespierre and the committee, of which Danton disapproves. Danton’s closest supporters warn him that Robespierre is planning on having him jailed. Danton, however, is positive that his newspaper and the support of the people will prevent anything like that from ever happening. All of his supporters urge him to strike now and take power, but he resists. That day, at the convention, one of Danton’s supporters, Bourdon, makes a speech against Heron and his secret police (a central part of Robespierre’s regime), and has Heron jailed.That night, Danton and Robespierre have dinner together. Danton puts much work into setting the meal, but Robespierre refuses to drink or eat, insisting on a serious discussion. Robespierre wants Danton to join his cause and stop fighting because he does not want to be forced to have Danton executed. Danton simply drinks until he passes out, and refuses Robespierre’s advances. As Danton leaves the hotel, he is met by a group of armed men who turn out to be Westermann's assistants, preparing to stage a coup. Danton rebuffs Westerman's attempt to coerce him into helping. Next, Robespierre goes to Camille Desmoulins' house, where Camille entirely ignores his presence. Robespierre tries to convince Camille that Danton is exploiting him, but he is again ignored. His wife Lucile begs Robespierre to stay and talk sense into her husband because she wants him to live, but Robespierre can do nothing. With no other options, Robespierre has Lacrois, Phillipeaux, Desmoulins, Westermann, Danton and other supporters arrested and jailed in the Luxembourg jail, after having the warrant signed by the Committee of General Security and the Committee of Public Safety. Although Danton has the power to raise up a force and resist, he doesn’t because he does not want any more bloodshed. The man who arrests Danton is scared of him, and Danton has to practically drag him along.The next day at the national convention, the members are outraged by the arrest, but Robespierre simply justifies his action by stating that Danton is an enemy of the Republic, and must be tried regardless of his popularity. To save his own life, Bourdon joins Robespierre's side, deserting Danton and Desmoulins, which disgusts Lucile.While Danton waits in custody, Robespierre plans out his trial. Only seven jurors are to be used, which is against the law, but Robespierre can only ensure seven men who will find Danton guilty. Danton has given up on the Revolution and on the people. At the trial, Danton consistently breaks the order by speaking out of turn. The people are still in support of him, and judge Fouquier finds no grounds to prosecute him. The accused are kept in prison overnight and there is a solitary scene in where Danton is brought to his knees when a condemned prisoner tells him how overjoyed he is to hear that Danton, the first president of the committee, is to be executed. While Robespierre is visiting David, he is informed that Danton's charisma is interrupting the planned process of the trial, and the sentence is going nowhere. In response a decree is issued that if anyone speaks out of turn again, which Danton has done repeatedly, they will be removed from court. Within minutes, the entire accused team has been dismissed, and the verdict of guilty is read. The day before his execution, Danton is depressed. Not due to his death, but due to the fact that he feels that he failed the people. They are led off to the scaffold and guillotined. When Robespierre finally hears of Danton’s death, he turns ghostly pale, and realizes how he has violated liberty, and the goals of the revolution. His mistress’s nephew, now fully practiced, is finally sent in to recite. As he reads off the Declaration of the Rights of Man and Citizen, Robespierre is fully brought to the reality of what he has done.","language":"French","danton":"Film poster","cinematography":"Igor Luther","directed_by":"Andrzej Wajda","release_dates":"12 January 1983 (1983-01-12) (France)|31 January 1983 (1983-01-31) (Poland)||||","produced_by":"Margaret Ménégoz","starring":"Gérard Depardieu Wojciech Pszoniak Anne Alvaro","running_time":"136 minutes","music_by":"Jean Prodromidès","edited_by":"Halina Prugar-Ketling","written_by":"Jean-Claude Carrière collaboration with Andrzej Wajda Agnieszka Holland Bolesław Michałek Jacek Gąsiorowski"}