{"directed_by":"Yoav Potash","country":"United States","release_dates":"January 21, 2011 (2011-01-21) (Sundance)|July 1, 2011 (2011-07-01) (United States)||||","Production":"Potash produced Crime After Crime over a five and a half year span, gaining unprecedented access to film in a maximum-security California prison, despite strict rules that barred members of the media from filming interviews with specific inmates. The filmmaker managed to bring his cameras into the prison by becoming the \"legal videographer\" for Debbie Peagler, and by producing an entirely separate documentary about the rehabilitative and employment programs available to inmates at the prison. Potash wrote about these activities and his motivations for making the film in articles published by The Wall Street Journal [1] and The Wrap.[2]The film was funded by the Sundance Documentary Film Program, the San Francisco Foundation, the Lynn and Jules Kroll Fund for Jewish Documentary Film at the Foundation for Jewish Culture, the Pacific Pioneer Fund, the Bay Area Video Coalition, the Women in Film Foundation Film Finishing Fund supported by Netflix, the Jewish Federation of the Greater East Bay, and Jewish Family and Children's Services of San Francisco.","starring":"Deborah Peagler Joshua Safran Nadia Costa","Television Broadcast":"The film was picked up by the Oprah Winfrey Network for broadcast and home video distribution.[11] OWN gave the film a national television primetime premiere in November 2011. The PBS NewsHour also broadcast a nine-minute excerpt of the film as part of its Economist Film Project, a collaboration with The Economist magazine.","Critical reception":"\"Crime After Crime\" earned strong praise from critics and audiences alike. The film received a 90% positive critic \"Tomatometer\" score on Rotten Tomatoes,[3] and a rating of 4.2 out of 5 stars on Netflix, generated from an average from 104,192 user ratings.[4]The film premiered at the Sundance Film Festival in January 2011, and went on to earn a total of 25 major awards[5] including the Robert F. Kennedy Journalism Award, The National Board of Review’s Freedom of Expression Award, and The Hillman Prize for Broadcast Journalism. The film was a New York Times Critics' Pick. In her New York Times review of \"Crime After Crime,\" film critic Jeanette Catsoulis called the film a \"wrenching documentary\" and wrote that its portrayal of Debbie Peagler \"makes it difficult to leave the theater with dry eyes and an untouched heart.\" She added that filmmaker Yoav Potash's \"moral outrage is magnificent, swelling from hushed to howling without the help of narration or posturing from the unfailingly dignified Ms. Peagler or her quietly dedicated lawyers.\" [6]The Washington Post listed the film as an Editors' Pick, and film critic Stephanie Merry began her review with the following paragraph: \"Some movies prove so eye-opening that a viewer may feel the urge to recount the story, start to finish, to friends and acquaintances. “Crime After Crime” is that kind of film. The shocking, emotional documentary follows an abused, incarcerated woman whose quest for freedom meets a never-ending series of outlandish obstacles.\"[7]New York Magazine also listed the film as a Critics' Pick, calling the film \"riveting and devastating,\" and describing it as a story about \"a great miscarriage of justice—but also one of heroic legal perseverance, with a surprisingly colorful cast of characters.\"The Los Angeles Times listed the documentary as \"a must-see film\"[8] and The Hollywood Reporter described the film as \"a tremendously moving story, strong in social commitment and deftly woven out of years of footage.\" Upon its Sundance Film Festival premiere, The Salt Lake Tribune called the film \"a riveting examination of justice denied through political manipulation and prosecutorial callousness.\"[9]Among the first honors bestowed upon the film were the Henry Hampton Award for Excellence in Film and Digital Media, presented by the Council on Foundations, and the Pursuit of Justice Award, presented by the California Women's Law Center.In May 2011, the film won both the Audience Award for Best Documentary and the Golden Gate Award for Documentary Feature at the 54th annual San Francisco International Film Festival, the first of several festivals to give the film multiple awards.[10] (See full Awards list below.)","Synopsis":"Crime After Crime tells the dramatic story of the legal battle to free Debbie Peagler, an incarcerated survivor of domestic violence. She was wrongly convicted of the murder of her abusive boyfriend, and sentenced to 25 years to life in prison.Her story takes an unexpected turn two decades later when two rookie land-use attorneys step forward to take her case. Through their perseverance, they bring to light long-lost witnesses, new testimonies from the men who committed the murder, and proof of perjured evidence. Their investigation ultimately attracts global attention to victims of wrongful incarceration and abuse, and becomes a matter of life and death once more."}