{"based_on":"Double Dragon by Technōs Japan","country":"United States","distributed_by":"Gramercy Pictures","Plot summary":"Koga Shuko, a crime lord and businessman, explains to his underlings about a powerful, magic medallion called the Double Dragon, which has been split into two pieces. He obtains one half and orders his henchmen to find the other for him.Teenage brothers Billy and Jimmy Lee, and their guardian Satori head home after citywide curfew from a martial arts tournament. On their way, they are accosted by gang members, who rule the streets after dark due to an uneasy pact made with the police department to keep them from running amok during the day. They escape with help from the Power Corps, a group of vigilantes headed by their friend Marian, daughter of the police chief. Unfortunately, Abobo, a gang leader, discovers Satori holds the second medallion half and reports this to Shuko. For his failure in securing it, he is mutated into a hulking giant.At their abandoned theater home, Satori explains to a skeptical Billy and Jimmy about the Double Dragon and how their piece must be protected, and she places it in the care of Billy. Shuko, with his henchmen in tow, pays the Lees a visit, intent on taking the other half. He reveals the ability of his medallion, the power of the soul, which gives the user the power of possession and a shadow form, by temporarily possessing Satori. Billy and Jimmy successfully incapacitate Abobo, but Shuko has the place doused in gasoline and lit on fire. Satori sacrifices herself so the brothers can escape with the Dragon.Unable to find the brothers on his own, Shuko unites and takes over the gangs by displaying his power and sends them after the Lees. Billy and Jimmy narrowly get away, and seek refuge in the Power Corps hideout. Marian agrees to help them, using this as an opportunity to get rid of the gangs once and for all, and the three of them decide to go to Shuko’s office building to steal his medallion. They ultimately fail and are forced to flee, but Jimmy is captured in the process.Billy and Marian return to the Power Corps base, and lament about how none of them have been able to figure out how to use their Dragon piece. Marian points out a discovery they made that the wearer of the medallion is immune to the powers of its counterpart, meaning Shuko is not able to possess him as long as he has it. Suddenly, the gangs attack the hideout. In the mélêe, Jimmy reappears. Billy is elated; however, Jimmy is merely being controlled by Shuko as he tries to pummel his brother into submission. Billy then accidentally activates his medallion’s ability, which is the power of the body and effectively makes him invulnerable to harm. Knowing this, Shuko threatens to kill Jimmy instead. This doesn’t succeed either, so he releases Jimmy to distract Billy long enough to get the medallion.Shuko unites the halves and turns into a pair of shadow warriors with katanas that disintegrate anything they slice through. The Lee brothers fight, but cannot beat him. Abobo, who had previously been taken prisoner and since reformed, reveals to Marian that Shuko’s weakness is light. Marian reactivates the hideout’s generator, and the shadow warriors are rendered powerless. Billy and Jimmy attack, forcefully recombining the shadows into Shuko, and acquire the Double Dragon halves. They combine the two pieces, granting them matching uniforms and the medallion powers, and they briefly see a vision of Satori’s spirit as she gives them encouraging words. The brothers pummel Shuko, and Jimmy possesses him to make him do embarrassing things. During this time, Marian’s father arrives to bring Shuko to justice and to take care of the gangs once and for all. Jimmy has Shuko write a check to the police department for $129 million before encouraging the police chief to arrest him.Shuko is sent to jail, the police department has renewed strength to fight the gangs instead of compromising with them, and Billy and Jimmy can now keep both halves of the medallion safe.","language":"English","Reception":"Reviews by critics, such as the review of the movie by the Washington Post, were not favorable.[3] Reviewbiquity gave the film one out of five stars, stating the movie \"won’t satisfy even the most fervent of fans.\"[4] On review aggregate website Rotten Tomatoes, it received a negative score of 8% from 12 reviews, with the consensus \"Double Dragon's clever use of special effects cannot mask the film's overly simplistic storyline and cheesy dialogue\", making it one of the lowest-rated video game movie adaptions of all time.[5][6][7]In 2009, Time listed the film on their list of top ten worst video game movies.[8]According to Box Office Mojo, The film grossed $1,376,561 in its opening weekend at 1,087 theaters and $2,341,309 in its finished theatrical run.Plot and visual elements of the film were reused in the 1995 fighting game version of Double Dragon produced by Technos Japan. This includes the transformation that the Lee brothers go through during the film's climax, which appear in the game as a special move for both characters; and the use of footage of the film in the game's introduction and Marian's stage.","box_office":"$2.3 million","Home video":"Universal released the film on VHS and Laserdisc in April 1995 in the United States, while CFP released the film on video in Canada. GoodTimes Entertainment made another VHS in late 1997, released it on DVD in 2001, and another DVD on August 31, 2004. Both DVDs are currently out of print.[citation needed]","cinematography":"Gary B. Kibbe","production_company":"Imperial Entertainment Group","directed_by":"James Yukich","release_dates":"November 4, 1994 (1994-11-04)|||||","Production":"First-time director Jim Yukich summarized his approach to the film: \"Our characters are like normal kids - three kids on an adventure, so we didn't want to make something that kids would almost be too afraid to see. ... I'd like to make it in a funnier, light-hearted vein.\"[2]The boat chase sequence was filmed on the Cuyahoga River in Northeast Ohio, and climaxes with an explosion which used 700 gallons of gasoline combined with 200 gallons of alcohol.[2] Despite warnings the night before on several news channels, the explosion caused residents of the nearby city to panic, leading to 210 phone calls to emergency services over ten minutes.[2]","starring":"Robert Patrick Mark Dacascos Scott Wolf Julia Nickson Kristina Wagner as 'Lash' John Mallory Asher Leon Russom and Alyssa Milano as 'Marian'","running_time":"95 minutes","music_by":"Jay Ferguson","edited_by":"Florent Retz","written_by":"Michael Davis Peter Gould","budget":"$7.8 million[1]"}