{"based_on":"E=mc2 Mon Amour 1977 novel  by Patrick Cauvin","country":"United States","distributed_by":"Warner Bros.","Related Media":"This film was remade in Tamil as Panneer Pushpangal in 1981 by P. Vasu and Santhana Barathy.","screenplay_by":"Allan Burns|George Roy Hill|","Plot":"Lauren King (Diane Lane) is a book-smart 13-year-old American girl with an IQ of 167 living in Paris with her affluent family. She spends her free time reading Heidegger. Daniel Michon (Thelonious Bernard) is a street-wise 13-year-old French boy who lives in La Garenne with his father, a cabbie. He loves Hollywood films and amuses himself handicapping theoretical wagers on horse races. The two meet in the Château de Vaux-le-Vicomte, where a movie is being filmed, and fall in love. Lauren's self-absorbed mother (Sally Kellerman), who consorts openly with her movie director boyfriend George in front of Lauren and her stepfather (Arthur Hill), fiercely objects to the romance, calling Daniel a \"filthy French boy\". When Daniel punches George at Lauren's birthday party for making a crude innuendo about Lauren, the two are forbidden to date.Lauren and Daniel meet Julius Santorin (Laurence Olivier), a quirky but kindly gentleman, literally by accident. He bores Daniel but fascinates Lauren with stories of his life. Julius and Lauren share a mutual love of the poetry of Robert and Elizabeth Barrett Browning, and he claims to have lived at one time in the Brownings' villa in Venice. This leads Julius to tell of a tradition that if a couple kiss in a gondola beneath the Bridge of Sighs in Venice at sunset while the church bells toll, they will be in love forever.Told that her family will be returning to America soon, Lauren hatches a plan to travel to Venice with Daniel. With the help of Julius (they cannot cross the border without an adult) and 18,000 francs won on a horse race, the three travel by train but miss their connection to Verona after Julius gets into a conversation during the stop at the Italian border. In the meantime Lauren's family discovers she is missing and spark an international investigation, believing Lauren has been abducted.They hitch a ride with an American couple from Columbus, Ohio, the Duryeas (Andrew Duncan and Claudette Sutherland), who are touring Italy by car and also traveling to Venice. In Verona the travelers go out to dinner together, where Bob Duryea discovers that his wallet has been stolen. Since their winnings from the horse race were left on the train in Julius's vest, presumably they have no money either, but Julius offers to pay the bill with cash, perplexing Lauren and irritating Daniel, who suspects he stole it.The following morning Lauren and Daniel leave the hotel early to visit places associated with Romeo and Juliet. At breakfast, the Ohio couple notices Lauren's picture in an Italian newspaper with the caption \"Dov'e?\". Janet thinks it means \"bird...peace\" but Bob deduces it's asking where she is. Julius has also seen the paper and intercepts Lauren and Daniel on their way back to the hotel, angry that Lauren lied to him about going to Venice to visit her sick mother. He angrily tells them that everyone now thinks that he is a kidnapper, for which \"they will put me away\" but can't bring himself to reveal that he has a criminal record as a pickpocket.Because they can no longer go back to the hotel, they join a local bicycle race to escape Verona. Julius soon falls behind and Lauren persuades Daniel to go back for him. They find his bike abandoned and him collapsed from exhaustion. Daniel worms his background out of Julius, who also confesses that he both picked Bob's pocket and stole the money for their train tickets, disappointing Lauren. Lauren then reveals that she will be moving back to the United States permanently in two weeks. She wanted to take a gondola to the Bridge of Sighs and kiss Daniel so as they could love each other forever. She berates Julius by dismissing all his stories as lies. Julius admits the truth of it but insists that the legend is not a lie. Daniel says that he is still going to Venice, and Lauren and Julius join him.In Venice they spend the night in St. Mark's Basilica, sleeping in the confessionals, until a chance meeting with the Duryeas sets them on the run again hours before sunset. Julius hides them in a movie theater and gives them his remaining cash, promising to return a half-hour before sunset. As soon as they are inside, however, Julius turns himself in to police searching for them. They fall asleep during the film and awake with just a few minutes remaining. Julius is nowhere to be seen, taken to a police station, but despite being slapped around by an inspector, refuses to reveal their whereabouts until the bells of the Campanile have rung.Not knowing where Julius is and with so little time, Lauren and Daniel run to find a gondola, most of which are booked by tourists eager to see the sunset from the canals. When an unoccupied gondola appears, its gondolier quotes a fare of 15,000 lire, 3,000 more than Julius gave them. Because his father drives a cab, however, Daniel knows how to cajole the gondolier into accepting what they have. The gondolier takes them within sight of the bridge but refuses to go further just as sunset arrives. Daniel pushes him into the canal and as the Campanile begins chiming, pulls the gondola towards the bridge hand over hand using the pilings. With Lauren's help they set the gondola in motion and cuddle as the boat glides under the bridge. While the bells are still pealing, Lauren and Daniel kiss and embrace. In the police station, Julius finally reveals where Lauren is and what she is doing.A few days later, Lauren is back with both her mother and stepfather, preparing to leave for home. As she starts to enter the car, Lauren notices Daniel across the street, waiting to say goodbye to her. Her mother starts to object but her stepfather tells Lauren to go ahead. She and Daniel share a final kiss, pledging not to become \"like everybody else.\" Julius is sitting on a nearby bench and she bids him a tearful farewell. Overcome with emotion, she runs back to her car. Daniel follows the retreating car down the street, watching Lauren wave through the rear window. A frustrated Parisian driver cuts in between them; Daniel jumps up so as he can see Lauren. The camera freezes on Daniel's face and zooms in, Lauren's last memory of Daniel until they can see each other again.","language":"English","Reception":"Following its initial release in 1979, the film received mixed reviews, with some being quite negative. In his review in The New York Times, Vincent Canby described the film as \"so ponderous it seems almost mean spirited. It's been a long time since I've seen a movie about boorish American tourists and felt sorry for the tourists—which is one of Mr. Hill's achievements here. I'm sure nothing mean-spirited was intended, but such is the film's effect. This may be the main hazard when one sets out to make a film so relentlessly sweet-tempered that it winds up—like Pollyana—alienating everyone not similarly affected.\"[2]In his review in the Chicago Sun-Times, Roger Ebert gave the film only two stars, writing that the film \"gives us two movie kids in a story so unlikely I assume it was intended as a fantasy. And it gives us dialog and situations so relentlessly cute we want to squirm.\"[6]Following its release on video and DVD, the film gained stronger critical support. In his review for DVD Movie Guide, David Williams called the film \"one of those gems that doesn't seem too great on the surface, but manages to lift your spirits in such a way that when it's over, it makes you glad you ignored your initial feelings and checked it out anyway.\" Williams applauded the performances as \"engaging from top-to-bottom\", singling out Olivier's portrayal of Julius, the mischievous escort and matchmaker.[7]In his review in DVD Movie Guide, John J. Puccio wrote, \"It's a lovely tale of pure and innocent love and the lengths that people involved in such a love will go to in their desire to ensure it. The movie can hardly fail to please even the most jaded audiences.\"[8]In his review in DVD Talk, David Langdon concluded, \"A Little Romance fits into that category we might call the children's film for adults. It's smart, well written, acted and directed. If anything it will be remembered as Diane Lane's first movie and one of Laurence Olivier's last. The DVD is above average in all categories except audio but it is worth a look.\"[1]On the aggregate reviewer web site Rotten Tomatoes, the film received a 72% positive rating from top film critics based on 25 reviews, and an 86% positive audience rating based on 5,156 reviews.[9]","cinematography":"Pierre-William Glenn","production_company":"Orion Pictures","directed_by":"George Roy Hill","release_dates":"April 27, 1979 (1979-04-27) (USA)|||||","Production":"Filming took place in Paris, France, as well as Verona, Venice and Veneto, Italy.","produced_by":"Robert L. Crawford|Yves Rousset-Rouard|","starring":"Laurence Olivier|Thelonious Bernard|Diane Lane|Arthur Hill|Sally Kellerman|","running_time":"108 minutes","a_little_romance":"Theatrical release poster","music_by":"Georges Delerue","edited_by":"William H. Reynolds"}