{"country":"West Germany","Comment":"Fassbinder has a cameo role in the beginning of the film sitting behind Voss in a movie theatre and watching her old movie. Lilo Pempeit (also Liselotte Eder), who plays the manager of a jewelry store, was Fassbinder's mother. Günther Kaufmann, one of Fassbinder's former lovers, plays in all three films of the cycle. In this one he is an enigmatic African-American G.I. Juliane Lorenz, seen in the brief role of a secretary, was a close associate of Fassbinder and the editor of this film; she became the chief executive of Fassbinder's estate, the Rainer Werner Fassbinder Foundation, in 1992. Lorenz spotted an article in Die Zeit about Schmitz's legal case and drew it to Fassbinder's attention.[1]","language":"German","Synopsis":"The film is loosely based on the career of actress Sybille Schmitz and is influenced by Billy Wilder’s Sunset Boulevard.Munich, 1955. Veronika Voss is a formerly popular UFA film star who is now struggling to get roles. She meets a sports reporter named Robert Krohn and is impressed that he does not know who she is. The two begin a love affair, even though Robert already lives with his girlfriend Henriette, who nevertheless realizes that Veronika has an irresistible allure. Veronika’s behavior is erratic and sometimes desperate, and as Robert delves into her life he discovers that she is essentially a captive to a corrupt neurologist named Dr. Marianne Katz. Dr. Katz keeps Veronika addicted to opiates and uses her power to give or deny drugs as a means to bleed the actress of her wealth. To verify his suspicions, Robert has Henriette approach Dr. Katz and pretend to be a rich woman in need of psychiatric care. Dr. Katz writes Henriette a prescription for an opiate but afterward witnesses her making a phone call in the street outside the office. Dr. Katz then has Henriette killed and with Veronika's help covers up the crime when Robert arrives with the police. The film ends tragically as Dr. Katz and her cohorts have Veronika sign over all that she owns and give her a fatal dose of pills. After Veronika’s death, Robert observes the villains celebrating their victory and is unable to do a thing.","cinematography":"Xaver Schwarzenberger","directed_by":"Rainer Werner Fassbinder","release_dates":"18 February 1982","produced_by":"Thomas Schühly","starring":"Rosel Zech Hilmar Thate Cornelia Froboess","running_time":"104 minutes","Reception and Awards":"The film was entered into the 32nd Berlin International Film Festival, where it won the Golden Bear.[2]Roger Ebert added the film to his Great Movies collection.[3]","music_by":"Peer Raben","written_by":"Rainer Werner Fassbinder Pea Fröhlich Peter Märthesheimer"}