{"Cast":"Kyle McCulloch as Grigorss Gosia Dobrowolska as Zenaida Sarah Neville as Klara Brent Neale as Johann Paul Cox as Count Knotkers Victor Cowie as Herr Trotta Michael O'Sullivan as Blind Ghost (Dead Husband of Zenaida) Vince Rimmer as Franz Katya Gardner as Sigleinde Jackie Burroughs as Frau Teacher Ross McMillan as Chief Steward Leith Clark as Butler Blore Glen Hubich as Butler Schrammel Brendan Carruthers as Mortician George Toles as Countess Knotkers","country":"Canada","Plot":"Careful is set in Tolzbad, a fictional mountain town under constant threat of devastating avalanches that can be triggered by any loud noise or even a too-large expression of emotion. The people of Tolzbad suppress their emotions as much as possible, living in constant vigilance against losing self-control. An opening lecture cautions common advice (\"Think twice!\", \"Don't stand so close to the walnut tree!\").The greatest ambition of the citizens of Tolzbad is to become good servants for the reclusive Count Knotkers. Johann and Grigorss are brothers and butlers-in-training. Both are beloved of their mother Zenaida, although she hates their brother Franz, whom they do not speak of and who has been exiled to the attic. The ghost of their dead blind father appears to Franz to warn him of impending doom in the family, yet Franz (paralyzed and mute and covered in cobwebs) can do nothing. The ghost complains to Franz that Zenaida never loved him and harboured love for Count Knotkers instead, although forbidden to marry him by the Count's mother.Johann is betrothed to Klara, daughter of Herr Trotta, and although Grigorss harbours secret love for Klara he says nothing. Johann, meanwhile, becomes incestuously attracted to his own mother Zenaida. He spies on her through the walls of the chimney as she undresses and bathes. He then concocts a love potion for her, and as she drifts into sleep he assaults her, kissing and groping her breasts. Horrified at himself, Johann burns off his lips with a hot coal, cuts off his fingers with garden shears, and throws himself off a mountain.Grigorss becomes infuriated when Zenaida reveals that her passion for Count Knotkers has been rekindled since his mother died, so that no obstacles stand in the way of their union. She reveals that the reason she hates Franz but loves her other sons is because Franz reminds her too much of her hated dead husband, but when she conceived Grigorss and Johann she was thinking about the Count. Grigorss challenges the Count to a duel to avenge his father's honour, but Zenaida talks him out of it by finally accepting Franz into the family.However, Klara convinces Grigorss to go through with the duel. Possessed like Johann with incestuous love for her parent (her father, Herr Trotta, who ignores Klara but lavishes attention on her sister Sigleinde), and inspired after viewing the enchained wild mountain girl Gerda, this duel is the first step of her plan for revenge. They duel with daggers, and Grigorss stabs Count Knotkers. He heads home, where Zenaida cares for him after he collapses from exhaustion. However, when she discovers he has killed her beloved Count, she throws him out of the house and hangs herself in the attic in front of Franz.Grigorss is taken by Klara to a mountain cave she once hopefully prepared as a love den for her and her father but which she now claims can be their new home. On the gondola ride there, Klara tells Grigorss that her father raped her and they must plan his death. Grigorss takes Herr Trotta on a sleigh ride, during which he shoots a pistol to start an avalanche to bury Trotta. All goes according to plan, except that Klara throws herself into the sleigh to die while kissing her father.Alone, Grigorss retreats to the mountain cave. A single teardrop causes another avalanche, which traps him inside, where he freezes to death while hallucinating a happy reunion with his parents. As the film ends, Franz and Sigleinde join together to search the mountains for their lost family members, not realizing they are dead.","language":"English","Critical reception":"The film received generally positive reviews, with review aggregator Rotten Tomatoes reporting an 83% approval rating based on 12 reviews.[6] A critical essay on the film by Will Straw was included in the book Canada's Best Features: Critical Essays on 15 Canadian Films.[7]","cinematography":"Guy Maddin","directed_by":"Guy Maddin","Awards":"Careful won \"Best Canadian Film\" at the 1992 Sudbury Cinéfest.","release_dates":"1992 (Canada) 1993 (U.S.)","produced_by":"Greg Klymkiw","starring":"Kyle McCulloch Gosia Dobrowolska Sarah Neville Paul Cox Brent Neale","running_time":"100 min.","edited_by":"Guy Maddin","Release":"Careful premiered at the New York Film Festival and, although it was not a commercial success elsewhere, \"single-handedly saved a struggling art-house cinema in Missoula, Montana\" where \"sell-out crowds had filled the house twice every night for two weeks.\"[3]Careful was released to home video in 2000, on a DVD that also includes an hour-long documentary on Maddin, Waiting for Twilight, directed by Noam Gonick and narrated by Tom Waits.[4] Careful is also included on the DVD boxed set The Quintessential Guy Maddin: 5 Films from the Heart of Winnipeg, released by Zeitgeist Video, alongside Archangel, Dracula: Pages from a Virgin's Diary, Twilight of the Ice Nymphs, and Cowards Bend the Knee.[5]","written_by":"Guy Maddin"}