{"original_language(s)":"English","production_company(s)":"PTEN","country_of_origin":"United States","original_network":"PTEN","created_by":"J. Michael Straczynski","distributor":"Babylonian Productions Rattlesnake Productions Synthetic Worlds","Synopsis":"Babylon 5 TV seasons and films 1993–2007In order of series chronology: 2245–48 • In the Beginning (1st film)* 2256 • Babylon 5 station commissioned 2257 • The Gathering (Pilot) 2258 • Signs and Portents (Season 1) 2259 • The Coming of Shadows (Season 2) 2260 • Point of No Return (Season 3) 2261 • No Surrender, No Retreat (Season 4)** 2261 • Thirdspace (2nd film)*** 2262 • The Wheel of Fire (Season 5)† 2263 • The River of Souls (3rd film) 2265 • The Legend of the Rangers (5th film) 2266 • A Call to Arms (4th film) 2267 • Crusade (spin-off series) 2271 • The Lost Tales: Voices in the Dark 2278 • In the Beginning (1st film)* 2281 • Babylon 5 station decommissioned* The framing story is set in 2278. ** The final episode of the season includes scenes of future events up to 3262 and beyond. *** The story is set between the two wars in season 4. † The final episode of series is set in 2281.In the earth year 2257, a multitude of humans and non-humans gather deep in neutral space at a new station, Babylon 5, which has recently become operational. Babylon 5 was built as a neutral venue for discussing and resolving issues between the five major spacefaring races of the galaxy, the humans, Narn, Centauri, Minbari and Vorlons. Commander Jeffrey Sinclair is in overall charge of the station.As the crew awaits the arrival of the fourth and final alien ambassador, Ambassador Kosh Naranek from the Vorlon Empire, a transport ship arrives from Earth, bearing Lyta Alexander, a human telepath who joins the station crew, and Del Varner, a civilian. Ambassador Kosh arrives two days ahead of schedule, and is on board the station less than a minute when he suddenly falls ill, apparently from poisoning. Babylon 5's chief medical officer, Dr. Kyle, conducts a medical investigation and seeks to prevent Kosh's death, while Security Chief Michael Garibaldi conducts a security investigation. Worried that, if Kosh dies, the Vorlons will attack and destroy the station, Dr. Kyle and Lt. Cmdr. Takashima persuade Lyta to perform an unauthorized mind scan on the unconscious Kosh. As she conducts the scan, Lyta sees Commander Sinclair poisoning the Ambassador. Lyta accuses Sinclair of attempted murder. A meeting of Babylon 5's Council, made up of delegates from all five races, resolves to extradite the Commander to the Vorlon homeworld for trial. Sinclair is told that he will be deported in twelve hours.Garibaldi comes to suspect Del Varner might have been involved in Kosh's poisoning. When he enters Varner's quarters, however, he discovers Varner dead in a fish tank. Lyta enters the medical lab, where she begins adjusting some of the settings that are keeping Kosh alive; when Dr. Kyle realizes what she's doing, he tries to stop her, and she attacks him. At that moment, the real Lyta Alexander enters the room; her double escapes.Upon further investigation in Varner's quarters, Garibaldi learns that Varner had been smuggling illegal items between systems, and that he most recently had gone to the Antares sector to acquire a changeling net: a device that can make an individual appear to look like somebody else. The crew realizes that Kosh had not been poisoned by Sinclair when he arrived at the station, but rather that he had been poisoned by someone who was using the changeling net to imitate Sinclair. Since the use of such a device would put out a lot of energy, Takashima uses her scanners to pinpoint an area of the station with a high concentration of unidentified energy use. Sinclair and Garibaldi head for that part of the station, just as a Vorlon squadron arrives in the vicinity of the station to pick up Sinclair for his voyage to the Vorlon homeworld.Sinclair and Garibaldi confront the mysterious assailant. Garibaldi is injured in the firefight and Sinclair faces the assassin himself. The changeling net is disabled, revealing the assailant to be a Minbari assassin. The assassin is a member of the Minbari warrior caste, and wanted to discredit Sinclair as retribution for Sinclair's role in the Earth-Minbari war ten years earlier. Sinclair asks the assassin why he did it; the assassin replies simply \"There is a hole in your mind.\" Sinclair, being informed that the assassin has triggered an explosive charge, manages to get away just before an explosion rips a hole in the station's hull, throwing the station off its axis, and beginning to tear it apart from the inside. Takashima uses the station stabilizers to reestablish the station's axis.The Vorlon delegation, now satisfied that Sinclair is innocent, drops all charges against him. In the station's garden, Sinclair reveals to Delenn what the Minbari assassin had said about the \"hole\" in Sinclair's mind. Delenn claims that it is just an old Minbari insult. Sinclair, however, tells her that he had fought in the climactic battle of the Earth-Minbari war, and that there is a twenty-four-hour period in the climactic battle, just before the Minbari surrendered, that he can't account for.Takashima declares Babylon 5 open for business.","babylon_5:_the_gathering":"The Gathering DVD Cover","executive_producer(s)":"Douglas Netter J. Michael Straczynski","cinematography":"Billy Dickson","directed_by":"Richard Compton","Changes between pilot and series":"Many elements of the pilot were changed when the series began, giving the pilot a different feel than the rest of the series. This was most evident in the prosthetics, sets, music, and cast members. Patricia Tallman played Lyta Alexander—she was replaced by Andrea Thompson as Talia Winters—but Tallman would return later in the series, first as a recurring character and then as a regular. The medical officer was Dr. Benjamin Kyle (played by Johnny Sekka), rather than Richard Biggs as Stephen Franklin. The explanation used for these cast changes is that these two characters saw Kosh outside his encounter suit and thus had to be removed from duty—Kosh's secrecy is a running theme in the show.The first officer was Laurel Takashima (played by Tamlyn Tomita), replaced for the series by Claudia Christian as Susan Ivanova. The alien characters—such as Delenn and G'Kar—appeared slightly different because the prosthetics were different for the pilot than the series. Also, Delenn was originally supposed to be a male character destined to become female at the end of season 1, but since they could not make Mira Furlan's voice male enough, they decided to play her as a pure female in the series.","original_release":"February 22, 1993","Versions":"There are two versions of The Gathering. The original version was a TV movie aired in 1993 on the Prime Time Entertainment Network as a pilot for the series. After a four-year run on PTEN, Babylon 5 moved to Turner Network Television (TNT) for its fifth and final season in 1998. Series creator and executive producer J. Michael Straczynski supervised a special edition of Babylon 5: The Gathering which aired on TNT immediately following the new TV movie, Babylon 5: In the Beginning. Scenes were edited to move at a faster pace, allowing the restoration of 14 minutes of footage adding exposition and character development.[1] Among the notable additions is a prophetic line spoken by Kosh when he first meets Sinclair. Lost in the special edition is a trip through the station's alien sector which some viewers felt looked too much like a zoo. The original music, composed by Stewart Copeland, is also replaced with a score by Christopher Franke, who composed music for the rest of the series, played by the Berliner Symphoniker.The special edition is included in the Warner Home Video DVD releases Babylon 5: The Gathering/In the Beginning and Babylon 5: The Movie Collection. The original version was previously available on AOL's now-defunct In2TV service, and Hulu, but is no longer available on either as of April 2014. The iTunes Store appears to carry the special edition as part of its Season 1 bundle, but not the original. The date listed is the original air date, but it opens with \"TNT Presents a Special Edition of...\" , and the run time is 1h35m.The original version was released on DVD by Warner Home Video in Region 2 only.","theme_music_composer":"Stewart Copeland Christopher Franke (1998 re-edit)","editor(s)":"Robert L. Sinise","genre":"Action Adventure Science Fiction","starring":"Michael O'Hare Tamlyn Tomita Jerry Doyle Mira Furlan Blaire Baron John Fleck Peter Jurasik Andreas Katsulas Johnny Sekka Patricia Tallman","running_time":"89 minutes","producer(s)":"Robert Latham Brown John Copeland (co-producer)","Notes":"When Del Varner (changeling) enters the quarters of his next victim using a card, the name Laurel Takashima is clearly visible on the panel.The rings used by Delenn to hurt G'Kar are never seen or mentioned in the series again. No explanation for their disappearance or origin is known.This is the only appearance in the series by Carolyn Sykes (Blaire Baron), although her breakup with Jeff is alluded to in the first season episode \"The Parliament of Dreams\".The conversation between G'Kar and Lyta regarding his bartering for telepath DNA is not revisited until the final season of the show. However, in the season one episode \"Legacies\", Susan Ivanova mentions the negotiations in reference to Na'Toth's attempts to win over Alisa Beldon.In the special edition, Commander Laurel Takashima tells Dr. Ben Kyle that she (against regulations) has someone occasionally bring her a plant to grow real coffee. In Season 3, Commander Susan Ivanova invites Lieutenant David Corwin to her quarters and tells him basically the same story.","written_by":"J. Michael Straczynski"}