{"country":"United States","distributed_by":"TLA releasing","Plot":"Nick (Jerome Elston Scott), Kevin (Nicholas Downs) and Tracy (Heather Bergdahl) are all the best of friends and are seemingly inseparable. They've spent most of their lives together and are so close that Kevin and Tracy (who are a couple) even allow Nick to watch while they have sex. This works out well until Nick meets Trevor (Micah Stuart) and begins questioning his own sexuality, as he's very attracted to Trevor. Things are made more tense by the fact that the three friends are in their senior year of high school and are rapidly approaching adulthood.","language":"English","Reception":"DVD Verdict gave a mostly positive review for Anderson's Cross, stating that while it \" won't prove terribly memorable\" it was overall a \"small, sweet movie with a good attitude and a lot of heart\",as \"a solid film; not a great one, but a solid debut.\"[2] While offering \"standard late teen fodder\",[2] the film includes actors whose abilities \"raise the film above your average indie drama.\"[2] While Jerome Elston Scott, Nicholas Downs, and Heather Bergdahl have chemistry as a threesome, it was the \"supporting cast gives the film its life.\"[2] Special note is made of the work of Michael Warren, Joanna Cassidy, and Bill Moseley. While the film itself is \"fairly forgettable\", the \"performances are downright excellent\" and the film can be recommended.[2] The reviewer concluded, \"Anderson's Cross is a small, sweet movie with a good attitude and a lot of heart. It won't prove terribly memorable, but it's a fine first feature.\"[2]Moving Pictures Magazine wrote that the film \"has its heart in the right place\", offering earnest intentions and having an undeniable sweetness, but \"unfortunately, it plays like a castrated teen Desperate Housewives.\"[1] With the film focusing on the relationships of middle-class teens and their families, it had elements reminiscent of Knots Landing or Peyton Place in \"its spotlight on alcoholism, absentee fathers, statutory rape, homosexuality and death\",[1] but presented in a sanitized version which diminishrd dramatic potential. The reviewer noted that director Scott had written the lead role of Nick Anderson with thought toward playing that role himself but was too old by the time of filming, which resulted in the role being miscast and becoming the film's greatest problem. As played by Michael Warren, the character of Nick was not compelling, being \"just too dopey, too hangdog, too hopelessly bland\" and lacking in magnetism and charisma for the other characters, as shared in the film, to have such romantic interest in him. It was offered that despite its flaws \"the script has nuggets of genuineness, and Micah Stuart as Trevor, the paperboy who romances Nick, is natural and dimensional\",[1] but the film's quality moments were \"not enough to cut through the sentimental facileness and surface melodrama of an ensemble of characters many of whose names we can’t even remember.\"[1]","cinematography":"Oktay Ortabasi","production_company":"Illumination Pictures","directed_by":"Jerome Elston Scott","release_dates":"May 20, 2010 (2010-05-20) (Limited)|||||","Production":"Jerome Elston Scott used the services of casting director Mark Sikes, and related that throughout the filmmaking process, the greatest challenge was financing.[6] In 2003, their official website offered that Kenneth \"Tennessee\" England was to direct and that casting was not yet announced.[7] By June 2007, casting was complete and a trailer had been released.[8] By July 2011 the film had screened at multiple film festivals and received positive response.[9]","Future plans":"In November 2010, Jerome Elston Scott revealed that Illumination Pictures was developing a prequel television series based on Anderson's Cross for cable television, aimed at a younger demographic to depict the growing relationships of the original film's main characters.[12] In a press release, Illumination Pictures announced that the series would center around the Anderson family and the teen friends as adolescents. Negotiations have begun with original cast members Michael Warren, Joanna Cassidy, and Joyce Guy to reprise their roles as the parents. Due to the prequel series taking place in an earlier timeline than the original, the roles of the teens will be cast with younger actors. Screenwriter Jerome E. Scott is expected to \"helm the pilot and the first six episodes.\"[13]","produced_by":"Nicholas Downs|Andrea Alseri|Corey Juarez|Christopher Khai|Micah Stuart|Jerome Elston Scott|","starring":"Michael Warren|Joanna Cassidy|Joyce Guy|Jerome Elston Scott|Nicholas Downs|Bill Moseley|","running_time":"98 minutes","music_by":"Cris Velasco","edited_by":"Leslie Ortabasi","written_by":"Jerome Elston Scott"}