{"based_on":"Novel: Agatha Christie","country":"Italy / Germany / France / Spain / United Kingdom","distributed_by":"AVCO Embassy Pictures","screenplay_by":"Harry Alan Towers (as \"Peter Welbeck\") Uncredited: Enrique Llovet","Background":"Two film adaptations were previously released (the 1945 version of the same title by René Clair and the 1965 Ten Little Indians), as was a videotaped made-for-television version broadcast in 1959.[2] This was the second of three versions of Christie's novel to be adapted to the screen by producer Harry Alan Towers; the others were the aforementioned 1965 version, and another in 1989.","and_then_there_were_none":"A film poster bearing the film's alternative title: Ten Little Indians","Plot":"A group of 10 people, strangers to one another, have all traveled to a hotel located deep in the deserts of Iran. Upon arrival they discover that their host is mysteriously absent. At dinner, they notice a display of figurines; the Ten Little Indians, as represented in the doggerel in each of their suites. They are accused via a tape recording by the host, U.N. Owen (\"unknown\"), someone none of them has ever met, of having committed various crimes in the past which went unpunished by the law.One by one, the guests start to die, first Michel Raven who sips poison in his drink and collapses. During the night, the cook, Elsa Martino makes a mad dash to escape, only to be strangled against a pillar; a method of Ancient Persian execution as noted by Hugh Lombard. A search of the hotel is intimated by General Salve who splits everyone into pairs. Not long after everyone separates from each other, Salve is stabbed to death in the hotel's catacombs. Their search reveals there is no one in the desert, except their seven selves, and that that there is a killer in their midst who is one of them. The next morning, Martino attempts to escape into the desert, only to expire from heat and exhaustion; his survival kit having been sabotaged. Ilona reveals her tragic past to the others, exposing the cause of her husband's suicide. Later, she is found dead, bitten by a venomous snake. The lights soon short out, leaving the five remaining guests in the dark, where at dinner, they reveal the nature of the crimes they stand accused of. Before Ann can offer her explanation, she leaves the others to return to her room. She screams, and the others rush to her. In the confusion, Judge Cannon is found dead in his bedroom, shot in the head. Dr. Armstrong poses his suspicions of Ann, and has her locked in her room. Hugh comes to Ann during the night to give her his gun, and reveals that he is in fact Charles Morley; the real Lombard had committed suicide and he took his place instead. In the morning, Dr. Armstrong is nowhere to be found. A search of the ruins leads to Blore being pushed to his death off a ledge. Ann and Morley find the body of Dr. Armstrong in the ruins and realize they are the only two remaining. Ann shoots Morley and returns to the hotel where she finds all the furniture sheeted up once more, except for a chair with a noose above. She find Judge Cannon alive, who reveals how he tricked Dr. Armstrong into helping him fake his murder, and how he wanted to seek perfect justice and perform his duty as an executioner of the guilty. He intimates to Ann to hang herself, to avoid being publicly executed as the last remaining person alive. He drinks poison, and prepares to die, right before Morley appears before him alive. Cannon chokes on the poison and realizes his scheme has been foiled.","language":"English","cinematography":"Fernando Arribas","production_company":"Corona Filmproduktion Talía Films COMECI","directed_by":"Peter Collinson","release_dates":"1974","Production":"This 1974 film follows the script of the 1965 version, right down to calling the Oliver Reed character \"Hugh\" (a name change made to accommodate Hugh O'Brian in the earlier version[citation needed]) instead of \"Phillip,\" which was the character's name in the novel and play. It is set in an abandoned hotel in the Iranian desert and was shot in the Shah Abbas Hotel (now known as the Abbasi Hotel) in Iran during its pre-revolution days. (The 1965 version was set at a snowed-in mountain chalet, and the 1989 one in the African savanna.)[citation needed]The film is an hour and 38 minutes long and was the first version of the novel to be filmed in colour.Some versions of the film feature a pre-credit sequence that shows the guests arriving by plane at an airport in Iran, where they subsequently board a helicopter to be transported to the hotel. This prologue was cut from the U.S. release.[citation needed]Herbert Lom, who plays Dr. Armstrong here, also starred in the 1989 version as the General.","produced_by":"Harry Alan Towers","starring":"Richard Attenborough Oliver Reed Charles Aznavour Stéphane Audran Elke Sommer Gert Fröbe","running_time":"98 min.","music_by":"Bruno Nicolai","edited_by":"John Trumper Gabrielle Reinecke Mike Crowley"}