{"based_on":"Clockers  by Richard Price","distributed_by":"Universal Pictures","Plot summary":"In a Brooklyn housing project, a group of clockers — street-level drug dealers — sell drugs for Rodney Little (Delroy Lindo), a local drug lord. Rodney tells Ronald \"Strike\" Dunham (Mekhi Phifer), one of his lead clockers, that another dealer, Darryl Adams (Steve White), is stealing from him and \"got to be got\", implying that he wants Strike to kill Darryl. Strike then meets with his brother, Victor Dunham (Isaiah Washington) and tries to persuade Victor to kill Darryl Adams.Rocco Klein (Harvey Keitel) and Larry Mazilli (John Turturro), homicide detectives, ride to the scene of Darryl Adams' murder. Larry and Rocco receive a phone call from another detective who says a man has confessed at a local church that he killed Darryl. The police meet Strike's older brother Victor at the church and take him in for questioning. In the interrogation room, Victor tells Rocco that he shot Darryl Adams in self-defense. Rocco finds holes in this story and starts looking into Victor's background which includes two jobs, a wife, two children, no criminal record, and aspirations to move out of the projects; Rocco comes to the conclusion that Victor is covering for his younger brother.Rodney accosts Strike for not committing the murder himself, with Errol, Rodney's enforcer, chastising Strike for getting his brother to do the hit. Later, Rodney tells Strike a story of a younger Rodney and an younger Errol (which goes to a flashback), where Errol threatened Rodney at gunpoint to kill a rival dealer, going as far as Errol holding a shotgun to Rodney's head. Rodney ends up killing the dealer, and (back to Rodney and Strike) Rodney tells Strike the reason Errol, his best friend, forced Rodney at gunpoint to do that was so that Errol could hold something over Rodney, if Rodney ever decided to tell on Errol, which was why Rodney told Strike to kill Darryl Adams himself.Rocco pressures Strike but Victor sticks to his story, so Rocco convinces Rodney that Strike has confessed and informed on Rodney's drug ring. Rocco arrests Rodney and then implicates Strike in front of his crew. Strike tries to play it off and deny that he was involved in Rodney's arrest, and his crew begins to turn on Strike, leading to the crew labeling Strike a snitch. Rodney calls Errol, advises that he is in jail and Rodney puts a hit out on Strike. Strike gets together some money and decides to leave town. As Strike walks to his car, he sees Errol sitting on his car, deducting that Errol is there to kill him. Strike hides behind a fence, but a younger boy who admired Strike, Tyrone, rides up to Errol on a bike and shoots him dead with Strike's gun. Later, Tyrone is taken into custody. With Rocco, Tyrone's mother and Andre listening, Tyrone confesses that he got the gun from Strike. Andre storms out of the interrogation room, and proceeds to look for Strike.Andre angrily beats Strike in front of the whole project, and threatens the on looking bystanders with a gun to stay back. Andre threatens to kill Strike if he ever talk to or even looks at the young boy again. As Andre says this to Strike, Rodney pulls up, which leads to Strike jumping in his car and driving to the precinct, with Rodney following. Strike runs into Rocco (who now has an arrest warrant for Strike), and runs into the precinct as Rodney pulls up. Rocco tries to intimidate Strike into confessing to the murder, and Rocco loses his composure when Strike continues to change his story. When Rocco grabs Strike and throws him against the wall, Strike's mother walks in with Mazzilli and Victor's wife. She advises Rocco that Victor confessed to the murder immediately when he got home, and how Victor was physically unable to leave his bed. Strike asks his mom what happened to the bail money he gave Victor's wife, which leads to Strike's mom angrily throwing the money in Strike's face. As this is going on, Rodney proceeds to damage Strike's car (going as far as breaking the windows, damaging the doors, and urinating in the car). Left with no other options and unable to go home, Strike asks Rocco to drive him to Pennsylvania Station.As they are sitting in a car, Rocco threatens Strike that if he ever sees him again, he will arrest him, let Andre beat him down, then arrest Rodney on the same charges and he will make sure Rodney and Strike share a cell and a bed in prison. Strike boards a train and leaves town. While Tyrone is playing inside his apartment with the train set that Strike gave him, outside the apartment, Rocco and Mazzilli responds to a homicide of Scientific, one of the guys in Strike's old crew. The film ends with a shot of Strike looking outward on a moving train, alluded to be far away from the city.","screenplay_by":"Richard Price Spike Lee","language":"English","Conception and adaptation":"David Denby of New York magazine said that while the original novel was \"filled with operational detail\" the film adaptation was \"more emotional\" and \"less factual\".[1] Denby further explained that Spike Lee, the film director, was \"concerned less with Strike's spiritual condition than with the survival of the entire community.\"[1]Denby said that Lee, in the work, \"jumps around a lot, telling his story in hot flashes\" as typical in Spike Lee films, arguing that the technique makes the film \"difficult to follow\".[1] In regard to the cinematography of Malik Sayeed, Denby said that it was \"rough and dark-hued, with an almost tabloid angriness in the scenes of violence.\"[1]","Reception":"The film received generally positive reviews. Roger Ebert gave the movie three-and-a-half stars,[3] and the review aggregator Rotten Tomatoes records that 67% of reviewers viewed it positively.[4]The movie had a poor opening at the box office.[5]","box_office":"$13,071,518","cinematography":"Malik Hassan Sayeed","production_company":"40 Acres and a Mule Filmworks","directed_by":"Spike Lee","Film poster":"Critics and film buffs were quick to notice that the poster, designed by Art Sims, was similar to Saul Bass' art for Otto Preminger's 1959 film Anatomy of a Murder. Sims claimed that it was a homage, but Bass regarded it as a rip-off.[2]","release_dates":"September 13, 1995","produced_by":"Martin Scorsese Spike Lee Jon Kilik","starring":"Harvey Keitel John Turturro Delroy Lindo Mekhi Phifer Isaiah Washington Keith David Pee Wee Love","running_time":"128 minutes","clockers":"Theatrical release poster","music_by":"Terence Blanchard","edited_by":"Sam Pollard","budget":"$25,000,000"}