{"based_on":"Characters created  by Rick Jaffa Amanda Silver Premise suggested by Planet of the Apes  by Pierre Boulle","country":"United States[2][3]","distributed_by":"20th Century Fox","Third film":"After seeing his cut of Dawn, 20th Century Fox and Chernin Entertainment signed Matt Reeves to return as director for a third installment of the reboot series. On January 6, 2014, Fox announced Reeves to direct as well as co-write along with Bomback, with a planned July 2016 release. Peter Chernin, Rick Jaffa and Amanda Silver will produce.[71] In January 2015, Fox delayed the release to July 14, 2017.[72][73] On May 14, 2015, the title was given as War of the Planet of the Apes.[74] In August 2015, Deadline reported that Gabriel Chavarria was cast as one of the humans in the film.[75] In September 2015, The Hollywood Reporter announced that Woody Harrelson had been cast as the film's antagonist, and that Chavarria's role was small.[76] In October 2015, The Wrap reports that Steve Zahn was cast as a new Ape in the film, retitled as War for the Planet of the Apes.[77]","Plot":"Ten years after the worldwide pandemic of the deadly ALZ-113 virus, or Simian Flu, human civilization is completely destroyed all over the world. Over 99% of the human population has died in the pandemic, while apes with genetically enhanced intelligence have started to build a civilization of their own.Near the ruins of San Francisco, Caesar leads and governs an ape colony located in the Muir Woods. While walking through the forest, Caesar's son Blue Eyes and his friend Ash encounter a man named Carver, who panics and shoots Ash, wounding him. Carver's party, led by a man named Malcolm, arrive while Blue Eyes calls for the other apes. Caesar orders the humans to leave, and they flee to their community of survivors in San Francisco, who are genetically immune to the virus and living in a tower within the city. Prompted by Koba, a scarred bonobo who holds a grudge against humans for mistreatment, Caesar brings an army of apes to the tower, where he announces that while the apes do not want war, they will fight to defend their home. He demands that the humans stay in their territory and states the apes will stay in theirs too.Malcolm convinces his fellow leader Dreyfus to give him time to reconcile with the apes and gain access to a hydroelectric dam in their territory, which could provide long-term power to the city. Dreyfus, distrustful of the apes, arms survivors using an abandoned armory. Malcolm travels into the ape village, where he is taken to Caesar. After a tense discussion, Caesar allows Malcolm to work on the dam's generator. As Malcolm, his girlfriend Ellie, and son Alexander work, they bond with the apes. Mutual distrust of both sides gradually subsides. Meanwhile, Koba discovers the armory and confronts Caesar, accusing him of loving humans more than apes. In response, Caesar severely beats Koba, but refrains from killing him; adhering to his philosophy that \"ape not kill ape\", Caesar forgives Koba. After recovering, Koba returns to the armory, where he kills two guards and steals an assault rifle. Returning home, he secretly kills Carver.The dam is eventually repaired, restoring power to the city. During the celebration, Koba sets fire to the apes' home, then, unseen to anyone else, shoots Caesar in the shoulder, causing him to fall from the settlement's main tree. In the panic of the loss of the alpha and the threat of the fire, Koba takes charge and, implicating Carver in the shooting, urges the apes to fight against the humans. He leads them into San Francisco, where they plunder the armory and charge the tower. Despite heavy casualties, the apes breach the building using a hijacked tank, and imprison the humans as Dreyfus flees underground. When Ash refuses Koba's orders to kill unarmed humans, citing Caesar's teachings, Koba kills Ash and imprisons the apes still loyal to Caesar.Malcolm's group finds Caesar barely alive and transport him to his former home in San Francisco. Caesar reveals to Malcolm that Koba shot him, realizing that apes can be as violent as humans. Malcolm leaves the group and heads to the city to find medical supplies for Caesar. While looking for medical supplies, Malcolm encounters Blue Eyes, who spares him and returns to the house with him, where he reconciles with his father. Blue Eyes then returns to the tower and frees the imprisoned humans and apes. Malcolm then leads the apes into the tower from below. After accomplishing this, Malcolm finds Dreyfus, who informs him that his men made radio contact with survivors at a northern military base, who are on their way to help fight the apes. Caesar confronts Koba at the top of the tower, but as they battle, Dreyfus detonates C-4 charges he planted beneath the tower. The resulting explosion kills him and collapses part of the tower. Caesar overpowers Koba, with Koba hanging over the edge of the tower. Pleading for his life, Koba reminds Caesar that apes do not kill apes, but Caesar states that Koba is not an ape and lets him fall to his death.Malcolm informs Caesar of the impending arrival of human military reinforcements. Caesar tells Malcolm that the humans will never forgive the apes for the war they started and advises him to leave with his family for safety as the two of them acknowledge their friendship. As Malcolm disappears, Caesar stands before a kneeling mass of apes, awaiting the war to come.","dawn_of_the_planet_of_the_apes":"Theatrical release poster","language":"English","Reception":"Dawn of the Planet of the Apes was a success at the box office with many critics calling it \"the summer’s best popcorn film\".[44] The film grossed $208,545,589 in North America and $500,290,000 in other territories for a worldwide total of $708,835,589.[6] Calculating in all expenses and revenues, Deadline.com estimated that the film made a profit of $182.18 million.[45] It had a worldwide opening of $103.3 million which was the 11th highest of 2014.[46] Worldwide it is the highest-grossing film in the Planet of the Apes franchise[47] and the ninth highest-grossing film of 2014.[48]In the U.S.A. and Canada, the film is the highest grossing film in the Planet of the Apes franchise, unadjusted for inflation[47] and the eighth highest-grossing film of 2014.[49] It opened on July 11, 2014 across 3,967 theaters and topped the box office on its opening day earning $27.7 million (including previews).[50] During its traditional three-opening, the film debuted at number one earning $72.6 million, which was 33% higher than its predecessor. Box Office Mojo pointed out that the film's good word of mouth as well as its predecessors', its darker tone, attachment of new characters and of first film's way of ending were all a determining factors of the film's strong opening.[51] It remained at the summit for two consecutive weekends in North America despite facing competition with The Purge: Anarchy in its second week.[52][53]Dawn of the Planet of the Apes earned $31.3 million during its opening weekend internationally from 4,913 screens in 26 markets where it opened at No. 1 in 14 of those. International opening weekend tallies of more than $5 million were witnessed in the UK ($14.88 million), Mexico ($12.94 million), South Korea ($11.5 million), Russia ($9.99 million), Brazil with ($9.2 million) and Australia ($6.6 million).[54][55] The film topped the box office outside North America for two non-consecutive weekends.[55][56]Dawn of the Planet of the Apes received widespread acclaim upon release.[57][58][59] On review aggregator site Rotten Tomatoes, it holds a score of 90% based on 268 reviews with a rating average of 7.9/10. The website's consensus reads: \"With intelligence and emotional resonance to match its stunning special effects, Dawn of the Planet of the Apes expands on its predecessor with an exciting and ambitious burst of sci-fi achievement.\"[60] On review aggregator Metacritic, which assigns a weighted average, the film has a \"generally favorable\" rating score of 79 out of 100 based on 48 reviews.[61]Guy Lodge of Variety said, \"An altogether smashing sequel to 2011's better-than-expected Rise of the Planet of the Apes, this vivid, violent extension of humanoid ape Caesar's troubled quest for independence bests its predecessor in nearly every technical and conceptual department, with incoming helmer Matt Reeves conducting the proceedings with more assertive genre elan than Rise journeyman Rupert Wyatt.\"[62] Todd McCarthy of The Hollywood Reporter stated that the film \"manages to do at least three things exceptionally well that are hard enough to pull off individually: Maintain a simmering level of tension without let-up for two hours, seriously improve on a very good first entry in a franchise and produce a powerful humanistic statement using a significantly simian cast of characters. In the annals of sequels, Dawn is to Rise of the Planet of the Apes what The Empire Strikes Back was to Star Wars—it's that much better.\"[63] Tim Robey of The Daily Telegraph said, \"There's evident patience and intelligence to the filmmaking all over, as well as an engagement with genuine ideas about diplomacy, deterrence, law and leadership. However often it risks monkey-mad silliness, it's impressively un-stupid.\"[64] Drew McWeeny of HitFix awarded the film \"A+\" and said \"Dawn is not just a good genre movie or a good summer movie. It's a great science-fiction film, full-stop, and one of the year's very best movies so far.\"[65]Ty Burr of the Boston Globe wrote that \"in bearing, speech, and agonized expressiveness, Serkis’s Caesar conveys the conflicts of a king with almost Shakespearean grandeur.\"[66] A.O. Scott of The New York Times praised the film for being able to balance out the action sequences and special effects with strong storytelling, writing that \"Dawn is more than a bunch of occasionally thrilling action sequences, emotional gut punches and throwaway jokes arranged in predictable sequence. It is technically impressive and viscerally exciting, for sure, but it also gives you a lot to think, and even to care, about.\"[67]Less favourable reviews included Andrew O'Hehir at Salon.com who wrote, \"Here’s a rule that has gradually become clear to me: Any film that begins with one of those fake-news montages, where snippets of genuine CNN footage are stitched together to concoct a feeling of semi-urgency around its hackneyed apocalypse, already sucks even before it gets started. This one makes a dutiful attempt to struggle back from that suckage, but it all ends in yelling.\"[68]Dawn of the Planet of the Apes was released by 20th Century Fox Home Entertainment on Blu-ray 3D, Blu-ray, and DVD on December 2, 2014.[69] According to Nielsen VideoScan, it subsequently became the best-selling home video release for the week.[70]","box_office":"$710.6 million[6]","cinematography":"Michael Seresin","production_company":"Chernin Entertainment TSG Entertainment","directed_by":"Matt Reeves","Soundtrack":"The film's score was composed by Michael Giacchino. The soundtrack was released by Sony Masterworks on July 8, 2014.[32]All music composed by Michael Giacchino.","release_dates":"June 26, 2014 (2014-06-26) (Palace of Fine Arts)|July 11, 2014 (2014-07-11) (United States)||||","Production":"After the release of Rise of the Planet of the Apes, director Rupert Wyatt commented on possible sequels: \"I think we're ending with certain questions, which is quite exciting. To me, I can think of all sorts of sequels to this film, but this is just the beginning.\"[7] Screenwriter and producer Rick Jaffa also stated that Rise featured several clues as to future sequels: \"I hope that we're building a platform for future films. We're trying to plant a lot of the seeds for a lot of the things you are talking about in terms of the different apes and so forth.\"[8]In an interview recorded after the release of Rise, Wyatt stated, \"We want to grow and evolve, in the films that will [hopefully] come after this, to the '68 original.\"[9] Wyatt also stated that he wants it to take place eight years after Rise, as a whole new ape generation can be born, and explore the dynamics of Caesar and Koba's relationship.[10] According to screenwriter Rick Jaffa, a version of the spaceship from the 1968 Planet of the Apes under the name Icarus was in Rise as a deliberate hint to a possible sequel.[11]In November 2011, Andy Serkis was the first to be announced as having closed a deal for a sequel to Rise. It was reported to be a \"healthy seven-figure deal\" for him to reprise his role as Caesar, the ape leader.[12] On May 15, 2012, it was announced Scott Z. Burns had been hired to do rewrites on the original screenplay by Rise writers Rick Jaffa and Amanda Silver.[13] On May 31, 2012, 20th Century Fox announced that the sequel would be titled Dawn of the Planet of the Apes.[14]On September 17, 2012, there were reports that director Wyatt was considering leaving the sequel due to his concern that a May 2014 release date would not give him enough time to make the film properly.[15] On October 1, Cloverfield director Matt Reeves was confirmed as his replacement.[16] Reeves had been working on developing a new Twilight Zone film.[17] On October 18, Mark Bomback, writer of Live Free or Die Hard, was reported to be doing a re-write for Reeves.[18]In December 2012, after the departure of director Wyatt, James Franco speculated that he would not be returning for the sequel, saying, \"Now Rupert's not a part of it so I don't know. My guess is I won't be in it. Nobody's talked to me since Rupert left.\"[19] Later, Matt Reeves revealed that Franco would be seen in a cameo in the film.[20][21] Freida Pinto, who played primatologist Caroline Aranha in Rise, confirmed that she would not be returning for Dawn.[22] In April 2014, when asked by IGN about the fate of Franco and Pinto's characters, producer Dylan Clark said, \"I mean, they’re the ones that died...They were ground zero of the virus.\"[23]In February 2013, actors Gary Oldman, Jason Clarke, and Kodi Smit-McPhee were cast in lead roles for the sequel, set ten years after the events from the first film.[24][25] In March 2013, actress Keri Russell was cast in a role.[26] That same month, Judy Greer was cast as Cornelia, a female chimp and love interest for Caesar.[27] Toby Kebbell, Enrique Murciano and Kirk Acevedo joined the cast during filming.[citation needed] On May 15, 2013, Jocko Sims was cast in a supporting role of military operative Werner.[28]Filming began in April 2013 around the town of Campbell River, British Columbia.[29] The location of Vancouver Island was chosen for its similarity to the locations depicted in the film, the forests, and the variety of landscapes.[30] Filming in New Orleans started in May 2013 and continued in July 2013 at various locations such as the former Six Flags park Six Flags New Orleans.[31]Like Rise, visual effects for Dawn were done by Weta Digital. In addition to the apes, Weta created other digital animals, such as a herd of elk, a grizzly bear, and CG doubles of the live horses. The elk were created using key-frame animation and the digital crowd enhancement software MASSIVE, the bear through key-frame animation, and the horses with a mixture of key-frame animation and motion capture.","produced_by":"Peter Chernin|Dylan Clark|Rick Jaffa Amanda Silver|","starring":"Andy Serkis|Jason Clarke|Gary Oldman|Keri Russell|Toby Kebbell|Kodi Smit-McPhee|","running_time":"130 minutes[1]","music_by":"Michael Giacchino","edited_by":"William Hoy|Stan Salfas|","Release":"On May 31, 2012, Fox announced that Dawn of the Planet of the Apes was scheduled for release on May 23, 2014.[14] It was announced on June 20, 2013 that the release date for Dawn was being pushed back two months to July 18, 2014.[33] On December 10, 2013, the film was pushed up one week to July 11, 2014.[34] The film premiered at the Palace of Fine Arts in San Francisco, California on June 26, 2014.[35] The film closed the 36th Moscow International Film Festival on June 28.[36]In Hungary, the largest cinema chain called Cinema City could not agree with the film's distributor, InterCom, and as a result it opened on July 17, 2014 on 45 screens, significantly fewer than similar big-budget productions.[37] However, the film still managed to top the weekend box office chart of the country beating Transformers: Age of Extinction, which had been leading the chart for three weeks (on 105 screens distributed by UIP Duna).[38]A viral marketing campaign for the film launched in July 2013 included a \"simian flu\" website[39] and mock PSA videos.[40] 20th Century Fox and Vice Media's Motherboard released three short films online in July 2014 which document the ten-year gap between the events of Rise of the Planet of the Apes and Dawn of the Planet of the Apes.[41] A novel titled Dawn of the Planet of the Apes: Firestorm which is also set between the events of the first two films was published in May 2014 by Titan Books.[42] A partnership with 20th Century Fox and Ndemic Creations saw mobile/PC game Plague Inc. get a Dawn of the Planet of the Apes-themed update on July 10, 2014. It allows players to create and customize a simian flu virus to infect the world and eradicate humanity whilst helping apes survive.[43]","written_by":"Mark Bomback|Rick Jaffa|Amanda Silver|","budget":"$235 million[4][5]"}