{"country":"United Kingdom","distributed_by":"Regal Film Distributors (UK) Paramount Pictures (USA)","Plot":"Five men enter a train carriage in London bound for Bradley, and are joined by a sixth, the mysterious Doctor Schreck (Peter Cushing) whose name, he mentions, is German for \"terror\". During the journey, the doctor opens his pack of Tarot cards (which he calls his \"House of Horrors\") and proceeds to reveal the destinies of each of the travellers. This provides the framework to tell five horror stories.The first story concerns an architect, Jim Dawson (Neil McCallum), who travels to a Scottish island to his former house to make alterations requested by the new owner, Mrs Biddulph (Ursula Howells). Mrs Bidduplh is described as a widow who bought the house to seek solitude to recover from the death of her husband. Behind a fake wall in the cellar, he finds the coffin of Count Cosmo Valdemar, who had owned the house centuries ago. Valdemar was killed in a conflict with the Dawson family, and had vowed to exact revenge on the owner of the house and reclaim his former home. Dawson soon discovers that Valdemar is emerging to take the form of a werewolf in the night, and believes the housemaid (Katy Wild) was killed by him. Believing the owner Mrs. Biddulph's life to be in danger, he melts a cross made out of silver by his ancestors to protect the house from Valdemar's spirit, to make silver bullets, which, according to legend, are the only means of killing a werewolf. On the night he encounters the wolf as it is about to attack Mrs Biddulph and shoots, he is baffled that the bullets don't kill it. Mrs Biddulph then reveals that she has replaced the silver bullets with ordinary ones. She reveals to Dawson that the true legend was that Valdemar would exact revenge on the last descendants of the Dawson clan, and that the placing of Dawson's body in place of Valdemar's in the coffin, would bring Valdemar back to life in human form. She reveals she was Valdemar's wife who had deliberately lured Dawson to kill him, even after 200 years.The second story has Bill Rogers (Alan Freeman), together with his wife and daughter (Ann Bell and Sarah Nicholls), returning from vacation to discover a fast-growing vine has installed itself in the garden. When the plant seems to respond violently to attempts to cut it down, Rogers goes to the Ministry of Defence, where he gets advice from a couple of scientists (played by Bernard Lee and Jeremy Kemp). It soon turns out that the plant has become intelligent — and harbours homicidal tendencies towards any threats to its existence.Story three is the intentionally comedic one. Biff Bailey (Roy Castle) is a jazz musician who accepts a gig in the West Indies, and foolishly steals a tune from a local voodoo ceremony. When he tries to use the tune as a melody in a jazz composition back in London, there are dire consequences. Running from an unknown force, Castle's character stumbles against a wall where there is a garish poster for \"Dr Terror's House of Horrors\". This story is probably based on the short story \"Papa Benjamin\" by Cornell Woolrich, which was also adapted by the television series Thriller and the radio series Suspense.Next is the tale of Franklyn Marsh (Christopher Lee), an art critic who seems more concerned with his own devastating wit than art itself. Painter Eric Landor (Michael Gough) bears the brunt of one of Marsh's tirades, but gets even by humiliating the critic publicly. When Landor takes it too far, Marsh responds by driving over him with his car, causing Landor to lose one of his hands. Unable to paint any more, Landor commits suicide. Marsh is then tormented by the disembodied hand, which seems immune to fire as well as attempts to contain it, leading to Marsh's eventual blindness in a car accident of his own.Lastly, Dr Bob Carroll (Donald Sutherland) returns to his home in the United States with his new French bride, Nicolle (Jennifer Jayne). Soon there is evidence that a vampire is on the loose, and Carroll seeks the aid of his colleague, Dr Blake (Max Adrian), only to find out that his bride is the vampire. Following Blake's advice, Carroll kills Nicolle. But when the police come to arrest Carroll for his wife's murder, Blake denies giving any such advice. When the police take Carroll away, Blake says that there is not enough place in the city for two doctors or two vampires, and he himself turns into a bat.The frame story ends with a twist: from the Tarot cards, the Doctor informs the men that the only way they can avoid these horrible destinies is by dying first. When the train stops, the men find out that they are dead, having already perished in a train wreck, and Doctor Schreck is revealed to be Death himself.","language":"English","cinematography":"Alan Hume","production_company":"Amicus Productions","directed_by":"Freddie Francis","release_dates":"23 February 1965 (UK) June 1965 (USA)","Production":"The film was a conscious attempt by Milton Subotsky to repeat the success of Dead of Night (1945). Subotsky wrote the original stories in 1948 when he was employed as a scriptwriter for NBC's Lights Out series.[1]Filming began on Dr. Terror's House of Horrors at Shepperton Studios on 25 May 1964 with a budget of £105,000. The script began as a stillborn television series in 1948 during the time when Dead of Night was a recent release. Milton Subotsky considered that movie to be \"the greatest horror film ever,\"[2] and used it as a blueprint for Dr. Terror and the rest of Amicus's portmanteau films. Filming was completed on 3 July 1964 and was released on 5 February 1965.Donald Sutherland was paid ₤1,000 for his performance.[1]","Cinematic process":"Dr. Terror's House of Horrors was filmed using the cinematic process known as Techniscope.","produced_by":"Max Rosenberg Milton Subotsky","starring":"Peter Cushing Christopher Lee Max Adrian Ann Bell Peter Madden Donald Sutherland Roy Castle","running_time":"98 minutes","music_by":"Elisabeth Lutyens","edited_by":"Thelma Connell","written_by":"Milton Subotsky","budget":"£105,000[1]"}