{"country":"United States","distributed_by":"20th Century Fox","Plot":"The story is about a lawsuit concerning injuries caused by a defective automobile. The suit takes on a personal dimension because the injured plaintiff's attorney, Jedediah Tucker Ward (Gene Hackman) discovers that the automobile manufacturer's attorney Maggie Ward (Mary Elizabeth Mastrantonio) is his estranged daughter.Jedediah Ward is a liberal civil rights lawyer who has based his career on helping people avoid being taken for a ride by the rich and powerful; he's pursued principle at the expense of profit, though he has a bad habit of not following up on his clients after their cases are settled.Jed's daughter, Maggie, has had a bad relationship with her father ever since she discovered that he was cheating on her mother, Estelle (Joanna Merlin), and while she also has made a career in law, she has taken a very different professional route by working for a high-powered corporate law firm and has adopted a self-interested political agenda.Jed is hired to help field a lawsuit against a major auto manufacturer whose station wagons have a dangerous propensity to explode on impact while making a left turn, but while his research indicates he has an all but airtight case against them, the case becomes more complicated for him when he discovers that Maggie is representing the firm he's suing.The auto manufacturer in the film also utilizes a \"bean-counting\" approach to risk management, whereby the projections of actuaries for probable deaths and injured car-owners is weighed against the cost of re-tooling and re-manufacturing the car without the defect (exploding gas tanks) with the resulting decision to keep the car as-is to positively benefit short term profitability.","language":"English","Reception":"Class Action opened at #4 in its opening weekend with $4,207,923 and ended with a domestic gross of $24,277,858; a worldwide total of $28,277,918 was made and the film was a moderate box office success.[1]The film received generally positive reviews; it currently holds a 75% 'fresh' rating on Rotten Tomatoes.[6] It holds a 58/100 on Metacritic, indicating \"mixed or average reviews\".[7]","box_office":"$28,277,918[1]","cinematography":"Conrad Hall","production_company":"Interscope Communications","directed_by":"Michael Apted","Production notes":"The central premise of the film is roughly analogous to the controversy surrounding the Ford Pinto and its fuel tank design. A 1977 article in Mother Jones alleged Ford was aware of the design flaw, refused to pay for a redesign, and decided it would be cheaper to pay off possible lawsuits. The magazine obtained a cost-benefit analysis that it said Ford had used to compare the cost of repairs (Ford estimated the cost to be $11 per car) against the cost of settlements for deaths, injuries, and vehicle burnouts. The document became known as the Ford Pinto Memo.[3][4][5]","release_dates":"March 15, 1991 (1991-03-15)|||||","produced_by":"Ted Field Scott Kroopf Robert W. Cort","starring":"Gene Hackman|Mary Elizabeth Mastrantonio|","running_time":"110 minutes","class_action":"Theatrical release poster","music_by":"James Horner","edited_by":"Ian Crafford","written_by":"Carolyn Shelby Christopher Ames Samantha Shad"}