{"country":"United States","distributed_by":"Orion Classics","screenplay_by":"Jennifer Chambers Lynch","story_by":"Philippe Caland","Plot":"Nick Cavanaugh is a lonely Atlanta surgeon obsessed with a woman named Helena. After she suffers a high grade tibial fracture in a hit-and-run motor vehicle accident in front of his home, he kidnaps and treats her in his house surreptitiously, amputating both of her legs above the knee. Later, he amputates her healthy arms above the elbow after she tries to choke him.Though Helena is the victim of Nick's kidnapping and mutilation, she dominates the dialogue with her constant ridiculing of him for all of his shortcomings.Eventually, Cavanaugh's actions are discovered by one of Helena's former co-workers. During a physical confrontation, Cavanaugh is killed, only to wake up and realize that the entire ordeal had been a dream he had at a hospital during Helena's surgery after the car accident.","language":"English","box_office":"$1.8 million[2]","cinematography":"Bojan Bazelli|Frank Byers|","production_company":"Main Line Pictures","directed_by":"Jennifer Chambers Lynch","release_dates":"September 3, 1993 (1993-09-03)|||||","Production":"A legal battle ensued when first Madonna,[5] then Kim Basinger backed out of the title role – eventually Basinger was the subject of an adverse jury verdict for over $8.1 million.[6] This caused Basinger to enter bankruptcy. The verdict was then set aside on appeal in 1994,[7][8] but the actress later settled for $3.8 million.[9][10]The score heard during the scene where Helena showers in a fountain, while a party crowd watches, was originally composed by Graeme Revell and based on the \"Love Theme\" used sparsely elsewhere in the film, with vocals by Bobbi Page. At the producers' request, \"The Fountain Song\", written and performed by Wendy Levy, replaced Revell's score in the DVD and subsequent releases.","produced_by":"Philippe Caland|Carl Mazzocone|","starring":"Sherilyn Fenn|Julian Sands|Bill Paxton|Kurtwood Smith|Art Garfunkel|","running_time":"105 minutes[1]","boxing_helena":"Theatrical release poster","music_by":"Graeme Revell","edited_by":"David Finfer","Release":"Boxing Helena premiered at the Sundance Film Festival in January 1993 and was theatrically released by Orion Classics in the United States on September 3, 1993, Entertainment Film Distributors in the United Kingdom on June 18, 1993, and Republic Pictures in other international territories.[11]The film performed poorly at the box office,[12] grossing only $1,796,389 in the domestic box office.[2]The film received negative reviews from critics upon release,[13] despite garnering praise at Sundance. On review aggregator website Rotten Tomatoes, the film has a 19% score based on 31 reviews, with an average rating of 3.7/10.[14] Metacritic reports a 26 out of 100 rating based on 14 critics, indicating \"generally unfavorable reviews\". Chicago Tribune critic Gene Siskel was one of the few positive notices, giving the film a 75 out of 100 score.[15]The film was nominated for the Grand Jury Prize at the 1993 Sundance Film Festival. Lynch won a Golden Raspberry Award for Worst Director at the 14th Golden Raspberry Awards in 1994."}