{"based_on":"The Stars in Their Courses  by Harry Brown","country":"United States","Poem":"The poem repeated in the film is \"Eldorado\", a ballad poem by Edgar Allan Poe. Caan continuously mispronounces the verse \"Ride, boldly ride\" as \"Ride, Bodie, ride,\" confusing audience members unfamiliar with Poe's poem.","distributed_by":"Paramount Pictures","screenplay_by":"Leigh Brackett","Plot":"Cole Thornton (John Wayne), a gunslinger-for-hire, is hired by wealthy rancher Bart Jason (Ed Asner) to help him in a range war with the McDonald family in the town of El Dorado. The local sheriff, an old friend of Thornton, J. P. Harrah (Robert Mitchum) gives Cole more details that Jason had deliberately left out, including the possibility of having to side against Harrah. Unwilling to fight his friend, Thornton quits, to the relief of saloon owner Maudie (Charlene Holt), who is in love with Thornton (and was for a time a romantic interest of Harrah's).The McDonalds learn of Thornton's presence in town. Fearing that he might come for them, Kevin McDonald (R. G. Armstrong) puts his youngest son, Luke, on guard. When Thornton passes by on his way back from rejecting Jason's offer, Luke (Johnny Crawford), who has fallen asleep, wakes and fires a wild warning shot whereupon Thornton reflexively shoots him. Luke is still alive when Thornton finds him, but he refuses treatment based upon the belief that a gut-shot man wouldn't have a chance anyway and commits suicide when Thornton turns his back on him.Thornton subsequently brings the boy's body to the McDonald ranch and offers an explanation. The only McDonald daughter, Joey (Michele Carey), impulsively rides off before Thornton can finish his story and ambushes him shortly thereafter. Her shot is not fatal, but the bullet lodges next to Thornton's spine and in time begins to trouble him by occasionally pressing against the spinal cord, causing temporary paralysis of his right side. The local doctor, Dr. Miller (Paul Fix), does not have the skill to remove the bullet and Thornton soon departs El Dorado for a new job.Several months later, Thornton runs into another gunslinger-for-hire named Nelson McLeod (Christopher George) and a young greenhorn with a peculiar hat called Mississippi (James Caan), who has come for revenge against one of McLeod's men for the murder of his old friend and mentor, Johnny Diamond. McLeod has been hired by Jason for the same job Thornton turned down and Thornton hears from McLeod about how Harrah has turned into a drunk after an unhappy love affair. Thornton decides to return to El Dorado, hoping to save Harrah from being gunned down by McLeod and his men. He is followed by Mississippi who also wishes to help, despite his lack of experience and terrible aim with a gun.Once Thornton and Mississippi arrive in El Dorado, they hear more of the story behind Harrah's change. The two men then join with Deputy Sheriff Bull (Arthur Hunnicutt) in order to get Harrah sober and cleaned up. Mississippi contributes an old folk recipe for a hangover that he learned from Johnny Diamond, promising it will make any man unable to drink liquor for a while. The concoction proves to be violently effective, and leaves Harrah sober and furious. Within a day of their arrival, McLeod and his men also come to El Dorado and are hired on by Bart Jason. When one of them shoots one of the McDonalds, Thornton, Harrah, Bull and Mississippi chase the shooter and his friends into an old church and then into Jason's saloon. Harrah arrests Jason and takes him to the jail for his part in the shooting of one of the McDonalds. Later that night, Thornton and Mississippi decide to patrol the town in the hope of keeping the peace and are deputized by Bull. There is another shootout with McLeod and his men, which results in a minor leg injury for Harrah.The next day, Maudie sends a message to Thornton and his friends, stating that McLeod's men are frightening her and her patrons. When Thornton and Mississippi go to help her, they are ambushed and Thornton has an attack that leaves him partially paralyzed and captured by McLeod. Subsequently, McLeod trades the injured Thornton for Bart Jason, a trade to which Harrah agrees, despite knowing that doing so will mean that nothing will stand in the way of McLeod going after the McDonalds.Sure enough, McLeod and his men shortly thereafter kidnap one of the McDonalds in order to force Kevin McDonald to sign over his water rights to Jason. Thornton and the others are forced to quickly come up with a plan to rescue Kevin McDonald's son and neutralize Jason and McLeod. Despite Thornton's paralysis and Harrah's leg injury, the two of them, along with Bull and Mississippi, return to town on wagons. While Thornton distracts Jason and McLeod outside of the front of the saloon, Mississippi, Harrah and Bull attack from the rear. The kidnapped McDonald is rescued, with a little help from Joey McDonald, Jason, McLeod and his men are killed, and order is restored to El Dorado. Thornton also begins to imply that he may discontinue his wandering ways in order to stay in the town with Maudie.","language":"English","Reception":"The film maintains a high critical praise, earning a 100 percent perfect rating on review compiler Rotten Tomatoes.[8] Popular critic Roger Ebert gave the film a near-perfect rating at 3 1/2 out of four stars,[9] stating \"El Dorado is a tightly directed, humorous, altogether successful Western, turned out almost effortlessly, it would seem, by three old pros: John Wayne, Robert Mitchum and director Howard Hawks\". Praised film poll, They Shoot Pictures, Don't They? ranked the film 799 out of 1,000 for the list of greatest films of all time.[10]The film was successful at the box office, generating North American rentals of $5,950,000 on box-office receipts of $12 million.[4]","box_office":"$5,950,000 (US/ Canada)[N 1][2][3]","cinematography":"Harold Rosson","production_company":"Laurel Productions","directed_by":"Howard Hawks","References":"NotesCitationsBibliography","release_dates":"December 17, 1966 (1966-12-17) (Japan)|June 7, 1967 (1967-06-07) (USA)||||","Production":"Leigh Brackett wrote the original script which she described as \"the best script I had ever done in my life. It wasn't tragic, but it was one of those things where Wayne died at the end.\" However she says the closer they got to production \"the more we got into doing Rio Bravo over again the sicker I got, because I hate doing things over again. And I kept saying to Howard I did that, and he'd say it was okay, we could do it over again.\"[6]Shot at Old Tucson Studios just west of Tucson, Arizona, as well as in and around Kanab, Utah, from October 1965 to January 1966, the film was Wayne's 138th picture and was actually filmed before The War Wagon, but its release was delayed so that Paramount's Nevada Smith with Steve McQueen would not have to compete with a John Wayne film at the box office. El Dorado finally reached the theatres in June 1967, a month after The War Wagon had opened.[7]Film footage from El Dorado was later incorporated into the opening montage of Wayne's final film, The Shootist, to illustrate the backstory of Wayne's character. Director Don Siegel used no scenes from any film shot before 1948 in The Shootist's frontispiece even though Wayne's career as a leading man began in 1930 with The Big Trail and had continued throughout the following two decades.[citation needed]Nelson Riddle's score, while melodic and competent, all too often evokes the kind of television scoring he made his living at—the Adam West Batman in particular—and therefore seems somewhat silly to modern, cable TV-reared audiences, when a conventional epic-style orchestral score would have been much more effective, even if it played against the somewhat lighthearted feel of the film.[citation needed]In the film, Mississippi gives Sheriff Harrah a concoction meant to deter him from further drinking. The ingredients include (among others) Cayenne pepper, ipecac (an emetic), mustard, croton oil (which induces diarrhea), asafoetida (often misspelled acifedida) and gunpowder.[citation needed]","el_dorado":"Theatrical release poster","produced_by":"Howard Hawks","starring":"John Wayne|Robert Mitchum|James Caan|Charlene Holt|Paul Fix|","running_time":"126 minutes","music_by":"Nelson Riddle","edited_by":"John Woodcock","budget":"$4,653,000[1]"}