{"country":"India","distributed_by":"Shakti Films","Plot":"In an idyllic hilly terrain, Indian Air Force officer Arun Varma (Rajesh Khanna) sings \"Mere Sapno Ki Rani\" atop an open jeep along with his co-pilot Madan (Sujit Kumar), while Vandana (Sharmila Tagore), the daughter of a doctor Gopal Tripathi (Pahadi Sanyal) demurely sneaks glances at him from a mini train. After a brief romance, they have a secret wedding.Soon afterwards, Arun dies in an air crash leaving behind a heartbroken and pregnant Vandana. His family refuses to accept the unwed mother-to-be since her marriage with Arun is never formalised. Meanwhile, her father also dies, leaving her destitute. Vandana's son is finally born, but she is forced to let a childless couple adopt him. Determined to be a part of his life, she accepts the responsibility of becoming his nanny. The boy is named Suraj. Her employer's brother Shyam (Manmohan) arrives and lusts for Vandana. He tries to harass her physically when no-one is around, but Suraj arrives and stabs him to death to save his nanny. When the police arrive police, Vandana takes the blame for the murder and is arrested while Suraj runs away and forgets this mishap as he grows up.Several years later, when Vandana is released from jail she is befriended by the jailer (Madan Puri) who takes her home and introduces her to his daughter Renu (Farida Jalal). Vandana comes face to face with Suraj (Rajesh Khanna) when she discovers that Renu is dating him. Suraj, just like how his father wished, is an air-force officer. He slowly starts remembering that he has seen Vandana somewhere, although Vandana wants to hide the truth as she feels Suraj may be embarrassed upon realising his parent's background and history. Vandana makes herself home at the jailer's house.Suraj is injured in an air crash like his real father Arun, but survives. While he is recuperating in the hospital, Vandana meets Madan, who knows that Suraj is Arun and Vandana's son. He wants to tell Suraj the truth, but Vandana denies wanting to let Suraj know that he is her son, fearing the consequences. Later when Vandana is not around, Suraj sees her diary where Arun's photo is found. Realising that Arun and Vandana are his true parents, he salutes Vandana's self-sacrificing attitude and accepts her as his own mother.","language":"Hindi","cinematography":"Alok Dasgupta","directed_by":"Shakti Samanta","Soundtrack":"The soundtrack of the film was composed by S. D. Burman, with lyrics by Anand Bakshi. Burman had already started recording the songs for Aradhana, but became very ill shortly thereafter. The responsibility for finishing the soundtrack fell on his son R. D. Burman, who used Kishore Kumar for the songs \"Roop Tera Mastana\" and \"Mere Sapnon Ki Rani\".[9][10] According to music and film expert Rajesh Subramanian, in \"Roop tera mastana\", Kersi Lord played the accordion, Homi Mullan played the duggi and Manohari Singh played the saxophone.","release_dates":"24 October 1969","Production":"The film was scripted by Sachin Bhowmick. The theme of the movie was based on the 1946 movie To Each His Own.[4] A day prior to the shooting of Aradhana, producer Surinder Kapoor showed Samanta his latest film, Ek Shrimaan Ek Shrimati with Shashi Kapoor as the lead which was also written by Sachin Bhowmick. Much to his surprise this film had similar ending as his own film. The following day Samanta decided to scrap his film, when writers Gulshan Nanda and Madhusudan Kalelkar visited his office. Upon hearing the issue, it was Gulshan Nanda who suggested to have a double role of father and son in the film. Originally the first hero was to die by the interval and a new hero was to step in.[5] The same evening, while Aradhana was being cancelled, Nanda recited a story of Kati Patang to Samanta, which he instantly liked, so for the next couple of hours they first rewrote the second half of Aradhana, and subsequently went on to discuss, Kati Patang.[6] The \"Roop Tera Mastana\" song sequence, which lasted more than three minutes and 30 seconds, was filmed in a single take.[7] Sharmila Tagore believes this was done due to time constraints.[8]","produced_by":"Shakti Samanta","starring":"Sharmila Tagore Rajesh Khanna Sujit Kumar Farida Jalal","running_time":"169 minutes","music_by":"S. D. Burman","edited_by":"Sahil Budhiraja","written_by":"Sachin Bhowmick"}