{"country":"United States","distributed_by":"Warner Bros.","Plot":"During a surprise 42nd birthday party for wealthy, well-known composer George Webber (Dudley Moore), thrown by his actress girlfriend Samantha Taylor (Julie Andrews), he finds he's coping badly with incipient middle age. From his car, George glimpses a bride-to-be (Bo Derek) and is instantly obsessed by her beauty, following her to the church, where he crashes into a police cruiser, is stung by a bee and nearly disrupts the wedding ceremony.George visits the priest, and learns the woman is Jenny Miles, daughter of a prominent Beverly Hills dentist. Later that night, Sam and George have an argument about George's failure to give her the attention she needs, his use of the term \"broad\", and the fact that he uses a telescope to watch a neighbor (a wealthy porn producer) perform carnal acts. The final straw for Sam occurs when George makes a remark subtly impugning her femininity, at which point Sam leaves in a huff.The following day, George spies on his neighbor again, hits himself with the telescope and falls down an embankment, causing him to miss Sam's phone call. Still obsessed with the young bride, George schedules a dental appointment with Jenny's father and learns Jenny and her husband went to Mexico for their honeymoon. The examination reveals a mouthful of cavities, requiring fillings in George's teeth. The after effects of the novocaine, aggravated by his heavy drinking, leave George completely incoherent. Sam finally reaches him on the phone but mistakes him for an intruder and calls the police, who hold George at gunpoint while trying to understand his gibberish. Unnerved by the day's events, George visits his neighbor's house to take part in an orgy. Sam arrives at George's and spots him through his telescope, widening the rift between them.While his songwriting partner Hugh (Robert Webber) consoles Sam and says she will need to decide how long to wait for George to grow up, George impulsively boards a plane and follows the newlyweds to their exclusive resort in Manzanillo, Colima, Mexico. In the bar, George becomes acquainted with a friendly bartender (Brian Dennehy), plays the piano and encounters an old acquaintance, Mary Lewis (Dee Wallace), who suffers from a lack of self-confidence because she blames herself for a series of failed relationships. When they attempt a fling, Mary interprets George's inadequacy in bed as confirmation of her own insecurities.At the beach, George sees Jenny―wearing a swimsuit with her hair braided in cornrows―and is awestruck again by her beauty. He notices that David, her husband (Sam J. Jones), has fallen asleep on his surfboard. George learns that beyond a certain point are powerful currents that can sweep a swimmer or surfer dangerously far from land. He rents a catamaran, clumsily but successfully rescues David, and becomes a hero. Sam sees him on a TV newscast and tries to contact him, but George (unaware that it is Sam) refuses the call. David, badly sunburned, is hospitalized, allowing Jenny and George to spend time alone together. After dinner, in her room, Jenny smokes a marijuana joint and then seduces George to the sounds of Ravel's Boléro.Although George is initially elated to find all of his fantasies being fulfilled, he is horrified when Jenny takes a call from her husband while in bed with him and casually informs him of George's presence. He is even more confused when David responds with a complete lack of concern (he had called to thank George for saving his life). When Jenny explains their open relationship and mutual honesty and that they only got married due to pressure from her conservative father, George is appalled; realizing that in contrast to the complete infatuation he has had with her, Jenny sees him as nothing more than a \"casual lay,\" George loses interest.Flying back home, George reconciles with Sam by apologizing and demonstrating a new maturity. Taking an idea from Jenny, he starts Ravel's Boléro on the phonograph and they make love with the music playing in the background. This is in full view of the neighbor's telescope, shortly after the neighbor has walked away in disgust, complaining that he has had enough of providing erotic entertainment to George and getting nothing in return.","language":"English","Reception":"10 opened #1 in the United States, earning $3,526,692 ($11,498,536 today) its opening weekend. The film went on to make a total of $74,865,517 ($244,093,852 today) in United States, making it one of the top grossing films of 1979.[1]10 received mostly positive reviews from critics and holds a 71% positive rating on the review aggregator Rotten Tomatoes.[2]In a positive review, Vincent Canby of The New York Times described the film as \"frequently hilarious\", praising the performances of Moore and Andrews, and concluding that 10 \"is loaded with odd surprises.\"[3] Roger Ebert of the Chicago Sun-Times gave the film a glowing four-out-of-four star review, calling it \"one of the best films Blake Edwards has ever made\" and stating \"What we're struck with, in 10, is the uncanny way its humor gets laughs by touching on emotions and yearnings that are very real for us. We identify with the characters in this movie: Their predicaments are funny, yes -- but then ours would be, too, if they weren't our own.\"[4] Ebert later named 10 one of the best films of 1979, ranking it 10th place on his yearly top ten list.[5]American Film Institute recognition:","box_office":"$74.8 million[1]","cinematography":"Frank Stanley","production_company":"Orion Pictures","directed_by":"Blake Edwards","release_dates":"October 5, 1979 (1979-10-05)","Production":"In numerous interviews, actor George Segal acknowledged that he was originally cast in the role of George, but changed his mind and pulled out of the production. Dudley Moore, a successful comedian not known for romantic leading-man roles, was then chosen by Blake Edwards to be Segal's replacement.The film was one of the first major Hollywood productions to shoot alternate versions of scenes in order to facilitate network television broadcast with a minimum of censorship. In the case of 10, this included filming two versions of scenes where Moore's character uses a telescope to spy on his male neighbor, another wealthy Beverly Hills resident who lives down the hill and regularly hosts parties with many nude women. In the theatrical version, porn actress Annette Haven plays the neighbor and appears nude; the TV version substitutes a blonde actress, (Denise Crosby in her first film role, later of Star Trek: The Next Generation fame), who wears a swimsuit.Similarly, in the version shown in theaters, when Bo Derek's character puts on Ravel's Boléro, she says that it's the perfect music to \"fuck\" to, whereas the version shown on television replaces \"fuck\" with \"make love\", while retaining Moore's character's startled reaction to hearing his idealized woman casually swearing.Frequent Edwards collaborator and famed comedian Peter Sellers had filmed a cameo for the film, but the scene was ultimately cut.The original music score for the film was composed by Henry Mancini. The film also features classical music by Sergei Prokofiev and Maurice Ravel, most notably Ravel's Boléro, which is identified as an ideal piece of background music for making love.","produced_by":"Blake Edwards Tony Adams","starring":"Dudley Moore Julie Andrews Robert Webber Bo Derek","running_time":"122 minutes","Cultural impact":"Bo Derek's appearance shot her to instant stardom and status as a sex symbol. Her beaded and plaited cornrow hairstyle in the film was widely copied and became eponymous.[7][8] Additionally, the scene where George sees Derek's character, Jenny, running on the beach in Mexico has become iconic and often parodied.[9]The film also brought renewed fame to the one-movement orchestral piece Boléro by Maurice Ravel. Use of the piece during the love scene between Derek and Moore's characters, with Jenny describing it as \"the most descriptive sex music ever written\", resulted in massive sales of the work. Because Ravel's music was still under copyright at the time, sales of Boléro generated his estate an estimated $1 million in royalties and briefly made him the best selling classical composer—over 40 years after his death.[10] Derek later appeared in a 1984 film named Bolero, titled to capitalize upon the piece's regenerated popularity.","music_by":"Henry Mancini","edited_by":"Ralph E. Winters","Release":"10 was released by Warner Bros. October 5, 1979, opening in 706 theaters.[1]10 was released on DVD through Warner Home Video May 21, 1997. A Blu-ray was later released February 1, 2011. The supplemental material, comprising the original theatrical trailer and a four-minute promotional documentary, are present on both media.","10":"Theatrical release poster by John Alvin.","written_by":"Blake Edwards","budget":"$7 million"}