{"based_on":"Divergent  by Veronica Roth","country":"United States","distributed_by":"Lionsgate|","screenplay_by":"Evan Daugherty Vanessa Taylor","divergent":"Theatrical release poster","Plot":"In a futuristic dystopian Chicago, society is divided into five factions: Abnegation (the selfless), Amity (the peaceful), Candor (the honest), Dauntless (the brave), and Erudite (the intellectual). The remaining population are the Factionless, who have no status or privilege in this society. When children reach the age of 16, they undergo a serum-induced psychological aptitude test which indicates their best-suited faction, though they are allowed to choose any faction as their permanent group at the subsequent Choosing Ceremony.Beatrice Prior (Shailene Woodley) was born into Abnegation, which runs the government. Her father, Andrew Prior (Tony Goldwyn), serves on the ruling council along with the head of Abnegation, Marcus Eaton (Ray Stevenson). Beatrice takes her test with a Dauntless woman named Tori Wu (Maggie Q) as her proctor. Her results show equal attributes of multiple factions, meaning she is Divergent. Her divergence includes Abnegation, Erudite, and Dauntless. Tori records her results as Abnegation and warns her to keep the true result a secret, saying that because Divergents can think independently the government cannot control them and they are considered threats to the existing social order.The next day at the Choosing Ceremony, Beatrice's brother Caleb Prior (Ansel Elgort) chooses Erudite. After some indecision, Beatrice defects to Dauntless. After the ceremony, Beatrice meets Christina (Zoë Kravitz), Al (Christian Madsen), and Will (Ben Lloyd-Hughes), three other initiates from other factions who also chose Dauntless. Christina and Al are from Candor, and Will is from Erudite. The initiates' commitment and fearlessness are immediately tested, and Eric Coulter (Jai Courtney), a brutal Dauntless leader, makes it clear that anyone not meeting Dauntless' high expectations will be expelled from the faction to become Factionless. Beatrice is the first to volunteer for a leap of faith from a tall building into a dark hole, landing in a net. When Four (Theo James), a transfer initiates' instructor, asks her name, she shortens it to \"Tris\" leaving her Abnegation childhood behind.Tris initially struggles in Dauntless training, ranking far below the cutoff after the first evaluation, but with Four's help slowly improves. Eric matches her against her nemesis — Peter (Miles Teller) in a fight. Tris is soundly defeated and wakes up in the infirmary. Informed that she will miss the most important test, Capture The Flag, Tris leaves the infirmary and joins the other initiates, secures her team's victory, and makes the final cut.In the next phase of training, the initiates face their worst fears in psychological simulations. Divergents are resistant to serums and simulations, so Tris excels at these tests, solving them in peculiar ways, but Four warns her to solve the challenges as a normal Dauntless would in order to hide her abilities.Tris visits Caleb, who tells her that Erudite is planning to overthrow Abnegation and become the ruling faction. On her return to Dauntless quarters, Tris is attacked by Al, Peter, and Drew before being rescued by Four. The next day Al pleads for Tris' forgiveness but she refuses, calling him a coward. He later kills himself by jumping into \"The Chasm\" rather than live with the shame.To prepare her for the final test, Four takes Tris into his own fear simulations, where she learns that he was Tobias Eaton, the son of Marcus Eaton. After the simulation, they kiss. Tris then passes her test and is officially initiated into Dauntless. The rest of the Dauntless are injected with a serum supplied by Erudite which is supposedly for tracking, but is actually for mind control.The next morning, the Dauntless prepare to execute Abnegations by the orders of the Erudites. Divergents are unaffected by the new serum, so Tris must blend in to avoid suspicion. She finds Four, who reveals himself as a Divergent. While the Dauntless move to raid Abnegation, Tris and Four separate from the group and attempt to locate Tris' parents, but Eric realises Four is not under control and captures the two. Four is taken into custody while Tris is ordered to be executed. Her mother Natalie (Ashley Judd) appears and liberates her but is shot dead as they flee.Tris finds her father in hiding with several Abnegations including Caleb and Marcus. The group sneaks into Dauntless headquarters, where Tris encounters Peter and forces him to lead them to Erudite's control center. Her father sacrifices himself in a shootout, and Tris goes in alone to find Four, who is now under stronger mind control designed for Divergents and attacks her. Using her knowledge of his fears, she manages to wake him from the mind control and the two enter the central control room, where Erudite leader Jeanine (Kate Winslet) is about to have the Dauntless army execute the entire Abnegation faction. Tris uses a sample of the mind control serum on her to force her to cancel the program. The group escapes the compound and boards a train out of the complex.","language":"English","Reception":"Divergent earned $150,947,895 in North America, and $137,800,000 in other countries, for a worldwide total of $288,747,895.[3] Calculating in all expenses, Deadline.com estimated that the film made a profit of $71.87 million.[74]On its opening weekend, the film attained the No. 1 spot in domestic and worldwide box office rankings by Rentrak.[75][76] The film grossed $4.9 million in late night screenings, on Thursday March 20, 2014.[11] On its opening day, the film grossed $22.8 million in the United States (including the Thursday night gross).[77][78][79] Divergent accumulated $54,607,747 from 3,936 theaters at an average of $13,873 per theater, on its opening weekend in the United States and Canada[80][81][82] and grossed $1.7 million internationally from four territories, with a worldwide total of $56,307,747.[83][84][85]Divergent received mixed reviews from critics. Review aggregator Rotten Tomatoes gives the film a 40% rating based on reviews from 200 critics, with an average score of 5.4/10. The site's consensus states: \"With an adherence to YA formula that undercuts its individualistic message, Divergent opens its planned trilogy in disappointingly predictable fashion.\"[86] Metacritic gives the film a score of 48 based on reviews from 38 critics, indicating \"mixed or average reviews\".[87] Audiences surveyed by CinemaScore were more receptive to the film, giving it a CinemaScore grade of \"A\". The survey group was 69% female and half of the audience was over 25.[88][89] The main criticisms of the film were its generic execution and predictable plot.[90][91] Bruce Diones of The New Yorker called it, \"barely diverting\",[92] and Jordan Adler of We Got This Covered said it was a \"plodding and generic dystopian drama\".[93] Several critics have compared the film unfavorably with other young-adult fiction adaptations such as Harry Potter and, predominantly, The Hunger Games. Andrew Barker of Variety said, \"Unlike the “Harry Potter” series’ tangible, fully dimensional Hogwarts or “The Hunger Games’” colorfully variegated districts, “Divergent’s” vision of new Chicago doesn’t have much to distinguish it from a standard-issue post-apocalyptic pic.\"[94] Peter Travers of Rolling Stone wrote that, \"At least The Hunger Games spawned two terrific movies and a breakthrough star in Jennifer Lawrence. Onscreen, Divergent ignites only indifference.\"[95] However, Peter Debruge of Variety considered it a much better adaptation writing that, \"[although] it shares a fair amount of DNA in common with “The Hunger Games,” it ranks as far superior.\"[96]Though the film overall received a mixed reception, many critics praised Shailene Woodley and Theo James for their portrayals as Beatrice Prior and Tobias Eaton. According to Todd Gilchrist of The Playlist, \"Woodley makes for more than uncertain enough of a hero to add detail and meaning to the implosion of this world\", adding that \"there's little artifice to her performance, and the mundane honesty of her reactions create a believability that the world would otherwise lack.\" Speaking of James's performance, Gilchrist adds that he \"manages the considerable accomplishment of seeming like a real grown-up man\" and that he \"makes the character's transformation from hardass to collaborator seem natural, if inevitable\".[97] Drew McWeeny at HitFix said, \"it helps that [they] got Woodley and James in the leads. [Woodley's] like a walking empathy battery, wide-open emotionally, easy to read and enormously appealing\", also adding that James is \"incredibly natural onscreen\".[98]Andrew Osmond of SFX magazine was more receptive to the film, calling it \"an often entertaining, and sometimes very interesting, piece of teen SF\".[99] Andy Lea of Daily Star wrote that \"the satire is not as sharp as that of The Hunger Games and the training scenes borrow heavily from the much smarter Ender's Game. But it's also stylish, tense and surprisingly pacy.\"[100] Orlando Weekly's Sam Allard gave the film a 3/5 rating, praising Shailene Woodley's performance by saying she \"rescues and then raises up a film that could have been an utter disaster\".[101] Christy Lemire of RogerEbert.com agreed with this sentiment, writing, \"the performances—namely from stars Shailene Woodley and Theo James and Kate Winslet in a juicy supporting role—always make the movie watchable and often quite engaging\".[102] Michael O'Sullivan of The Washington Post felt that the film surpassed its source material, feeling that \"it's rare that a movie is as good as the book on which it's based. It's even more unusual when it's better.\"[103] Leigh Paatsch of the Herald Sun dubbed the film a \"solid first-up effort for the Divergent franchise\",[104] and Margaret Pomeranz of At the Movies gave praise to director Neil Burger, stating that he \"handles the action with aplomb\".[105]The Playlist's Todd Gilchrist gave it a mixed review saying that it has \"great ideas ... and some terrific character work, but it's given such uneven attention, alternately languished upon and glossed over\".[97] IGN's Matt Patches gave it 5.8 out of 10, citing its similarities to other young adult films and contrived Dauntless plot line. He praised lead actors Theo James and Shailene Woodley's performances, judging that they \"add personality and physicality to the limp script they're acting out\".[106] Scott Mendelson of Forbes magazine echoed these sentiments, arguing that despite Woodley's excellent performance, \"the generic story reduced a large portion of the mythology to irrelevancy\". Mendelson believed that the film would please the novel's fanbase.[107]","box_office":"$288.9 million[3]","cinematography":"Alwin H. Küchler","production_company":"Red Wagon Entertainment Summit Entertainment","directed_by":"Neil Burger","Music":"The score for Divergent was composed by Junkie XL and executive produced by his longtime mentor Hans Zimmer. Ellie Goulding's Beating Heart was included in the film as original soundtrack and later the assisting video was also released from Goulding's YouTube channel. Randall Poster served as the film's music supervisor.[51][52] The original soundtrack was released on March 11, 2014, while the Original Score of the film was released on March 18, 2014, by Interscope Records.[53][54]","release_dates":"March 18, 2014 (2014-03-18) (Los Angeles Premiere)|March 21, 2014 (2014-03-21) (United States)||||","Production":"In March 2011, Summit Entertainment picked up the rights for Divergent with Douglas Wick and Lucy Fisher's production company Red Wagon Entertainment.[12] Neil Burger was announced as the director on August 23, 2012.[13] Evan Daugherty, who co-wrote the screenplay with Vanessa Taylor, said, \"I get hung up on the toughness of the movie but of equal importance is the love story between Tris and Four. It's inherently and inextricably linked to Tris's character journey. There will be plenty of sexual tension and chemistry, but it's important that all of that stuff doesn't just feel like it's thrown in, but that it all helps Tris grow as a character.\"[14] Daugherty further added, \"It's tricky because the book is a very packed read with a lot of big ideas. So, distilling that into a cool, faithful two-hour movie is challenging. Not only do you have to establish five factions, but you have to acknowledge that there's a sixth entity, which is the divergent, and you also have the factionless. So there's a world that really has to be built out for the big screen... the movie is going to do it a little more efficiently.\"[15] Author Veronica Roth said about the script of the film: \"Reading a script is a really interesting experience. I'd never read a script before. I was really impressed by how closely it stuck to the general plot line of the book.\"[16]Initially, the budget of the film was $40 million but Lionsgate later increased it to $80 million (which finally changed to $85 million) due to the success of The Hunger Games. Analyst Ben Mogil said, \"Divergent is more similar to Hunger Games in that the company owns the underlying economics (i.e. production) and the budget (at $80[million]) is more manageable.\"[17]On October 22, 2012 it was announced that Shailene Woodley had landed the lead role of Beatrice \"Tris\" Prior.[18] Lucas Till, Jack Reynor, Jeremy Irvine, Alex Pettyfer, Brenton Thwaites, Alexander Ludwig and Luke Bracey were all considered for the role of Tobias \"Four\" Eaton.[19][20] On March 15, 2013, it was announced that Theo James had been cast as Four.[21]Though James was 10 years older than the character when cast, Roth praised his casting: \"I was sure within seconds: this was 'Four', no question. Theo is able to capture 'Four's' authority and strength, as well as his depth and sensitivity.\" She also mentions the chemistry between him and Shailene: \"He is a perfect match for Shailene's incredibly strong presence as Tris. I'm thrilled!\"[22] The producers said about his casting: \"We took our time to find the right actor to fill the role of Four, and Theo is definitely the perfect fit. Veronica has crafted a truly iconic character in Four and we cannot wait to begin production and bring him and this story to life for millions of fans around the world.\"[21]On March 11, 2013, it was announced that the roles of Tori, Christina, and Caleb had gone to Maggie Q, Zoë Kravitz, and Ansel Elgort respectively.[23] Ray Stevenson, Jai Courtney and Aaron Eckhart were announced to be in talks to join the cast on March 15, 2013.[24] Stevenson and Courtney joined the cast as Marcus Eaton and Eric.[25] That same day, Miles Teller was cast as Peter.[26] Kate Winslet was announced to be in talks on January 24, 2013.[27] Later, it was confirmed that she would portray Jeanine Matthews.[28] Talking about playing the negative character for the first time, Winslet said, \"I'm no idiot. The idea went through my head that I have never played a baddie before, I was almost kind of surprised.\" Since Winslet joined filming late, she used that distance from her co-stars to appear aloof on the first day of her shoot. \"I wanted to break it and say, 'It's OK, I'm really fun. I promise.' But I thought, just for today, I'd let them think that I am a complete bitch.\"[29] Winslet was five months pregnant during the shooting of the film and her pregnancy was concealed using various props. According to Burger, \"We had to be very strategic in the way that we shot her. She always had some sort of file or case in her hand that was sort of protecting, you know, her bump.\"[30] On March 25, 2013, Ben Lamb was cast as Edward, Ben Lloyd-Hughes as Will, and Christian Madsen as Al.[31] In April 2013, Ashley Judd and Tony Goldwyn joined the cast as Natalie and Andrew Prior, Beatrice's parents.[32][33]Filming began in Chicago on April 16, 2013 and concluded on July 16, 2013.[34][35][36] Virtually all production photography took place in Chicago; many of the interior locations were filmed at Cinespace Chicago Film Studios.[37] Scenes for the \"choosing ceremony\" were shot at 17th Church of Christ, Scientist, Chicago on East Wacker in downtown Chicago,[38] with outdoor shots taken at Pioneer Court.[39] Filming also took place at the Navy Pier Ferris Wheel; the entire area was treated with dirt and rust to appear more dystopian.[40] Additional scenes were shot at 57th Street and Ellis Avenue near the University of Chicago,[41] at Federal Street where fake L tracks were constructed[42] and at Michigan Avenue.[43] Scenes were also filmed in the University of Chicago's Joe and Rika Mansueto Library.[44]For the Abnegation sector, the production team constructed the set on Wells Street in downtown Chicago.[45] In late June, filming took place at 1500 S Western Avenue and 600 S. Wells Street, Chicago.[46] In the last schedule, filming moved to the Chicago River and continued at Lake Street Bridge, Wacker Drive and LaSalle Street Bridge.[47] Filming wrapped on July 16, 2013.[48] On January 24, 2014, additional filming began in Los Angeles, finishing two days later, which officially became the last day of shooting.[48]Post-production work began after filming wrapped.[49] On July 18, Summit and Lionsgate issued a joint statement announcing the film would be released in IMAX format: \"We're delighted to continue our successful collaboration with IMAX, with whom we have already partnered on the global blockbuster Hunger Games and Twilight Saga franchises, and we're especially pleased that we can introduce our newest young adult franchise, Divergent, to the movie going public in the premium IMAX format that celebrates its status as a special and memorable event.\"[50]","Distribution":"The first image of Shailene Woodley as Beatrice \"Tris\" Prior was revealed by Entertainment Weekly on April 24, 2013.[55] A few seconds sneak preview footage of the film was shown at the 2013 Cannes Film Festival.[56] On June 7, Entertainment Weekly released a still of Theo James (Four) showing the Dauntless initiates around their new headquarters.[57] The magazine released several more stills on July 19.[58] On July 16, USA Today released the first image of Kate Winslet as Jeanine Matthews.[29]On July 18, 2013 Summit held a sold-out San Diego Comic-Con panel in Hall H. Shailene Woodley, Theo James, Maggie Q, Zoe Kravitz, Ansel Elgort, Ben Lloyd-Hughes, Amy Newbold, Miles Teller, Christian Madsen, director Neil Burger, and author Veronica Roth attended the panel and answered fan questions, along with the showing of exclusive film clips.[59]On August 22, 2013, a sneak peek of the first teaser trailer was released by MTV.[60][61][62] The full teaser was released on August 25, 2013 during the pre-show of the MTV Video Music Awards.[63][64][65] Two official posters featuring Woodley and James as Tris and Four and highlighting their tattoos were released on September 23, 2013.[66][67] Neil Burger released the full official trailer on November 13, 2013.[68][69] On February 4, 2014 Shailene Woodley and Theo James released the final trailer for the film during their appearance on Jimmy Kimmel Live!.[70]The marketing campaign for the film cost at least $50 million.[71]On its first day of advance ticket sales, the film sold half of its tickets.[72]Divergent was released on DVD and Blu-ray on August 5, 2014.[10] Prior to its DVD release, a deleted scene from the film featuring Miles Teller as Peter Hayes and Ben Lamb as Edward was released on July 30, 2014.[73]","produced_by":"Douglas Wick|Lucy Fisher|Pouya Shabazian|","starring":"Shailene Woodley|Theo James|Ashley Judd|Jai Courtney|Ray Stevenson|Zoë Kravitz|Miles Teller|Tony Goldwyn|Ansel Elgort|Maggie Q|Kate Winslet|","running_time":"139 minutes[1]","Sequels":"On May 7, 2013, Summit Entertainment revealed that a sequel based on Insurgent was in the works. Brian Duffield, writer of Jane Got a Gun, was hired to write the script.[111] The sequel was released on March 20, 2015. The third film, based on the novel Allegiant, was initially announced as a single film scheduled for release on March 18, 2016.[112][113] In December 2013, it was announced that Neil Burger will not return to direct the sequel, due to him still working on the first film.[114] On February 11, 2014, it was announced that Robert Schwentke would take Burger's place for the next installment.[11][115][116] Principal photography for The Divergent Series: Insurgent began in Atlanta on May 27, 2014[117] and concluded on September 6, 2014.[118]On April 11, 2014, Summit Entertainment announced that the third film would split into two films titled The Divergent Series: Allegiant – Part 1 and The Divergent Series: Allegiant – Part 2, with Part 1 scheduled to be released on March 18, 2016 and Part 2 scheduled to be released on June 9, 2017.[119][120] On December 5, 2014, it was announced that Robert Schwentke would return to direct Part 1.[121] On September 10, 2015, it was announced that the two films would be re-titled, with Part 1 being renamed as Allegiant and Part 2 as Ascendant.[122]On February 8, 2016, it was reported that Robert Schwentke, who directed both Insurgent and Allegiant, would not return to direct for the final film.[123] Lee Toland Krieger will replace Schwentke as the director of the film.[124]","music_by":"Junkie XL","edited_by":"Richard Francis-Bruce|Nancy Richardson|","budget":"$85 million[2][3]"}