{"country":"United States","distributed_by":"Buena Vista Pictures","screenplay_by":"John Byrum","duets":"Theatrical release poster","Background":"This was the only time Gwyneth Paltrow and her producer/director father Bruce Paltrow worked together on a film project, and it was also Bruce Paltrow's last production before his death.Brad Pitt was first cast in Speedman's role, but, after he and Gwyneth Paltrow announced the end of their off-camera romance, Pitt decided not to take the role.The film locations include Las Vegas, Nevada; British Columbia, Canada; and Los Angeles, California.","Plot":"The story revolves around unrelated pairs of people who spend time in karaoke bars across the United States in the week leading up to a big contest in Omaha.All three pairs end up at the Omaha contest, each having won the right to compete there for $5,000 by virtue of winning in one of the smaller towns. Finally accepting his daughter, Ricky invites her to perform a duet with him of her mother's favourite song, Cruisin'. Billy discovers that Suzi's bravado is hollow when he finds her sitting on the floor in the ladies' room, vomiting in the toilet from stagefright, but he convinces her to compete. After Reggie sees the police arrive at the contest, investigating the service station shooting, he performs an a capella version of Free Bird before pulling a gun on stage, prompting police to shoot him; he gives Todd the opportunity to lay full blame for the service station shooting on him, and to return to his old life.After the contest, Billy and Suzi continue on their way to California. Billy invites Liv (with whom he had been lightly flirting at the contest) and Ricky to join them, and they resolve to take a slight detour to another karaoke contest in Nevada. Todd and Candy contemplate reconciliation, but the fate of their relationship is left open.","language":"English","Reception":"Film critic Roger Ebert gave the film a thumbs down on his television program, and wrote on his newspaper review, \"Duets has little islands of humor and even perfection, floating in a sea of missed marks and murky intentions.\"[2] Kenneth Turan, film critic for the Los Angeles Times, described the film as \"six characters in search of a movie. Any movie will do...\"[3]Critic Bob Graham, writing for the San Francisco Chronicle, liked the spirit of the film and the acting, and he wrote, \"Cut 'Duets' some slack. This is an appealing, and ultimately moving, ensemble comedy/drama about ordinary folks whose one chance at anything resembling stardom is a karaoke contest...The fable style is a fragile one. The Ally McBeal test probably applies here. Fans of that show are likely to give themselves over to Duets, too.\"[4]Variety critic Todd McCarthy singled out Giamatti's work and character, writing, \"Giamatti gets the lion's share of Byrum's good lines and if the film is to go over with auds, it will be largely due to this character and performance, which reps one of the funniest sustained rants against the lowest common denominator in American culture that has been seen in ages.\"[5]Overall, many critics echoed Stephanie Zacharek's review in Salon.com. She wrote, \"Its three interlocking stories don't find the right rhythmic balance, and some of the dialogue is stiff and mannered.\" Zacharek did praise the acting and the film's message. She added, \"In that respect, the way Duets treats its characters is refreshing. There are brief moments when it reminds us that plenty of people enjoy karaoke at the expense of their audience (during one scene an Asian businessman warbles tunelessly in the background), but Duets isn't out to make anyone look ridiculous.\"[6]","box_office":"$4,739,023","cinematography":"Paul Sarossy","production_company":"Hollywood Pictures","directed_by":"Bruce Paltrow","Home media":"A DVD of the film was released on May 8, 2001 by Hollywood Pictures Home Entertainment. The DVD contained additional features: a commentary track by director Bruce Paltrow and producer Kevin Jones, additional scenes, conversations with director Bruce Paltrow, and a multi-angle music video of \"Cruisin'\".","Soundtrack":"An original motion picture soundtrack album was released on September 12, 2000 by Hollywood Records. The CD contained twelve tracks including the original music composed for the film by David Newman.The actors who sang their own tunes in the film, and included on the CD, are: Huey Lewis, Gwyneth Paltrow, Paul Giamatti, and Maria Bello. Arnold McCuller sings all of Andre Braugher's songs including Lynyrd Skynyrd's \"Free Bird\", performed a cappella.The soundtrack spawned two hit singles in Australasia, with Gwyneth Paltrow and Huey Lewis' \"Cruisin'\" spending two weeks at #1 in Australia[8] and five weeks at #1 in New Zealand,[9] with Paltrow's \"Bette Davis Eyes\" also becoming a top 3 hit in Australia.[10]The Canadian crooner Michael Bublé has a cameo singing \"Strangers in the Night\", but it is not included on the soundtrack.","release_dates":"September 9, 2000 (2000-09-09) (Toronto Film Festival)|||||","Distribution":"The producers marketed the film using the following tagline:The film was first presented at the Toronto Film Festival on September 9, 2000. When released, Duets suffered at the box office. The first week's gross sales at the box office was $2,002,588 (581 screens) and the total receipts for the run were $4,734,235.In its widest release the film was featured in 583 theaters and the film was in circulation for seven weeks.[7] The production budget was $16,000,000.","produced_by":"John Byrum Kevin Jones Bruce Paltrow","starring":"Gwyneth Paltrow Huey Lewis Paul Giamatti Maria Bello Andre Braugher Scott Speedman","running_time":"112 minutes","music_by":"David Newman","edited_by":"Gerald B. Greenberg","budget":"$16,000,000"}