{"'71":"UK release poster","country":"United Kingdom","distributed_by":"StudioCanal","Plot":"English soldier Gary Hook, a new recruit to the British Army, takes leave of his much younger brother Darren. Hook's platoon of British soldiers is sent to Belfast in 1971 in the early years of the Troubles. Under the leadership of the inexperienced Second Lieutenant Armitage, his platoon is deployed to a volatile area of Belfast where Catholic Nationalists and Protestant Loyalists live side by side. The unit provides support for the Royal Ulster Constabulary as it inspects homes for firearms, shocking Hook with their rough treatment of women and children. The Catholic neighbourhood has been alerted to the activity and a crowd gathers to protest and provoke the British troops who, though heavily armed, can only respond by trying to hold the crowd back.One soldier is hit unconscious by a rock thrown by a protestor, leaving his rifle on the ground in the confusion and a young boy runs off through the mob with it; Hook and another pursue him. As the crowd's protest escalates into stone-throwing, the soldiers and police pull out, leaving the two soldiers behind. Hook and the other soldier are briefly rescued by a sympathetic woman who fails to hold back a small crowd who are beating them. Hook sees the other soldier shot dead at point blank range by the Provisional Irish Republican Army (PIRA) gunman Paul Haggerty and then, with the crowd physically engaging him, Hook flees through streets and back alleys, finally eluding his pursuers and hiding until dark.A Protestant youngster brings Hook to a local pub that serves as a front for Loyalists, where he glimpses a Loyalist group in a back room constructing a bomb under the guidance of a member of the Military Reaction Force (MRF), the covert counter-insurgency unit of the British Army. Hook steps outside the pub just before an enormous explosion destroys the building, killing or injuring many of those inside, including the young boy who brought him there. Hook flees once more into the dark streets. Unaware that the Loyalist bombers have blown themselves up accidentally, the PIRA and Official Irish Republican Army (OIRA) factions charge each other with responsibility for the bombing.Two Catholics, Eamon and his daughter Brigid, discover Hook as he lies in a street unconscious and injured by shrapnel. They take him to their flat in the Divis Flats area and, even though they discover he is a British soldier, Eamon stitches his wounds. Despite the PIRA recently taking control over the area from the OIRA, Eamon contacts senior OIRA official Boyle for help, expecting a more humane solution than the PIRA faction would allow. Boyle, less radical and violent than the younger PIRA members, has a working relationship with the MRF. He tells MRF Captain Browning, leader of the local MRF section, of Hook's whereabouts and asks in return that Browning kill James Quinn, a key leader of the PIRA faction.Quinn and his PIRA squad have been tailing Boyle since the pub explosion and saw him visit Eamon's flat without knowing why he was there. Sensing danger, Hook flees the flat, taking a sheathed blade with him. Moving painfully through the flat complex halls and stairways, he eludes the PIRA men who have now learned of his presence and separated to search for him. Finally, unable to get away from Haggerty, who is about to come around a corner and discover him, Hook stabs him. As the wounded man lies dying, Hook reaches down and grasps his shoulder, sharing strength and sympathy as they hold each other's gaze and the PIRA man dies.Hook is captured by Quinn's group and taken to a hideout. Quinn orders Sean, a young teenager whom Quinn has recruited, to murder Hook. When Sean hesitates, Quinn prepares to execute Hook. Browning's group arrives and Lewis, to Hook's horror, shoots Sean. Lewis attempts to strangle Hook to prevent him from informing others of the bomb. As Lieutenant Armitage and his men enter in support of Browning, Armitage sees Lewis' attempt to kill Hook. Sean raises himself and shoots Lewis dead before being shot again, this time by Armitage. Browning finds Quinn and rather than arrest him, tells him Boyle wants him dead. He promises to contact him soon, telling him he expects him to prove to be co-operative. Hook returns to his barracks. Later, despite a formal complaint by Armitage, the commanding officer dismisses the incident between Hook, Lewis and Sean as a confused situation that merits no further inquiry. Hook returns to England and reunites with Darren.","language":"English","Reception":"'71 received positive reviews. Rotten Tomatoes, a review aggregator, reports that 97% of 115 surveyed critics gave the film a positive review; the average rating was 7.7/10. The site's consensus reads: \"Powerfully directed and acted, '71 stays true to its fact-based origins while remaining as gripping as any solidly crafted action thriller.\"[7] Metacritic rated it 83/100 based on 33 reviews, indicating universal acclaim.[8]Writing for the Los Angeles Times, Kenneth Turan called '71 \"a tense thriller from Britain that so adroitly joins physical intensity, emotional authenticity and political acuity that you may find yourself forgetting to take a breath.\" Manohla Dargis of The New York Times singled out Jack O'Connell for praise, saying, \"Mr. O'Connell runs away with '71, in which his character's every emotional, psychological and physical hurdle makes for kinetic cinema.\" The Hollywood Reporter critic Leslie Felperin noted of Yann Demange's direction, \"A big part of [Demange's] achievement resides in the casting of such a veteran crew of character actors in the first place, but credit is due for coaxing such subtle performances.\"[9] Jonathan Romney in Film Comment praised the originality of the film, \"a rare hybrid between hard-nosed realism, on the cusp of a quasi-documentary style, and genre thriller-adventure\", while criticising the opening and closing scenes as conventional.[10]'71 won Best Director at the 2014 British Independent Film Awards,[11] after receiving nine nominations.[12]The National Board of Review named '71 one of the top 10 independent films of 2015.[13]","box_office":"$2.9 million[3]","cinematography":"Tat Radcliffe","production_company":"Crab Apple Films Warp Films Film4 BFI Film Fund Screen Yorkshire Creative Scotland","directed_by":"Yann Demange","release_dates":"7 February 2014 (2014-02-07) (Berlin Film Festival)|10 October 2014 (2014-10-10) (United Kingdom)||||","produced_by":"Angus Lamont|Robin Gutch|","starring":"Jack O'Connell|Richard Dormer|Sean Harris|Sam Reid|Charlie Murphy|Paul Anderson|Paul Popplewell|","running_time":"99 minutes[1]","music_by":"David Holmes","edited_by":"Chris Wyatt","written_by":"Gregory Burke","budget":"£8.1 million[2]"}