{"based_on":"Pather Panchali and Aparajita  by Bibhutibhushan Bandopadhyay","country":"India","Awards and nominations":"Aparajito won the Golden Lion at the 1957 Venice Film Festival and, to date, remains the only film sequel to ever win the grand prize at the prestigious Venice, Berlin or Cannes Film Festivals. Along with the Golden Lion, it received the Cinema Nuovo Award and the FIPRESCI Award Critics Award in the process becoming the first movie to win all three.[4]Ray also won the Golden Gate awards for Best Picture and Best Director at the San Francisco International Film Festival in 1958, along with the Critics Award for this film.[22]The film won the Bodil Award for Best Non-European Film of the Year at Denmark in 1967.[23]It won the Selznick Golden Laurel for Best Film at the Berlin International Film FestivalIt also received the FIPRESCI Award and Wington Award at the British Film Institute Awards at London Film FestivalThe film was nominated for the Best Film and Best Foreign Actress at the 1959 British Academy Film Awards.","distributed_by":"Merchant Ivory Productions / Sony Pictures Classics (In US)","screenplay_by":"Satyajit Ray","aparajito":"A poster of Aparajito","Plot":"Apu and his parents, who left their home in Bengal, has moved to an apartment in Varanasi where Apu's father Harihar (Kanu Banerjee) works as a priest. Harihar dies and Sarbajaya (Karuna Banerjee) starts working as a maid. Apu and his mother return to Bengal and settle in the village Mansapota. Apu asks his mother to send him to a school. He has an inquisitive mind and studies diligently; he receives a scholarship to go to Calcutta for further studies. Sarbajaya does not want to let her son leave but she gives in and helps him prepare to leave.Apu (Smaran Ghosal) starts working at a printing press in Calcutta, after school hours, to subsist. He becomes more accustomed to the city life and feels out of place in the village. Sarbajaya expects visits from him, but he visits only a few times. Her loneliness and yearning for her son continue to grow. She becomes seriously ill, but does not disclose her illness to Apu, lest his studies get disturbed. When Apu finally comes to know about her poor health, he returns to the village to find that she has died. Bhabataran, Apu's great uncle, requests that he stay there and work as a priest. Apu rejects the idea and returns to Calcutta.","language":"Bengali","Critical reception":"The film has been enthusiastically received by critics. James Berardinelli wrote:Aparajito was filmed forty years ago, half way around the world, yet the themes and emotions embedded in the narrative are strikingly relevant to modern Western society (thus explaining why it is called a \"timeless classic\")....Aparajito is an amazing motion picture. Its rich, poetic composition is perfectly wed to the sublime emotional resonance of the narrative. For those who have seen Pather Panchali, Aparajito provides a nearly-flawless continuation of the journey begun there. Yet, for those who missed Ray's earlier effort, this film loses none of its impact. On its own or as part of the Apu Trilogy, Aparajito should not be missed.[16]Roger Ebert said, \"the relationship between Apu and his mother observes truths that must exist in all cultures: how the parent makes sacrifices for years, only to see the child turn aside and move thoughtlessly away into adulthood....It is about a time, place and culture far removed from our own, and yet it connects directly and deeply with our human feelings. It is like a prayer, affirming that this is what the cinema can be, no matter how far in our cynicism we may stray.\"[7]During the Venice Film Festival, Penelope Houston, who was among the jury, broke protocol and told Ray personally: \"I think it was magnificent\".[17] The chairman of the award ceremony, René Clair, was initially reluctant to give it the coveted prize; he eventually acquiesced, but not before saying to Houston: \"I hope Ray will go away and learn how to make films!\" [18] The Japanese director Akira Kurosawa had an important film entered in that year's festival competition, Throne of Blood (Kumonosu-jō), which lost to Ray's film. However, many years later, Kurosawa's daughter generated a list of 100 films admired by him; this list quoted him as having affirmed the jury's choice as \"ABSOLUTELY right\" (though he misidentified the winning film as Pather Panchali).[19]Emanuel Levy said: \"Made in 1956 (and released in many countries a year later), 'Aparajito' indicates India’s processes of modernization and industrialization and their inevitable impact on both individual and culture. Nonetheless, in his upbeat outlook, Ray suggests that individuals can rise to the occasion and might not be compromised by the corruption that characterizes the society at large.\"[20] Bosley Crowther, who had earlier given a lukewarm response to Pather Panchali, saying that the film was so amateurish that \"it would barely pass for a rough cut in Hollywood\",[18] praised it, saying that \"Mr. Ray's remarkable camera catches beauty in so many things, from the softness of a mother's sad expression to the silhouette of a distant train, that innuendos take up the slack of drama. Hindu music and expressive natural sounds complete the stimulation of the senses in this strange, sad, evocative film.\"[6] At Rotten Tomatoes, Aparajito has a 93% fresh rating based on an aggregate of 15 reviews.[21]","cinematography":"Subrata Mitra","directed_by":"Satyajit Ray","Accolades and legacy":"In 1992, Sight & Sound (the British Film Institute's film magazine) ranked The Apu Trilogy at No. 88 in its Critics' Poll of all-time greatest films,[24] while Aparajito itself was ranked separately at No. 127 on the same list.[25] In 2002, a combined list of Sight & Sound critics' and directors' poll results included Aparajito in its top 160.[26] In 1998, the Asian film magazine Cinemaya's critics' poll of all-time greatest films ranked The Apu Trilogy at No. 7 on the list.[27] In 1999, The Village Voice ranked The Apu Trilogy at No. 54 in its Top 250 \"Best Films of the Century\" list, based on a poll of critics.[28] In 2001, film critic Roger Ebert included The Apu Trilogy in his list of \"100 Great Movies\" of all time.[29] In 2005, The Apu Trilogy was included in Time magazine's All-TIME 100 Greatest Movies list.[30]Smaran Ghosal who played the role of adolescent Apu, at the age of 14, did only one more film, documentary Rabindranath Tagore (1961), also made by Ray, where he played young Rabindranath Tagore. Smaran died in 2008 in Kolkata, at the age of 64.[31]Aparajito was preceded by Pather Panchali (1955) and followed by Apur Sansar (The World of Apu) in 1959. Together, the three films constitute the Apu trilogy. Pather Panchali portrays the childhood of Apu in their ancestral house. Apur Sansar depicts Apu's adult life, his reaction to his wife's premature death, and his final bonding with his son whom he abandoned as an infant. Ray did not initially plan to make a trilogy: he decided to make the third film only after being asked about the possibility of a trilogy at the 1957 Venice Film Festival,[32] where Aparajito won the Golden Lion.[33] The film is considered as the richest of three in terms of its characterization.[34] Apur Panchali (2014) is a Bengali film directed by Kaushik Ganguly, which depicts the real-life story of Subir Bannerjee, the actor who portrayed Apu in Pather Panchali.[35]According to Michael Sragow of The Atlantic Monthly in 1994, \"The youthful coming-of-age dramas that have flooded art houses since the mid-fifties owe a tremendous debt to the Apu trilogy, which Terrence Rafferty has rightly called 'cinema's purest Bildungsroman'.\"[36] Across the world, filmmakers such as Martin Scorsese,[37][38] James Ivory,[39] Abbas Kiarostami, Elia Kazan and Wes Anderson[40] have been influenced by The Apu Trilogy, with many others (such as Kurosawa) praising the work.[41] The technique of bounce lighting developed by the cinematographer Subrata Mitra for Aparajito has also had a profound influence on the development of cinematography.[15] After Aparajito, Ray went on to make 35 more films, including feature films, documentaries and shorts. He worked on scripting, casting, scoring, cinematography, art direction, editing and designing his own credit titles and publicity material. He developed a distinctive style of film-making[42] based on visual lyricism and strong humanism,[43][44] as in his Apu trilogy. Thus Ray established himself as an auteur of cinema.[42]","release_dates":"11 October 1956","Production":"Aparajito was based on the last fifth of the novel Pather Panchali and the first third of the novel Aparajito by Banerjee.[8] The novel Pather Panchali is a classic bildungsroman (a type of coming-of-age story) in the canon of Bengali literature.[9][10] It first appeared as a serial in a Calcutta periodical in 1928[11] and was published as a book the next year.[12] According to Ray's biographer, Robinson, among the three films of the Apu trilogy, Aparajito bears the closest resemblance with its literary source. Banerjee's depiction of the mother-son relation fascinated Ray. Robinson writes: \"Their relationship had some echoes on a purely psychological plane for him\". Ray was in particular moved by Banerjee's \"daring and profound revelation\", that \"for some time after Sarbajaya's death Apu becomes familiar with a strange sensation...his immediate reaction had been one of pleasure, like a surge of release...a delight in the breaking of bonds...there was no doubt he loved his mother, but the news of her death had at first brought him pleasure—he couldn't avoid the truth.\"[1] Ray's wife Bijoya also voiced her concerns when she came to know the plot, asking him \"Do you think people in our country will accept a son's relief at having won his freedom at his mother's death?\" Ray was aware of the risk, saying \"let's see what happens. After all, later Apu was full of regret at his initial reaction upon his mother's death. And as he realized, her death actually came as a very big blow to him.\"[13]The novels had a female character named Leela who influenced Apu's alienation from his mother when he was living in Calcutta. After rejecting two aspirants, Ray found one actress to portray the character, but the actress was not allowed to act in the film by her fiancé. Eventually, Ray removed the character from the script reluctantly.[8] Ray himself later commented that he thought Leela, with whom Apu had an understated affair, was a strong reason behind Apu's attraction of Calcutta, and that without Leela's presence in the film, Apu's attraction to Calcutta may seem to some extent artificial. \"I'm never sure,\" he said, \"whether Apu's attachment to the city without the element of the girlfriend is strong enough, the pull that the city exerts is a bit abstract.\" However, when he watched the movie later, he did not feel the absence of Leela.[14]Subrata Mitra, the cinematographer for The Apu Trilogy, made his first technical innovation with this film: the introduction of bounce lighting. According to the Internet Encyclopedia of Cinematographers:[15]The fear of monsoon rain had forced the art director, Bansi Chandragupta, to abandon the original plan to build the inner courtyard of a typical Benares house in the open and the set was built inside a studio in Calcutta. Mitra recalls arguing in vain with both Chandragupta and Ray about the impossibilities of simulating shadowless diffused skylight. But this led him to innovate what became subsequently his most important tool—bounce lighting. Mitra placed a framed painter white cloth over the set resembling a patch of sky and arranged studio lights below to bounce off the fake sky.","produced_by":"Epic Films (Satyajit Ray)","starring":"Kanu Banerjee Karuna Banerjee Pinaki Sen Gupta Smaran Ghosal Ramani Sen Gupta Charaprakash Ghosh Subodh Ganguly","running_time":"113 minutes","music_by":"Ravi Shankar","edited_by":"Dulal Dutta"}