{"based_on":"Skidding 1928 play  by Aurania Rouverol","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot summary":"Judge Hardy (Lionel Barrymore) hopes to be re-elected, but his campaign is put in jeopardy by his opposition of a wasteful public works program.[3] In Carvel (a small, idealized American town) lives the Hardy family of Judge James K Hardy, wife Emily and teenage son Andy (Mickey Rooney). Judge Hardy (Lionel Barrymore) is well admired and respected. However his chances for being re-elected as Judge are threatened when he blocks the construction of a $30,000,000 aqueduct.Spurned, contractor Hoyt Wells and newspaper publisher Frank Redmond swear to block his re-election campaign. Frank agrees to use his paper, The Carvel Star to publish disparaging stories about the family.That evening Hardy daughter Marion returns home from college. Older daughter Joan Hardy Martin moves in as well, after a secret separation from her husband Bill. The family throws a party for returning Marion. At the party they are warned by a Star gossip columnist that only negative stories are going to be published about the family. Later that night teenaged Andy Hardy reluctantly takes his childhood sweetheart Polly to a party, and is pleasantly surprised at what a beautiful woman she has grown into. Marion has also found love in Wayne Trent, an engineer who has come to town to work on the aqueduct. Facing the possibility of her boyfriend losing her job, she questions her father’s decision to block the construction.Meanwhile Joan confesses to her father that she and Bill are separated after she went to a roadhouse with another man. Although the encounter was innocent, Bill was enraged, and they soon separated.The Carvel Star publishes an article stating that people are calling for Judge Hardy’s impeachment. Judge Hardy attempts to bring contempt of court proceeding against the Star.","a_family_affair":"Film Poster","language":"English","Reception":"The film made a profit of $153,000.[1]","Original Play":"The movie was based on the play Skidding by Aurania Rouverol.[4]","box_office":"$502,000[1]","cinematography":"Lester White","directed_by":"George B. Seitz James Dugan (assistant)","release_dates":"March 12, 1937 (1937-03-12)|||||","Production":"The film was made in the wake of the success of Ah, Wilderness! (1936). Many of the same cast from that movie returned.[5]","produced_by":"Lucien Hubbard Samuel Marx","starring":"Lionel Barrymore Cecilia Parker Spring Byington Eric Linden Charley Grapewin","running_time":"69 minutes","music_by":"David Snell","edited_by":"George Boemler","written_by":"Kay Van Riper Hugo Butler","budget":"$178,000[1]"}