{"country":"United States","distributed_by":"Paramount Pictures","Plot":"Steve Giardino, an abrasive, workaholic Wall Streeter, and his wife Jackie divorce after twenty-six years of marriage and find themselves thrust back into the dating world in middle age and in search of a new life.Steve's fellow trader, Mel Arons, likes being single and chasing women, encouraging Steve to join him, with disastrous results at first. Jackie, starved for affection, is at first thrilled by the romantic interest of a man called Doc, only to end up smothered by his attentions and in desperate need of some private space.Unwilling to stop smoking and drinking or to eat properly, Steve has a mild heart attack. He ends up falling for his doctor, Kay Hutton, but a rift develops when he insists that he is too old to father her children and begin a new family.","language":"English","Reception":"The film received mostly positive reviews upon its release. Janet Maslin wrote in The New York Times: \"A film of Mr. Alda's is guaranteed to make you feel 10 years older, no matter what age you were when you went in. That's not entirely a negative thing, since it does have its soothing side. The middle-aged audience that made The Four Seasons a hit obviously enjoyed the feeling of recognition that comes with Mr. Alda's work, and that same audience may like the equally predictable A New Life [...] almost as well.\"[1] Roger Ebert stated: \"Like “Four Seasons,” his debut as a writer-director, “A New Life” is Alda’s version of various rites of passage. His ambition is not to bring anything new or revealing to his subject matter, but to see it as it is. If you told him you recognized all of the characters, that would be a compliment. The result is a little hard to evaluate. Alda’s purpose is to show us fairly typical people going through fairly typical things. They live, we watch. On that voyeuristic level, the movie works.\"[2]In one notable review from The Washington Post, Desson Howe wrote, \"There's nothing tricky to Alan Alda: no Eddie Murphy worship-me complex, no Woody Allen navel-contemplating, no Steve Martin I'm-brilliant-watch-me-dance routines. He's just a witty Mr. Nice Guy, all positive reinforcement and sincerity. In \"A New Life,\" which he wrote and directed and stars in, for a change Alda doesn't play a self-righteous lib a` le Martin Sheen, which is refreshing. And though \"New Life's\" premise -- the tribulations of a male divorce' -- is hardly groundbreaking, its safe confines provide Alda ample room for his engaging brand of sitcom repartee. [...] Steve has passed the singles physical. Now it's time to try the married version, full of all those b-words -- birthing, breathing, bonding. How he fares is hardly nail-biting fare, but it leaves you with a favorable impression of Alda -- even if his openly bleeding heart has made you cringe in the past.\"[3] In another such review, Rita Kempley wrote: \"Quick, somebody cancel Alan Alda's subscription to Ms. The Schwarzenegger of sensitivity is at it again, razing our consciousness with \"A New Life,\" the story of an insensitivo who turns into a giving guy. Alda [...] wrote and directed this romance for the \"Donahue\" set. [...] \"A New Life\" indeed.\"[4]","box_office":"$7,721,852","cinematography":"Kelvin Pike","directed_by":"Alan Alda","release_dates":"March 25, 1988 (1988-03-25)|||||","produced_by":"Martin Bregman","starring":"Alan Alda|Ann-Margret|Hal Linden|Veronica Hamel|John Shea|Mary Kay Place|Deann DeGruijter|","running_time":"104 minutes","music_by":"Joseph Turrin","External links":"","edited_by":"William H. Reynolds","written_by":"Alan Alda","budget":"$12 million"}