{"directed_by":"Sandy Tung","country":"United States","release_dates":"1989 (1989)","Plot":"Across the Tracks is the story of two brothers who have gone very different ways in their past, and who now must learn to deal with each other again. Joe (Brad Pitt) is the older of the two. He is a good student and runner set on winning a track scholarship to Stanford University. Billy (Rick Schroder), on the other hand, is a delinquent involved in drugs and crime. As the story begins, he has just been released from reform school after serving time for a failed attempt at car theft. While Billy tries to make amends for his past life, it is not an easy task. Joe still holds a lot of resentment for what Billy has put their widowed mother (Carrie Snodgress) through, and feels that Billy's return is an unnecessary strain on their family.Forced to attend another high school on the other side of town, Billy tries to stay out of trouble, but his old rivals force him into a fight on his first day, which gets him into trouble with the school authorities. Billy's friend Louie (David Anthony Marshall), a highly alluring drug dealer who was also involved in the car theft that got Billy sent to reform school, wants him to return to his life as a criminal. It seems that only Billy and Joe's mother believes that Billy can become a valuable member of society and offers Billy full support.Joe mockingly suggests to Billy that he try out for his school track team, figuring that nothing will come of it. Nevertheless, Billy asks the coach at his school for a tryout even though the track season is two months old and only two months remain until the county meet. Billy hardly looks like a track star in his black high top Chucks and greased back long hair, but the coach gives him a tryout due to his brother's reputation as one of the best runners in the county, during the tryout he demonstrates surprising speed, running an 800m race at 2:04. (Joe's best time in that event is 1:57 and that is with four years of running.) Impressed, the coach immediately puts Billy on the team. Joe is very much impressed by this, and the two start to bond, especially after Joe goes out and buys him a special pair of track shoes as a gift.Billy's speed soon makes him a contender for the county record for the 800m event (at 1:55.25). Since Billy attends a rival school to Joe's, they compete in a head to head meet as a prelude to the championship and Billy defeats Joe. The brothers are then scheduled to compete in the championship meet which will help determine whether or not Joe receives that scholarship to Stanford. With the pressure on Joe to prove that he is the best runner in the county, Joe has trouble handling the competition. The outcome of this dilemma and the determination of Billy's low-life friends to get some revenge for Billy's abandoning them for the straight life come together as the two brothers attempt to overcome the adversity caused by these outside influences and solidify their relationship with each other. Joe ends up shattering the record thanks to Billy holding back in the final leg of the race, letting Joe win and coming in a close second.","produced_by":"Francesca Bill Nancy Paloian Dale Rosenbloom Robert A. Schacht","starring":"Rick Schroder Brad Pitt Carrie Snodgress David Anthony Marshall","language":"English","music_by":"Joel Goldsmith","edited_by":"Farrel Levy","written_by":"Sandy Tung","cinematography":"Michael Delahoussaye"}