{"country":"110 minutes","distributed_by":"Screamkings Productions","screenplay_by":"Alex Pucci Pete Jacelone","story_by":"Draven Gonzales","Plot":"During a sing-along at Camp Hiawatha in 1981, two revelers sneak away to have sex, and are killed by an unseen assailant. Twenty-four years later, four friends (Angela, Jen, Mario, and Vade) are driving through the area on their way to Boston. The quartet becomes lost (passing the same sign several times) and their SUV breaks down after night comes unusually early. All the electronics fail to work, and the group is thrown into hysterics when screams emanate from the surrounding forest, and the vehicle is pelted with debris, prompting them to spend the night in it.In the morning, the travelers are found by campers and counselors from Hiawatha, and invited to stay at the camp, which looks like it has not changed since the 1980s. As the quartet is shown around (noticing how anachronistic the place is) someone murders any campers who go off on their own. That night, the killer rampages through the facilities, butchering everyone except the quartet. At dawn, the travelers awaken to discover that nothing appears to be wrong, and that everyone is alive again.Daniel and Ivan, a pair of counselors who are aware of what is going on, find the four, and explain that the camp is in a time loop, stuck repeating the day of the killing spree. To prove they are telling the truth, the counselors take the others to witness the first murder, a strangulation in the woods, which they have never been able to stop, despite their best efforts. The time-displaced four try to leave on their own, but the SUV will not appear until nightfall, and walking away just brings them back to Hiawatha. Daniel and Ivan state that they are limited in what they can do, but with the help of outsiders, they may be able to break the loop, and move on to whatever fate awaits them.The night of the massacre, it is revealed that Daniel and Ivan are the murderers, and that they manipulated Michelle and Ruben, a pair of outcasts, into helping them with their thrill killing. The psychopaths intend to have the travelers take their place in the cycle, which they believe they can achieve by murdering them, so they can get out. Mario and Vade die, but Angela and Jen manage to kill Daniel and Ivan. The girls go to the SUV, where Lou, the groundskeeper, is attacking Michelle and Ruben. Lou snaps Michelle's neck, and exposits that he took out the perpetrators of the original massacre minutes after it occurred. A wounded Ruben then shoots an arrow into Angela's chest, and is stomped to death by Lou as Jen escapes in the SUV.Three years later, Jen has become a successful writer, and while in her office one day, she receives an email. It is from Daniel and Ivan, who have written that they cannot wait to meet their \"favorite author\" soon.","language":"United States","Reception":"The film was praised by Slasherpool, which gave it a four out of five, and wrote \"I definitely recommend this for anyone who misses slasher movies from that time [the 1980s].\"[1]Sticky Red gave Camp Slaughter a one and half out of five, and said that while the film had a lot to offer, it was brought down by budgetary constraints, poor quality sound, gratuitous scenes, obnoxious characters, unoriginal and sloppy kills, bad acting, confusing editing and cinematography, nonsensical plot twists, and a weak ending.[2]Similar criticisms were made by Vegan Voorhees and eFilmCritic, both of whom gave the film two stars out of five, with the former stating \"With a better collection of actors and shot with more care, this could've been a minor classic, but it's destined to become just one more post-millennial DTV slasher film that claimed it was recapturing the old school methods, but failed miserably.\"[3][4]","camp_slaughter":"DVD released by Screamkings Productions","cinematography":"Brad Fowler","production_company":"James Conant Jonathan Williams","directed_by":"Camp Daze","release_dates":"Screamkings Productions Lightning Home Entertainment","produced_by":"Alex Pucci","starring":"Alex Pucci","running_time":"June 20, 2005 (2005-06-20) (United States)|||||","music_by":"Kyle Lupo Matt Dallas Miles Davis Jon Fleming Eric McIntire Joanna Suhl Bethany Taylor Anika C. McFall","edited_by":"Pete Jacelone Jonathan Williams","budget":"English"}