{"based_on":"Diabolik by Angela and Luciana Giussani","country":"Italy|France[1]|","distributed_by":"Paramount Pictures","screenplay_by":"Dino Maiuri|Brian Degas|Tudor Gates|Mario Bava|","story_by":"Angela Giussani|Luciana Giussani|Dino Maiuri|Adriano Baracco|","Plot":"After an armored car leaves the bank with ten-million dollars, it is attacked on route by Diabolik (John Phillip Law) who manages to steal the money and escape with his partner Eva Kant (Marisa Mell). Leaving the money in their underground hideout, Diabolik and Eva attend a press conference held by the Minister of the Interior which they disrupt by releasing laughing gas. Due to the high level of crime, the death penalty is brought back. The police cannot find Diabolik but gang leader Valmont (Adolfo Celi) suffers at their hands because of a clampdown due to Diabolik's actions. Realising things can get only worse because of Diabolik's crime spree, Valmont contacts Inspector Ginco (Michel Piccoli) and makes a bargain to catch Diabolik alive for the police. In his hideout, Diabolik decides to steal the famous Aksand emerald necklace for Eva's birthday from the Saint Just Castle. Valmont builds up an identikit picture of Eva and circulates it as a means of capturing Diabolik. Diabolik scales the walls of Saint Just Castle where he finds the police are waiting, Diabolik manages to steal the necklace by fooling the police officers with mirrors on the road and dummy decoys of himself.Valmont has made further plans to lure Diabolik out of hiding by having one of his henchmen kidnap Eva. To rescue her, Diabolik boards Valmont's airplane, along with the ten million dollars and emerald necklace as a trade for Eva. Diabolik is ejected from the plane but manages to grab Valmont just before his plane explodes from a bomb that Diabolik had placed earlier. Diabolik manages to rescue Eva as the police close in on them. Eva makes her escape as Diabolik kills Valmont, is trapped and takes a golden capsule. The police find Diabolik and proclaim him dead. Later while the police are holding a conference on the death of Diabolik, he is about to be autopsied when he returns to life. Diabolik reveals that he has faked his death through a technique taught to him by Tibetan lamas. However, If he does not get the antidote within 12 hours, he will die.Posing as a nurse, Eva wheels Diabolik past groups of people where Diabolik sneaks into a morgue where Valmont's body has been cremated. Diabolik collects the 11 emeralds from Valmont's ashes and escapes. The police find out that Diabolik is not dead and offer a million dollar reward for Diabolik. Diabolik reacts by blowing up tax offices. Without tax revenue, the country is in debt and sells off some gold to buy currency. The 20 tons of gold is melted into one solid block to make it difficult to steal. Diabolik and Eva divert the train by leaving a burning truck on the tracks having it re-route to a bridge track where a bomb is placed. After being triggered when the train arrives, the gold falls into the water below where Diabolik and Eva collect it to return it to their hideout.The steel casket containing the gold had been irradiated, which allows the police to trace it. They close in on Diabolik who is melting the gold, to put it into ingots. Being shot at by the police, Diabolik is unable to control the heating of the gold which leads to Diabolik and the cavern being covered in molten gold. Again, Diabolik is believed to be dead, with his heat-proof suit now covered in hardened gold. The police seal off the place to later recover it. Eva is allowed to pay her respects to the dead Diabolik, who winks at her.","language":"Italian[2]","Reception":"The movie received a 67% \"Fresh\" rating on the review aggregator website Rotten Tomatoes.[10] The New York Times gave a brief negative review of Danger: Diabolik referring to the film as \"infantile junk\".[11] Film critic Roger Ebert gave the film a two and a half star rating out of four, stating that he felt it was better than the other Dino De Laurentiis production Barbarella, but that it was \"long and eventually loses track of Itself\".[12] Variety gave the film a negative review, calling it a \"dull Dino De Laurentiis programmer\" with \"Bizarre sets, poor process work, static writing and limp direction spell pure formula fare for lowercase grind bookings.\"[13]The Monthly Film Bulletin gave the film a positive review, noting that \"Bava's superb visual sense stands him in good stead in this comic-strip adventure which looks like a brilliant pastiche of the best of everything in anything from James Bond to Matt Helm.\"[14]","cinematography":"Antonio Rinaldi","production_company":"Dino de Laurentiis Cinematografica Marianne Productions","directed_by":"Mario Bava","Releases":"Danger: Diabolik premièred in Paris in April 1968 under the title Danger Diabolik.[6] The film received a theatrical release in Italy on January 24, 1968.[2]At least two English-language dubs were made for the film.[4] The American version titled Diabolik dubs everyone with American accents, while the second titled Danger: Diabolik gives everyone British accents.[4] The film opened in New York on December 1968.[6] Diabolik was featured on the television series Mystery Science Theater 3000 on August 8, 1999 and was the last show in the series.[7][8]Danger: Diabolik was released on DVD by Paramount Pictures on June 14, 2005.[9] The DVD includes an audio commentary with John Phillip Law and Mario Bava biographer Tim Lucas as well as the music video for \"Body Movin'\" by the hip-hop group the Beastie Boys.[9]","release_dates":"January 24, 1968 (1968-01-24) (Italy)|||||","Production":"Director Mario Bava was originally offered $3 million by Dino De Laurentiis to make Diabolik but Bava eventually made the film for $400,000.[4] De Laurentiis’ first choice for the role of Eva was Catherine Deneuve. but Bava was sternly against casting her.[5]The film was shot between April and June of 1967.[4] The film was shot at a Fiat plant in Turin, on location in Rome and at the Blue Grotto in Capri.[4]","produced_by":"Dino de Laurentiis","starring":"John Phillip Law|Marisa Mell|Michel Piccoli|Adolfo Celi|Terry-Thomas|","running_time":"105 minutes","Aftermath":"The release of Barbarella and Danger: Diabolik lead to a minor trend of adaptations of comic strips that emphasized mild sado-masochism and late 1960s fetish gear.[15] Diabolik was the first of three European comic strip adaptations released in 1968, the other two being Piero Vivarelli's Satanik and Roger Vadim's Barbarella.[16][15] These films were followed up with Bruno Corbucci's Isabella, Duchess of the Devils and Corrado Farina's Baba Yaga (1973).[15]","music_by":"Ennio Morricone","edited_by":"Romana Fortini","budget":"$400,000"}