{"country":"United States","Structure and content":"The film does not feature any narration or spoken comments from the filmmakers. Instead, it primarily follows three residents of Detroit in various situations around the city, circa 2010. Interspersed is contemporary footage of different areas of Detroit shot by the filmmakers, and clips of historic footage. Segments of performances at the Detroit Opera House are incorporated as well.The three Detroiters who are profiled are video blogger Crystal Starr, nightclub owner Tommy Stephens, and United Auto Workers local President George McGregor, each of whom reflect on their own experiences and share their observations about the city, its problems, and its opportunities.[3] Also featured are portions of Mayor Dave Bing's discussions with city officials and residents about the possibility of geographically consolidating Detroit residents as a cost-saving measure. A group of artists, mostly newcomers to Detroit, are shown as well, particularly Steve and Dorota Coy. The Coys, who are performance artists, are featured on the poster and DVD cover for the film.[4]Locations that are shown or commented on include the Detroit/Hamtramck Assembly, where the Chevy Volt is assembled; the defunct Detroit Cadillac facility; and the abandoned Michigan Central Station.","distributed_by":"ITVS","Background":"Directors Heidi Ewing and Rachel Grady are the founders of Loki Films, a production company that specializes in documentaries.[5] By 2008, they had made several successful documentaries, including The Boys of Baraka and Jesus Camp. Ewing, who grew up in the Detroit suburb of Farmington Hills, described the genesis of the Detropia project in a 2012 Q&A interview:\"...my co-director and I, Rachel, started talking about the city of Detroit in late 2008, because I would return home and things really seemed to be getting worse and worse. And it was already bad when I grew up there in the 80s. So to see the crisis sort of spread out further and further into the suburbs and a lot of people I knew were leaving. And we started discussing, 'What was the future of this place? What would it look like?' And then in October of 2009, I came with my crew for three days, just as an experiment, and filmed in the city just as an outsider. And talked to a few people, and was absolutely riveted to – riveted by the people and the place and I thought, 'There is definitely a movie here. I'm not sure what it is, but we need to make a film in Detroit.'\"[2]The film received funding from several sources, particularly the Ford Foundation and the Independent Television Service.[2]Ewing elaborated further on the evolution of their filmmaking process in a HuffPost interview,\"We came back [from Detroit], made a trailer, and started to show it around. We raised the money very quickly -- turned out there were other people also very interested in Detroit. PBS came on board, and Ford Foundation, and next thing you knew, we were moving to Detroit. We rented two apartments in downtown Detroit, got two cars, and basically stayed for a year. We didn't know what we were going to do. We had chosen a city to make a movie about -- not a school in a city, or a dude in a city -- [so] we had to talk to a city, ask a city questions. It became a very organic, long, many-rabbit-holes, never-stop-casting sort of film. There are certain things we captured just because we were living there. We knew [the film] had to be a chorus, it had to be a poem, it had to be a butterfly, going from place to place. You can't just hang a city on one person, or one family, I don't think. So it was a totally different kind of filmmaking -- it felt experimental, kind of artsy, kind of crazy.\"[6]","language":"English","Reception":"Detropia received an 83% \"Fresh\" rating on Rotten Tomatoes, with 30 positive reviews and six negative reviews.[7]The film won the U.S. Documentary Editing Award, and was nominated for the Grand Jury Prize at the 2012 Sundance Film Festival.[8]The National Board of Review of Motion Pictures named it one of the top five documentaries of 2012.[9]It was placed on the shortlist for the Academy Award for Best Documentary Feature in the 85th Academy Awards.[10]","cinematography":"Tony Hardmon, Craig Atkinson","production_company":"Loki Films","directed_by":"Heidi Ewing, Rachel Grady","release_dates":"January 21, 2012 (2012-01-21) (Sundance Film Festival)|||||","produced_by":"Craig Atkinson","running_time":"91 minutes","music_by":"DIAL.81","edited_by":"Enat Sidi"}