{"country":"United States","distributed_by":"Orion Pictures","screenplay_by":"Steven Kampmann Will Porter Peter Torokvei Harold Ramis","story_by":"Rodney Dangerfield Greg Fields Greg Snee","Plot":"Thornton Melon's is a rags-to-riches story. The son of an Italian immigrant tailor, he is shown as a boy (Jason Hervey) in his father's shop, bearing a report card with poor grades. His ambition is to go into his father's line of work, but his father reprimands Thornton for his poor schoolwork, and tells him no matter how hardworking, skilled or wealthy one may be, \"if a man has got no education, he has got nothing\".As decades pass, Thornton is shown opening his first \"Tall and Fat\" clothing store and eventually becoming a corporate giant, complete with a TV commercial in which he asks:Are you a large person? Pleasantly plump? A little on the hefty side, perhaps? Well, let's face it: are you fat? When you go jogging, do you leave potholes? When you make love, do you have to give directions? At the zoo, do elephants throw you peanuts? Do you look at a menu and say, 'Okay'?He also has changed his last name to \"Melon\" (from the original \"Meloni\").After his college-student son Jason (Keith Gordon) cancels a visit, Thornton goes home to Vanessa (Adrienne Barbeau), his second wife. Thornton is a widower and Vanessa is a social climbing gold digger, unable to bear her crude husband. Upon agreeing to a divorce, he threatens to expose her adulterous affairs (showing her Polaroids of her with other men, including a midget) after she threatens to sue him for half of his net worth.Thornton tells his friend, chauffeur and bodyguard Lou (Burt Young) to drive him to Jason's college. It turns out Jason has been keeping secrets from his father. He is not on the Grand Lakes diving team, but instead works as a towel boy, treated badly by star diver Chas Osborn (William Zabka). Jason has only his best friend Derek Lutz (Robert Downey, Jr.) for support and intends to drop out. Thornton pleads with him, offering to go to college with his son if he'll stay, and also tells Jason that he has no reason to be ashamed of his failures, considering Thornton's early mediocre life.Possessing neither a high school diploma nor any transcripts or SAT scores, Thornton’s efforts seem to be stalled. But when the university's \"Dean\" Martin — a play on the crooner Dean Martin — played by Ned Beatty, asks how he can possibly admit an unqualified student, the next scene cuts to a groundbreaking of the university's new Thornton Melon School of Business.Thornton's bribery earns him the wrath of Dr. Philip Barbay (Paxton Whitehead), dean of the business school. The wrath is further exacerbated when Dr. Barbay's ivory tower ways are at odds with Thornton's knowledge of business gained from actual experience. Thornton promptly strikes up a romance with Dr. Diane Turner (Sally Kellerman), an attractive literature professor who is dating Barbay.At the same time, Jason begins to attract the interest of Valerie Desmond (Terry Farrell), a girl that Chas has been trying to impress. Jason's popularity on campus also increases thanks to his father’s generosity and party-throwing. Jason even earns a spot on the diving team as well after Thornton — who claims to have once been a spectacular diver himself — talks the Grand Lakes coach (M. Emmet Walsh) into giving the kid another look.As a student, even though Diane is inspiring a deeper appreciation of literature, Thornton prefers partying to studying. He hires a team of professionals to complete his assignments, including author Kurt Vonnegut, to write a paper on Kurt Vonnegut for literature class. To Thornton's surprise, a disappointed Diane, recognizing the fraud, gives Thornton an F on his paper, telling him that she will not accept work from him that was written by someone else, and adding that whoever did write the paper doesn't know the first thing about Kurt Vonnegut. Meanwhile, Jason is fed up with his father, his school, his status and his own failures. At his dad's big party, he gets drunk, punches Chas and disappears.Thornton’s fraud is further exposed by Dr. Barbay, who challenges him before Dean Martin to pass an oral examination from all of his professors. If Thornton fails any part of it, he will be expelled. Not believing that he will be able to pass that oral exam, Thornton packs up and prepares to leave, knowing that he can't be expelled if he drops out. But Jason stops him and reminds him of how he wanted to drop out, too, but Thornton talked him out of it. Jason believes that Thornton can do it and says that they'll help him. Thornton then decides that he's up to the challenge.With limited time to prepare, Thornton crams for exams with help from Jason, Derek, Lou and Diane. When the big day comes, Barbay begins by telling Thornton that he has only one question, \"...in 27 parts.\" Thornton seems to falter, but is inspired to answer the question with the screaming assistance of crazed Contemporary American History professor (and as revealed earlier, a Vietnam vet), Terguson (Sam Kinison). He passes, nevertheless, after Dr. Turner inspires him by having him recite Dylan Thomas' poem \"Do not go gentle into that good night.\"At the championship dive meet, father and son patch things up and, with a little distraction, Derek fouls up the opposing team’s dives, while Chas gives a lackluster effort, followed by a near-perfect performance from Jason. Chas fakes a cramp out of spite in an effort to make the team lose. This gives the coach an inspiration. He calls upon Thornton, who comes out of the grandstand to perform an “impossible” dive, the legendary “Triple Lindy,\" to win the meet.Thornton learns that he has passed all his classes with D's, except from Diane, who has given him an A. The movie closes with Thornton lecturing the graduating class that the real world is hard, so: \"Move back in with your parents... let them worry about it!\" and \"Look out for Number One, but don't step in Number Two!\"[3]","language":"English","Reception":"The film received mainly positive reviews from critics, and is the 6th highest grossing film of 1986, as well as the second highest grossing comedy film of the year, behind \"Crocodile\" Dundee (records state that in addition to the rental and theatrical gross it received, it went on to gross $108,634,920 globally). Kevin Thomas of the Los Angeles Times noted that \"Dangerfield seems to be setting the film's brisk pace and flawless timing himself.\"[4] Nina Darnton wrote in The New York Times that \"the film is a good-natured potpourri of gags, funny bits, populist sentiment and anti-intellectualism.\"[5] Rotten Tomatoes' Tomatometer shows that 84% of 31 critics' reviews were positive.[6] Roger Ebert's Chicago Sun-Times review read: \"This is exactly the sort of plot Marx or Fields could have appeared in. Dangerfield brings it something they might also have brought along: a certain pathos.\"[7]","back_to_school":"Film poster","box_office":"$91,258,000 (theatrical)[2] $41,948,000 (rentals)","cinematography":"Thomas E. Ackerman","production_company":"Paper Clip Productions","directed_by":"Alan Metter","Soundtrack":"The soundtrack was released on MCA, available in LP or Cassette (no CD), but cues from the score were released that year with selections from the score of Pee-wee's Big Adventure (both re-recordings made in London) on CD. Original film recordings were issued in 2010 on The Danny Elfman & Tim Burton 25th Anniversary Music Box.","release_dates":"June 13, 1986 (1986-06-13)|||||","produced_by":"Chuck Russell","starring":"Rodney Dangerfield|Sally Kellerman|Burt Young|Keith Gordon|Adrienne Barbeau|Robert Downey, Jr.|Sam Kinison|Ned Beatty|","running_time":"96 min.","music_by":"Danny Elfman","edited_by":"David Rawlins","budget":"$11 million[1]"}