{"country":"United States","distributed_by":"Warner Bros.","Plot":"Paul Hackett (Griffin Dunne), a word processor, meets Marcy Franklin (Rosanna Arquette) in a local cafe in New York. They discuss their common interest in Henry Miller. Marcy leaves Paul her number and informs him that she lives with a sculptor named Kiki Bridges (Linda Fiorentino), who makes and sells plaster of Paris paperweights resembling cream cheese bagels. Later in the night, under the pretense of buying a paperweight, Paul visits Marcy, taking a cab to her apartment. On his way to visit Marcy, a $20 bill is blown out the window of the cab, leaving him with only some spare pocket change. The cab driver is furious that he cannot pay. This is the first in a long series of misadventures for Paul that turn hostile through no fault of his own. At the apartment Paul meets the sculptor Kiki and Marcy, and comes across a collection of photographs and medications which imply that Marcy is severely disfigured from burns on her legs and torso. As a result of this implication, and as a result of a strained conversation with Marcy, Paul abruptly slips out of the apartment.Paul then attempts to go home by subway, but the fare has increased at the stroke of midnight and he finds that his pocket change is no longer sufficient to purchase a token. He goes to a bar where Julie (Teri Garr), a waitress, becomes enamored with him. At the bar, Paul learns that there have been a string of burglaries in the neighborhood. The bar's owner, Tom Schorr (John Heard), offers to give Paul money to cover the subway fare, but cannot open the cash register. They exchange keys so Paul can go to Tom's place to fetch the cash register keys. On the way back from Tom's apartment, Paul is questioned by suspicious neighbors. Afterwards, Paul spots two actual burglars, Neil (Cheech Marin) and Pepe (Tommy Chong), with one of Kiki's sculptures. After he attempts to confront them, they flee, dropping the sculpture in the process. When Paul returns the sculpture to Kiki and Marcy's apartment, he finds Marcy has committed suicide. Kiki and a stout man named Horst have already left to go to Club Berlin, a nightclub.Paul attempts to return to Tom's bar, but it is locked up, with a sign indicating that Tom will be back in half an hour. Paul meets Julie, the waitress, in the street, who invites him up to her apartment to wait for Tom to reopen the bar. Julie is enamored with Paul, but Paul goes back to Tom's bar, finding Tom grieving over Marcy, who was his girlfriend. Paul returns to Julie's apartment where she begins to sketch his portrait while they talk. Ultimately, Paul rejects Julie's advances and leaves. He goes to Club Berlin to find Kiki and Horst, where a collection of punks attempt to shave his head into a Mohawk hairstyle. On the street, Paul is mistaken for a burglar and is relentlessly pursued by a mob of local residents.Paul finds Tom again, but the mob (with the assistance of Julie, Gail, and Gail's Mister Softee truck) chases Paul. Paul discovers that as payback for rejecting her, Julie used his image in a wanted poster which names him as the burglar. He ultimately seeks refuge back at the Club Berlin. Paul uses his last quarter to play \"Is That All There Is?\" by Peggy Lee and asks a woman named June to dance. Paul explains he's being pursued and June, also a sculptress, offers to help him. She protects him by pouring plaster on him in order to disguise him as a sculpture. However, she won't let him out of the plaster, which eventually hardens, trapping Paul in a position that resembles the character depicted in Edvard Munch's painting The Scream. The burglar duo then breaks into the Club Berlin and steals him, placing him in the back of their van. He falls from the burglar's cargo right outside the gate to his office as the sun is rising. Paul brushes himself off and goes to work, bringing the film full circle.","language":"English","Reception":"The film grossed $10,609,321 in the United States.[2] Though it was not received well by audiences, it was given positive reviews at the time and went on to be considered an \"underrated\" Scorsese film, and a cult classic in its own right.[13][14][15][16] The film did, however, garner Scorsese the Best Director Award at the 1986 Cannes Film Festival and allowed the director to take a hiatus from the tumultuous development of The Last Temptation of Christ.[17] It currently holds a 90% rating on review aggregator Rotten Tomatoes.[18] Film critic Roger Ebert gave After Hours a positive review and a rating of four out of four stars. He praised the film as one of the best in the year and said it \"continues Scorsese's attempt to combine comedy and satire with unrelenting pressure and a sense of all-pervading paranoia.\"[19] He later added the film to his \"Great Movies\" list.[20] In The New York Times, Vincent Canby gave the film a mixed review and called it an \"entertaining tease, with individually arresting sequences that are well acted by Mr. Dunne and the others, but which leave you feeling somewhat conned.\"[7]","box_office":"$10.6 million[2]","Lawsuit":"Radio artist Joe Frank later filed a lawsuit, claiming the screenplay lifted its plot setup and portions of dialogue, particularly in the first 30 minutes of the film, from his 1982 NPR Playhouse monologue \"Lies\".[21] Though Frank never received official credit, he reportedly was \"paid handsomely\" in a settlement.[22]","cinematography":"Michael Ballhaus","production_company":"The Geffen Company Double Play Productions","directed_by":"Martin Scorsese","Music":"The musical score for After Hours was composed by Howard Shore, who went on to collaborate multiple times with Scorsese. Although an official soundtrack album was never released, many of Shore's cues appear on the 2009 album Howard Shore: Collector's Edition Vol. 1.[27] In addition to the score, other music credited at the end the film is:","release_dates":"September 13, 1985 (1985-09-13)|||||","Production":"Paramount Pictures' abandonment of the Last Temptation of Christ production was a huge disappointment to Scorsese. It spurred him to focus on independent companies and smaller projects.[5] The opportunity was offered to him by his lawyer Jay Julien, who put him through Griffin Dunne and Amy Robinson's independent group: \"Double Play Company\". The project was called \"A Night in Soho\" and it was based on the script by Joseph Minion. The screenplay, originally titled Lies after the 1982 Joe Frank monologue that inspired the story,[6] was written as part of an assignment for his film course at Columbia University. Minion was 26 years old at the time the film was produced.[7] The script finally became After Hours after Scorsese made his final amendments.[8]One of Scorsese's inputs involves the dialogue between Paul and the doorman at Club Berlin, inspired by Kafka's Before the Law, one of the short stories included in his novel The Trial.[9][10] As Scorsese explained to Paul Attanasio, the short story reflected his frustration towards the production of The Last Temptation of Christ, for which he had to continuously wait, as Joseph K had to in The Trial.[11]The film was originally to be directed by Tim Burton, but Scorsese read the script at a time when he was unable to get financial backing to complete The Last Temptation of Christ, and Burton gladly stepped aside when Scorsese expressed interest in directing.[citation needed]After Hours was the first fictional film by Scorsese in ten years in which Robert De Niro was not part of the cast.[3]British director Michael Powell took part in the production process of the film (Powell and editor Thelma Schoonmaker married soon afterwards). Nobody was sure how the film should end. Powell said that Paul must finish up back at work, but this was initially dismissed as too unlikely and difficult. They tried many other endings, and a few were even filmed, but the only one that everyone felt really worked was to have Paul finish up back at work just as the new day was starting.[12]","after_hours":"Theatrical release poster","produced_by":"Amy Robinson|Griffin Dunne|Robert F. Colesberry|","starring":"Rosanna Arquette|Verna Bloom|Thomas Chong|Griffin Dunne|Linda Fiorentino|Teri Garr|John Heard|Richard Cheech Marin|Catherine O'Hara|","running_time":"97 minutes","Themes and motifs":"This film belongs in a grouping which revolve around a young working professional who is placed under threat, named the \"yuppie nightmare cycle\",[23] a subgenre of films which combine two genres in itself – screwball comedy and film noir. Some critics present a psychoanalytic view of the film. Paul is constantly emasculated by women in the film: by Kiki with her sexual aggressiveness and a lust for masochism,[24] Marcy turning down his sexual advances, Julie and Gail turning a vigilante mob on him, and June entrapping him in paper-mache, rendering him helpless. There are many references to castration within the film,[23] most of which are shown when women are present. In the bathroom in Terminal Bar where Julie first encounters Paul, there is an image scrawled on the wall of a shark biting a man's erect penis off.[25] Kiki holds a cigarette in her teeth when she first encounters him, a phallic symbol,[26] and Marcy makes a reference to her husband using a double entendre when saying, \"I broke the whole thing off\" when talking about her and her husband's sex life.[23] A mouse trap clamps shut on a mouse when Julie tries to give Paul the bagel paperweight.","music_by":"Howard Shore","edited_by":"Thelma Schoonmaker","written_by":"Joseph Minion|Martin Scorsese (uncredited)|","budget":"$4.5 million[1]"}