{"country":"United States","distributed_by":"Columbia Pictures","Plot":"A man named Michael Newman (Adam Sandler) is a hardworking architect who is married to his longtime sweetheart, Donna Newman (Kate Beckinsale) with two children, Ben and Samantha. Michael is easily pushed around by his overbearing boss, John Ammer (David Hasselhoff). On numerous occasions, Michael chooses working over family functions. While going in search of a universal remote control at the retail store Bed Bath & Beyond, Michael falls onto a bed and then proceeds to the section marked \"Beyond\". There, he befriends a mysterious man named Morty (Christopher Walken), who gives him a \"universal\" remote control for free and warns him that it can never be returned.To Michael's amazement, he finds that this remote can actually control time. At first, Michael uses the remote to have fun, but then starts to use it for his benefit, including to interpret for foreign clients or revisit events in his life, including a time in his childhood. During a camping trip in Lake Winnipesaukee, his parents had a barbeque, but the other kids had declined his invitation in favor of another family who had more compared to his family. This shows an insight to Michael's adult personality; his determination to succeed in order to avoid raising his family in the same squalor his parents did. Morty tries in a broken way to explain the error of Michael's work ethic, as well as not to take Donna for granted by showing some of Michael's past girlfriends who were homely or had awful personalities. However, Michael also uses the remote to skip quarrels with Donna, to avoid suffering a cold by skipping to the point at which he recovers, and to skip a family dinner in order to finish an important project. Later, Morty reveals that when Michael fast-forwards through time, his body is on \"auto-pilot,\" his mind skips ahead while his body goes through the motions of everyday life. After seeing his children upset that he cannot afford bicycles for them, Michael decides to use the remote to when Ammer delivers on his promised partnership, but learns that was one year away. Michael also finds out that he is in marriage counseling, his children prefer to watch CSI instead of Dragon Tales, and he missed the death of his dog. To make matters worse, the remote begins fast-forwarding on its own. Michael's various attempts to dispose of or destroy the remote fail, giving him the resolve to regain agency of his life. The next day, Ammer tells Michael he is retiring and suggests that one day Michael may end up CEO. Momentarily forgetting his plan to outfox the remote, Michael says he would like to end up CEO; the remote reacts accordingly and fast-forwards to 2017. In the future Michael has achieved everything he wished to now the new CEO of the company with all the material wealth and luxuries he could ever want, albeit at the cost of his family's state. Michael has become very unhealthy over the ten years causing him to become obese and discovers he resides in a penthouse by himself. After discovering his new life Michael wishes to go back to his old one and the remote acts accordingly. However, when he returns to his old house Michael is resented by everyone in his family and is divorced from Donna. He also discovers that Donna has married Bill, who coached Ben's swim team. While visiting his family, Michael meets Ben who is now an overweight teenager with self-esteem issues from copying his father's eating habits and Samantha who has grown into a beautiful young lady, but moody with similar attitude problems like Ben's. He then fights with Donna and Bill, before confronting Morty who reveals his life choices caused him to become an overweight workaholic who neglected his family. The new family dog then pounces on him, causing him to fall and hit his head on a brick wall, knocking him into a coma.Having \"learned\" from Michael when he skipped his cold, the remote transports him six years into the future. Michael had suffered a heart attack while in a coma, but is no longer obese. Ben is also in shape and is now Michael's partner. Michael is devastated when Ben tells him his father Ted has died, and Michael, while visiting his father's tomb, tries to use the remote to go to the moment when Ted was on his deathbed, but Morty appears, saying that it will not take him there; the time travel function only works for events Michael was physically present. Michael uses the remote to take him to the point when he last saw Ted alive, which is when Ted made an impromptu visit to his son's and grandson's office. Michael sees that, while on auto-pilot, he had brusquely rejected his father's offer for a night out with him. Heartbroken, Ted says, \"I love you, son,\" and walked away with Ben. Although aghast, Michael \"pauses\" Ted to get in his last words and make peace with his father. Morty reveals he is in fact the Angel of Death. Upset with his life, Michael begs to go to a \"good place\", and fast forwards to Ben's wedding in year 2029. Although Michael is glad, he also sees Samantha calling Bill \"Dad\", and the shock triggers a second heart attack. When Michael awakens in a hospital wing, Morty appears and tells him that he has chosen his path and is powerless to do anything about it. Michael's family arrives, and Ben tells his dad their business is in trouble so he has cancelled his honeymoon in order to secure a deal. Not wanting Ben to make the same mistakes he did, Michael rushes out the door. Although Morty protests that Michael will die unless he goes back to the hospital, Michael insists he needs to speak his last words to his family. Michael reaches his family and collapses, but manages to convince Ben that family must come first; he reassures the others that he still loves them, and Morty approaches to take him. The family weeps as Michael expires.Michael wakes up in the bed onto which he had collapsed at Bed Bath & Beyond, convinced that the events have all been a crazy dream. A reformed Michael bumps into a store employee whom earlier said he had no friends, so Michael gives the man his business card and says they should get together. A joyous Michael drives through town, being cheerful to everyone and then stops at his parents' house, telling them his door is always open for them. Michael goes home, but finds the remote on the kitchen counter along with a note by Morty, who says \"good guys need a break\" and Morty knows Michael will do right by his family. Michael now realizes his experience was not a dream but a warning. Michael thanks Morty and offers to play with his kids. Prior to doing that, he tosses the remote into the garbage bin, and it does not regenerate.","language":"English","Reception":"Rotten Tomatoes gave the film a score of 32% based on 167 reviews, giving the film a \"Rotten\" rating. The average score is a 4.7 out of 10, with the consensus being \"This latest Adam Sandler vehicle borrows shamelessly from It's a Wonderful Life and Back to the Future, and fails to produce the necessary laughs that would forgive such imitation.\"[8] Metacritic gave it a score of 45 out of 100 which indicates \"mixed or average reviews\".[9] Click grossed $137,355,633 in the United States and $100,325,666 internationally, with a total gross of $237,681,299 worldwide.[1]","click":"Theatrical release poster","box_office":"$237.6 million[1]","cinematography":"Dean Semler","production_company":"Revolution Studios Happy Madison Original Film","directed_by":"Frank Coraci","release_dates":"June 23, 2006 (2006-06-23)|||||","Production":"On February 15, 2003, Frank Coraci was hired and set to direct Click. Steve Koren and Mark O'Keefe wrote the script for the film. Adam Sandler, Jack Giarraputo and Neal H. Moritz produced the film with the budget of $82.5 million for release in 2006. On March 11, 2004, it was announced that Adam Sandler, Emilio Cast, Kate Beckinsale, Christopher Walken, David Hasselhoff, Henry Winkler, Julie Kavner, Sean Astin, Jennifer Coolidge, Sophie Monk, Michelle Lombardo, Joseph Castanon, Jonah Hill, Jake Hoffman, Danielle Tatum McCann, Lorraine Nicholson, Katie Cassidy, Cameron Monaghan, Rachel Dratch, Nick Swardson, Rob Schneider and Billy Slaughter joined the film. James Earl Jones joined the cast on March 14 to play himself and the narrator. On April 8, 2005, it was announced that Rupert Gregson-Williams would compose the music for the film. In May 8, Columbia Pictures acquired distribution rights to the film. Click was filmed at Shreveport, Louisiana.The film's plot is similar to a story from the Goosebumps book series, also entitled \"Click\", which was made into an episode of the franchise's television series in 1997.[3] The content of the show prompted widespread discussion over whether the material was influential or borrowed for the 2006 film.[4][5][6][7]","produced_by":"Adam Sandler|Jack Giarraputo|Neal H. Moritz|Steve Koren|Mark O'Keefe|","starring":"Adam Sandler|Kate Beckinsale|Christopher Walken|Henry Winkler|David Hasselhoff|Julie Kavner|Sean Astin|","running_time":"107 minutes","music_by":"Rupert Gregson-Williams","edited_by":"Jeff Gourson","Release":"The film screened out of competition at the San Sebastian International Film Festival.","written_by":"Steve Koren|Mark O'Keefe|","budget":"$82.5 million"}