{"country":"Italy France","distributed_by":"Gaumont The Criterion Collection (DVD)","Plot":"The film opens depicting a scene in July 1914 immediately prior to the cruise ship Gloria N. setting sail from Naples Harbor. The opening sequence is in sepia tones, as if it were a film shot in that era, with no sound other than the whirring of the projector. Gradually the sepia fades into full colour and we can hear the characters’ dialogue.Orlando, an Italian journalist, supplies commentary by directly addressing the camera, explaining to the viewer that the cruise is a funeral voyage to disperse the ashes of opera singer Edmea Tetua near the island of Erimo, her birthplace. Considered the greatest singer of all time, Tetua is celebrated for her goddess-like voice.The bumbling but lovable journalist also provides highly subjective anecdotes and gossip on the wide array of cartoon characters that evoke the golden age of the \"funny papers\" (Little Nemo[citation needed], Bringing Up Father[citation needed], The Katzenjammer Kids[citation needed]) but with a perverse Felliniesque twist. These include more opera singers, voice teachers, orchestra directors, theatre producers, actors, prime ministers, counts, princesses, Grand Dukes, and panic-stricken fans of the deceased diva.A jealous and bitter soprano named Ildebranda desperately tries to penetrate the secret behind Edmea Tetua’s unforgettable voice. A bristle-haired Russian basso is shown around the ship’s vast mess hall where, using only his voice, he hypnotizes a chicken. A curly-cued actor travels with his mother in order to seduce sailors. Sir Reginald Dongby, a voyeuristic English aristocrat, relishes spying on Lady Violet, his nymphomaniac wife. The Grand Duke of Harzock, a Prussian, is an obese bubble of a young man whose blind sister (choreographer Pina Bausch) schemes with her lover, the prime minister, to disinherit her brother. The brooding Count of Bassano closets himself in his cabin transformed into a temple dedicated to the diva’s memory.An awful stench rises from the ship’s hold and soon it’s revealed that a love-sick rhinoceros has been neglected by the ship’s crew. The beast is pulled up, washed on deck, and returned to the hold with fresh water and hay.On the third day of the voyage, the passengers discover a crowd of shipwrecked Serbians camped on the deck of the ship. Fleeing in rafts towards Italy after the assassination at Sarajevo, the refugees were brought on board the previous night by the captain. The Grand Duke and his men, however, are convinced the Serbians are terrorists and order the captain to isolate the group to a corner of the ship. The upshot is Fellini’s barely disguised take on the Marx Brothers's A Night at the Opera in a heady mix of cultures, both ethnic and artistic, where aristocrats and snobs joyfully share the stage (the ship’s deck) with peasants and vibrant Serbian folklore.But the revels end when the menacing flagship of the Austro-Hungarian fleet sails into view, demanding the return of the Serbian refugees. The captain agrees on condition that Edmea Tetua’s ashes be dispersed at Erimo beforehand. After the ceremony, the refugees are loaded into a lifeboat for delivery to the Austrians but a young Serbian hurls a bomb at the flagship, causing pandemonium. The Austrians respond by cannon fire. The Gloria N. sinks while Albertini wields his baton, aristocrats march to the lifeboats, a grand piano slides across the floor smashing mirrors, and butterflies twitter serenely above the melee of suitcases in flooded corridors.In a reverse tracking shot, Fellini reveals the stupendous behind-the-scenes of his floating opera of a movie - giant hydraulic jacks (constructed by Oscar-winning set designer, Dante Ferretti) that created the ship’s rolling sea movements, along with acres of plastic ocean, an army of technicians burning naphthalene for the smoke of disaster effect, and, finally, an enigmatic figure that may be Orlando or Fellini intentionally hiding behind his own camera filming the main camera filming himself.The main camera then tracks forward to a final shot of Orlando in a lifeboat with the rhinoceros happily munching on hay. \"Did you know,\" confides Orlando, \"that a rhinoceros gives very good milk?\" Laughing, he once again mans the oars to disappear on a vast plastic ocean.","language":"Italian","Critical reception":"Screened out of competition at the 40th Venice Film Festival, the film received a fifteen-minute standing ovation.[2]Writing for the Italian weekly magazine L'Espresso, novelist and film critic Alberto Moravia saw the film as an intuitive critique of European society that preceded the First World War. \"What is brilliant,\" explained Moravia, \"is the intuition that European society of the Belle Epoque had emptied itself of all humanism leaving only an artificial and exhaustive formalism. The result was a society founded on a continuous yet contemptible melodrama. The other genial intuition is that of the fundamental unity of the world back then which was completely bourgeois or utterly obsessed with the bourgeoisie. This idea comes through magnificently in the scene where immaculate opera singers perform leaning over the iron balcony of the engine room as sweat-grimed workers cease stoking the furnace with coal to listen to the splendid voices.\"[3]","cinematography":"Giuseppe Rotunno","directed_by":"Federico Fellini","and_the_ship_sails_on":"Italian release poster","release_dates":"7 September 1983 (1983-09-07)|||||","produced_by":"Franco Cristaldi Renzo Rossellini (associate) Daniel Toscan du Plantier","starring":"Freddie Jones Barbara Jefford Peter Cellier Norma West Pina Bausch","running_time":"132 minutes","music_by":"Gianfranco Plenizio","edited_by":"Ruggero Mastroianni","written_by":"Federico Fellini Tonino Guerra Andrea Zanzotto (lyrics)"}