{"based_on":"Play: (1952) Frederick Knott","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Frederick Knott","Plot":"Tony Wendice (Ray Milland), an ex-professional tennis player, is married to wealthy socialite Margot (Grace Kelly). She had a brief affair with an American crime-fiction writer Mark Halliday (Robert Cummings) out of loneliness as Tony was traveling during his tennis career. When Tony retires in response to her complaints about his busy schedule, he secretly discovers the affair and decides to murder her, both for revenge and to ensure that her money will continue to finance his comfortable lifestyle.Tony meets an acquaintance from the University of Cambridge, C. A. Swann (Anthony Dawson), who has become a small-time criminal. Tony has secretly been following Swann so he can blackmail him into murdering Margot. Tony tells Swann about Margot's affair. Six months prior, Tony stole her handbag, which contained a love letter from Mark, and anonymously blackmailed her. After tricking Swann into leaving his fingerprints on the letter, Tony offers to pay him £1,000 (£24,700 today) to kill Margot; if Swann refuses, Tony will turn him in to the police as Margot's blackmailer.When Swann agrees, Tony explains his plan: he will take Mark to a party, leaving Margot at home and hiding her latchkey outside the front door of their flat. Swann is to sneak in when Margot is asleep and hide behind the curtains in front of the French doors to the garden. At 11 pm, Tony will telephone. Swann must kill her while she is at the telephone, open the French doors, leave signs suggesting a burglary gone wrong, and exit through the front door, hiding the key again.Swann enters the flat and waits. At the party, Tony discovers his watch has stopped, so he phones the flat later than intended. Swann tries to strangle Margot with his scarf, but she manages to grab a pair of scissors and kill him. She picks up the telephone receiver and pleads for help. Tony tells her not to do anything. At home, he calls the police and sends Margot to bed. Tony then moves what he thinks is Margot's latchkey from Swann's pocket into her handbag, plants Mark's letter on Swann, persuades Margot to hide the fact that he told her not to call the police, and destroys Swann's knotted scarf, replacing it with Margot's own stocking in an attempt to incriminate her.The next day, Chief Inspector Hubbard (John Williams) questions the Wendices, and Margot makes several conflicting statements. When Hubbard says Swann must have entered through the front door, Tony falsely claims to have seen Swann after Margot's handbag was stolen, and suggests that Swann made a copy of her key. Hubbard does not believe that story because no key was found on Swann. Hubbard arrests Margot after concluding that she killed Swann for blackmailing her. Margot is found guilty and sentenced to death.On the day before her execution, Mark visits Tony, pleading with him to save her by claiming that he hired Swann to kill her. Tony says the story is too unrealistic. Hubbard arrives, and Mark hides in the bedroom. Hubbard asks Tony about money he has been spending, tricks him into revealing that his latchkey is in his raincoat, and asks him about an attaché case. Tony claims to have lost the case, but Mark, still in the bedroom, sees it on the bed, full of cash. Mark stops Hubbard from leaving and explains his theory. Hubbard says he prefers Tony's story, but after Mark leaves, Hubbard discreetly swaps his own raincoat with Tony's, and as soon as Tony leaves, he uses Tony's key to re-enter the flat. Hubbard had already discovered that the key in Margot's handbag was Swann's latchkey, and realized that Swann had put the key back in its hiding place after unlocking the door.Mark returns, and police officers release Margot. She tries to unlock the door with the key in her purse, then enters through the garden, proving she is unaware of the hidden key. Hubbard has the handbag returned to the police station, where Tony retrieves it after discovering that he has no key. The key from Margot's bag does not work, so he uses the hidden key to open the door, proving his guilt. His escape routes blocked by Hubbard and another policeman, Tony calmly makes himself a drink and admits defeat.","language":"English","Reception":"It currently holds an 88% favorability rating on Rotten Tomatoes. [8]","box_office":"$6 million[1]","cinematography":"Robert Burks","directed_by":"Alfred Hitchcock","dial_m_for_murder":"Theatrical release poster by Bill Gold","Similar films and remakes":"As it is considered one of the classic examples of a stage thriller, it has been revived a number of times since, including a US TV movie in 1981 with Angie Dickinson and Christopher Plummer. The American Broadcasting Company (ABC) produced a two-hour color version in 1968 featuring Laurence Harvey as Tony, Diane Cilento as Margot, and Hugh O'Brian as Max.[9]A Perfect Murder is a 1998 remake directed by Andrew Davis in which the characters of Halliday and Swann are combined, with the husband (Michael Douglas) both hiring and coercing his wife's lover (played by Viggo Mortensen) into a scheme to kill her (Gwyneth Paltrow). However, the lover hatches a revenge plot against the husband. Things go disastrously wrong for both of them, bringing in the cold, smoothly dogged police inspector (David Suchet), whose role is much reduced, as it is Gwyneth Paltrow's character, the wife, who unravels much of the mystery.The television series Alfred Hitchcock Presents premiered in the United States the year after Dial M for Murder was released. The main character in an episode from the series's first season, \"Portrait of Jocelyn,\" is named Mark Halliday. In the episode, Halliday's wife, Jocelyn, has disappeared several years earlier, and at the conclusion, it is revealed that he murdered her.[10]The original play was also adapted in the Soviet Union in 1981 under the title Tony Wendice's Mistake (Ошибка Тони Вендиса).[11]The film partially inspired a Hindi-language version in 1985, released as Aitbaar, starring Raj Babbar, Dimple Kapadia, and Suresh Oberoi, and Chaavi with Sathyaraj, Saritha, Jaishanker and Nizhalgal Ravi. The film also inspired a Malayalam-language adaptation as New Year starring Jayaram, Urvashi and Suresh Gopi in 1989. Another Bollywood film, Humraaz (2002), starring Bobby Deol, Akshaye Khanna, and Amisha Patel, was inspired by A Perfect Murder.The episode \"The Fifth Stair\" of the TV series 77 Sunset Strip recreated Dial M for Murder, with Richard Long portraying Tony Wendice.The third episode of the sixth season of Frasier is titled \"Dial M for Martin\". The plot centres on the title character's father believing that his younger son is subconsciously trying to kill him when he is beset by a series of mishaps seeming caused by Frasier's younger sibling, Niles.","release_dates":"May 29, 1954 (1954-05-29)|||||","Production":"After 1953's I Confess, Hitchcock planned to film The Bramble Bush, based on the 1948 novel by David Duncan, as a Transatlantic Pictures production, with partner Sidney Bernstein. However, there were problems with the script and budget, and Hitchcock and Bernstein decided to dissolve their partnership. Warner Bros. allowed Hitchcock to scrap the movie, and begin production on Dial M for Murder.[2]Mark's name was changed for the film. In the original play, he was Max Halliday.[3] Actors Dawson and Williams reprise their Broadway roles (Captain Lesgate, Inspector Hubbard).Alfred Hitchcock's cameo is a signature occurrence in most of his films. In Dial M for Murder, he can be seen thirteen minutes into the film, in a black-and-white reunion photograph, sitting at a banquet table among former students and faculty.","produced_by":"Alfred Hitchcock","starring":"Ray Milland Grace Kelly Robert Cummings John Williams","running_time":"105 minutes","music_by":"Dimitri Tiomkin","3-D release":"The 1954 film was shot using Warner Bros.' own proprietary 3-D camera rig, the so-called All-Media Camera. Originally intended to be shown in dual-strip polarized 3-D, the film played in most theaters in ordinary 2-D due to the loss of interest in the 3-D process (the projection of which was difficult and error-prone) by the time of its release.[4]The film earned an estimated $2.7 million at the North American box office in 1954.[5] Dial M for Murder marked the end of the brief flirtation with 3-D movies of the early 1950s. Hitchcock said of 3-D, “It's a nine-day wonder, and I came in on the ninth day.”[6]In February 1980, the dual-strip system was used for the revival of the film in 3-D at the York Theater in San Francisco. This revival did so well that Warner Bros. did a limited national re-release of the film in February 1982, using Chris Condon's single-strip StereoVision 3-D system, including a sold out engagement at the Detroit Institute of Arts.Warner Bros. released Dial M for Murder as a 3D Blu-ray on October 9, 2012.The film was shown in 3-D in some UK cinemas during the summer of 2013 and in Italy at the beginning of fall of the same year.[7]","edited_by":"Rudi Fehr","budget":"$1.4 million"}