{"based_on":"A Simple Plan by Scott B. Smith","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Scott B. Smith","a_simple_plan":"Theatrical release poster","Plot":"Hank Mitchell and his wife Sarah live in rural Minnesota. One of the town's few college graduates, Hank works in a feed mill, while his wife is a librarian. When Hank, his older, socially challenged brother Jacob and Jacob's friend Lou chase a fox into the woods, they stumble upon a crashed airplane. Hank decides to look inside the plane where he discovers a dead pilot and a bag containing $4.4 million in $100 bills. He suggests turning the money in but is persuaded not to by Jacob and Lou. Hank then proposes that he keep the money safe at his house until the end of winter. Sheriff Carl Jenkins drives by the area and notices the three men after they hide the money in Jacob's pick-up truck. Jacob mentions hearing a plane in the area to avoid suspicion. After Carl leaves, the three men decide to keep the money a secret, but Hank breaks the pact when he reveals the discovery to Sarah.Sarah suggests that Hank and Jacob return a paltry sum of the money to the plane to avoid suspicion from local authorities. While travelling on foot to the woods, the brothers come across an old man on a snowmobile. Jacob, thinking that their cover is blown, bludgeons him. When the man regains consciousness, Hank suffocates him, then uses the snowmobile to drive his body off a bridge, making the murder look like an accidental death. The following night, Lou drunkenly demands some of the money from Hank, because he has spent recklessly since the discovery. When Hank refuses, Lou threatens to go to the authorities, having learned from Jacob about the old man's murder.Sarah advises that Hank and Jacob team up to plot against Lou. Much to Jacob's dismay, the two brothers visit Lou at his home where Jacob has him drunkenly confess to the old man's murder. Hank records the false confession with a tape recorder. Lou grows enraged when he realizes that the two have conspired against him and pulls a gun on them. Jacob grabs a rifle from his truck and kills Lou to save his brother. Hank then kills Lou's wife with Lou's shotgun when she appears with another gun. The two brothers avoid arrest after Hank concocts a rehearsed speech for himself and Jacob to tell the police.Because Jacob mentioned hearing a plane in the woods, Carl asks the brothers to assist an FBI agent, Neil Baxter, in a search for the missing aircraft. Hank and Jacob meet with Baxter and Carl at the police station. Sarah grows skeptical of Baxter, whom she later discovers to be an impostor; she contacts and warns Hank, who steals a handgun from Carl's office. The four men head into the woods and split up. When he finds the plane, Baxter kills Carl, and engages in a gunfight with Hank. Hank manages to kill Baxter with the gun he had stolen. Hank starts to concoct another story to tell the authorities. Jacob however announces that he does not want to live with these bad memories; he threatens to shoot himself to end it. He then encourages Hank to kill him instead and frame Baxter for the crime. After grappling with the decision, Hank kills Jacob.At the police station, Hank tells his rehearsed story to real FBI agents. As Sarah predicted, the agents do not believe that Hank, an upstanding member of the community, would be capable of such wrongdoing. Although he is ruled out as a suspect, Hank is told that the money was part of a ransom and that many of the bills' serial numbers were written down to track the cash. Hank realizes he cannot use the money without being caught; he goes home and burns it all. In a closing narration, Hank reflects on his losses; as he tries to move on with his life, the murderous events constantly haunt him.","language":"English","box_office":"$16.3 million[1][4]","cinematography":"Alar Kivilo","directed_by":"Sam Raimi","production_companies":"Mutual Film Company Savoy Pictures","release_dates":"September 11, 1998 (1998-09-11) (TIFF)|December 11, 1998 (1998-12-11) (limited)||||","Production":"After Scott B. Smith had published a short story for The New Yorker, the magazine's fiction editor learned of his then-unpublished novel A Simple Plan before reading it and forwarding it to an agent. Shortly thereafter, Smith learned that Mike Nichols was interested in purchasing the film rights to his novel.[5] Nichols spent a weekend reading the book, before contacting Smith's agent, and finalizing a deal the following Monday morning. Nichols purchased the rights for his production company Icarus Productions[6] for $250,000, with an additional $750,000 to come later from a studio interested in pursuing the project.[7] Smith’s manuscript of A Simple Plan was optioned for development at an independent film studio, Savoy Pictures. However, due to scheduling conflicts with a planned film adaptation of All the Pretty Horses, Nichols stepped down from the project.[8]After learning of the film adaptation from Nichols, Ben Stiller joined the project[8] and signed a two-picture directing deal with Savoy.[9] He spent nine months working on the script with Smith. During preproduction, however, Stiller had a falling out with Savoy over budget disputes—among them was how Savoy’s reported $4 million offer to Nicolas Cage would affect the film’s budget. Stiller explained, ”The problem was Savoy. I don’t think they had a good understanding of how to make films happen.”[8] Unable to secure financing from another studio, Stiller left the production.[10]In January 1995, John Dahl was announced to helm the film, with Cage set to appear in a starring role, and filming likely to start during the following summer in the southern hemisphere or in Canada during the following winter.[11][10] In November 1995, following a series of box office failures, Savoy announced that it was retreating from the film industry.[12] The studio was later acquired by IAC/Interactive Corporation, whose chairman, Barry Diller, put A Simple Plan up for sale.[8] This resulted in both Dahl and Cage leaving the project.[8][10]The project was purchased by Paramount Pictures, where producer Scott Rudin hired John Boorman to direct the film. Boorman cast Bill Paxton and Billy Bob Thornton in the lead roles of Hank and Jacob Mitchell, respectively.[13] A Simple Plan marked the second on-screen collaboration between Paxton and Thornton after One False Move (1992).[14] Thornton recalled, \"I got a call from one of my agents who said, 'John Boorman wants you to do a script that I sent you a year ago and you never read,' I said, 'Send it to me again, and this time I'll really read it.' Within the first two pages, I knew I wanted to do it.\"[10] Paxton learned of the novel A Simple Plan from his father five years before securing the role of Hank: \"He said, 'You'll love it. It's got a lot of hair on it. You were born to play this part.' I said, 'Dad, I'll never get to do this.' And for five years, there was a whole list of actors and directors who kind of marched through it. Billy Bob and I were set to do these roles in 1997, and then it fell apart. That was the cruelest twist for an actor, to get a part you dreamed you'd get and then they decide to scrap the whole thing.\"[14] Rudin considered casting Anne Heche as Hank's wife Sarah Mitchell.[15]Boorman took part in location scouting, and filming was set to begin during the first week of January 1998.[10] When a second investor left the project, Paramount refused to fully finance the $17 million production itself.[13][10] Although Boorman was able to secure financing, the studio feared that filming would not be finished before the end of winter.[10] Boorman ran into scheduling conflicts, which resulted in him leaving the production.[10] Paramount then hired Sam Raimi to direct the film.[13] Smith said of Raimi, \"I wasn't familiar with Sam's other work, but I met with him, and in talking to him I was very pleased. I felt like he understood the story. He understood the people. We grew up in the same area of the country. He knew what I was writing about and he knew how to tell the story in the right way.\"[5] Raimi did not have time to scout locations due to studio constraints; he relied on the previous locations visited during Boorman's involvement.[10] In December 1997, Bridget Fonda, who had previously collaborated with Raimi on Army of Darkness (1992), was cast as Sarah Mitchell.[3]A Simple Plan was a co-production between Paramount and Mutual Film Company. The film was co-financed by Mutual and Newmarket Capital Group[2] as part of a joint venture that was formed by the two companies.[16] Mutual's international partners—the United Kingdom's BBC, Germany's Tele-München, Japan's Toho-Towa/Marubeni and France’s UGC-PH—also co-financed the film in exchange for distribution rights in their respective territories and equity stakes on the film on a worldwide basis.[17] Paramount acquired the North American distribution rights.[3]\"Ben [Stiller] really taught me how to write a script. I don’t know that he ever explicitly said it, but by imagining the script as a verbal description of a movie, the movie that I wanted the book to be. That’s very simple, but it really was the key to everything for me—just imagining what was on the page. I was shortchanging the visual in my script, concentrating on dialogue, which I imagine is a very common first-time screenwriter’s mistake, and to suddenly just do it visually opened up everything for me.\"The original script that Smith had written for Mike Nichols was 256 pages long—the equivalent of a four-and-a-half hour film. Smith said of the experience, \"I wrote a horrible, amateurish draft...which I think scared [Nichols] away from the project.\" Smith kept Nichols's suggested story setting: Because snow plays a crucial role, the film adaptation would take place in Minnesota, rather than in Ohio, where the book is set.[10] After Nichols suggested that the story be set in the state, the Minnesota Film Board joined the project and remained with it throughout principal photography.[10]Following publication of A Simple Plan, Nichols eventually turned down the project during the script's early draft stages.[5] When Ben Stiller became involved, he and Smith spent nine months rewriting the script. Smith explained, \"Ben was the one that showed me how to write a script. He worked with me and gave me the cue to visualize the movie and write down what I was picturing in my head.\"[5]For the film adaptation, certain visual changes were made from the novel. Smith explained that one change involved the discovery of the crashed plane; his script had the character Lou Chambers \"throwing [a] snowball to uncover the plane...In the book, they're just walking and they find it.\"[5] Scott Rudin wanted to change the focus of the story to Hank and Jacob, and ordered Smith to shorten the screenplay to 120 pages. Smith explained, \"I had to work to make Hank a more rational character, less evil.\"[5] The shortening of the script also resulted in the character of Sarah having a smaller role, and Jacob getting to live longer (in the book, Jacob dies in a shootout at Lou's house). After the role was secured by Billy Bob Thornton, Smith omitted the character's overweight appearance from the novel.[5] Smith described the film adaptation as being less violent than the book: \"The book is much more violent than the movie, more graphic in its violence. It was [Raimi]'s choice to be more restrained, to bring out the characters.\"[13]Principal photography for A Simple Plan began on January 5, 1998, and concluded on March 13, 1998 after 55 days.[6][19] Filming was scheduled to begin in Delano, Minnesota, but due to climatic changes as the result of El Niño, the production was forced to temporarily relocate to northern Wisconsin to find the snow levels described in the script.[20] The production began shooting in Ashland, Wisconsin, where most of the film's exterior shots, and the road and woods near where the characters find the plane, were filmed.[19] An actual plane, with one side cut open, was one of two planes used to depict the crashed aircraft.[19] Patrizia Von Brandenstein was the film's production designer, marking her second collaboration with Raimi, after The Quick and the Dead (1995). Brandenstein found the weather conditions difficult during production, as she had to await good weather to complete the necessary exterior work. Describing the overall look of the film, she said, \"We created a muted black-and-white color scheme to suggest a morality tale, the choices given between right and wrong.\"[20]The production team returned to Minnesota, where it was plagued by a lack of snow.[21] To solve this problem, the production put together an effects team whose sole responsibility was dealing with snow. This snow effects team created a combination of real snow and fake synthetic snow that was made from shaved ice.[21]:2 The home of Lou Chambers and his wife Nancy was filmed in an abandoned house in Delano,[19] which cinematographer Alar Kivilo described as \"a very difficult [filming] location with very low ceilings and no heating\".[21] Brandenstein and the art department were tasked with designing the set inside the home.[22][21]The interior of the crashed plane, in which Hank discovers a dead pilot and the $4.4 million in cash, was filmed on a soundstage. A second plane, designed to have frosted windows, was attached to a gimbal, about five feet off the ground. Kivilo explained, “As [Paxton] crawls to the front of the plane, it tilts down. When he moves toward the back, it tilts in that direction. Since we were using an actual plane there was a limit to how much of the plane’s walls could be removed before it became structurally unsound.\"[22] Kivilo described the interior of the plane as \"a very small, cramped shooting space.\"[22] To match the interior with footage shot in Wisconsin, the art department built a set with real trees and a painted backdrop.[22] To depict Hank being attacked by a flock of crows inside the plane, puppets were used to attack Paxton as he appeared on screen, while two live crows were used to attack an animatronic replica of the actor.[22] A separate soundstage was used to create two sets depicting the interiors of the Mitchell home, where Hank and his wife Sarah (Fonda) reside. The first set was the main floor an exterior entrance way, and the second was created for the upstairs bedrooms.[22]\"This is a change of pace for me because the film is not about shots, but the performance within the frame. I wanted the camera work to be invisible and just allow the actors to tell this very thrilling story.\"Upon reading the script, director of photography Alar Kivilo said that his first approach to making the film \"was to make the look simple, allowing the characters to tell the story. Outwardly, the film is a thriller, but at the heart of it, this is a dark psychological drama of one man’s descent into hell. I knew the camera would have to take a back seat.”[22] Prior to his first meeting with Raimi, Kivilo's inspiration for the look of the film came from the visual imagery in the 1967 film In Cold Blood and the work of photographer Robert Frank.[22]Kivilo contacted his agent to arrange a meeting with Raimi; their first meeting occurred only three weeks prior to filming, during which Kivilo was also inspired by photographs taken during location scouting in Delano, Minnesota. He described the photographs as being \"very stark, with white snow and black trees. They were very hard-contrast, and reminded me of Japanese wood-cut prints, with very simple and graphic images.\"[21] Raimi saw A Simple Plan as an opportunity to direct a character-driven story that differed from his earlier works, which were highly stylized or dependent on intricate camera movements.[5]Kivilo originally wanted to shoot the film in widescreen, using the anamorphic format. \"Sam and I had talked briefly in the beginning about going anamorphic,\" he explained, \"but because of the lack of prep time, a restricted budget and lack of lenses available, we decided against it.\"[21] Kivilo used Panavision Platinum cameras with the company's Primo series of prime lenses to shoot the film.[21] He used Eastman Kodak 5246 250ASA Vision film stock for all of the daylight scenes and tungsten-balanced 5279 Vision 500T film stock for the night scenes.[21]Despite the intense weather conditions, Kivilo believed that the overcast skies created a \"gray, somber, stark look.\" He said, \"This allowed me to eliminate the need to bring in heavy movie lights for the exteriors, complicating the logistics even more. Because the light would bounce off the snow, I would use big solids for negative fill to shape the light, adding just a bit of shiny card for the actors’ eyes. I wanted to keep the snow very hot and retain a contrasty and stark look.\"[22] Kivilo also chose not to use any lighting for daytime exterior scenes.[21] For exterior scenes shot during sunnier filming days, computer-generated imagery (CGI) was used to re-create the overcast skies.[21] Kivilo added that \"CGI also helped to even out inconsistencies caused by the amount of snow falling from shot to shot.\"[22]Kivilo explained that he and Raimi intended to use the camera to enhance the story with simplicity: “Our opening sequence starts with quiet, poetic landscapes. White snow. Black trees. A black crow flying off. Symbolically, these are very fitting images. The crow is a symbol of greed and becomes a strong reoccurring visual theme later in the film. The choice of black and white foreshadows the battle between the conscious and the unconscious, which is such an important element in our story. We then show evocative images of an abandoned farm, [Hank and Jacob] Mitchell’s family home. A red tractor is parked in falling snow. A torn curtain flapping in the wind. These are innocent shots, before their world falls apart.”[22] Kivilo noted that “the film ends with some of the exact frames of the abandoned farm that we saw in the title sequence. Because of what the characters have gone through, a totally new value is assigned to those shots. They feel different, evoking new emotions and yet physically they haven’t changed from when we first saw them!\"[22]\"In most of my films, I’ve tended to find a progression of visuals to emphasize the story. They will often start one way and end another. The lighting and the camera will build with the story. But here, because the characters were going through such extreme psychological changes, we decided to keep the photography on an even keel. \"Regarding scenes that take place in Lou's home, Kivilo said, \"Because the performances were so intense, Sam wanted to shoot the scene with at least two cameras, and sometimes three. Lighting for three cameras is a significant compromise, but it was one I was willing to make to lessen the emotional load on the actors.\"[21] In filming a confrontation involving Hank, Jacob and Lou, Kivilo said, “Most of the lighting came from shallow soft boxes mounted into the low ceilings. We used two cameras throughout. The scene was such an odd mixture of dealing with dark human moments and very detailed technical considerations. Very draining for everybody.” In depicting the resulting shootout, Kivilo's intent was to \"keep things quite sketchy in the lighting and not be clear about exactly what was happening.\" The camera department lit a China ball from the ceiling to depict a dimly lit kitchen light that would reveal Nancy holding a shotgun.[21] Flash photography guns were used to depict the muzzle flashes during the shootouts. Kivilo said, \"Those flash guns are great because they have a long burn time and you don't run the danger of having the flash occur between exposures. The flashes were daylight-balanced, but we put double CTO on them to give them a slightly warmer feel. This was something that we had determined through testing in preproduction.\"[21]A Simple Plan's film score was produced and composed by Danny Elfman, who was drawn to the project after learning that Raimi would be directing the film; the film marked his third collaboration with Raimi. The instruments included alto and bass flutes, re-tuned pianos and banjos, zithers, and hand drums.[24]Regarding the tonal quality of the score, Elfman explained, \"...there are 2 thematic areas, one of them was a flute ensemble. It was a fun orchestra for me to work with because there was really no brass, no percussion. It was just strings and flutes, lots of flutes, 9 of them, mostly alto and bass. That was kind of a fun different thing, very, very simple, sparse ensemble led by alto and bass flutes. The other part of it [were] these specially tuned pianos that I prepared before I started and specially tuned banjos so I worked the music around the sounds of these micro-tuned piano chords and special banjo samples that I did myself. I tried to make the heart of it. Starting with these two odd tonal groups, I started composing the score.\"[24] The soundtrack album, titled A Simple Plan: Music from the Motion Picture Soundtrack, was released on January 26, 1999.[25]","produced_by":"James Jacks|Adam Schroeder|","starring":"Bill Paxton|Billy Bob Thornton|Bridget Fonda|","running_time":"121 minutes","music_by":"Danny Elfman","edited_by":"Arthur Coburn|Eric L. Beason|","Release":"A Simple Plan premiered at the 23rd Toronto International Film Festival on September 11, 1998.[26] On December 11, 1998, the film opened in limited release at 31 theaters.[27] Upon its limited release, A Simple Plan grossed $390,563 in its first week of limited release, with an average of $12,598 per theater.[27] More theaters were added during the limited run, and on January 22, 1999, the film officially entered wide release by screening in 660 theaters across North America.[27] The film ended its North American theatrical run on May 14, 1999, having grossed $16,316,273, below its estimated production budget of $17 million.[1][4]A Simple Plan received critical acclaim from mainstream film critics. Review aggregation website Rotten Tomatoes sampled 67 reviews, and gave the film a \"Certified Fresh\" score of 90%, with an average score of 8.2 out of 10. The website's consensus calls the film \"A riveting crime thriller full of emotional tension.\"[28] Another review aggregator, Metacritic, assigned the film a weighted average score of 82 out of 100, based on 28 reviews from mainstream critics, indicating \"universal acclaim\".[29]Reviewing the film during the Toronto International Film Festival, Glen Lovell of Variety, compared A Simple Plan to Joel and Ethan Coen's earlier film Fargo (1996): \"Both [films] are slices of life about outlandish crimes and Average Joe felons in over their heads, and both blend Grand Guignol and beautiful but foreboding snowscapes...The key differences are in emphasis and tone: Fargo is deadpan noir; A Simple Plan...is a more robust Midwestern Gothic that owes as much to Poe as Chandler.\"[30]In an \"early review\" of the film prior to its limited release, Roger Ebert and his colleague, Gene Siskel, gave the film a \"Two Thumbs Up\" rating on their syndicated television program Siskel and Ebert and the Movies.[31] In a later episode, Ebert ranked A Simple Plan at number four on his list of the \"Best Films of 1998\".[32] Online film critic James Berardinelli praised Billy Bob Thornton's performance as being \"the most striking that A Simple Plan has to offer.\" He also praised the other performers, writing \"Paxton's part is deceptively complex in the way he shows how paranoia, greed, and deception can erode the conscience of even the best-intentioned of men. Brent Briscoe plays Lou as the most untrustworthy and avaricious of souls. And Bridget Fonda offers solid support as a woman who stands by her man – when she's not taking control of his life, that is.\"[33]Sam Raimi was repeatedly praised for his direction. Owen Gleiberman of Entertainment Weekly wrote that the film was \"lean, elegant, and emotionally complex – a marvel of backwoods classicism\" and that it was \"proof that Raimi, after the splatterific Evil Dead series and the lushly operatic Darkman, has now grown into a filmmaker of ravishing maturity and skill.\"[34] Siskel, writing for the Chicago Tribune, said that the film was \"an exceedingly well-directed genre picture by [Raimi]...[who] does an excellent job of presaging the lethal violence that follows. From his very first images we know that bodies are going to start to pile up.\"[35] Janet Maslin of The New York Times called the film a \"quietly devastating thriller directed by [Raimi]...who makes a flawless segue into mainstream storytelling.\"[36] Edward Guthmann of the San Francisco Chronicle wrote, \"...for Raimi, whose mastery of visual effects has driven all of his previous films, A Simple Plan marks a tremendously successful break from the past. He's drawn lovely, complex performances from Paxton and Thornton and proven that he can work effectively – and movingly – in a minor emotional key.\"[37]While reviews of the film were mostly positive, A Simple Plan was not without its detractors. Regarding the plot and characters, Richard Schickel of Time wrote, \"There's neither intricacy nor surprise in the narrative, and these dopes are tedious, witless company.\"[38] Schlomo Schwartzberg of Boxoffice wrote, \"Instead of unfolding as a subtle, powerful delineation of quiet desperation warping and destroying people's lives through greed, A Simple Plan clutters up the story with unnecessary acts of violence and murder, and mainly stays on the surface, offering little more than cheap jolts of melodrama.\"[39]A Simple Plan garnered awards and nominations in a variety of categories with particular praise for its screenplay by Scott B. Smith and Billy Bob Thornton's performance. At the 56th Golden Globe Awards, Thornton received a Best Supporting Actor nomination, but lost against Ed Harris, who received the award for his performance in The Truman Show.[40] At the 71st Academy Awards, Thornton received an Oscar nomination for Best Supporting Actor, but lost against James Coburn, who won the award for his performance in Affliction. Smith received an Oscar nomination for Best Adapted Screenplay, but lost to Bill Condon, who won for Gods and Monsters.[41] In addition to receiving various awards and nominations, A Simple Plan was named one of the \"Top 10 Films of 1998\" by the National Board of Review.[42]In North America, A Simple Plan was released on VHS and DVD formats on June 22, 1999. These home video releases were undertaken by Paramount Home Entertainment.[52]","budget":"$17 million[1][2][3]"}