{"country":"United Kingdom","distributed_by":"Vertigo Films (UK) Magnet Releasing (US)","language":"English","Reception":"Bronson opened in a single cinema in North America and made $10,940. The film ended up earning $104,979 in the U.S with the widest release being in 10 cinemas. Internationally it made $2,155,733 for a total of $2,260,712.[2]Rotten Tomatoes gives the film a \"Certified Fresh\" score of 76% based on reviews from 79 critics, with an average rating of 6.6 out of 10 with the consensus \"Undeniably gripping, Bronson forces the viewer to make some hard decisions about where the line between art and exploitation lies.\"[5] Metacritic gives the film a \"generally favourable\" average score of 71 out of 100 based on 22 reviews.[6]Roger Ebert gave the film three stars out of four and praised the decision not to attempt to rationalise and explain Bronson's behaviour stating in his review, \"I suppose, after all, Nicolas Winding Refn, the director and co-writer of \"Bronson,\" was wise to leave out any sort of an explanation. Can you imagine how you'd cringe if the film ended in a flashback of little Mickey undergoing childhood trauma? There is some human behavior beyond our ability to comprehend. I was reading a theory the other day that a few people just happen to be pure evil. I'm afraid I believe it. They lack any conscience, any sense of pity or empathy for their victims. But Bronson is his own victim. How do you figure that?\"[7]Bronson was not initially allowed to view the film, but had said that if his mum liked it he was sure he would as well. According to Refn's DVD audio commentary, his mother said she loved it. On 15 November 2011, he was granted permission to view it. Describing it as \"theatrical, creative, and brilliant\", Bronson heaped praise upon his portrayer, Hardy, but disagreed on the implied distance between himself and his father and the portrayal of Paul Edmunds (portrayed in the film by Matt King as 'Paul Daniels') as \"a bit of a ponce.\" Nevertheless, he challenged his own family's reaction to the portrayal of his Uncle Jack, stating that he \"loved\" it, as would Jack himself.[8] Bronson had been originally displeased with the choice of Hardy, but after their first physical meeting, Hardy assured him that he would \"fix it.\"[9] As proven, Bronson's development in trust in Hardy's acting grew, even describing him as \"Britain's No. 1 actor.\"[8]","box_office":"$2.3 million[2]","cinematography":"Larry Smith","production_company":"Aramid Entertainment Str8jacket Creations EM Media 4DH Films Perfume Films","directed_by":"Nicolas Winding Refn","release_dates":"17 October 2008 (2008-10-17) (BFI London Film Festival)|13 March 2009 (2009-03-13) (United Kingdom)||||","Production":"For the role, Hardy had telephone conversations with the real Charles Bronson, before meeting him in person. During their meetings, Bronson was so impressed by how Hardy had managed to build up his physique for the role and how good he was at imitating him that he shaved off his trademark moustache so that it could be made into a moustache prop for Hardy to wear in the film.[3] Filming was done in and around the St. Ann's, Sherwood, Worksop and Welbeck Abbey areas of Nottingham and Nottinghamshire.[4] The post office shown at the beginning of the film is located in Lostwithiel, Cornwall.Director Refn was not permitted to visit Bronson in prison because he is not from Britain. He was only allowed two phone calls with him.[citation needed]","bronson":"Theatrical release poster","produced_by":"Rupert Preston Danny Hansford","starring":"Tom Hardy","running_time":"92 minutes[1]","music_by":"Johnny Jewel","edited_by":"Matthew Newman","written_by":"Brock Norman Brock Nicolas Winding Refn","budget":"$230,000"}