{"based_on":"Blade  by Marv Wolfman Gene Colan","country":"United States","distributed_by":"New Line Cinema","Plot":"A group of vampires look for the hidden resting place of Drake, also known as Dracula—the genetic \"father\" of their species. They find him in an Iraqi ziggurat tomb, although not before, in a moment of blood lust, he kills one of them. The vampires capitalize on Blade's reputation as a serial killer and frame him for the killing of a human familiar. During the ensuing manhunt, the FBI locate Blade's latest hideout, and, during the siege, Abraham Whistler dies. With his mentor gone and surrounded by human authorities, Blade allows himself to be captured and arrested.After both medical and interrogative sessions prove futile, the police prepare to hand Blade over to a group of federal agents, who are, unbeknownst to them, vampires. He is then rescued by Hannibal King and Abigail Whistler, Abraham's illegitimate daughter, both of whom belong to a group of vampire hunters called the Nightstalkers. King and Abigail reveal that the vampire Danica Talos, who once temporarily turned King into a vampire, has located Drake. Because he is the first of their kind, Drake is invulnerable to sunlight and much more powerful than modern vampires. Talos hopes Drake is powerful enough to kill Blade and make the rest of the vampires into daywalkers as well.The Nightstalkers believe the vampires are too numerous to kill individually, so Sommerfield, their resident chemical specialist, has created an experimental bioweapon dubbed Daystar, an airborne virus capable of killing every vampire in the immediate vicinity. However, it does not yet work.In their first confrontation, Drake tests Blade by drawing him away from King and Abigail, incapacitating King in the chaos. Although physically superior, Drake shows an affinity with Blade, as they are both unique to their race and \"honorable warriors\" by choice. While Drake converses with Blade, he uses a baby that he has taken hostage as leverage. When questioned about his actions, Drake reveals that he considers all humans unworthy of his notice and even holds his own followers in contempt. While investigating, Blade and Abigail learn of the vampires' planned \"final solution\": blood farms where brain-dead humans are harvested for their blood. Blade shuts down the victims' life support in an act of euthanasia.The two return to find all the Nightstalkers but King and Sommerfield's young daughter, Zoe, dead; Drake uses the two survivors to lure Blade into combat. A posthumous recording by Sommerfield reveals that she has perfected a small quantity of the Daystar virus, but it requires the blood of Drake and may kill Blade along with the other vampires. Meanwhile, King is chained and tortured by Jarko Grimwood and Asher Talos (Talos' two lieutenants) for information about Daystar. When this fails, Talos herself tortures King by pressuring his covered wound with the tip of the high heel of her shoe. She also threatens to turn King into a vampire again and force him to feed on Zoe.Blade and Abigail arrive and fight the Talos underlings and the building security force. After freeing both King and Zoe, Abigail kills Asher, King kills Jarko, and Blade engages Drake in a sword battle. Blade is seemingly outmatched by the stronger Drake, and all seems lost when Abigail fires the Daystar arrow but Drake catches it. In the end, Blade impales Drake with the arrow, allowing the virus to catalyze with Drake's blood and release into the air. The virus kills all the nearby vampires, including Danica. As Drake dies, he praises Blade for fighting with honor and tells him that through Blade, the vampire race will survive. Dying, he offers Blade a \"parting gift\"; he also warns him that, \"sooner or later, the Thirst always wins\".From here there are multiple endings:","language":"English","Potential sequel":"At San Diego Comic Con 2015, Snipes told IGN that both he and Marvel are now in talks about bringing Blade back in theaters.[16][17]","box_office":"$128.9 million[1]","cinematography":"Gabriel Beristain","production_company":"New Line Cinema Marvel Enterprises Amen Ra Films Imaginary Forces Shawn Danielle Productions Ltd.","directed_by":"David S. Goyer","Soundtrack":"A soundtrack containing hip hop music and electronic music was released on November 23, 2004 by New Line Records. It peaked at #68 on the Top R&B/Hip-Hop Albums and #15 on the Top Soundtracks.","release_dates":"December 8, 2004 (2004-12-08)|||||","Production":"Reportedly, series star Wesley Snipes was unhappy with the film's script and original choice of director. David S. Goyer, who had written all three films in the franchise, was then selected to replace the original director of the film, which Snipes protested. Snipes reportedly caused difficulty during filming, including frequently refusing to shoot scenes, often forcing director Goyer to use stand-ins and computer effects to add his character to scenes. Co-star Patton Oswalt alleged that Snipes would spend much of his time smoking marijuana in his trailer, and that he had become violent with Goyer after falsely accusing him of racism. It has also been alleged that Snipes refused to interact with Goyer or his co-stars, and would instead communicate with them through his assistant or the use of notes. Snipes also allegedly referred to co-star Ryan Reynolds by the term \"cracker\" on one or more occasions.[3][4]In the DVD special features[5] Goyer talks about how cities are often multilingual. For example, Blade: Trinity is shot in Vancouver, British Columbia, Canada where signs are in English. Goyer decided to use the Esperanto language and flag as part of the fictional city where Blade is set.[6] The Esperanto flag is shown twice, at the entrance to the Police headquarters after Blade is rescued from jail, and in the rooftop scene where Drake threatens to drop a baby over the edge.[6] Background elements such as signs and advertisements include Esperanto translations. Hannibal King is at one point seen watching the Esperanto language film Incubus on television, with one reviewer unkindly remarking that first time director \"Goyer's grasp of directorial fundamentals (such as when to tilt the camera and when to shoot in close-up) is about as strong as Shatner's fluency in Esperanto.\"[7] The film's director of photography Gabriel Beristain makes a cameo appearance as the one-eyed newspaper vendor who talks to Whistler in Esperanto and discusses the public perception that Blade is a menace to society.","produced_by":"Peter Frankfurt|Wesley Snipes|David S. Goyer|Lynn Harris|","starring":"Wesley Snipes|Kris Kristofferson|Jessica Biel|Ryan Reynolds|Parker Posey|Dominic Purcell|Triple H|","running_time":"113 minutes","blade:_trinity":"Theatrical release poster","music_by":"Ramin Djawadi|The RZA|","edited_by":"Conrad Smart|Howard E. Smith|","Release":"The film's American box office gross was $52 million, and the total worldwide gross was $128.9 million.[1] This matched the first Blade's take but came behind Blade II, which grossed $150 million worldwide.[8][9]In 2005, Snipes sued New Line Cinema and Goyer, claiming that the studio did not pay his full salary, that he was intentionally cut out of casting decisions and filmmaking process, despite being one of the producers, and that his character's screen time was reduced in favor of costars Ryan Reynolds and Jessica Biel.[10]The film earned an approval rating of 25% on Rotten Tomatoes based on 165 reviews. The consensus reads: \"Louder, campier, and more incoherent than its predecessors, Blade: Trinity seems content to emphasize style over substance and rehash familiar themes.\"[11] Rotten Tomatoes included the film at 76 out of 94 on a countdown (from 94 to 1) of \"worst to best\" comic book to film adaptations.[12]Roger Ebert, who gave Blade 3 stars out of 4[13] and Blade II 3½ stars,[14] gave Blade: Trinity 1½ stars, writing: \"It lacks the sharp narrative line and crisp comic-book clarity of the earlier films, and descends too easily into shapeless fight scenes that are chopped into so many cuts that they lack all form or rhythm.\"[15]","written_by":"David S. Goyer","budget":"$65 million[1]"}