{"country":"United Kingdom","distributed_by":"Sigma III(Original U.S. Release) Transmission Films (Online)","Plot":"The film begins with gruff American gangster Dickey pushing his broken-down car along a causeway through rising seawater while his eccentric companion Albie lies inside, bleeding from a gunshot wound after a bungled robbery. Cut off by the unexpected rising tide, they are on the only road to a bleak and remote tidal island (Lindisfarne in Northumberland), where, in a dark castle on a hilltop, a highly neurotic Englishman named George lives with his pretty and promiscuous young French wife Teresa. Dickey disconnects the phone lines and proceeds to hold the two hostage while awaiting further instructions from his underworld boss, the mysterious Katelbach.When Albie dies from his injuries, Dickey decides to take over the castle as George grows increasingly paranoid and hysterical, Teresa increasingly flirtatious, and Dickey ever more thuggish and violent. George briefly entertains some of his obnoxious friends who show up at the castle unannounced, leading Dickey to pose as a servant while Teresa begins to flirt with one of the guests, Cecil.Dickey eventually gets word that his boss Katelbach is not going to come, so he demands George drive him to the mainland by causeway. George, who has had enough of Dickey's bullying, goes berserk and shoots him dead with his own gun (Teresa had stolen Dickey's pistol from his coat pocket and encouraged George to use it). Now fearful of being implicated in the killing (and of possible reprisals from Katelbach's other henchmen), Teresa frantically insists that she and George abandon the castle together. But George is in a state of shock and seems unable to leave. Desperate and afraid, Teresa runs off by herself and hides in a closet. She is later rescued by Cecil, who had returned to retrieve his rifle.Now utterly alone, George runs along the beach at daybreak. He finally sits down on a rock in the fetal position and weeps hysterically as the early morning tide rises around him.","language":"English","Reception":"Cul-de-sac currently (July 2012) holds an 84% approval rating on the film review aggregator Rotten Tomatoes, based on 19 reviews.","Interpretation":"Like his previous film Repulsion, it explores themes of horror, frustrated sexuality and alienation, which have become characteristic of most of Polanski's films, notably Rosemary's Baby and The Tenant.Cul-de-Sac has been compared in tone and theme with the works of Harold Pinter and Samuel Beckett;[4][5] Jack MacGowran was renowned for his stage performances of Beckett's plays. The film's German title is Wenn Katelbach kommt (When Katelbach Comes).","cinematography":"Gilbert Taylor","production_company":"Compton Films Tekli British Productions","directed_by":"Roman Polanski","cul-de-sac":"Original film poster","Awards":"Cul-de-sac was awarded the 1966 Golden Bear at the 16th Berlin International Film Festival.[6]","release_dates":"17 June 1966 (1966-06-17) (London)|24 June 1966 (1966-06-24) (BIFF)|7 November 1966 (1966-11-07) (United States)|||","Production":"The film was shot on location in 1965 on the island of Lindisfarne (also known as Holy Island) off the coast of Northumberland, England. Lindisfarne Castle, which served as the home in the film, is now a National Trust property and can be toured by the public; despite the passage of forty years, the building and its surroundings are largely unchanged.","produced_by":"Gene Gutowski Michael Klinger[1] Tony Tenser","starring":"Donald Pleasence Françoise Dorléac Lionel Stander","running_time":"112 minutes[2]","music_by":"Krzysztof Komeda","edited_by":"Alastair McIntyre","written_by":"Roman Polanski Gerard Brach","budget":"£120,000[3]"}