{"country":"UK","distributed_by":"Warner Bros. Pictures","Plot":"During the filming of a TV commercial for a \"Meat For Go\" campaign set in London's Smithfield Market, stuntman Steve (Dave Clark), disillusioned by the inanity of his job, absconds in an E-type Jaguar (one of the props) with a young actress/model, Dinah (played by Barbara Ferris). After a visit to an open-air swimming-pool in central London and a memorable scene in and around the Great Conservatory in the grounds of Syon House, they make their way across a wintry southern England towards an island (Burgh Island) off the coast of Devon, which Dinah is contemplating buying (presumably to escape the pressures of her celebrity as the \"Butcher Girl\" on the back of the TV meat advertising campaign). This act of rebellion is cynically exploited by the advertising executive behind the campaign, Leon Zissell (played by David de Keyser), who deputes two of his henchmen to pursue the fleeing couple.On their journey, Steve and Dinah encounter first a group of proto-hippies (squatting in MOD-owned buildings on Salisbury Plain - some of this sequence was shot in the evacuated village of Imber), and then an unhappily married middle-aged couple (the duo of Yootha Joyce and Robin Bailey) in the opulent surroundings of the Royal Crescent in Bath, Somerset. Steve also plans to visit his boyhood hero, Louie (David Lodge), whose youth club in London's East End he attended, and who has since relocated to Devon.Having fled the police, and Leon Zissell's henchmen, after a fancy-dress party in the Roman Baths at Bath, Steve and Dinah (with the rest of Steve's gang - and the police - in hot pursuit) make their way towards Devon. Steve's encounter with Louie is disappointing. Louie recognises Dinah instantly (because of her TV celebrity) but fails to recognise Steve and misremembers his name, even after being introduced. Dinah's island also proves to be disappointing. At low tide it is reachable from the mainland, and Zissell (who is clearly besotted with Dinah) has already arrived.","language":"English","Themes":"Although they perform the off-screen soundtrack music, The Dave Clark Five (unlike The Beatles in their films) do not portray themselves, but appear to be a team of freelance stuntmen/extras led by the saturnine Steve (Dave Clark). Clark had worked as a stuntman on a number of films, which appears to have provided him with a level of cinematic experience and camera-sense rare for a pop-artist of the time.Far from being a conventional pop vehicle, the film concerns itself with the frailty of personal relationships, the flimsiness of dreams, and the difficulty of maintaining spontaneity, authenticity and integrity in a stage-managed \"society of the spectacle.\" Boorman's debut offering drew favourable notices from Pauline Kael and Dilys Powell, not least because it captured much of the enormous cultural energy of the time (mid-1960s) in which the film was made.","cinematography":"Manny Wynn","production_company":"Anglo-Amalgamated","directed_by":"John Boorman","Production notes":"Lenny Davidson is the only one of the DC5 who does not utter a single word in the movie, usually because the others don't let him get a word in edgeways. Appropriately enough, he is dressed as Harpo Marx at the Arts Ball party (until Dinah switches costumes with him to avoid being caught by the police and her bosses; this is evident not only in the film, but also on the back cover of the soundtrack album).Denis Payton's last name is misspelled as \"Paynton\" in the opening and closing credits.","Soundtrack":"Of the twelve tracks on the U.S. soundtrack album (Epic 24162/26162), only four are from the film: \"Having A Wild Weekend\", \"Catch Us If You Can\", \"Sweet Memories\" and \"On The Move\". The remainder of songs used in the film were from previous albums, including...","release_dates":"April 1965 (UK) 18 August 1965 (U.S.) 16 May 1970 (German TV premiere)","produced_by":"David Deutsch Basil Keys","starring":"Dave Clark Julian Holloway Lenny Davidson Rick Huxley Mike Smith Denis Payton Barbara Ferris","running_time":"91 min.","catch_us_if_you_can":"A poster bearing the film's US title: Having a Wild Weekend","music_by":"The Dave Clark Five John A. Coleman Basil Kirchin","edited_by":"Gordon Pilkington","written_by":"Peter Nichols"}