{"country":"United States","distributed_by":"20th Century Fox","Plot":"Jane Nichols (Katherine Heigl) has been a bridesmaid for twenty-seven weddings. One night when she is attending two weddings almost simultaneously, she meets Kevin Doyle (James Marsden), who helps her home but disgusts her with his cynical views of marriage. He finds her day planner which she'd forgotten in the cab they shared. Meanwhile, Jane's sister Tess (Malin Åkerman) falls in love with Jane's boss George (Edward Burns) at first sight. Tess pretends to like the same things that George does so that she can get him to like her. Despite loving George herself, Jane does not reveal the truth and her sister's courtship progresses rapidly. Soon the new couple announces that they intend to marry in only three weeks and Jane becomes the wedding planner.The reporter who agrees to cover their wedding for the society page turns out to be Kevin, who writes wedding announcements under pseudonym Malcolm Doyle. Having looked at the contents of Jane's planner before returning it, he then decides to use the contents as material for a piece on the \"perennial bridesmaid\" and hopefully be promoted to writing investigative pieces about \"real\" news.Jane is unaware of Kevin's intentions, and when he asks to interview her for his column on Tess, he gets her to try on all 27 bridesmaids dresses in her closet. He takes pictures of her in all of them and sends them with the completed article to his boss. As they get to know each other because of Tess's wedding, Kevin begins to think that Jane is not as one-dimensional as he thought, and asks his editor to hold his article so he can \"fix\" it.When Kevin finds out that Jane is getting her sister's marriage fixed with the man she loves, he rebukes her. Jane agrees to one drink with Kevin and ends up getting drunk. Kevin and Jane kiss and have sex in the car. Kevin's editor runs the article anyway on the front page of the 'Commitments' section. When Jane finds out about it the next morning, she feels betrayed and is furious at him. Tess then gets angry at Jane for giving Kevin material about her, whom he describes as a bridezilla. The fight escalates when Jane realizes that Tess altered their late mother's wedding dress to her own choice, the last straw on Tess' string of lies to George and demands on Jane.Despite the fight, Tess still asks Jane to make a slideshow to show at her engagement party. Jane decides that George should know the truth about Tess and instead runs pictures of Tess with other men during her past years, eating ribs, and holding a cat by the tail - in short, doing all the things she had told George that she never did. After Pedro, the young Hispanic child that George mentors, tells the crowd that Tess had him cleaning George's apartment for money, George breaks off the engagement.Later at work, George tells Jane that he appreciates her because she never says no. Remembering that Kevin once said the same thing as a criticism, Jane quits and admits she only stayed at the job because she was in love with George. She discovers after an experimental kiss that she no longer loves him and decides to meet Kevin. She announces in front of the entire crowd at a wedding he is covering that she is in love with him.One year later Jane and Kevin are now getting married. George and Tess meet in their wedding again, and a hope for a second chance shows. All 27 brides Jane helped, as well as Tess and Casey (Judy Greer), her best friend, are her bridesmaids, and they are wearing the dresses she once wore as their bridesmaid.","language":"English","box_office":"$160.3 million[1]","cinematography":"Peter James","production_company":"Fox 2000 Pictures Spyglass Entertainment Dune Entertainment III, LLC.","directed_by":"Anne Fletcher","27_dresses":"Theatrical release poster","Soundtrack":"The movie features a score written by Randy Edelman along with numerous songs from other artists. These songs do not appear on the soundtrack CD, which includes only the Edelman score.","release_dates":"January 10, 2008 (2008-01-10) (Australia)|January 18, 2008 (2008-01-18) (United States)||||","Production":"Principal photography began on May 10, 2007. The film was primarily shot in the state of Rhode Island. Locations included Rosecliff and Marble House mansions, a beach in Charlestown, East Greenwich, and Providence. Filming also took place during two weeks in New York City.[2]","produced_by":"Gary Barber Roger Birnbaum Jonathan Glickman","starring":"Katherine Heigl James Marsden Malin Åkerman Edward Burns Judy Greer Maulik Pancholy","running_time":"111 minutes","music_by":"Randy Edelman","edited_by":"Priscilla Nedd-Friendly","Release":"The film opened at #2 at the North American box office making USD 23 million in its opening weekend behind Cloverfield. As of April 18, 2009, 27 Dresses had grossed $76,808,654 in North America, and $83,450,665 overseas, for a total worldwide gross of $160,259,319.[3]According to BoxOfficeGuru.com, \"The audience for the $30M-budgeted 27 Dresses was overwhelmingly female. Studio research showed that 75% of the crowd consisted of women, but the audience was evenly split between persons over and under 25.\"[4]27 Dresses received generally mixed reviews from critics. The review aggregator Rotten Tomatoes reported that 41% of critics gave the film positive reviews, based on 148 reviews with the comment being \"The filmmakers perfectly follow the well-worn romantic comedy formula, rendering 27 Dresses clichéd and mostly forgettable.\"[5] Metacritic reported the film had an average score of 47 out of 100, based on 31 reviews.[6]The Blu-ray Disc and DVD was released on April 29, 2008 in the United States and July 29 in the United Kingdom.","written_by":"Aline Brosh McKenna","budget":"$30 million"}