{"Reunion":"On August 14, 2015, a 20th anniversary reunion for the film occurred at the D23 Expo at Anaheim Convention Center in Anaheim, California.[18] Those in attendance included Bill Farmer, Jason Marsden, Jim Cummings, Rob Paulsen, Jenna von Oy, and producer Don Hahn. Wallace Shawn, Pauly Shore, and director Kevin Lima also sent video messages.[18] The panel also included musical performances from Farmer, Marsden, and Tevin Campbell.[18][19]","country":"United States","distributed_by":"Buena Vista Pictures Distribution, Inc.","screenplay_by":"Jymn Magon Chris Matheson Brian Pimental","story_by":"Jymn Magon","Plot":"Goofy is the single father of a teenage boy named Max Goof in the town of Spoonerville, Ohio, though the two have a tense relationship. On the last day of school before summer vacation, Max and his best friends P.J. and Robert \"Bobby\" Zimmeruski hijack the auditorium stage in the middle of Principal Mazur's speech, creating a small concert where Max performs, while costumed as the pop singer Powerline. The performance succeeds in making Max a school celebrity and impressing his love interest, Roxanne; but he, P.J. and Bobby are sent to Mazur's office. Roxanne speaks with Max and agrees to go with him to a party where Powerline's concert will be aired live. However, Mazur exaggerates these events to Goofy and forewarns him that Max's actions may result in him facing capital punishment.Goofy decides to take Max on a fishing trip to Lake Destiny, Idaho, following a map route he and his father took years ago, and the two go into his station wagon. However, he is oblivious to what Max is planning to do with Roxanne. Max stops by Roxanne's house to call off their date, but when Roxanne says she will just have to go with someone else, Max instead fabricates a story about his father knowing Powerline; he tells her he will be on stage at the concert.Despite his son's objections, Goofy plans his own trip, with initially disastrous results. Max hurts his father's feelings after his father humiliates him at an opossum-based theme park. While camping, Pete and P.J. join them. Following Pete's advice to keep Max under control, Goofy takes his son fishing and performs the Perfect Cast fishing technique, luring Bigfoot to their camp. Pete and P.J. flee, leaving Goofy and Max to spend the night with Bigfoot. At night, while Goofy is still asleep, Max alters the map route to Los Angeles, where the concert is taking place.The next morning, Goofy decides to make Max the navigator of the trip. The two go to several locations that satisfy both of them. They stop by a motel where they meet Pete and P.J. again. When Pete overhears a conversation between Max and P.J., he tells Goofy that Max has tricked him in traveling to Los Angeles. The next day, Goofy and Max come to a junction: One leading to Idaho, the other to California. Max chooses the route to California, making Goofy stop the car and storm off in anger. With the brake loose, the car drives off on its own; Goofy and Max chase after it and end up at a river. Goofy reveals that no matter how old Max gets, he will always be his son and the two reconcile with each other. After learning that Max had promised Roxanne that he would be at the concert, Goofy decides to take him to Los Angeles. The two nearly plummet down a waterfall to their deaths, but Max fortunately saves Goofy, using the Perfect Cast technique.Goofy and Max get to Los Angeles and they end up onstage and dance with Powerline, watched by Pete, P.J. and Roxanne on separate televisions. Goofy and Max later return to Roxanne's house in their damaged car. Max tells the truth to Roxanne, though she accepts it and admits she always had feelings for him, ever since he first said, \"Ahyuck!\"; thus, a relationship starts between them. Goofy's car suddenly explodes due to the damage it has sustained, ejecting Goofy in the process, but he safely falls through the porch roof of Roxanne's house, and Max proceeds to introduce him to Roxanne.","language":"English","Reception":"A Goofy Movie holds a score of 53% Rotten Tomatoes based on reviews from 13 critics.[14]Variety's Todd McCarthy criticized the film's score, calling the six featured songs \"unmemorable\". He also felt that the personality of Goofy's character, while agreeable enough in support, proved a bit over the top for a headliner, and that \"by any reasonable reckoning, he's distinctly overbearing and selfish, and responds with a bland dismissal to any opinion offered up by his son.\" McCarthy praised the film's technical aspects, calling them \"crisp and clean\".[5] Louis Black of The Austin Chronicle summed up his review by saying the film was \"bland, a barely television-length cartoon stretched out to fill a feature, and not much fun.\"[4]Siskel and Ebert both approved of the movie, praising the color scheme and the \"sweet\" father-son plot and gave it a \"Three stars\".[15]A Goofy Movie was considered a relative success for Disney, opening in 2,159 theaters at #2 on its opening weekend with $6,129,557 - held from the #1 spot only because of the Will Smith blockbuster Bad Boys that opened the same weekend, with $15,523,358 in box office returns.[16] It ultimately ended its run at the US box office grossing $35,348,597 - coming in as the 51st highest-grossing domestic film in 1995.[2]The film was nominated for \"Best Animated Feature\" in the production categories and \"Best Production Design\", \"Best Storyboarding\", \"Best Music\", and \"Best Animation\" in the individual categories at the 23rd Annie Awards.[17]","box_office":"$35.3 million[2]","production_company":"Walt Disney Pictures DisneyToon Studios","directed_by":"Kevin Lima","Music":"The score for A Goofy Movie was provided by Carter Burwell and Don Davis.[8] Bobby Brown was the original choice for Powerline and had some songs recorded but was cut due to drug problems. Some of the songs Bobby did for the movie were revamped and ended up on his Forever album. The songs \"I 2 I\" and \"Stand Out\" were performed by R&B singer Tevin Campbell. The soundtrack album for A Goofy Movie was released by Walt Disney Records on March 18, 1995.[9] Mitchell Musso covered the song \"Stand Out\" for the DisneyMania 7 album, which was released on March 9, 2010.[10]","release_dates":"April 7, 1995 (1995-04-07)[1]|||||","Production":"A Goofy Movie was the directorial debut for Disney crewmember Kevin Lima, who went on to direct the Disney films Tarzan and Enchanted.[3] In 1995, Lima said that \"Instead of just keeping Goofy one-dimensional as he's been in the past, we wanted to give an emotional side that would add to the emotional arc of the story. We wanted the audience to see his feelings instead of just his antics.\"[4]The main characters of this film, specifically Goofy, Max Goof, Pete, and PJ, are based on their incarnations in the Goof Troop television show, albeit slightly older: Max and PJ are high-school aged rather than middle-schoolers. However, other characters that had been established in Goof Troop do not appear in this film, such as Pete's wife Peg, his daughter Pistol, and pets Waffles and Chainsaw. Goofy and Pete retain their classic looks from the 1940s cartoons as opposed to the looks that they had in the 1950s cartoons and Goof Troop.Although based upon a Disney TV series, A Goofy Movie was jointly produced by Walt Disney Feature Animation, Disney MovieToons, Walt Disney Animation France S.A. and Walt Disney Animation Australia. Pre-production was done at the main WDFA studio in Burbank, California, starting as early as mid-1993. The animation work was done at Walt Disney Animation France in Paris, France supervised by Paul and Gaëtan Brizzi, with additional scenes animated at Disney's studio in Sydney, Australia under the direction of Steve Moore, and clean-up work done at the main Burbank studio.[5][6] Additional clean-up/animation was done by Phoenix Animation Studios in Canada, and digital ink and paint by the Pixibox studio in France.[7]","a_goofy_movie":"Theatrical release poster","produced_by":"Dan Rounds","starring":"Bill Farmer Jason Marsden","running_time":"78 minutes","Sequel":"A sequel to this film was released in 2000, titled An Extremely Goofy Movie. The sequel takes place about four years after this film, involving Max's freshman year in college. Characters that returned for the sequel were Goofy, Max, PJ, Pete, and Bobby, but most notable is that Roxanne, Max's love interest, is absent from the sequel and not referenced at all. Roxanne did appear in the television series, House of Mouse (specifically the episode \"Max's Embarrassing Date\"), where she was voiced by Grey DeLisle instead of Kellie Martin.","music_by":"Carter Burwell Don Davis","edited_by":"Gregory Perler","Release":"A Goofy Movie was originally scheduled for a November 1994 theatrical release,[11] but production setbacks resulted in a push-back to 1995, while The Lion King was reissued to fill in for the film's absence.[12] The film's premiere took place on April 5, 1995 at the AMC Pleasure Island in Lake Buena Vista, and was attended by director Kevin Lima and voice stars Bill Farmer and Jenna von Oy. On the 7th, it was released nationwide.[13]The film was first released on VHS home video on September 6, 1995, and included a music video for the Parachute Express song Doctor Looney's Remedy on their video, Come Sing with Us. In the UK, it was released in theaters succeeding the Mickey Mouse short Runaway Brain on October 18, 1996 and on VHS in 1997. It was reissued on June 20, 2000, along with a DVD version as part of the short-lived Walt Disney Gold Classic Collection. To date, this film and Doug's 1st Movie are the only two Disney animated films produced in widescreen that have pan and scan-only Region 1 DVD releases (not counting separate widescreen and pan and scan DVD releases of the two Disney/Pixar films The Incredibles and Cars). However, the film's PAL and NTSC (Japan) counterpart does have a non-anamorphic widescreen DVD, and the film is available in a letterbox presentation on Laserdisc.When the film premiered for the first time ever on Toon Disney HD on June 2, 2008 and on Disney Channel HD on June 10, 2008, it was in the standard-definition format instead of the high-definition format.It was revealed inside a Mickey Mouse Clubhouse DVD that this film along with its sequel will be re-issued as a two-movie pack; however the DVD has been put into hiatus.A Goofy Movie is available for rent on Amazon.com Video On Demand in widescreen, and is now available in all English-speaking countries (including Ireland, UK and Australia) on iTunes."}