{"country":"United States","Awards and nominations":"Arctic Tale was nominated for the Panda Award 2008 which was given at the Wildscreen Festival 2008 in Bristol.[1]","distributed_by":"Paramount Classics","arctic_tale":"Theatrical release poster","Background":"The footage used in Arctic Tale was filmed over the span of 15 years by married filmmakers Adam Ravetch and Sarah Robertson, along with the National Geographic Natural History Unit and others who record wildlife. They compiled over 800 hours worth of clips of animals that are typically hard to catch on camera, such as the polar bear and walrus. Even though polar bears and walruses are seen in many scenes together in this film, they usually do not cross paths. According to Ravetch, they were \"told by scientists that it was very rare for a polar bear to attack a walrus.\" But his experience made him \"realize that polar bears and walruses have quite a lot in common,\" which is narrated as such in the film.","Message":"Throughout the film, narrator Queen Latifah makes allusions to how the rising temperature is affecting the animals in the ice kingdom. A message at the end of the animal footage notes that if the current trend continues, there will be no Arctic ice remaining by the year 2040. During the closing credits, several children talk about how global warming has had a detrimental effect on the animals such as the ones in Arctic Tale as well as the people around the world. Afterwards, the National Geographic \"green\" website is shown on the screen, as National Geographic is a presenter of the film","Plot":"At the outset of the movie, Nanu emerges from the cave where she was born along with her brother, just born as well, and their mother. The two polar bear cubs play in the snow for a while until returning to their snow cave. The next day, the cubs start learning from their mother how to survive in the wild. One of the first things they find out by watching their mother is to stay away from grown male polar bears who are apt to kill them.Seela is shown in the water just after birth with her mother and \"Auntie\" who helps protect the walrus calf during her early life. For her first life lesson, Seela is taught how to hoist herself onto an ice floe from the water without any help except watching her mother do the same. During this time, Auntie watches for predators. When a male polar bear comes along and starts swimming towards the walruses, Seela and her mother try to get away from him, but must rely on Auntie's help to stave off the polar bear's attack.Next for the polar bear cubs is learning how to hunt for food. Their mother teaches them how to hunt for a fur seal by stamping down on the ice where she can smell the seal in a small cave underneath. After one failed attempt diving into the water, the mother gets the seal by this stamping method, so her cubs and a fox trailing them can eat the meat. Meanwhile, the young walrus feasts on clams for three days with the rest of its herd on a clam bed they might revisit in another five years.The two animals then take similar paths. They have to travel because shorter winters mean ice that freezes later and melts sooner, making it harder to survive and eat as the water of Arctic Ocean expands. Interestingly, male polar bears pose a threat to both of the main creatures, as the cubs have to navigate around him and the walruses try to get away from being prey. After Nanu's brother dies, Nanu has to leave her mother earlier than is customary because of the changing climate conditions, but she still has trouble finding food on her own. Eventually, she finds a male bear who has killed a walrus, identified as Auntie, and aggressively persuades the male to let her share on the feast.Finally being attracted to animals of the opposite sex, Nanu finds a mate whom she is seen playing with on screen. Seela waits until a particular male walrus's song appeals to her before diving into the water to meet him. Arctic Tale closes with the cycle being complete, as Nanu gives birth to two cubs of her own and Seela gives birth to a female calf.","language":"English","box_office":"$1,858,064","cinematography":"Adam Ravetch","directed_by":"Adam Ravetch Sarah Robertson","Soundtrack":"The soundtrack album for Arctic Tale includes the following tracks:","narrated_by":"Queen Latifah","References":"\"Arctic Tale\" (Press release). Paramount Classics.  |access-date= requires |url= (help)","release_dates":"July 25, 2007 (limited)","produced_by":"Adam Leipzig Keenan Smart","running_time":"86 minutes","Home video release":"This film was released on standard DVD, HD DVD, and Blu-ray December 4, 2007.","music_by":"Joby Talbot","edited_by":"Beth Spiegel","written_by":"Linda Woolverton Mose Richards Kristin Gore"}