{"based_on":"One Thousand and One Nights","country":"Portugal|France|Germany|Switzerland|","distributed_by":"Shellac Distribution","screenplay_by":"Telmo Churro|Miguel Gomes|Mariana Ricardo|","Plot":"The film is set in Portugal, with the plot drawing from current events. The structure of the film is based on the One Thousand and One Nights collection of fantasy tales.","language":"Portuguese","box_office":"Volume 1:|$12,260[4]|Volume 2:'|$6,398[5]|Volume 3:|$4,502[6]|All three films:|$23,160|","cinematography":"Sayombhu Mukdeeprom","production_company":"BOX Productions Komplizen Film O Som e a Fúria Shellac Sud","directed_by":"Miguel Gomes","release_dates":"16 May 2015 (2015-05-16) (Cannes)|||||","Production":"Production was expected to end in August 2014 and the film was expected to be completed in February 2015.[15][16]","produced_by":"Luís Urbano","starring":"Crista Alfaiate|Dinarte Branco (pt)|Carloto Cotta|Adriano Luz|Rogério Samora|Maria Rueff|Cristina Carvalhal|","running_time":"Volume 1:|125 minutes[1]|Volume 2:|132 minutes[2]|Volume 3:|125 minutes[3]|Full version:|382 minutes|","arabian_nights":"Film poster","music_by":"Mariana Ricardo","edited_by":"Telmo Churro","Release":"The three installments of Arabian Nights premiered at the 2015 Cannes Film Festival. Volume 1: The Restless One on 16 May 2015, Volume 2: The Desolate One on 18 May 2015, and Volume 3: The Enchanted One on 20 May 2015. The films were released in France on 24 June, 29 July, and 26 August.All three films received generally positive reviews from critics. Rotten Tomatoes reports that Volume 1 has a 96% score based on 27 reviews, with an average rating of 8.2/10.[17] Volume 2 has a 100% score based on 10 reviews, with an average rating of 8/10.[18] Volume 3 has a 92% score based on 13 reviews, with an average rating of 7.6/10.[19] On Metacritic, Volume 1 has an 80 out of 100 rating based on 9 critics, indicating \"generally favorable reviews\".[20] Volume 2 has an 81 out of 100 rating based on 8 critics, indicating \"universal acclaim\".[21] Volume 3 has an 80 out of 100 rating based on 8 critics, indicating \"generally favorable reviews\".[22]Boyd van Hoeij of The Hollywood Reporter called the first part a \"frequently fascinating collage of stories\"[23] and the second part \"an appropriately striking, dramatic and even mirthful work that, however, would make little sense on its own.\"[24]Richard Brody of The New Yorker considered the series a \"passionately investigative, floridly imaginative triptych\" and its first installment \"an uproarious and scathing, compassionate and urgent outburst.”[25] Brody went on to conclude that \"Gomes single-handedly reinvent[ed] the political cinema.”[26]","budget":"€2.7 million"}