{"country":"United Kingdom","distributed_by":"United Artists","Novelization":"In 1964, Pan Books published a novelisation of the film by author John Burke, described as \"based on the original screenplay by Alun Owen\". The book was priced at two shillings and sixpence and contained an 8-page section of photographs from the movie. It is the first book in the English language to have the word 'grotty' in it.[citation needed]","a_hard_day's_night":"Theatrical release poster","language":"English","box_office":"$12,299,668[2]","cinematography":"Gilbert Taylor","production_company":"Proscenium Films Walter Shenson Films Maljack Productions","directed_by":"Richard Lester","release_dates":"6 July 1964","Production":"The film was shot for United Artists (UA) using a cinéma vérité style in black-and-white and produced over a period of sixteen weeks. It had a low budget for its time of £200,000 ($500,000) and filming was finished in under seven weeks.[14] At first, the film itself was something of a secondary consideration to UA, whose primary interest was in being able to release the soundtrack album in the United States before Capitol Records (the American EMI affiliate who had first shot at releasing Beatles music in the States) got around to issuing their material; in the words of Bud Ornstein, the European head of production for United Artists: \"Our record division wants to get the soundtrack album to distribute in the States, and what we lose on the film we'll get back on this disc.\"[15] As film historian Stephen Glynn put it, A Hard Day's Night was intended as, \"a low-budget exploitation movie to milk the latest brief musical craze for all it was worth.\"[16]Unlike most productions, it was filmed in near sequential order, as stated by Lennon in 1964.[17] Filming began on 2 March 1964 at Marylebone station in London (sometimes misidentified as Paddington). The Beatles had joined the actors' union, Equity, only that morning.[18] The first week of filming was on a train travelling between London and Minehead.[19] On 10 March, scenes with Ringo were shot at the Turk's Head pub in Twickenham, and over the following week various interior scenes were filmed at Twickenham Studios. From 23 to 30 March, filming moved to the Scala Theatre,[20] and on 31 March, concert footage was shot there, although the group mimed to backing tracks.[18] The \"Can't Buy Me Love\" segment, which featured creative camera work and the band running and jumping around in a field was shot on 23 April 1964 at Thornbury Playing Fields, Isleworth, Middlesex.[18] The final scene was filmed the following day in West Ealing, London, where Ringo obligingly drops his coat over puddles for a lady to step on, only to discover that the final puddle is actually a large hole in the road.[21]Before A Hard Day's Night was released in America, a United Artists executive asked Lester to dub the voices of the group with mid-Atlantic accents. McCartney angrily replied, \"Look, if we can understand a fucking cowboy talking Texan, they can understand us talking Liverpool.\"[22] Lester subsequently directed the Beatles' 1965 film, Help!.Irish actor Wilfrid Brambell, who played Paul McCartney's fictional grandfather John McCartney, was already well-known to British audiences as co-star of the British sitcom Steptoe and Son. The recurring joke that he was so clean reflects a play on his sitcom role, where he was always referred to as a dirty old man. In other roles, Norman Rossington played the Beatles' manager Norm, John Junkin played the group's road manager Shake, and Victor Spinetti played the television director. Brian Epstein, the group's real manager, had an uncredited bit part.[23]The supporting cast included Richard Vernon as the \"city gent\" on the train and Lionel Blair as a featured dancer. There were also various cameos. John Bluthal played a car thief and an uncredited Derek Nimmo appeared as magician Leslie Jackson. David Janson played the small boy met by Ringo on his \"walkabout\". Rooney Massara, who went on to compete in the 1972 Munich Olympics, was the sculler in the river in the \"walkabout\" scene by the river at Kew (uncredited). Kenneth Haigh appeared as an advertising executive who mistakes George for a \"new phenomenon.\" David Langton also made a cameo appearance as an actor in the dressing room scene.Mal Evans, one of the Beatles' road managers, also appears briefly in the film—moving an upright bass through a tight hallway as Lennon talks with the woman who mistakes him for someone else.George Harrison met his wife-to-be, Patricia Boyd, on the set when she made a brief (uncredited) appearance as one of the schoolgirls on the train. His initial overtures to her were spurned because she had a boyfriend at the time but he persisted and they were married within 18 months.[24] The girl with Boyd in the dining car scene is Prudence Bury.[25] Phil Collins appeared as an extra, uncredited as a boy in the concert audience, and would go on to become a very successful musician himself.[26][27]","running_time":"87 minutes","Songs":"The film's credits state that all songs are composed by John Lennon and Paul McCartney. However, a portion of \"Don't Bother Me\" is heard in the film; this song is, in fact, a George Harrison composition, and is identified as such on all album appearances.","budget":"£189,000[1]","screenplay_by":"Alun Owen","Plot":"Bound for a London show, the Beatles escape a horde of fans. Once they are aboard the train and trying to relax, various interruptions test their patience: after a dalliance with a female passenger, Paul's grandfather is confined to the guard's van and the four lads join him there to keep him company. John, Paul, George, and Ringo play a card game, entertaining schoolgirls before arriving at their destination.Upon arrival in London, the Beatles are driven to a hotel, only to feel trapped inside. After a night out during which Paul's grandfather causes minor trouble at a casino, the group is taken to the theatre where their performance is to be televised. The preparations are lengthy so Ringo decides to spend some time alone reading a book. Paul's grandfather, a \"villain, a real mixer\", convinces him to go outside to experience life rather than reading books. Ringo goes off by himself. He tries to have a quiet drink in a pub, walks alongside a canal and rides a bicycle along a railway station platform.[5] Meanwhile, the rest of the band frantically (and unsuccessfully) attempts to find Ringo. Finally, he returns after being arrested by the police along with Paul's grandfather, and the concert goes ahead as planned. After the concert, the band is taken away from the hordes of fans via helicopter.[6]","Title":"The movie's strange title originated from something said by Ringo Starr, who described it this way in an interview with disc jockey Dave Hull in 1964: \"We went to do a job, and we'd worked all day and we happened to work all night. I came up still thinking it was day I suppose, and I said, 'It's been a hard day...' and I looked around and saw it was dark so I said, '...night!' So we came to A Hard Day's Night.\"[46]According to Lennon in a 1980 interview with Playboy magazine: \"I was going home in the car, and Dick Lester suggested the title, 'Hard Day's Night' from something Ringo had said. I had used it in In His Own Write, but it was an off-the-cuff remark by Ringo. You know, one of those malapropisms. A Ringo-ism, where he said it not to be funny... just said it. So Dick Lester said, 'We are going to use that title.'\"[47]In a 1994 interview for The Beatles Anthology, however, McCartney disagreed with Lennon's recollections, recalling that it was the Beatles, and not Lester, who had come up with the idea of using Starr's verbal misstep: \"The title was Ringo's. We'd almost finished making the film, and this fun bit arrived that we'd not known about before, which was naming the film. So we were sitting around at Twickenham studios having a little brain-storming session... and we said, 'Well, there was something Ringo said the other day.' Ringo would do these little malapropisms, he would say things slightly wrong, like people do, but his were always wonderful, very lyrical... they were sort of magic even though he was just getting it wrong. And he said after a concert, 'Phew, it's been a hard day's night.'\"[48]Yet another version of events appeared in 1996; producer Walter Shenson said that Lennon had described to him some of Starr's funnier gaffes, including \"a hard day's night\", whereupon Shenson immediately decided that that was going to be the title of the film.[49]Regardless of which of these origin stories is the true one, the original tentative title for the film had been \"Beatlemania\" and when the new title was agreed upon, it became necessary to write and quickly record a new title song, which was completed on 16 April, just eight days before filming was finished.[15] Lennon and McCartney wrote the song in one night, basing the lyrics on a birthday card sent to his young son Julian,[50] and it went on to win a Grammy for Best Performance by a Vocal Group.[51]:p.xiiThe film was titled Yeah Yeah Yeah in Germany, Tutti Per Uno (All for One) in Italy, Quatre Garçons Dans Le Vent (Four Boys in the Wind) in France,[52] Yeah! Yeah! Tässä tulemme! (Yeah! Yeah! Here We Come!) in Finland and Os Reis do Iê-Iê-Iê (The Kings of Yeah-yeah-yeah) in Brazil.","Reception":"The film premiered at the Pavilion Theatre in London on 6 July 1964—the eve of Ringo Starr's 24th birthday—and the soundtrack was released four days later.[28] A Hard Day's Night set records at the London Pavilion by grossing over $20,000 in the first week, ultimately becoming so popular that more than 1,600 prints were in circulation simultaneously.[29]Reviews of the film were mostly positive; one oft-quoted assessment was provided by Andrew Sarris of The Village Voice, labeling A Hard Day's Night \"the Citizen Kane of jukebox musicals.\"[30] When The Village Voice published the results of its first annual film poll, A Hard Day's Night placed second behind Stanley Kubrick's Dr. Strangelove.[31] Time magazine called the film \"One of the smoothest, freshest, funniest films ever made for purposes of exploitation.\"[32] Film critic Roger Ebert described the film as \"one of the great life-affirming landmarks of the movies\", and added it to his list of The Great Movies.[33] In 2004, Total Film magazine named A Hard Day's Night the 42nd greatest British film of all time. In 2005, Time.com named it one of the 100 best films of the last 80 years.[3] Leslie Halliwell gave the film his highest rating, four stars, the only British film of 1964 to achieve that accolade.[4] It has a 99% rating on Rotten Tomatoes based on 101 reviews.[34] It is also No.1 on Rotten Tomatoes' list of the Top Ten Certified Fresh Musicals[35] and No. 8 on the Best Reviewed Movies of All Time.[36]New York Times film critic Bosley Crowther noted the film was a subtle satire on Beatlemania and the Beatles themselves. The Beatles are portrayed as likeable young lads who are constantly amazed at the attention they receive and who want nothing more than a little peace and quiet; however, they have to deal with screaming crowds, journalists who ask nonsensical questions, and authority figures who constantly look down upon them.[37] In fact their biggest problem is McCartney's elderly, but \"clean\" grandfather, played by Wilfrid Brambell.[38] The New Yorker critic Brendan Gill wrote: \"Though I don't pretend to understand what makes these four rather odd-looking boys so fascinating to so many scores of millions of people, I admit that I feel a certain mindless joy stealing over me as they caper about uttering sounds.\"[39]A Hard Day's Night was nominated for two Academy Awards: for Best Screenplay (Alun Owen), and Best Score (Adaptation) (George Martin).By 1971 the film was estimated to have earned $11 million worldwide.[1]","Release history":"On 6 July 2004, the 40th anniversary of the film's world premiere, a private cast and crew reunion screening was hosted in London by DVD producer Martin Lewis. The screening was attended by McCartney, actors Victor Spinetti, John Junkin, David Janson and many crew members. In media interviews at the event, McCartney disclosed that while he had seen the film many times on video, he had not seen the film on the \"big screen\" since its 1964 premiere.[65]","produced_by":"Walter Shenson","starring":"The Beatles Wilfrid Brambell","Influence":"British critic Leslie Halliwell states the film's influence as \"... it led directly to all the kaleidoscopic swinging London spy thrillers and comedies of the later sixties...\"[4] In particular, the visuals and storyline are credited with inspiring The Monkees' television series.[40] The \"Can't Buy Me Love\" segment borrowed stylistically from Richard Lester's earlier The Running Jumping & Standing Still Film, and it is this segment, in particular using the contemporary technique of cutting the images to the beat of the music, which has been cited as a precursor of modern music videos.[41][42][43][44][45] Roger Ebert goes even further, crediting Lester for a more pervasive influence, even constructing \"a new grammar\": \"he influenced many other films. Today when we watch TV and see quick cutting, hand-held cameras, interviews conducted on the run with moving targets, quickly intercut snatches of dialogue, music under documentary action and all the other trademarks of the modern style, we are looking at the children of A Hard Day's Night\".[33]","music_by":"Score: George Martin Songs: John Lennon Paul McCartney","edited_by":"John Jympson","Screenplay":"The screenplay was written by Alun Owen, who was chosen because the Beatles were familiar with his play No Trams to Lime Street, and he had shown an aptitude for Liverpudlian dialogue. McCartney commented, \"Alun hung around with us and was careful to try and put words in our mouths that he might've heard us speak, so I thought he did a very good script.\"[6] Owen spent several days with the group, who told him their lives were like \"a train and a room and a car and a room and a room and a room\"; the character of Paul's grandfather refers to this in the dialogue.[7] Owen wrote the script from the viewpoint that the Beatles had become prisoners of their own fame, their schedule of performances and studio work having become punishing.The script comments cheekily on the Beatles' fame. For instance, at one point a fan, played by Anna Quayle, apparently recognises John Lennon, though she does not actually mention Lennon's name, saying only \"you are...\". He demurs, saying his face is not quite right for \"him\", initiating a surreal dialogue ending with the fan agreeing that Lennon doesn't \"look like him at all\", and Lennon saying to himself that \"she looks more like him than I do\".[7] Other dialogue is derived from actual interviews with the Beatles. When Ringo is asked if he's a mod or a rocker, he replies: \"Uh, no, I'm a mocker\",[8] a line derived from a joke he made on the TV show Ready Steady Go!.[9][10] The frequent reference to McCartney's grandfather (Wilfrid Brambell) as a \"clean old man\" sets up a contrast with the stock description of Brambell's character, Albert Steptoe in Steptoe and Son, as a \"dirty old man\".[11]Audiences also responded to the Beatles' brash social impudence. Director Richard Lester said, \"The general aim of the film was to present what was apparently becoming a social phenomenon in this country. Anarchy is too strong a word, but the quality of confidence that the boys exuded! Confidence that they could dress as they liked, speak as they liked, talk to the Queen as they liked, talk to the people on the train who ‘fought the war for them’ as they liked... [Everything was] still based on privilege—privilege by schooling, privilege by birth, privilege by accent, privilege by speech. The Beatles were the first people to attack this… they said if you want something, do it. You can do it. Forget all this talk about talent or ability or money or speech. Just do it.\"[12]Despite the fact that the original working titles of the film were first The Beatles and then Beatlemania, the group's name is never spoken in the movie[13]—it is, however, visible on Ringo's drum kit, on the stage lighting, and on the helicopter in the final scene. The television performance scene also contains a visual pun on the group's name, with photos of \"beetles\" visible on the wall behind the dancers."}