{"based_on":"All the King's Men  by Robert Penn Warren","Cast":"Character actor Paul Ford has an uncredited role as the Leader of the Senate Opposition","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Robert Rossen","Plot":"The story of the rise of politician Willie Stark from a rural county seat to the governor's mansion is depicted in the film. He goes into politics, railing against the corruptly run county government, but loses his race for county treasurer, in the face of unfair obstacles placed by the local machine. Stark teaches himself law, and as a lawyer, continues to fight the local establishment, championing the local people and gaining popularity. He eventually rises to become a candidate for governor, narrowly losing his first race, then winning on his second attempt. Along the way he loses his innocence and becomes as corrupt as the politicians he once fought against. When his son becomes paralyzed following a drunk driving accident that kills a female passenger, Stark's world starts to unravel and he discovers that not everyone can be bought off.The story has a complex series of relationships. All is seen through the eyes of the journalist, Jack Burden, who admires Stark and even when disillusioned still sticks by him. Stark's campaign assistant, Sadie is clearly in love with Stark and wants him to leave his wife, Lucy. Meanwhile Stark philanders and gets involved with many women, taking Jack's own girlfriend, Anne Stanton, as his mistress. When Stark's reputation is brought into disrepute by Judge Stanton (Anne's uncle), he seeks to blacken the judge's name. When Jack finds evidence of the judge's possible wrongdoing, a quarter century earlier, he hides it from Stark. Anne gives the evidence to Stark, who uses it against her uncle, who immediately commits suicide. Anne seems to forgive Stark, but her brother, the surgeon who helped save Stark's son's life after the car crash, cannot. The doctor eventually assassinates Stark after Stark wins an impeachment investigation. The doctor in turn is shot down by Sugar Boy, Stark's fawning assistant.The main plot is a thinly disguised version of the rise of real-life 1930s Louisiana Governor, Huey Long, Long's efforts to blacken the name of Judge Benjamin Pavy, and Long's assassination by the Judge's son-in-law (compared to nephew, as in the film), Dr. Carl Weiss.","language":"English","Reception":"When the film was released, it received wide acclaim. Film critic Bosley Crowther lauded the film and its direction in his review, writing, \"Robert Rossen has written and directed, as well as personally produced, a rip-roaring film of the same title ... We have carefully used that descriptive as the tag for this new Columbia film because a quality of turbulence and vitality is the one that it most fully demonstrates ... In short, Mr. Rossen has assembled in this starkly unprettified film a piece of pictorial journalism that is remarkable for its brilliant parts.\"[5] Critic William Brogdon, writing for Variety magazine, was complimentary as well and praised Broderick Crawford's work, \"As the rural Abe Lincoln, springing up from the soil to make himself a great man by using the opinionless, follow-the-leader instinct of the more common voter, Broderick Crawford does a standout performance. Given a meaty part, his histrionic bent wraps it up for a great personal success adding much to the many worthwhile aspects of the drama.\"[6]Film historian Spencer Selby calls the film \"[A] hard-hitting noir adaptation of Warren's eloquent novel\".[7]Joe Goldberg, film historian and former story editor for Paramount Pictures, wrote about the content of the plot and its noirish fatalistic conclusion, \"The plot makes sense, the dialogue is memorable, the story arises from the passions and ideas of the characters. It deals with graft, corruption, love, drink and betrayal, and the subversion of idealism by power, and it might even make someone angry... The story moves toward its conclusion with the dark inevitability of film noir.\"[8]In 2001, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". To date, it is the last Best Picture winner to be based on a Pulitzer Prize-winning novel.All the King's Men received seven Academy Awards nominations, winning three.","all_the_king's_men":"Theatrical release poster","box_office":"$2.4 million (US rentals)[1]","cinematography":"Burnett Guffey","directed_by":"Robert Rossen","References":"Silver, Alain and James Ursini (editors). Film Noir: Reader 2. All the King's Men film noir themes discussed in essay, \"Violence and the Bitch Goddess\" by Stephen Farber, pgs. 54-55 (1974). Proscenium Publishers, Inc., New York (July 2003). Second Limelight Edition. ISBN 0-87910-280-2.","release_dates":"November 8, 1949 (1949-11-08) (premiere-United States)|January 1950 (1950-01) (wide-United States)||||","Production":"Rossen originally offered the starring role to John Wayne, who found the proposed film script unpatriotic and indignantly refused the part. Crawford, who eventually took the role, won the 1949 Academy Award for Best Actor, beating out Wayne, who had been nominated for his role in Sands of Iwo Jima.The film was shot at various locations in California using local residents, something that was fairly unknown for Hollywood at the time.[3] The old San Joaquin County courthouse in Stockton, built in 1898 and demolished about a dozen years after the film's release, was featured prominently.Paul Tatara, a film reviewer for CNN, describes the film as \"one of those pictures that was saved in the editing\". Al Clark did the original cut but had trouble putting all the footage that Robert Rossen had shot into a coherent narrative. Robert Parrish was brought onboard by Rossen and Columbia Studios head, Harry Cohn, to see what he could do. Since Rossen had a hard time cutting anything he shot, after several weeks of tinkering and cutting, the movie was still over 250 minutes long. Cohn was prepared to release it in this version after one more preview, but this threw Rossen into a panic, so Rossen came up with a novel solution. Rossen told Parrish to \"[s]elect what you consider to be the center of each scene, put the film in the synch machine and wind down a hundred feet before and a hundred feet after, and chop it off, regardless of what's going on. Cut through dialogue, music, anything. Then, when you're finished, we'll run the picture and see what we've got\". When Parrish was done with what Rossen had suggested, they were left with a 109-minute movie that was more compelling to watch. After All the King's Men won its Academy Award for Best Picture, Harry Cohn repeatedly gave Parrish credit for saving the film, even though Parrish only did what Rossen told him to do. The editing gambit gives the film a memorably jagged urgency that's unique for a studio-era film.[4] Although Clark is credited as the \"Film Editor\" (with Parrish being credited as \"Editorial Advisor\"), both Clark and Parrish received a nomination for an Academy Award for Best Film Editing.","produced_by":"Robert Rossen","starring":"Broderick Crawford John Ireland Mercedes McCambridge Joanne Dru John Derek","running_time":"109 minutes","music_by":"Louis Gruenberg","edited_by":"Al Clark Robert Parrish(sup)"}