{"based_on":"Black Hawk Down  by Mark Bowden","country":"United States United Kingdom","distributed_by":"Columbia Pictures","screenplay_by":"Ken Nolan","Plot":"Following the ousting of the central government and start of a civil war, a major United Nations military operation in Somalia was authorized with a peacekeeping mandate. Following the withdrawal of the bulk of the peacekeepers, Mogadishu-based Mohamed Farrah Aidid militia loyalists declare war on remaining UN personnel. In response, U.S. Army Rangers, Delta Force counter-terrorist operators, and 160th SOAR aviators are deployed to Mogadishu to capture Aidid, who has proclaimed himself president. To cement his power and subdue the population in the south, Aided's militia, led by Yousuf Dahir Mo'alim (Razaaq Adoti), is shown seizing Red Cross food shipments, killing anyone who get in their way.A patrolling Black Hawk helicopter ('Super Six-Four' piloted by CWO Michael Durant played by Ron Eldard) requests permission to engage the militia after witnessing the massacre but he is told to stand down and return to base as the UN has jurisdiction. Outside Mogadishu, Delta Force operators capture Osman Ali Atto (George Harris), a faction leader selling arms to Aidid's militia and bring him to their main base at the Mogadishu Airport. Atto is interrogated by MG William F. Garrison (Sam Shepard) who states that they will not leave Somalia until they find Aidid.A mission is planned to capture Omar Salad Elmi and Abdi Hassan Awale Qeybdiid, two of Aidid's top advisers, the US force including experienced men as well as new recruits, including the young and naive PFC Todd Blackburn (Orlando Bloom), SPC John Grimes (Ewan McGregor) a desk clerk going on his first field mission. SSG Matthew Eversmann (Josh Hartnett) is given his first command - Ranger Chalk Four - by commanding officer CPT Mike Steele (Jason Isaacs) after his Lieutenant, 1LT Beales (Ioan Gruffudd), suffers an epileptic seizure.In Mogadishu, a paid informant gives the location of Aidid's advisors to Garrison, who soon gives the code word (Irene) thus commencing the operation. Delta Force operators, led by SFC Norm \"Hoot\" Gibson (Eric Bana) and SFC Jeff Sanderson (William Fichtner), capture Aidid's advisers inside the target building, but the Rangers and helicopters escorting the ground-extraction convoy take heavy fire, while Eversmann's Chalk Four is dropped a block away in error.Blackburn is severely injured after falling from one of the Black Hawk helicopters, so three Humvees led by SSG Jeff Struecker (Brian Van Holt) are detached from the convoy to return Blackburn to base. With many Rangers occupied by incoming militia forces, Hoot and his Delta Team volunteer to escort the Humvees. SGT Dominick Pilla (Danny Hoch) is shot and killed just as Struecker's column departs while manning one of the humvees' M2 Browning .50-caliber machine gun, and shortly thereafter Black Hawk Super Six One, piloted by CWO Clifton \"Elvis\" Wolcott (Jeremy Piven), is shot down by a rocket-propelled grenade (RPG), crashing deep within the militia-controlled city.Both Wolcott and his co-pilot are killed on impact and both crew chiefs critically injured. Delta Force sniper SSG Daniel Busch (Richard Tyson) pulls himself out of the wreckage and attempts to defend the crash site from incoming militia, but is severely wounded by gunfire. Eversmann and the rest of Chalk Four reach the crash site on foot, providing covering fire while Busch is evacuated by a Little Bird scout/attack helicopter. Meanwhile, a vehicle convoy rerouted to evacuate them is stopped by militia roadblocks. Somali forces inflict heavy casualties, but two more Ranger units manage to reach the site on foot and occupy several nearby houses, awaiting evacuation.Durant is ordered to Super Six One's previous position but it is also shot down by an RPG. Having witnessed the crash, Mo'alim leads an enormous mob, consisting of his own militiamen and many angry locals, to the second crash site. Durant, sole survivor of the crash, attempts to exit the downed helicopter, but discovers that his leg is broken and he is unable to escape, so defends himself from incoming militia as best he can with his MP5.With CPT Steele's Rangers pinned down and sustaining heavy casualties no ground forces can reach Super Six-Four's crash site, nor reinforce the Rangers defending Super Six One. Onboard Super Six Two, a pair of Delta Force snipers, SFC Randy Shughart (Johnny Strong) and MSG Gary Gordon (Nikolaj Coster-Waldau), volunteer to defend the crash site for the time being. Their requests are denied by command, as Mo'alim's mob has massed into the hundreds and there is no guarantee when reinforcements will arrive. Eventually, their third request is approved and the pair are landed at the site, where they find Durant still alive. Pulling him from the wreckage, Shughart and Gordon hold off the incoming Somali insurgents until Gordon is killed with a shot to the head. Shughart hands Gordon's CAR-15 to Durant, then kills several more insurgents before he is surrounded and shot to death by the mob when one gets close enough to dump his entire pistol magazine into Shughart. Durant is then found and nearly beaten to death before Mo'alim arrives to have the mob stand down so he can take Durant alive as a prisoner of war.McKnight's column gives up the attempt to reach the first crash site, returning to base with their prisoners and the casualties. Garrison begins assembling a second convoy to rescue those still trapped in Mogadishu, this time including tanks and APCs from Malaysian and Pakistani UN forces operating with the 10th Mountain Division.As night falls, Aidid's militia, led again by Mo'alim, launch a sustained assault on the trapped Americans at the first crash site. On route to Super Six One, Gibson receives an update on the status of the second crash site and is given permission to secure it, taking his Delta Team and a single Ranger with him. When he reaches Durant's crash site, he finds and scares away the remaining members of the mob, who have begun to strip the crashed helicopter of its parts as well as any remaining gear and ammunition on board. While they are unable to find the bodies of Gordon, Shughart and the rest of Six-Four's crew, Hoot finds a badly damaged Delta helmet and takes a brief moment to mourn his fallen comrades before destroying the remains of the helicopter to ensure the classified equipment on board cannot be salvaged by Aidid's militia.Meanwhile, a badly beaten Durant is being interrogated by one of Aidid's lieutenants, Firimbi (Treva Etienne), who, when Durant insists that the U.S. government will never trade him for Aidid's captured advisors, tells him even if Aidid himself is taken or killed, nothing will stop the killing.Throughout the night, militia attacks are fended off by strafing runs and rocket attacks from AH-6J Little Bird helicopter gunships of the Nightstalkers. The next morning, a joint Pakistani-Malay-American relief column is able to reach and save the American forces. Hoot and his team eventually regroup with Eversmann's \"Chalk-Four\", finally killing Mo'alim in the process with one of his own technicals. While casualties are evacuated inside the armored vehicles, a handful of Rangers and Delta Force soldiers are forced to run from the crash site back to the Pakistani compound, a sports stadium inside the UN Safe Zone, while under fire from the militia as they retreat back to friendly territory.The closing credits detail the results of the raid. Nineteen American soldiers were killed; over 1,000 Somali militants and civilians died. After 11 days of captivity Durant was released; Delta Force snipers Gordon and Shughart were the first soldiers to be awarded the Medal of Honor posthumously since the Vietnam War, and two weeks later President Bill Clinton withdrew Delta Force and the Rangers from Somalia. Major General William F. Garrison accepted full responsibility for the outcome of the raid. On August 1, 1996, Aidid was killed in a battle with a rival faction. General Garrison retired the following day.","Accolades":"Black Hawk Down received four Academy Award nominations for Best Director (lost to A Beautiful Mind) and Best Cinematography (lost to The Lord of the Rings: The Fellowship of the Ring) and won two Oscars for Best Sound and Best Film Editing. It also received three BAFTA Award nominations for Best Cinematography, Best Sound and Best Editing.","language":"English","box_office":"$173 million[1]","Background and production":"Adapting Black Hawk Down: a Story of Modern War by Mark Bowden was the idea of director Simon West, who suggested to Jerry Bruckheimer that he should buy the film rights and let West direct. West moved on to direct Lara Croft: Tomb Raider (2001) instead.[5]Ken Nolan was credited as screenwriter, and others contributed uncredited: Mark Bowden wrote an adaptation of his own book, Steven Gaghan was hired to do a rewrite, Steven Zaillian and Ezna Sands rewrote the majority of the Gaghan and Nolan's work, Sam Shepard (MGen. Garrison) wrote some of his dialogue, and Eric Roth wrote Josh Hartnett and Eric Bana's concluding speeches. Ken Nolan was on set for four months rewriting his script and the previous work by Gaghan, Zaillian, and Bowden. He was given sole screenwriting credit by a WGA committee.Filming began in March 2001 in Salé, Morocco, and concluded in late June.[6]The book relied on a dramatization of participant accounts, which were the basis of the movie. SPC John Stebbins was renamed as fictional \"John Grimes.\" Stebbins had been convicted by court martial, in 1999, for sexually assaulting his daughter.[7] Mark Bowden said the Pentagon, ever sensitive about public image decided to alter factual history by requesting the change.[8] Bowden wrote early screenplay drafts, before Bruckheimer gave it to screenwriter Nolan. The POW-captor conversation, between pilot Mike Durant and militiaman Firimbi, is from a Bowden script draft.For military verisimilitude, the Ranger actors took a one-week Ranger familiarization course at Fort Benning, the Delta Force actors took a two-week commando course from the 1st Special Warfare Training Group at Fort Bragg, and Ron Eldard and the actors playing 160th SOAR helicopter pilots were lectured by captured aviator Michael Durant at Fort Campbell.The U.S. Army supplied the materiel and the helicopters from the 160th Special Operations Aviation Regiment. Most pilots (e.g., Keith Jones, who speaks some dialogue) had participated in the historic battle on October 3–4, 1993.[9]On the last day of their week-long Army Ranger orientation at Fort Benning, the actors who portrayed the Rangers received letters slipped under their doors. It thanked them for their hard work, and asked them to \"tell our story true\", signed with the names of the men who died in the Mogadishu firefight.[9] A platoon of Rangers from B-3/75 did the fast-roping scenes and appeared as extras; John Collette, a Ranger Specialist during the battle, served as a stunt performer.[10]Many of the actors bonded with the soldiers who trained them for their roles. Actor Tom Sizemore said, \"What really got me at training camp was the Ranger Creed. I don't think most of us can understand that kind of mutual devotion. It's like having 200 best friends and every single one of them would die for you\".[9]Although the filmmakers considered filming in Jordan, they found the city of Amman too built up and landlocked. Scott and production designer Arthur Max subsequently turned to Morocco, where they had previously worked on Gladiator. Scott preferred that urban setting for authenticity.[9] Most of the film was photographed in the cities of Rabat and Salé; the Task Force Ranger base sequences were filmed at Kénitra.[11]To keep the film at a manageable length, 100 key figures in the book were condensed to 39. The movie also does not feature any Somali actors.[12] Additionally, no Somali consultants were hired for accuracy, according to writer Bowden.[13]The film features soldiers wearing helmets with their last names on them. Although this was not accurate, director Ridley Scott used this device to help the audience distinguish among the characters because \"they all look the same once the uniforms are on\".[14]","cinematography":"Sławomir Idziak","production_company":"Revolution Studios Jerry Bruckheimer Films Scott Free Productions","black_hawk_down":"Theatrical release poster","directed_by":"Ridley Scott","Controversies and inaccuracies":"Soon after Black Hawk Down's release, the Somali Justice Advocacy Center in California denounced what they felt was its brutal and dehumanizing depiction of Somalis and called for its boycott.[3]In a radio interview, Brendan Sexton, an actor who briefly appeared in the movie, said the version of the film which made it onto theater screens significantly differed from the one recounted in the original script. According to him, many scenes asking hard questions of the US regarding the violent realities of war and the true purpose of their mission in Somalia were cut.[21]In a review featured in The New York Times, film critic Elvis Mitchell expressed dissatisfaction with the film's \"lack of characterization\", and opined that the film \"reeks of glumly staged racism\".[22] Owen Gleiberman and Sean Burns, the film critics for the mainstream magazine Entertainment Weekly and the alternative newspaper Philadelphia Weekly, respectively, echoed the sentiment that the depiction was racist.[23]American film critic Wheeler Winston Dixon also found the film's \"absence of motivation and characterization\" disturbing, and wrote that while American audiences might find the film to be a \"paean to patriotism\", other audiences might find it to be a \"deliberately hostile enterprise\"; nevertheless, Dixon lauded the film's \"spectacular display of pyrotechnics coupled with equally adroit editing.\"[24]Jerry Bruckheimer, the film's producer, rejected such claims on The O'Reilly Factor, putting them down to political correctness in part due to Hollywood's liberal leanings.[25]Somali nationals charge that the African actors chosen to play the Somalis in the film do not resemble the culturally unique features of the Horn of Africa nor does the language they communicate in sound like the Afro-Asiatic tongue spoken by the Somali people, and claim the abrasive way lines are delivered and lack of authenticy regarding Somali culture fails to capture the tone, mannerisms and spirit of actual life in Somalia. No Somali actors were used in the movie.[12]In an interview with the BBC, the faction leader Osman Ali Atto said that many aspects of the film are factually incorrect. Taking exception with the ostentatious character chosen to portray him Ali Atto claimed he neither looks like the actor who portrayed him, smoke cigars, or wear earrings,[26] all later confirmed by SEAL Team Six sniper Howard E. Wasdin in his 2012 memoirs. Wasdin also indicated that while the character in the movie ridiculed his captors, in reality Atto seemed concerned that Wasdin and his men had been sent to kill rather than apprehend him.[27] Atto additionally stated that he had not been consulted about the project or approached for permission, and that the film sequence re-enacting his arrest contained several inaccuracies:[26]First of all when I was caught on 21 September, I was only travelling with one Fiat 124, not three vehicles as it shows in the film[...] And when the helicopter attacked, people were hurt, people were killed[...] The car we were travelling in, (and) I have got proof, it was hit at least 50 times. And my colleague Ahmed Ali was injured on both legs[...] I think it was not right, the way they portrayed both the individual and the action. It was not right.[26]Navy SEAL Wasdin similarly remarked that while olive green military rigger's tape was used to mark the roof of the car in question in the movie, his team in actuality managed to track down Atto's whereabouts using a much more sophisticated technique involving the implantation of a homing device. (This was hidden in a cane presented to Atto as a gift from a contact who routinely met with him, which eventually led the team directly to the faction leader.[27])Malaysian military officials whose own troops were involved in the fighting have likewise raised complaints regarding the film's accuracy. Retired Brigadier-General Abdul Latif Ahmad, who at the time commanded Malaysian forces in Mogadishu, told the AFP news agency that Malaysian moviegoers would be under the wrong impression that the real battle was fought by the Americans alone with Malaysian troops relegated to \"mere bus drivers to ferry them out\". The film does portray Malaysians contributing to the battle from their vehicles.[28]General Pervez Musharraf, who later became President of Pakistan after a coup, similarly accused the filmmakers of not crediting the work done by the Pakistani soldiers. In his autobiography In the Line of Fire: A Memoir, Musharraf wrote:The outstanding performance of the Pakistani troops under adverse conditions is very well known at the UN. Regrettably, the film Black Hawk Down ignores the role of Malaysian and Pakistan in Somalia. When U.S. troops were trapped in the thickly populated Madina Bazaar area of Mogadishu, it was the Seventh Frontier Force Regiment of the Pakistan Army that reached out and extricated them. The bravery of the U.S. troops notwithstanding, we deserved equal, if not more, credit; but the filmmakers depicted the incident as involving only Americans.[29]","release_dates":"December 28, 2001 (2001-12-28) (Limited)|January 18, 2002 (2002-01-18) (Worldwide)||||","produced_by":"Jerry Bruckheimer Ridley Scott","starring":"Josh Hartnett Ewan McGregor Tom Sizemore Eric Bana William Fichtner Ewen Bremner Sam Shepard","running_time":"144 minutes","music_by":"Hans Zimmer","edited_by":"Pietro Scalia","Release":"Black Hawk Down had a limited release in four theaters on December 28, 2001, in order to be eligible for the 2001 Oscars. It earned $179,823 in its first weekend, averaging $44,956 per theater. On January 11, 2002, the release expanded to 16 theaters and continued to do well with a weekly gross of $1,118,003 and an average daily per theater gross of $9,982. On January 18, 2002, the film had its wide release, opening at 3,101 theaters and earning $28,611,736 in its first wide release weekend to finish first at the box office for the weekend. Opening on the Martin Luther King holiday, the film grossed $5,014,475 on the holiday of Monday, January 21, 2002, for a 4-day weekend total of $33,628,211. Only Titanic had previously grossed more money over the Martin Luther King holiday weekend. Black Hawk Down finished first at the box office during its first three weeks of wide release. When the film was pulled from theatres on April 14, 2002, after its 15th week, it had grossed $108,638,746 domestically and $64,350,906 overseas for a worldwide total of $172,989,651.[1]The film received many positive reviews from mainstream critics. Empire magazine gave it a verdict of \"ambitious, sumptuously framed, and frenetic, Black Hawk Down is nonetheless a rare find of a war movie which dares to turn genre convention on its head\".[15]Film critic Mike Clark of USA Today wrote that the film \"extols the sheer professionalism of America's elite Delta Force – even in the unforeseen disaster that was 1993's Battle of Mogadishu,\" and praised Scott's direction: \"in relating the conflict, in which 18 Americans died and 70-plus were injured, the standard getting-to-know-you war-film characterizations are downplayed. While some may regard this as a shortcoming, it is, in fact, a virtue\".[16]It has a 76% \"Certified Fresh\" rating on Rotten Tomatoes, with its critics consensus being: \"Though it's light on character development and cultural empathy, Black Hawk Down is a visceral, pulse-pounding portrait of war, elevated by Ridley Scott's superb technical skill.\"[17] It has a rating of 74 on Metacritic, indicating \"generally favorable reviews\".[18]The film has had a small cultural legacy, which has been studied academically by media analysts dissecting how media reflects American perceptions of war. Newsweek writer Evan Thomas considered the movie one of the most culturally significant films of the George W. Bush presidency. He suggested that although the film was presented as being anti-war, it was at its core pro-war. He further wrote that \"though it depicted a shameful defeat, the soldiers were heroes willing to die for their brothers in arms[...] The movie showed brutal scenes of killing, but also courage, stoicism and honor[...] The overall effect was stirring, if slightly pornographic, and it seemed to enhance the desire of Americans for a thumping war to avenge 9/11.\"[19]Stephen A. Klien, writing in Critical Studies in Media Communication, argued that the film's sensational rendering of war had the effect of encouraging audiences to empathize with the film's pro-soldier leitmotif. He suggested that this in turn served to \"conflate personal support of American soldiers with support of American military policy\" and discourage \"critical public discourse concerning justification for and execution of military interventionist policy.\"[20]","budget":"$92 million[1]"}