{"country":"United Kingdom","distributed_by":"Columbia-Warner Distributors","language":"English","Reception":"Critical reaction to Dracula AD 1972 has been mixed to negative. Upon the film's release, Roger Ebert gave the film only one star out of four.[2] Dennis Prince of DVD Verdict said, \"Dracula A.D. 1972 is definitely one of the weakest installments in Hammer's horror catalog and will likely only have strong appeal to Dracula completists.\"[3] Eccentric Cinema wrote, \"One can have a fun time with this movie—mostly because of its faults. It's cheese all right, professionally made cheese that's much better acted and staged than it really has any right to be.\"[4]The Science Fiction, Horror and Fantasy Film Review called the film \"a major disappointment\" and \"the low-point of the whole Hammer Dracula series\" despite \"minor positive aspects\".[5] George R. Reis of DVD Drive-In wrote, \"Considered a low point in Hammer’s roster, Dracula A.D. 1972 is hardly that. ... [T]he film has a number of things going for it. ... Cushing’s exceptional Van Helsing pretty much carries the film. ... Christopher Neame is charismatically evil as Johnny Alucard [and] his stirring fight scene with Van Helsing is a highlight. ... How can Hammer fans not like this stuff?\"[6]The film, despite its generally mixed reception, has some prominent admirers and supporters. American film director Tim Burton did at one point claim it to be among his favourite films,[citation needed] and English author, film critic and horror expert Kim Newman chose it as one of his top ten favourite vampire movies.[7]","DVD releases":"The film was released on DVD in the UK, US and Germany by Warner Home Video in 2005. It was released as Dracula A.D. 1972 in the UK and US and as Dracula jagt Mini-Mädchen in Germany.On 6 November 2007, the movie was released in a film pack along with Dracula, Dracula Has Risen from the Grave, and Taste the Blood of Dracula.[8]","cinematography":"Dick Bush","production_company":"Hammer Film Productions","directed_by":"Alan Gibson","Soundtrack":"The soundtrack was composed by former Manfred Mann member Mike Vickers, and is in a funky, 'blaxploitation' style that reflects the early 1970s setting of the film. It was not released commercially prior to a long-awaited CD release in 2009. The film also features two songs, \"Alligator Man\" and \"You Better Come Through for Me\" by the American band Stoneground, who were a late replacement for The Faces. The Black Mass segment uses the track \"Black Mass: An Electric Storm in Hell\" by the pioneering electronic group White Noise. The Black Mass scene with Christopher Neame's dialogue was also sampled by Orbital for \"Satan Live\" and \"Tension\".","release_dates":"28 September 1972 (1972-09-28)|||||","Production":"Following the success of the modern-day vampire film Count Yorga, Vampire, Warner Bros commissioned two Hammer Dracula films set in the present day, which were to become Dracula A.D. 1972 and The Satanic Rites of Dracula. Dracula A.D. 1972 began production in September 1971 as Dracula Today and was filmed in Chelsea and Hertfordshire. The film was inspired by the events surrounding the Highgate Vampire case.[1]While the two present-day Dracula films star both Lee and Cushing, they do not correspond to the chronology established in the Victorian/Edwardian era films; the first Hammer Dracula film, Dracula, is set in the 1880s, whereas the flashback sequence of the last battle between Van Helsing and Dracula in Dracula A.D. 1972 is set in 1872—long before the first meeting of Van Helsing and Dracula in the original film.Dracula A.D. 1972 was marketed with the taglines \"Past, present or future, never count out the Count!\" and \"Welcome back, Drac!\" When it was released in the USA, a brief clip was played before the film in which actor Barry Atwater (the vampire Janos Skorzeny in The Night Stalker) rises from a coffin and swears the entire audience in as members of the Count Dracula Society.","produced_by":"Michael Carreras Josephine Douglas","starring":"Christopher Lee Peter Cushing","running_time":"96 minutes","Storyline":"In 1872, Count Dracula (Christopher Lee) and his nemesis Lawrence Van Helsing (Peter Cushing) battle on the top of a runaway coach. The carriage crashes and Dracula is partly impaled by one of the wheels. In the struggle, Van Helsing manages to fully push the wheel into the vampire's chest, staking him. This done, Van Helsing collapses and dies from his own wounds. At that moment a follower of Dracula (Christopher Neame) arrives, collects Dracula's remains and, a few days later, buries them near Van Helsing's grave at St Bartolph's Church.One hundred years later, a new generation of Britons appear who move the tale along: in this case, a group of young hippies that includes Jessica Van Helsing (Stephanie Beacham), granddaughter of Lorrimer Van Helsing (Peter Cushing), an occult expert and descendant of Dracula's old nemesis, and Johnny Alucard (Christopher Neame), who closely resembles the disciple of Dracula seen in 1872. Alucard persuades Jessica and the others to attend a black magic ceremony in the now abandoned, deconsecrated St Bartolph's, where he performs a bloody ritual involving one of their group, Laura Bellows (Caroline Munro). Jessica and the others flee in horror, after which Dracula is resurrected and kills Laura.Laura’s body is discovered, drained of blood, and a police investigation begins, headed by an Inspector Murray (Michael Coles). Murray suspects an occult element and interviews Lorrimer Van Helsing, who is shocked to learn the details of Laura’s death. He realises that Johnny Alucard (whose name is Dracula written backwards) is a disciple of Dracula, and that the Count must have returned.In the meantime, Alucard brings another of Jessica’s friends, Gaynor Keating (Marsha Hunt), to St Bartolph’s, where she is killed by Dracula and Alucard is himself turned into a vampire. The vampire Alucard kills a passer-by and lures Jessica’s boyfriend, Bob (Philip Miller), to a café they frequent, where he turns him into a vampire as well. While Lorrimer is out, Bob goes to the Van Helsing house and persuades Jessica to come to the café, where he and Alucard capture her and take her to Dracula.Lorrimer tracks Alucard to his flat and kills him with the running water in the bathroom shower. He finds Bob's dead body and discovers Jessica in a trance at St Bartolph’s, where Dracula plans to take his revenge on the Van Helsing family by turning her into a vampire. Van Helsing sets a trap for Dracula and waits for him to return at nightfall. After a struggle, Dracula is killed by a fall into a pit of stakes that Van Helsing had previously prepared, and his spell over Jessica is broken. She embraces her grandfather and the title \"Rest In Final Peace\" is shown.","Continuity":"The film's opening sequence was not in the previous film Scars of Dracula, but is completely new and sets a new short series of the Hammer Horror Dracula chronology finishing in the following film The Satanic Rites of Dracula.","music_by":"Mike Vickers","dracula_a.d._1972":"Theatrical release poster","edited_by":"James Needs","written_by":"Don Houghton"}