{"country":"UK","distributed_by":"20th Century Fox","screenplay_by":"Peter Cook","bedazzled":"Bedazzled 1967 film poster","Plot":"Stanley Moon (Moore) works in a Wimpy's restaurant and is infatuated with the waitress Margaret (Eleanor Bron). In despair he attempts suicide but is interrupted by the Devil, incarnated as George Spiggott (Cook).Spiggott is in a game with God, trying to be the first to gather 100 billion souls. If he achieves this first, he will be readmitted to Heaven. He is also busy with minor acts of vandalism and spite, helped by his staff of the seven deadly sins, notably Lust (Raquel Welch) and Envy (Barry Humphries).In return for his soul, Spiggott offers Stanley seven wishes. Stanley uses these trying to satisfy his love for Margaret, but Spiggott twists his words to frustrate him.Ultimately, Spiggott spares Stanley eternal damnation, because he has exceeded his quota of 100 billion and can afford to be generous. Stanley returns to his old job, wiser and more clear-sighted. Spiggott goes to Heaven to meet God, but is rejected again; St Peter (Lockwood West) explains that when he gave Stanley back his soul, Spiggott did the right thing, but with the wrong motive.In the closing scene, Stanley and Margaret are back in the restaurant. Stanley finally asks her out but, she says she's already doing something, though she does suggest perhaps another night. Stanley smiles, happy that he has found the courage to talk to her. Spiggott tries to entice Stanley again, but Stanley turns him down. Spiggott leaves and threatens revenge on God by unleashing all the tawdry and shallow technological curses of the modern age:","language":"English","Reception":"The film gained mixed reviews in the United States. Bosley Crowther of The New York Times called it a \"pretentiously metaphorical picture\" which becomes \"awfully precious and monotonous and eventually ... fags out in sheer bad taste.\"[6] Crowther does, however, compliment Donen for his \"colorful and graphic\" mise-en-scène.[6] On the other hand, Roger Ebert compared the film's humour to that of Bob and Ray. He called Bedazzled's satire \"barbed and contemporary ... dry and understated,\" and overall, a \"magnificently photographed, intelligent, very funny film.\".[7]The unattributed and undated review in the Time Out Film Guide 2009 describes the film as a \"hit and miss affair\" which is \"good fun sometimes\", but suffers from a \"threadbare\" plot.[8] The Virgin Film Guide says \"Cook and Moore brilliantly shift from character to character with just a change of voice (not unlike Peter Sellers), and the movie never flags\".[9]Film aggregator Rotten Tomatoes gave it 81% by critics and 65% by audience.[10]","box_office":"$1,500,000 (US/ Canada)[2][3]","cinematography":"Austin Dempster","directed_by":"Stanley Donen","Soundtrack":"Cook and Moore wrote Bedazzled's soundtrack, which was performed by the Dudley Moore Trio.[4] The title track, Moore's best known song, was performed in the movie by the fictional psychedelic rock band Wedge and the Vegetations. The piece has since been covered widely, including performances by Tony Hatch and Nick Cave. Moore himself recorded several instrumental versions.[5]","release_dates":"10 December 1967 (1967-12-10) (US)|||||","produced_by":"Stanley Donen","starring":"Peter Cook Dudley Moore Eleanor Bron Raquel Welch","running_time":"103 min","music_by":"Dudley Moore","edited_by":"Richard Marden","budget":"$770,000[1]"}