{"based_on":"Before I Go to Sleep  by S. J. Watson","country":"United Kingdom United States France Sweden","distributed_by":"Clarius Entertainment 20th Century Fox","before_i_go_to_sleep":"Promotional poster","Plot":"Forty-year-old Christine Lucas wakes up in bed with a man she does not know, in an unfamiliar house. The man explains that he is her husband, Ben, and that she suffered brain damage from a car accident ten years earlier. Christine wakes up every morning with no memory of her life from her early twenties onwards.Christine receives treatment from Dr. Nash, a neurologist at a local hospital who gives her a camera to record her thoughts and progress each day, and calls her every morning to remind her to watch the video in the camera. Dr. Nash instructs Christine to keep the camera hidden from Ben and reveals that her memory loss occurred after she was attacked and left for dead near an airport hotel. They surmise that Ben tells Christine it was a car accident to avoid upsetting her.Over the course of treatment, Christine faintly remembers a red-haired woman named Claire. Ben tells her that Claire was a friend who couldn't handle Christine's condition and ended contact with her. Later, Christine recalls that she had a son. She angrily confronts Ben over hiding their child, but he says their son died of meningitis when he was eight. Christine remembers the name Mike and believes it may be the name of her attacker, which she relates to Dr. Nash. He hugs her to comfort her and almost kisses her, but she pulls back and then sees her doctor's name tag and his first name is Mike. She runs from him but he catches her and administers a sedative, leaving her at home. He tells her later that she was upset and he's sorry but he doesn't feel he can treat her anymore, because he has feelings for her and her memories are causing her to transfer what happened onto him.Christine learns that, several years after her attack, Ben had placed her in an assisted care facility and divorced her, then had a change of heart and brought her home to live with him. Christine learns that Claire had been trying to contact her at the care facility, unaware that Ben took her away. Christine obtains Claire's phone number and meets her. Claire reveals that Christine had embarked on an affair prior to her attack, while Ben and Claire had a one-time sexual encounter, due to their shared grief at Christine's memory loss. Feeling obliged to keep Ben and Christine's marriage intact, Claire ended contact.Out of gratitude for his love and care, Christine decides to let Ben see the videos she has made on the digital camera. However, Ben angrily accuses Christine of having an affair with Dr. Nash, strikes her, and storms out. On the telephone, Claire tells Christine that Ben claims to not have seen Christine for several years. Claire asks Christine to describe the \"Ben\" she is living with, and they realize he is not Ben. Christine attempts to escape the house, but \"Ben\" renders her unconscious.The next morning, Christine again awakens with no memories but she finds the camera and sees her entry saying she loves \"Ben\" and wants to make a life with him. \"Ben\" calls Christine and tells her to pack, that they are going on a trip that night. He then visits Dr. Nash at the hospital and tells him to stay away from Christine. That night, \"Ben\" takes her to a hotel close to where she had been found. He reveals that he is Mike, the man she had an affair with. Mike had wanted Christine to reveal their affair to Ben, but Christine refused, and their argument culminated in Mike attacking Christine, resulting in her amnesia. He also inadvertently reveals that Christine's son Adam is still alive. Declaring his love for Christine, Mike deletes the videos on her camera and states that he is no longer interested in playing the part of Ben. He tells Christine that they leave together, or no one leaves. Another struggle ensues, but this time Christine knocks Mike out and gets away. She sets off the hotel fire alarm while running from the hotel and is seen telling her story on the camera while waiting in an ambulance.Christine wakes up in a hospital bed and is visited by Dr. Nash, this time as a friend and not her therapist. He assures her the man responsible for her condition has been arrested. Christine is then visited by the real Ben who explains he kept away for the sake of their son Adam who visits as well with Christine now remembering them.","language":"English","box_office":"$15.1 million[3]","cinematography":"Ben Davis","production_company":"StudioCanal Millennium Films Scott Free Productions Film i Väst","directed_by":"Rowan Joffé","release_dates":"4 September 2014 (2014-09-04) (New Zealand)|5 September 2014 (2014-09-05) (United Kingdom)||||","Production":"On 1 May 2011, Ridley Scott bought the film rights of the novel Before I Go to Sleep written by S. J. Watson and hired Rowan Joffé to direct and write the script.[4] In February 2012 Nicole Kidman was in talks to join the film;[8] later in May she joined to star as Christine.[5] On 31 October 2012 Mark Strong also joined the cast of the film.[7] According to The Hollywood Reporter on 16 November 2012, Kidman said she wanted Colin Firth to work with her again. They had already worked together in a drama The Railway Man.[9] On 6 February 2013, it was confirmed that Firth has joined the cast to lead with Kidman.[6]The film was shot in London and at Twickenham Studios.[10]","produced_by":"Avi Lerner Liza Marshall Mark Gill Matthew O'Toole Ridley Scott","starring":"Nicole Kidman Mark Strong Colin Firth Anne-Marie Duff","running_time":"92 minutes[1]","music_by":"Edward Shearmur","edited_by":"Melanie Oliver","Release":"The film was released in the United Kingdom on 5 September 2014 and released in the United States on 31 October 2014.On 3 July 2014, the first UK trailer of the film was released by the StudioCanal UK.[11]The film was met with generally negative reviews from critics. On Rotten Tomatoes, the film holds a rating of 35%, based on 107 reviews, with an average rating of 5/10. The general consensus reads, \"If it doesn't completely avoid thriller clichés, Before I Go to Sleep still offers a stylish, fast-paced, and well-acted diversion.\"[12] On Metacritic, the film has a score of 41 out of 100, based on reviews from 31 critics, indicating \"mixed or average reviews\".[13]It has been unfavorably compared to Memento, a film released nearly a decade and a half earlier. \"What the brilliant 'Memento' once used as a way to explore a truly inventive way of storytelling is here just a gimmick. It's shallow, it's silly, it's pat. It's... forgettable,\" wrote the New Jersey Star-Ledger.[14] \"Christopher Nolan's 2000 brain-twister 'Memento' starred Guy Pearce as a man with a similar malady. The earlier film rigorously stuck within the logical confines of its premise. Joffé's is filled with far too many contradictions and implausible situations,\" wrote the Philadelphia Inquirer.[15]Kidman's performance has been positively received. Writing for Daily Star, critic Andy Lea said in a positive review that \"Kidman puts in a chilling performance as the frail but determined Christine.\"[16] David Edwards of Daily Mirror stated, \"Leading lady Nicole Kidman hasn’t been this good in ages\" finishing with \"Kidman is on top form as the nervy, spiky woman walking a psychological tightrope.\"[17]","written_by":"Rowan Joffé","budget":"$22 million[2]"}