{"country":"United States","distributed_by":"TriStar Pictures","beverly_hills_ninja":"Theatrical release poster","Plot":"A clan of ninjas finds an abandoned chest that has been washed onto shore, and find a white baby inside. One of their ancient legends spoke of a white foreigner male who would come among the ninja and become a master like no other would. The boy, Haru (Chris Farley), is raised amongst the ninja, with the expectation that he may be the one of whom the legend speaks. As Haru grows into adulthood, doubts are quickly cast over him for being the great white ninja. Despite not possessing any ninja traits, Haru is clumsy and fails to graduate a ninja with the rest of his class. Left alone to protect the temple while the clan are on a mission, Haru disguises himself as a ninja when an American woman whose real name is Alison Page but calls herself \"Sally Jones\" (Nicollette Sheridan), comes to the temple to seek assistance. Sally says she is suspicious of her boyfriend, Martin Tanley (Nathaniel Parker), and asks Haru to investigate. Haru finds out that Tanley and his bodyguard, Nobu (Keith Cooke Hirabayashi) are involved in a money counterfeiting business, but cannot find Sally to tell her. Haru leaves Tokyo and goes to Beverly Hills to search for Sally. Gobei (Robin Shou), Haru's adoptive brother, is sent by the clan's sensei (Soon-Tek Oh) to watch over and protect Haru, with Haru unaware of his presence.Haru checks in at a Beverly Hills hotel, where he befriends bellboy Joey Washington (Chris Rock), and teaches him some ninja lessons. Unaware that Gobei is helping him, Haru manages to find Sally. Haru tracks Tanley and Nobu to a night club located in Little Tokyo, where they are trying to retrieve a set of counterfeiting plates from their rival gang. The gangs fight, resulting in the deaths of two of the rival gang members, which Haru finds himself the suspect for. After receiving guidance from his sensei, Haru resumes his quest to search for Sally, and tracks down Tanley's mansion. Haru also then finds Sally and realizes her real name is Alison Page who tells him that Tanley murdered her sister, and that she is dating Tanley in a search for evidence which is why she used the false name \"Sally Jones\". Haru disguises himself as a Japanese restaurant chef, and finds out Tanley will be hiring an ink specialist named Chet Walters (William Sasso) to help counterfeit money. Haru then disguises himself as Walters to gain access to Tanley's warehouse. Haru's identity is exposed after failing to properly counterfeit the money and is captured by Tanley. While Tanley succeeds in getting the other half of the plates that night from the rival gang, Alison rescues Haru, only to get kidnapped by Tanley herself. The next day Haru enlists Joey's help in finding the warehouse. After they fail, Gobei intervenes without Haru's knowledge and leads them back to the warehouse.Tanley locks Alison in a room with a bomb. Haru attempts to intervene but is overwhelmed by Tanley's guards. Gobei reveals himself to Haru, and is able to distract the guards, allowing Haru to rescue Alison. Haru attempts to defuse the bomb but fails. On hearing Gobei become overwhelmed by Tanley's guards, Haru leaves Alison to help Gobei. Seeing Gobei about to be killed, Haru snaps and suddenly demonstrates amazing martial arts moves, stunning Gobei. Haru saves Gobei's life and successfully defeats several guards himself. Haru and Gobei are left facing off Nobu and two guards. Joey, attempting to enter the building, crashes through a window and knocks himself and one of the guards unconscious. Haru and Gobei defeat Nobu and the remaining guard. Tanley then confronts Haru and Gobei. In the fight that follows, Haru accidentally knocks Gobei unconscious by hitting him in the head with a sheave, but forces Tanley to flee afterwards. Haru returns to attempt to rescue Alison. Using a large harpoon gun mounted on a cart, Haru shoots a harpoon through the room which inadvertently lands in the back of a truck in which Tanley is trying to escape. The harpoon drags the bomb into Tanley's truck and explodes. Haru successfully rescues Alison, then Tanley and his surviving hitmen are arrested by the LAPD.Sometime later back in Japan, Haru tells his sensei he will be returning to Beverly Hills to live with his girlfriend Alison. Haru and Alison leave together on a bus. A grappling hook tied to a rope has fallen from the bus and hooks into Gobei's wheelchair, causing him to be thrown into the ocean. Haru shouts an apology to Gobei.","language":"English Japanese","Reception":"Beverly Hills Ninja received generally negative reviews. It holds a 14% \"rotten\" rating at review aggregator Rotten Tomatoes,[3] and holds a 27/100 score at Metacritic.[4] James Berardinelli panned the film, stating that \"Beverly Hills Ninja is essentially a one-joke film. That joke has to do with Chris Farley [...], who plays one of the clumsiest men on Earth, crashing into objects or having things fall on his head\" and concluded that it \"isn't just juvenile, it's lackluster and unfunny.\"[5] Bruce Fretts of Entertainment Weekly criticized the film as well, complaining it had \"...a yawner plot about Farley busting up a yen-counterfeiting ring\" and that \"...when the writers run out of ideas, they simply have Farley walk into a lamppost, or cop from old SNL skits.\"[6]A favorable review came from Mick LaSalle of the San Francisco Chronicle who wrote that it is \"not the kind of picture that gets respect from New York critics, but it's funny. [...] This is a movie in which the audience knows half the gags in advance, but thanks to director Dennis Dugan's timing and Farley's execution, the audience doesn't just laugh anyway, but laughs harder... he's too good, too funny and too in control of his out-of-controlness to be a mere buffoon.\"[7]","box_office":"$31.5 million[1]","cinematography":"Arthur Albert","production_company":"Motion Picture Corporation of America","directed_by":"Dennis Dugan","release_dates":"January 17, 1997 (1997-01-17)","produced_by":"Bradley Jenkel Brad Krevoy Steven Stabler Mitch Klebanoff","starring":"Chris Farley Nicollette Sheridan Robin Shou Nathaniel Parker Chris Rock","running_time":"88 minutes","Sequel":"Beverly Hills Ninja 2, a sequel written by Mitch Klebanoff and co-directed by Klebanoff and Kelly Sandefur. The film would feature David Hasselhoff and Lucas Grabeel, and began shooting scenes in South Korea in October 2008.[9] During filming, the name was changed to Dancing Ninja and released in 2010.[10]","music_by":"George S. Clinton","edited_by":"Jeff Gourson","written_by":"Mark Feldberg Mitch Klebanoff","budget":"$18 million"}