{"Cast":"*Denote the director's name tattooed on the characters.","country":"United States","cecil_b._demented":"Theatrical release poster","distributed_by":"Artisan Entertainment","Plot":"Honey Whitlock is a Hollywood A-list actress whose public persona is that of a sweet and considerate woman, but who is actually profane, unreasonable, and demanding. While in Baltimore to attend a premiere, Honey is kidnapped by the manic film director, Cecil B. Demented, and his band of misfit, Andy Warhol–worshiping artists who have branded themselves \"kamikaze filmmakers\", going by the group name \"SprocketHoles\". Each of the SprocketHoles has infiltrated the staff of the theater where the premiere is to take place; they subsequently kidnap Honey as she concludes her remarks on stages. In the ensuing mayhem, the group escapes.Honey is taken to an abandoned movie theater where she is kept captive. Honey is introduced to Cecil's crew of followers, each of whom wears a tattoo of a noted filmmaker and reveals unique, individual quirks. Cecil explains that he wants to make his masterpiece film and needs Honey to star as the lead. At first she resists, shooting scenes with no emotion, but when Cecil demands better results, Honey gives an over-the-top performance in the film's opening scene which pleases him. Apart from the first scene, Cecil, Honey and the crew roam around the city filming scenes at real (unapproved) locations, often involving innocent bystanders in the process.The group's first location is a luncheon being hosted by the Baltimore Film Commission. The group crashes the event and Cecil orders Honey to jump off the roof of a nearby building, which she does without safety measures. A gunfight ensues between Cecil's crew and the police. As gunfire is exchanged, Rodney the hairdresser is killed and Cecil is wounded. Honey uses the opportunity to turn herself in to the authorities and they take her away in a police car, but she is retrieved by the film group soon after.As Honey seems to become more comfortable with her situation, possibly developing Stockholm syndrome, she watches a television special discussing her disappearance. Persons who knew her, including her ex-husband, are interviewed and come clean about how mean-spirited she was in daily life. Honey now realizes that her desire to escape would only lead her back to Hollywood, where she is hated for being rude. She resists the idea of joining Cecil's followers but changes her mind and declares herself \"Demented forever\", burning a brand into her arm and officially joining the motley crew.After these events, the crew invades the set of the Forrest Gump sequel being filmed in Baltimore, at Honey's suggestion. When the SprocketHole crew arrives, they subdue and replace many of the film's crew. A gunfight breaks out between Cecil's friends and Teamsters who got free. Members of Cecil's crew are either killed or wounded. The surviving SprocketHoles and Honey flee to a nearby pornographic theater and seek refuge inside. The audience helps Cecil escape.At their last location, Cecil is shooting the final scene at a local drive-in while law enforcement are alerted. Cecil and the crew take over the projection room, and he proceeds to excite the crowd into a frenzy. He asks Honey to light her hair on fire for the final shot (which she does). With the film finished, the SprocketHoles start having sex in public before the authorities step in. Cecil sets himself completely ablaze as police arrive, to give Honey a chance to run away. In the ensuing chaos, some crew members escape with the raw film footage while others are shot. Honey is taken into custody; she is surprised and pleased by the new affection shown to her by the crowd as she is put into the police van.","language":"English","box_office":"$1,961,544[3]","cinematography":"Robert M. Stevens","production_company":"Le Studio Canal+ Polar Entertainment","directed_by":"John Waters","Soundtrack":"The soundtrack was released August 8, 2000 by RCA Records.","release_dates":"August 11, 2000 (2000-08-11)|||||","produced_by":"Joseph M. Caracciolo, Jr. John Fiedler Mark Tarlov","starring":"Melanie Griffith Stephen Dorff Alicia Witt Adrian Grenier Mink Stole Ricki Lake Larry Gilliard, Jr. Maggie Gyllenhaal Jack Noseworthy Mike Shannon","running_time":"88 minutes[1]","music_by":"Basil Poledouris Zoë Poledouris","edited_by":"Jeffrey Wolf","Release":"The film was screened out of competition at the 2000 Cannes Film Festival.[5]Roger Ebert gave the film one and a half stars out of four, remarking that it was like \"a home movie [with] a bunch of kids goofing off\",[6] while others such as Peter Travers of Rolling Stone said \"DeMented is Waters the way we like him—spiked with laughs and served with a twist\".[7]The review aggregator Rotten Tomatoes reported that 53% of critics gave Cecil B. Demented positive reviews, based on 80 reviews; the consensus states \"The idea behind John Waters' latest has much potential, but the movie ends up being too sloppy and underdeveloped in terms of script and direction. Also, by today's standards, it fails to shock.\"[8] Metacritic reported the film had an average score of 57 out of 100, based on 32 reviews.[9]Cecil B. Demented was a box office failure, grossing a mere $1,961,544[3] from an estimated $10 million budget.[2]","written_by":"John Waters","budget":"$10 million[2]"}