{"country":"United Kingdom United States","distributed_by":"Cinecom International PBS","screenplay_by":"Gregory Nava Anna Thomas","story_by":"Gregory Nava","Background":"The origins of El Norte are the director's experiences in San Diego, California, as he grew up. Nava came from a border family and has relatives on the other side in Tijuana, Baja California. As a youth, he crossed the border several times a week, often wondering who lived in all those cardboard shacks on the Mexican side.For research the producers of El Norte learned about the plight of indigenous Guatemalans from years of research, much of it conducted among exiles living in Southern California. According to Nava, \"There are hundreds of thousands of refugees from Central America in Los Angeles alone. Nobody knows the exact number, but a recent television inquiry estimated 300,000-400,000. In our own research, we came across a community of Mayans from Guatemala—5,000 from one village—now in Los Angeles. The original village, which is now dead, had 15,000.\"[8]Annette Insdorf, writing for The New York Times, said Nava discussed the singular nature of the US-Mexico border. Nava said: \"The border is unique—the only place in the world where an industrialized first-world nation shares the border with a third-world country. In California, it's just a fence: on one side are the Tijuana slums, on the other side—San Diego. It's so graphic! This was the germ of the story.\"[8]The motion picture has become a staple of high school Spanish language classes throughout the United States and multiculturalism studies in college.Nava and Anna Thomas spent two years raising money for El Norte but they consciously did not pursue film studios or television networks because, more than likely, studio executives would demand changes be made in either script, casting, or both. Gregory Nava and Thomas believe that much of what makes El Norte special would have been jeopardized if a major studio had been involved in the filmmaking process.Financing for the film was provided by PBS's American Playhouse (50%) and the rest in pre-sales. One such pre-sale was made to the United Kingdom's Channel 4 (a public-service television broadcaster).[8]","Plot":"The writing team of Nava and Thomas split the story into three parts:Arturo Xuncax: The first part takes place in a small rural Guatemalan village called San Pedro and introduces the Xuncax family, a group of indigenous Mayans. Arturo is a coffee picker and his wife a homemaker. Arturo explains to his son, Enrique, his world view and how the indio fares in Guatemalan life, noting that, \"to the rich, the peasant is just a pair of strong arms\".[4] Arturo and his family then discuss the possibility of going to the United States where \"all the people, even the poor, own their own cars\". Because of his attempts to form a labor union among the workers, Arturo and the other organizers are attacked and murdered by government troops when a co-worker is bribed to betray them—Arturo's severed head is seen hanging from a tree.[5] When Enrique attempts to climb the tree that displays his father's head, a soldier attacks him. Enrique fights and kills the attacker, only to learn that many of their fellow villagers have been rounded up by soldiers. The children's mother too \"disappears\": abducted by soldiers. So, using money given to them by their godmother, Enrique and his sister Rosa decide to flee Guatemala, the land of their birth, and head north.Coyote: During the second part of the film the two teenagers flee Guatemala, travel through Mexico, and meet a Mexican coyote who guides them across the border. This section includes various comic scenes relating to mutual stereotyping among different ethnic groups; the two attempt to pass themselves off as indigenous Mexicans, failing to convince one Mexican truck driver after naming the wrong destination, but later succeeding in convincing a U.S. Border Patrol officer by copiously peppering their responses with the Mexican word for \"fuck\", which a neighbor had suggested was how all Mexicans speak.[5] After their first failed attempt to cross the \"frontera\", where a man posing as a coyote deceives and attempts to rob them, they have a horrific experience when they finally cross the U.S.-Mexican border through a sewer pipe laden with rats; critic Roger Ebert noted:The scene is horrifying, not least because it's pretty clear these are real rats. Disease-free rats purchased from a laboratory, yes, but real rats all the same, and although Gutierrez was phobic about rats, she insisted on doing her own scenes, and her panic is real.[6]El Norte: In the final part of the film Rosa and Enrique discover the difficulties of living in the U.S. without official documentation. The brother and sister team find work and a place to live and initially feel good about their decision. However, Rosa nearly is caught up in an immigration raid and must find a new job. Working as a domestic, she is puzzled when her Anglo employer shows her a washing machine. Enrique becomes a busboy and, as his English classes begin to improve his command of the language, he is promoted to a position as a waiter's assistant. He is later approached by a businesswoman who has a better-paying job for him in Chicago as a foreman, which he initially declines; he too encounters problems when a jealous Chicano co-worker reports him to immigration, causing him to flee the restaurant and seek out the businesswoman.When Enrique finally decides to take the position, Rosa becomes gravely ill with typhus contracted from the rat bites she received during their border crossing. When this happens, Enrique must make the tough decision of missing the flight to Chicago to be by her side, and thus loses the position. As Enrique visits the hospital, Rosa laments that she will not live to enjoy the fruits of their harrowing journey to the U.S. Rosa sums up the film's major theme when she says to Enrique:After Rosa dies peacefully, Enrique is shown once again waiting with the other day-labor hopefuls in a parking lot, offering his services to a man looking for \"strong arms\"; reviewer Renee Scolaro Rathke observes: \"It is a bitter realization that Arturo’s words about the poor being nothing but arms for the rich holds true even in El Norte.\"[5]Although Enrique is temporarily employed once again, he is distracted by haunting daydreams about his sister's lost desires for a better life. The final shot in the film again shows a severed head hanging from a rope, which may be the same image used in Part I of the film; one critic has commented that a hanging, severed head is \"a symbolic device used in some Latin films to signify that the character has committed suicide\".[7]","language":"English Quiché Spanish","Themes":"Parts of El Norte provide an example of how Latin American magical realism, primarily found in novels, has been depicted in a theatrical film.[6][9][10] The Washington Post writer Ann Hornaday said: El Norte was seminal, both for its graceful blend of classical narrative and magic realism, and the power with which it brought an otherwise invisible world to life.”[11]El Norte portrays an Amerindian point-of-view and this is exemplified by the religion they follow. An example is when Rosa Xuncax sings the eulogy at the funeral of her father and its Native American Maya religious theme. A traditional Maya belief is that life has a cyclical nature.[12] Rosa sings in her Maya tongue:Throughout El Norte young Rosa and Enrique and their family are subjected to many epithets, hatred, and bigotry due to their indigenous heritage. When the father Arturo inadvertently kills a soldier, for example, a ladino screams:And, when Rosa and Enrique reach their destination in Mexico, a passenger screams at the timid Maya youngsters:David Villalpando, the actor who played Enrique Xuncax, gave an interview to Lear Media about what the film meant to him and why he believes the film is important. Villalpando said:","Reception":"When released, the staff at Variety magazine described the film as the \"first United American independent epic\".[17]In his review, film critic Roger Ebert was pleased with Nava and Thomas's work and likened it to a classic film of yesteryear, writing: El Norte (1983) tells their story with astonishing visual beauty, with unashamed melodrama, with anger leavened by hope. It is a Grapes of Wrath for our time.\"[6]In a scene where the characters cross into California by means of a rat-infested sewer tunnel and emerge to a view of San Diego, Commonweal critic Tom O'Brien wrote: \"... the scene sums up its rare strength\".[18]Film critics Frederic and Mary Ann Brussat of the website Spirituality and Practice were touched by Nava and Thomas' story and the attention they give to the character's native roots, and wrote: \"Nava's attention to details, particularly the aesthetic and religious beauty of Indian culture, and his sympathy for the protagonists' inner lives lift this story above its melodramatic moments and make the tale a memorable one.\"[19]Yet, some film reviewers objected to what they considered the film's overly sad end.Vincent Canby, writing for The New York Times, wrote: \"Until its arbitrarily tragic ending, El Norte seems about to make one of the most boldly original and satirical social-political statements ever to be found in a film about the United States as a land of power as well as opportunity.\" However, Canby did find the acting top-rate and noted the realism they bring to their tasks. He added: \"Mr. Nava does not patronize his 'little people.' This has something to do with the straight, unactorly quality of the performances, especially by Zaide Silvia Gutierrez as Rosa and David Villalpando as Enrique, two splendid Mexican actors.\"[20]The review aggregator Rotten Tomatoes reported that 80% of critics gave the film a positive review, based on ten reviews.[21]WinsNominationsOther distinguishments","cinematography":"James Glennon","production_company":"American Playhouse Channel Four Films Independent Productions Island Alive Public Broadcasting Service","directed_by":"Gregory Nava","Home media":"The film has been released in video on two separate occasions, with different video covers.In DVD format it has been released in: region 2 on June 15, 2002; region 4; and region 1.[23]The Criterion Collection released El Norte in DVD and Blu-ray format in January 2009.[24]","Soundtrack":"A soundtrack for the film was produced in France by Island/Phono-Gram. The album was produced by Gregory Nava and Danny Holloway. The CD features original music for the film by Los Folkloristas, Emil Richards, and Linda O'Brian.It also features \"Rosa's Song\" sung by the actress Zaide Silvia Gutiérrez.[22] Adagio for Strings, by the American composer Samuel Barber, was featured at two different points in the film. It also contains the First Cello Concerto and De Natura Sonoris No. 1 by Krzysztof Penderecki, the latter of which is used twice.","release_dates":"November 10, 1983 (1983-11-10) (United Kingdom)|January 11, 1984 (1984-01-11) (New York City)||||","Production":"When Nava and his production crew were, more or less, kicked out of Mexico during the film shoot, he had to re-create a Mexican village in California. Nava said: \"We were filming in Mexico during the end of the López Portillo presidency, one of the last of the old-fashioned caciques to rule Mexico. One day, men with machine guns took over the set. I had guns pointed at my head. We were forced to shut down production, bribe our way out of the country, fight to get our costumes back, and start shooting again in California. Ironically, in the United States our extras were real Mayan refugees. They were the people the movie was about.\"[14]Nava tells the story that, at one point, Mexican police kidnapped their accountant and held him for ransom, while, at the same time, his parents had to pose as tourists in order to smuggle exposed film out of the country in their suitcases.[15]The film was shot in Mexico and California. In Mexico: Chiapas, Morelos, México, D.F., and Tijuana. In California: San Diego and Los Angeles.","Distribution":"The film was released in Scotland on October 11, 1983. On December 11, 1983, the movie opened in New York City and on January 27, 1984, it opened in wide release.It was screened in the un certain regard section at the 1984 Cannes Film Festival.[16]A director's cut was re-released in May 2000.[3]","produced_by":"Anna Thomas","starring":"Zaide Silvia Gutiérrez David Villalpando","running_time":"139 minutes","el_norte":"Theatrical release poster","music_by":"The Folkloristas Malecio Martinez Linda O'Brien Emil Richards","edited_by":"Betsy Blankett Milicevic","budget":"$800,000[1]"}