{"country":"United States","distributed_by":"Orion Pictures","Background":"This film borrows heavily from the films of Allen's idol, Ingmar Bergman, particularly Wild Strawberries, where the main character is an elderly professor who learns from a close relative that his family hates him. Allen also recreates some of the dream sequences from Wild Strawberries, and puts Marion Post into a similar situation as Isak Borg, where both characters reexamine their life after friends and family accuse them of being cold and unfeeling. This film has many of Allen's signature features, particularly the New York City stamp of the film; only a few scenes are shot outside the city, in the Hamptons. It also uses classical music- Gymnopedie No. 1 by Erik Satie (Debussy's orchestral arrangement renamed as Gymnopédie No. 3), and poetry- Archaic Torso of Apollo by Rainer Maria Rilke, to serve its narrative, as do earlier and later films such as Hannah and Her Sisters, Crimes and Misdemeanors, and Husbands and Wives. It also focuses primarily on upper middle class intellectuals, as nearly all of Allen's 1980s films do.","Plot":"Marion Post (Gena Rowlands) is a New York philosophy professor past the age of 50 on a leave of absence to write a new book. Due to construction work in their building, she sublets a furnished flat downtown to have peace and quiet.Her work there is interrupted by voices from a neighboring office in the building where a therapist conducts his analysis. She quickly realizes that she is privy to the despairing sessions of another woman (Mia Farrow) who is disturbed by a growing feeling that her life is false and empty. Her words strike a chord in Marion, who begins to question herself in the same way.She comes to realize that, like her father (John Houseman), she has been unfair, unkind and judgmental to many of the people closest to her: her brother Paul (Harris Yulin) and his fragile wife Lynn (Frances Conroy), her best friend from high school Claire (Sandy Dennis), her first husband Sam (Philip Bosco), and her stepdaughter Laura (Martha Plimpton).She also realizes that her marriage to her second husband, Ken (Ian Holm), is unfulfilling and that she missed her one chance at love with his best friend Larry (Gene Hackman). She finally manages to meet the woman in therapy as she contemplates a Klimt painting called \"Hope\". Although she wants to know more about the woman, she ends up talking more about herself, realizing that she made a mistake by having an abortion years ago and that at her age there are many things in life she will not have anymore.By the end of the film, Marion resolves to change her life for the better.","language":"English","Reception":"Another Woman received modest praise from critics and holds a 65% positive \"Fresh\" rating on the review aggregator Rotten Tomatoes.[1]Tim Robey of The Daily Telegraph described the film as \"one of [Allen's] shortest, least funny, and very best films\".[2] Roger Ebert of the Chicago Sun-Times similarly praised the film, awarding it four-out-of-four stars and writing, \"Allen's film is not a remake of Wild Strawberries in any sense, but a meditation on the same theme: the story of a thoughtful person, thoughtfully discovering why she might have benefitted from being a little less thoughtful.\"[3] Variety praised the film as \"brave, in many ways fascinating, and in all respects of a caliber rarely seen.\"[4]Vincent Canby of The New York Times was more critical of the film, however, remarking, \"Everyone speaks slightly stilted, epistolary dialogue. The rounded sentences sound as if they'd been written in a French influenced by Flaubert, then translated into English by a lesser student of Constance Garnett.\" He added, \"Mr. Allen is becoming an immensely sophisticated director, but this screenplay is in need of a merciless literary editor. It's full of an earnest teen-age writer's superfluous words, in addition to flashbacks and a dream sequence that contain material better dealt with in the film's contemporary narrative.\"[5]","box_office":"$1,562,749","cinematography":"Sven Nykvist","directed_by":"Woody Allen","another_woman":"Theatrical release poster","release_dates":"October 14, 1988 (1988-10-14)|||||","produced_by":"Robert Greenhut","starring":"Philip Bosco|Betty Buckley|Blythe Danner|Sandy Dennis|Mia Farrow|Gene Hackman|Ian Holm|John Houseman|Martha Plimpton|Gena Rowlands|David Ogden Stiers|Harris Yulin|","running_time":"84 minutes","edited_by":"Susan E. Morse","written_by":"Woody Allen"}