{"country":"United States","distributed_by":"Lionsgate","Plot":"In the year 10,001 B.C., a caveman runs away from a predator through a plain and immediately gets into a fight with Wolf (Ike Barinholtz). After defeating him, the caveman then encounters the predator: a saber-toothed, gasoline-drinking Amy Winehouse (Nicole Parker), who after checking her Facebook account, informs him that the world will end on August 29, 2008 (the film's release date) revealing that their fate lies in a crystal skull. The film flash-forwards to the present, treating the first scene as a dream sequence of Will (Matt Lanter). He then finds out that his girlfriend Amy (Vanessa Minnillo) is having an affair with Flavor Flav (Abe Spigner), and she breaks up with Will because he is not admitting his true feelings for her.Later that day, Will has a \"Super Duper Sweet Sixteen\" party at his house, despite the fact he is 25. The guests include Juney (Crista Flanagan), Dr. Phil (John Di Domenico), Will's best friend Calvin (Gary \"G Thang\" Johnson), and Anton Chigurh (Barinholtz), among others. Seth and McLover (Noah Harpster and Austin Michael Scott) are trying to steal the alcohol from the party, and Calvin's girlfriend Lisa (Kim Kardashian) requests Calvin to kill them, but he realizes the distance is not clean. Then the Beautiful Assassin (Carmen Electra) suggests him to attempt to curve a bullet around the room to stop them, but he accidentally kills Dr. Phil, Chigurh, and the Beautiful Assassin in the process. By then, Amy arrives with her new boyfriend, a Calvin Klein underwear model, and the musical number \"Friends Forever\" is performed by high school kids, an off-key Jessica Simpson (Parker), and J. T. (Jonas Neal).However, the party comes to a halt when a strong movement shakes the room and lights go out. A bulletin on the radio claims there is a meteor shower and it is the end of the world. Will, Juney, Calvin, and Lisa go outside during the shower and find Hannah Montana (Flanagan) crushed by a meteor. Even when she is caught between life and death, she is still promoting her merchandise until her wig falls off, revealing her as Miley Cyrus before she finally dies. While this is occurring, a kid wakes up Hancock (Walter Harris) and mouths at him to go save the world, only to be knocked away as Hancock tries to escape from the city, but hits his head on a streetlight and knocks himself out.Soon after, the city starts to freeze over, and the group retreats to a garage for shelter. They meet the Sex and the City girls, who acknowledge that they are willing to fight for the place. Then, Juney and Carrie Bradshaw (Jason Boegh) start a combat, where Juney wins. When she mentions that the calamities are caused by global warming, Will replies to her that his dream about Amy Winehouse is maybe related. Lisa says that she is getting cold and Calvin suggests they should take their clothes off, but only the girls take them off, and the guys stare in awe until Juney's water breaks. Later, Will has a dream where he confesses to Amy he is a jumper, but when she tells him that she loves him she escapes, but accidentally impales himself on Prince Caspian's (Barinholtz) sword, and Caspian identifies him as \"the guy who ruined Star Wars\". After Will's dream ends, the group chide with him because he does not commit his relationship with Amy.The gang leaves the garage and Will gets a call from Amy, where he admits his feelings for her before the call is dropped. He decides to go to rescue Amy to her job, but Lisa is killed by a meteor. While the others comfort a distraught Calvin, the Enchanted Princess (Parker) climbs out of a manhole and gets hit by a taxi, with Calvin catching her as they immediately fall in love with each other. Juney guesses that she is a Princess thrown out of her kingdom by an evil witch, but the Princess explains that she is a \"demented homeless chick who lives in the sewers\" due to consuming \"lots and lots and lots of mind-altering, enchanting drugs\". Her pimp, Prince Edwin (Tad Hilgenbrink), challenges Calvin to dance fight reminiscent to Step Up 2 for the love of the Princess, but then a tornado appears and Prince Edwin escapes. Iron Man (Gerrard Fachinni), Hellboy (Barinholtz), and the Hulk (Roland Kickinger) attempts to fight the natural disaster but all are knocked down by cows that the twister sends. When the group finds shelter, Calvin gets a call on his shoe phone from Lisa's mother, who is informed about Lisa's death and how Calvin has found someone hotter than Lisa. Afterward, they encounter rabid knockoffs of Alvin and the Chipmunks, who start attacking the gang and eat Juney's flesh until she dies. The Chipmunks then go after Will and Calvin and they trap them in a trash can, fatally suffocating them as they attempt to escape.On their way to the museum to save Amy, who called to tell Will she is trapped under a statue, they run into Batman, who informs them that they must get to the evacuation buses by 9 pm (it is now 5:30 pm) and mentions that there will be no chance of survival if they go to save Amy. Learning that it is closer to nine than he thought, Batman throws a rope, which accidentally lands on a car that drags him away. With time against them, Princess Giselle kills Speed Racer (Jared S. Eddo) so they can hijack his Mach 5 and drive to the museum. But before departing, they hear someone giggling in the trunk and as they look inside they find Michael Jackson (Christopher Johnson) cuddled up with Spritle and Chim-Chim. After Jackson closes the trunk, they drive to the museum and they save Amy who reveals the Crystal Skull from Will's dream to be the only thing that can stop the end of the world. As Will and Amy make their way to the altar, Calvin and Princess Giselle find that the museum doors are closed and all the artifacts have come alive, including Kung Fu Panda (Yoshio Iizuka), who fights Calvin. When Calvin makes out with the Princess after beating Kung Fu Panda, Calvin accidentally pulls one part of The Princess' wig and discovers that the Princess is actually a transvestite. While this happens, Kung Fu Panda takes out a katana and kills Calvin and the Enchanted Princess.Meanwhile, Will and Amy run into a nude Beowulf (Barinholtz), who fights with Will. After Beowulf is defeated, Will and Amy encounter Indiana Jones (Tony Cox), who is revealed to be Will's father. Indy tries to put the crystal skull on the altar, but he has an accident; Will does it instead, and he averts further destruction. The film ends with a wedding ceremony for Will and Amy being performed by The Guru Shitka (Domenico). The film ends with an extensive musical number about all the characters dating (\"fucking\" in the unrated version) each other, which sets off a chain, ending with the Chipmunks.","Accolades":"On January 21, 2009, the film received six nominations for the 29th Golden Raspberry Awards:[21] The nominations were for Worst Picture, Worst Supporting Actress (Electra), Worst Supporting Actress (Kardashian), Worst Director, Worst Screenplay, and Worst Prequel, Remake, Rip-Off, or Sequel. Kardashian acknowledged her nomination on her blog, where she commented, \"It's an honor just being nominated!\"[22]","language":"English","Trivia":"Crista Flanagan, Ike Barinholtz, and Nicole Parker were all cast members of MADtv.","box_office":"$34.8 million[2]","cinematography":"Shawn Maurer","production_company":"3 in the Box The Safran Company Grosvenor Park","directed_by":"Jason Friedberg Aaron Seltzer","Home media":"The DVD and Blu-ray was released on January 6, 2009. They both included an Unrated \"Cataclysmic\" Edition and a theatrical version, both with the same extras. About 410,934 DVD units were sold, bringing in $8,447,690 in revenue (updated October 2009).[20]","disaster_movie":"Theatrical release poster","release_dates":"August 29, 2008 (2008-08-29)|||||","produced_by":"Jason Friedberg|Aaron Seltzer|Peter Safran|","starring":"Matt Lanter|Vanessa Minnillo|Gary \"G Thang\" Johnson|Crista Flanagan|Nicole Parker|Kim Kardashian|Ike Barinholtz|Carmen Electra|Tony Cox|","running_time":"87 minutes[1]","music_by":"Christopher Lennertz","edited_by":"Peck Prior","Release":"Reviews were almost universally negative; Rotten Tomatoes ranked the film 22nd in the 100 worst reviewed films of the 2000s, with a rating of 1%.[4] Metacritic gave the film a metascore of 15%, based on 12 reviews.[5] It was featured in Empire's 50 Worst Movies Ever poll,[6] Total Film's 66 Worst Movies Ever list[7] and the MRQE's 50 Worst Movies list (where it holds a score of 17, the lowest score on the site).[8] Disaster Movie became the lowest ranked film on IMDb's Bottom 100 list days after its premiere.[9][10]Jason Solomons of The Guardian wrote that \"Nothing can convey the grimness of Disaster Movie, which would be the Worst Movie Ever Made were it actually a movie at all.\"[11] Adam Tobias of the Watertown Daily Times opined, \"I just don't see how anyone could not find Disaster Movie one of the worst films of all time,\" further adding that the title of the film was appropriate, because the movie is \"a disaster.\"[12] The Times newspaper named the film the worst of 2008.[13]The only positive review posted on Rotten Tomatoes was by Jim Schembri from Australian newspaper The Age. Schembri called it \"dumb but also undeniably funny in more spots than a right-thinking mature person feels comfortable admitting\", the film was given 3½ stars out of five.[14]The most positive major critic review listed on either Metacritic or Rotten Tomatoes was by Owen Gleiberman of Entertainment Weekly, who gave the film a C+ and remarked: \"The movie is merciless sending up Juno's self-satisfied hipster gobbledygook, and it's quite funny to see Hannah Montana still promoting her tie-in products as she lies crushed and dying under a meteor.\"[15] Gleiberman previously contributed the only positive review listed on either site (out of 17 at Metacritic and 57 at Rotten Tomatoes) of Friedberg and Seltzer's earlier effort Epic Movie.[16][17]On its domestic theatrical debut, Disaster Movie grossed $2,023,130 on its opening day, $5,836,973 over the three-day weekend, and $6,945,535 over the four-day weekend (including Labor Day).[18] It ranked #7 for both the three- and four-day weekends. The film's takings for the weekend fell far short of the $17 million predicted by the Dallas Morning News.[19] The film was not as commercially successful as previous Friedberg/Seltzer releases. On a $20 million budget, it grossed $14,190,901 domestically and $17,492,474 overseas for a worldwide total of $31,683,375,[2] less than half the gross of Meet the Spartans.","written_by":"Jason Friedberg|Aaron Seltzer|","budget":"$20 million[2]"}