{"country":"United States","distributed_by":"Fox Searchlight Pictures","Plot":"Davis (Jake Gyllenhaal), a successful investment banker, struggles after losing his wife in a tragic car crash. Despite pressure from his father-in-law Phil (Chris Cooper) to pull it together, Davis continues to unravel. What starts as a complaint letter to a vending machine company turns into a series of letters revealing startling personal admissions. Davis’ letters catch the attention of customer service rep Karen (Naomi Watts) and, amidst emotional and financial burdens of her own, the two form an unlikely connection. With the help of Karen and her son Chris (Judah Lewis), Davis starts to rebuild, beginning with the demolition of the life he once knew.","language":"English","Reception":"In the United States and Canada, pre-release tracking suggested the film would gross $2–3 million from 854 theaters in its opening weekend, trailing fellow newcomers The Boss ($20–24 million projection) and Hardcore Henry ($7–10 million projection).[14] It ended up grossing just $1.1 million in its opening weekend, finishing 15th at the box office.[15]Demolition received mixed reviews from critics. On Rotten Tomatoes, the film has a rating of 50%, based on 152 reviews, with an average rating of 5.8/10. The site's consensus reads, \"Demolition benefits from a stellar cast, even if their solid work isn't always enough to prop up a confused story that aims for profundity but too often settles for clichés.\"[16] On Metacritic, the film has a score of 49 out of 100, based on 42 critics, indicating \"mixed or average reviews\".[17]","box_office":"$3.3 million[1]","cinematography":"Yves Bélanger","production_company":"Black Label Media Sidney Kimmel Entertainment Mr. Mudd","directed_by":"Jean-Marc Vallée","release_dates":"September 10, 2015 (2015-09-10) (TIFF)|April 8, 2016 (2016-04-08) (United States)||||","Production":"In May 2013, director Jean-Marc Vallée was set to direct Demolition, for a 2015 release date.[5] On October 9, 2013, it was announced that Black Label Media would finance the film, and would co-produce along with Mr. Mudd.[6] On June 6, 2014, Jake Gyllenhaal was in early talks to star in the film.[7] On July 21, Naomi Watts was in talks to join the film.[8] On September 4, Watts was confirmed cast in the film to play the female lead.[9] On September 10, Chris Cooper was set to star in the film.[3] On October 18, The Hollywood Reporter announced that Fox Searchlight Pictures had acquired the US rights to the film, and director Vallée said, \"I'm thrilled and excited to be back in business with Fox Searchlight. They have been wonderful, creative partners on Wild. I look forward to collaborating again on Demolition.\"[10] Judah Lewis' role as the son of Watts' character Karen Moreno was confirmed on July 15, 2015.[4]Filming began on September 15, 2014, in New York City.[9] On September 24, Gyllenhaal was spotted on the set while filming some scenes at John F. Kennedy International Airport.[11] On October 6, Gyllenhaal and Watts were spotted on the shores of Coney Island.[12] On October 8, filming was taking place on Greenwich Street in NYC.[13]","demolition":"Theatrical release poster","produced_by":"Lianne Halfon|Russ Smith|Molly Smith|Trent Luckinbill|Sidney Kimmel|Jean-Marc Vallée|Thad Luckinbill|John Malkovich|","starring":"Jake Gyllenhaal|Naomi Watts|Chris Cooper|Judah Lewis|","running_time":"101 minutes","edited_by":"Jay M. Glen","Release":"On July 15, 2015, Fox Searchlight Pictures set the film for a wide release on April 8, 2016.[4]","written_by":"Bryan Sipe"}