{"country":"United States","distributed_by":"Universal Pictures","Plot":"In Buffalo, New York, in 1887, Edith Cushing (Mia Wasikowska), the young daughter of wealthy American businessman Carter Cushing (Jim Beaver), is visited by her mother's ghost who warns her, \"Beware of Crimson Peak.\"Fourteen years later, Edith, a budding author, prefers penning ghost stories to writing the romance novels that her editor wants. She meets Sir Thomas Sharpe (Tom Hiddleston), an English baronet who has come to the United States seeking investors, including Edith's father, for his clay-mining invention. Disdaining privileged aristocracy and unimpressed with Sharpe's prototype and previous failures to raise capital, Cushing rejects Thomas's proposal. Edith notices that Thomas and his sister, Lucille (Jessica Chastain), wear expensive but outdated and somewhat-frayed fashions. Shortly after, her mother's spirit once again visits Edith, bearing the same warning.When Sir Thomas and Edith become romantically attached, Cushing and Edith's childhood friend, Dr. Alan McMichael (Charlie Hunnam), disapproves. Mr. Cushing hires a private detective who uncovers unsavory facts about the Sharpes. Mr. Cushing confronts the siblings and bribes them to leave town and for Sir Thomas to end his and Edith's relationship by breaking her heart. The next morning, Sir Thomas sends her a note explaining his actions. Not long after, Mr. Cushing is brutally murdered, though his death is ruled accidental. Edith and Sir Thomas eventually marry and return to England. They arrive at Allerdale Hall, the Sharpes' dilapidated mansion, which sits atop a red clay mine. As Edith settles in, she finds that Lucille is somewhat cold while Sir Thomas remains physically distant. Edith is left confused and uncertain by their behavior.Gruesome ghosts begin appearing to Edith throughout the mansion. To help calm her, Sir Thomas takes her into town. After being snowed in for the night, they finally consummate their marriage. Lucille angrily lashes out after their return, frightening Edith. By the time Sir Thomas mentions that the estate is also referred to as \"Crimson Peak,\" due to the warm red clay seeping up through the snow, Edith is growing increasingly weaker and coughing up blood.Edith explores the mansion and begins piecing clues together, discovering that Sir Thomas previously married three wealthy women who were fatally poisoned for their inheritances. She realizes she, too, is being poisoned. She also discovers the siblings have had a long-term incestuous relationship, resulting in a sickly infant, who was later killed by Lucille. Lucille also murdered their mother after she had discovered her children's incest. Sir Thomas inherited the family manor that, like many aristocratic estates of the era, is no longer profitable; the Sharpes are virtually penniless. The brother and sister began the \"marriage and murder\" scheme to support themselves and to fund Thomas's inventions.Back in the United States, the detective that Mr. Cushing had hired tells Alan what he uncovered about the Sharpes, including Thomas's multiple marriages and Lucille's time in a mental institution. Alan goes to Allerdale Hall to rescue Edith. Lucille stabs him, then demands that Sir Thomas finish him off. Sir Thomas, who has fallen in love with Edith and wants to protect her, inflicts a second, non-fatal stab wound to Alan before hiding him in the cellar. Lucille forces Edith to sign a transfer deed granting the Sharpes ownership of the Cushing estate and also confesses to her that she was the one who murdered Edith's father. After Edith signs the deed, she stabs Lucille and tries to flee. Sir Thomas burns the deed and promises to help her and Alan to escape. Lucille, jealous over Sir Thomas falling in love with Edith, murders him in a rage. She then pursues Edith. Aided by Sir Thomas' ghost, Edith kills Lucille with a shovel. Sir Thomas' spirit bids Edith a silent farewell and departs. Edith and Alan are rescued, and Lucille's ghost now haunts Allerdale. The end credits imply that Edith has written a novel titled Crimson Peak based on her experiences.","language":"English","box_office":"$74.7 million[2]","cinematography":"Dan Laustsen","production_company":"Legendary Pictures DDY","directed_by":"Guillermo del Toro","crimson_peak":"Theatrical release poster","release_dates":"October 16, 2015 (2015-10-16)|||||","Production":"\"But basically what it is is a really, really, almost classical gothic romance ghost story, but then it has two or three scenes that are really, really disturbing in a very, very modern way. Very, very disturbing, it's a proper R rating. And it's adult.\"Del Toro and Robbins wrote the original spec script after the release of Pan's Labyrinth in 2006. It was sold quietly to Donna Langley at Universal. Del Toro planned to direct the film, but postponed the project to make Hellboy II: The Golden Army, and then again to work on The Hobbit films. Langley suggested that del Toro produce the film for another director, but he could not find one he deemed suitable. While directing Pacific Rim, del Toro developed a good working relationship with Legendary Pictures' Thomas Tull and Jon Jashni, who asked what he wanted to do next. Del Toro sent them his screenplays for a film adaptation of At the Mountains of Madness, a Western adaptation of The Count of Monte Cristo, and Crimson Peak. The producers deemed the last of these \"the best project for us, just the right size\". Universal allowed del Toro to move the project to Legendary, with the caveat that they could put up money for a stake in the film.[16]Del Toro called the film a \"ghost story and gothic romance\". He has described it as \"a very set-oriented, classical but at the same time modern take on the ghost story\", and said that it would allow him to play with the genres' conventions while subverting their rules.[16] He stated, \"I think people are getting used to horror subjects done as found footage or B-value budgets. I wanted this to feel like a throwback.\"[17]Del Toro wanted the film to honor the \"grand dames\" of the haunted house genre, namely Robert Wise's The Haunting and Jack Clayton's The Innocents. The director intended to make a large-scale horror film in the tradition of those he grew up watching, such as The Omen, The Exorcist, and The Shining. He cited the latter as \"another Mount Everest of the haunted house movie\", praising the high production values and Stanley Kubrick's control over the large sets.[16]British playwright Lucinda Coxon was enlisted to rewrite the script with del Toro, in hopes of bringing it a \"proper degree of perversity and intelligence\", but she is not credited on the finished film.[17]Benedict Cumberbatch and Emma Stone were originally cast, but both dropped out of the production. Tom Hiddleston and Mia Wasikowska took over their respective roles, making this film their second collaboration after Only Lovers Left Alive.[18][19][20][21] Crimson Peak is also the second collaboration between Wasikowska and Chastain after starring together in Lawless. The film was titled Haunted Peak while under production, a title used only for the studio booking.[22] In the summer of 2013, Burn Gorman joined the cast in a cameo role.[12]In October 2013, Chastain went through a full-body cast process for the film. She posted pictures on her Facebook of her getting her head, torso, and fists cast.[23][24] Composer Fernando Velázquez composed the film's score.[25] Callum Greene, Jon Jashni and Thomas Tull helped produce the film.[26][27]Principal photography began in Toronto at Pinewood Toronto Studios on February 10, and ended on May 14, 2014.[28] On April 28, filming started on Queen Street South, between Main Street and King Street in Hamilton, Ontario. That section of roadway was closed to traffic and covered in topsoil to assist in the look of the setting. The gothic-looking Scottish Rite building to the west figured prominently.[4][29][30] Filming also took place in Kingston, Ontario on April 14, 2014.[31] The film features PJ Harvey's cover of \"Red Right Hand\".[32]","produced_by":"Guillermo del Toro|Callum Greene|Jon Jashni|Thomas Tull|","starring":"Mia Wasikowska|Jessica Chastain|Tom Hiddleston|Charlie Hunnam|Jim Beaver|","running_time":"119 minutes[1]","music_by":"Fernando Velázquez","edited_by":"Bernat Vilaplana","Release":"Filming was originally to begin in February 2014 and set for an April 2015 release, but because of the problems production was pushed back for an October 16, 2015 release.[7]At the San Diego Comic-Con International on July 23, 2014, del Toro helped create props for the Legendary Pictures booth by allowing fans to walk through snow-covered gates, and a gallery of props from the set and costumes from the film, including a bloody knife and moth print in the wallpaper that spell out the word \"fear\".[33][34] On February 13, 2015, the first trailer for the film was released online.[35] On May 13, 2015, the second trailer was released online, together with an international trailer featuring alternate material.[36]On June 16, 2015, four character posters were released, featuring the four main cast members.[37] On July 6, 2015, four alternate character posters were released, less than a week prior to Legendary Pictures' Crimson Peak panel at San Diego Comic-Con International.[38]On July 11, 2015 John Murdy, creative director of Universal Studios Hollywood's Halloween Horror Nights, announced that the movie would be adapted into a maze for the 2015 season. A novelization of the film, by Nancy Holder, will be released on October 20, 2015. Publisher Titan Books had previously published the novelization of del Toro's film Pacific Rim.As of November 26, 2015[update], Crimson Peak has grossed $31.1 million in North America and $43 million in other territories for a worldwide total of $74 million, against a budget of $55 million.[2]In the United States and Canada, the film opened simultaneously with Bridge of Spies, Goosebumps, and Woodlawn, on October 16, 2015, in 3,501 theaters as well as IMAX and premium large formats.[39] Pre-release tracking projected the film to open to around $15–20 million.[40][41] It made $855,000 from its early Thursday night showings at 2,178 theaters, and $5.2 million on its opening day.[42][43] It finished off the weekend with $12.8 million from 2,984 theaters falling in line with the projections. IMAX comprised $2.3 million of the opening gross from 365 IMAX theaters. The film suffered from a very competitive PG-13 adult market where such films as The Martian and Bridge of Spies were overperforming. Females repped 60% of the film's audience with 55% 25 or older.[44][45]Outside North America, Crimson Peak will open in 66 countries. It earned $13.6 million in its opening weekend from 55 territories.[46] It opened at No. 2 in Russia and the CIS ($2.6 million; behind The Martian) and Spain ($1.1 million) and No. 5 in the U.K., Ireland and Malta ($1.5 million).[46] It opened in Belgium, Greece, Israel, Italy, Poland, Portugal, and Trinidad around October 22–23.[46][47]Crimson Peak has received generally positive reviews from critics. On Rotten Tomatoes the film has a rating of 70%, based on 209 reviews, with an average rating of 6.5/10. The site's critical consensus reads, \"Crimson Peak offers an engaging – albeit somewhat slight – diversion driven by a delightfully creepy atmosphere and director Guillermo del Toro's brilliant knack for unforgettable visuals.\"[48] On Metacritic, the film has a score of 66 out of 100, based on 37 critics, indicating \"generally favorable reviews\".[49] On CinemaScore, audiences gave the film an average grade of \"B–\" on an A+ to F scale.[50]After attending an early screening, horror writer Stephen King called the film \"gorgeous and just fucking terrifying\", and said it \"electrified\" him like Sam Raimi's The Evil Dead, whose distribution he helped secure with a rave review in 1982. King's son, writer Joe Hill, called Crimson Peak \"del Toro's blood-soaked Age of Innocence, a gloriously sick waltz through Daphne du Maurier territory\".[51] IGN reviewer Scott Collura gave the film an 8.5 out of 10 score, saying, \"Featuring memorable performances, amazing production design, and a hard edge that is too often lacking in horror films these days, it nonetheless also manages to subvert some long-standing tropes about the gothic romance genre which inspired it.\"[52] Writing on Roger Ebert's official website and giving the movie four stars out of four, Sheila O'Malley said \"Watching del Toro's films is a pleasure because his vision is evident in every frame. Best of all, though, is his belief that 'what terrifies him will terrify others.' He's right.\"[53] Robbie Collin of The Daily Telegraph wrote that \"Its sombre sincerity and hypnotic, treasure-box beauty make Crimson Peak feel like a film out of time – but Del Toro, his cast and his crew carry it off without a single postmodern prod or smirk. The film wears its heart on its sleeve, along with its soul and most of its intestines.\"[54] The Guardian lead film critic Peter Bradshaw gave the film four stars out of five, wrote that \"Guillermo del Toro’s gothic fantasy-romance Crimson Peak is outrageously sumptuous, gruesomely violent and designed to within an inch of its life.\"[55] Observer critic Mark Kermode considered it the director's best film since Pan's Labyrinth and noted the various gothic and horror influences - including Sheridan Le Fanu, Robert Stevenson's Jane Eyre, and Hitchcock's Rebecca - on \"one of the year's most handsomely mounted productions.\"[56]Dan Jolin of Empire wrote that \"It may be a little overwrought for some tastes, borderline camp at points, but if you're partial to a bit of Victorian romance with Hammer horror gloop and big, frilly night-gowns, GDT delivers an uncommon treat.\"[57] Bilge Ebiri of Vulture wrote that \"It doesn’t always seem to know what it wants to be. But it’s still full of marvels.\"[58] Eric Kohn from indieWIRE wrote that \"Beyond its surface pleasures, Crimson Peak also confronts the demons of modern entertainment. The movie frightens and surprises us in familiar ways, but at the same time issues a plea for restraint\". Dana Stevens of Slate wrote that \"For the two hours it lasted I wasn't asking any questions, only giggling, squirming, screaming, and swooning\". Katie Rife of The A. V. Club wrote that \"Unsurprisingly for a Del Toro film, the production design is the real star of Crimson Peak\". Peter Travers of Rolling Stone wrote that \"A ghost story in which superior camerawork, costumes and production design work together to put the audience in a trance. It's tough on actors not to get swallowed up in the scenery\". Sara Stewart of New York Post wrote that \"Chastain and Wasikowska take center stage while Hiddleston flutters around like one of Allerdale’s huge black moths. Watching the women square off within del Toro’s eye-popping, painterly palette is a feast for the eyes, if not particularly substantial fare for the mind.\" Ty Burr of Boston Globe wrote that \"This is a film that believes deeply in ghosts, and half of them are in its director’s head\". A.O. Scott of New York Times wrote that \"The film is too busy, and in some ways too gross, to sustain an effective atmosphere of dread. It tumbles into pastiche just when it should be swooning and sighing with earnest emotion\".[59] Michael O'Sullivan of Washington Post wrote that \"The film by the stylish fantasist Guillermo del Toro looks marvelous, but has a vein of narrative muck at its core.\"[60] Tom Huddleston of Time Out London wrote that \"All three actors work hard... and when the melodrama hits fever pitch, Crimson Peak lurches into life. But overall this lacks weight and intensity: a Brontë-esque bauble smeared in twenty-first-century slickness.\"[61] Richard Roeper of Chicago Sun-Times wrote that \"Crimson Peak is a gorgeous mediocrity\". Peter Debruge of Variety wrote that \"Aflame with color and awash in symbolism, this undeniably ravishing yet ultimately disappointing haunted-house meller is all surface and no substance, sinking under the weight of its own self-importance into the sanguine muck below.\"[62] Chris Nashawaty of Entertainment Weekly wrote that \"Crimson Peak is a cobwebs-and-candelabras chamber piece that’s so preoccupied with being visually stunning it forgets to be scary.\"[63] McConnaughay of Slasher Club concluded it as a \"beautifully filmed romance horror,\" though had criticisms about the lack of character depth.[64]","written_by":"Guillermo del Toro|Matthew Robbins|","budget":"$55 million[2]"}