{"country":"Portugal","distributed_by":"Kino International Corp. (U.S.)","Plot":"It is set in July 2001. Rosa Maria (Leonor Silveira), a university teacher, takes her little daughter Maria Joana on a cruise from their home country of Portugal to Bombay, India, to see Rosa's husband who is an airplane pilot. Her motive is to visit the birthplaces of civilisation. At each port, a new person boards the ship. A famous businesswoman (Catherine Deneuve) boards in France, a famous model (Stefania Sandrelli) in Italy, and a famous actress (Irene Papas) in Athens. The captain of the ship (John Malkovich) invites the three distinguished women to dinner at his table, and they all speak in their own languages for the better part of the conversation. Later in the movie, Maria Joana and Rosa Maria are also invited to his table, where the captain presents the child with a gift.At dinner that night, the captain is informed that in Aden terrorists have planted two time bombs aboard the ship. The passengers are then ordered to evacuate. Maria Joana runs back to her and her mother's cabin to get the Arab doll the captain presented her with earlier that evening. Rosa Maria realizes that Maria Joana is missing, runs to the cabin to find her, and takes her back on deck to board a life raft. Unfortunately, it is too late; all the life rafts have left.The captain sees them on deck and yells for them to jump. As he is struggling to take off his uniform so he can swim to rescue them, there is the sound of two explosions and a bright light lights up the captain's face. The credits are displayed with the face of the distraught captain, lit up from the explosion, in the background.","a_talking_picture":"original film poster","language":"Portuguese French Greek English Italian","box_office":"$20,237[1]","cinematography":"Emmanuel Machuel","directed_by":"Manoel de Oliveira","release_dates":"2003 (2003)|||||","produced_by":"Paulo Branco","starring":"Catherine Deneuve John Malkovich Irene Papas Stefania Sandrelli Leonor Silveira","running_time":"96 minutes","written_by":"Manoel de Oliveira"}