{"based_on":"Dracula  by Bram Stoker","country":"United States","distributed_by":"Universal Pictures","Possible sequel":"On October 2, 2014, executive producer Alissa Phillips revealed at the UK premiere of the film that there might be a sequel to the film.[5] On November 3, 2014, Box Office Mojo speculated that, based on domestic and foreign earnings to date, the film \"is likely on the edge of earning enough to start a modest franchise.\"[85]","screenplay_by":"Matt Sazama Burk Sharpless","Plot":"In the Middle Ages, Vlad Tepes (Luke Evans) is the Prince of Wallachia and Transylvania. As a child, he was a princely hostage of the Ottoman Empire and was trained to be a soldier in the Sultan's elite Janissary corps, where he became their most feared warrior. He was called Vlad the Impaler after slaughtering thousands by impaling them on spears. Now ruling his domains in peace, Vlad and his soldiers discover a helmet in a stream and fear that an Ottoman scouting party is preparing the way for invasion. The stream leads to Broken Tooth Mountain, the top of which has a cave carpeted in crushed bone. Within the cave they are attacked in the dark by a creature (Charles Dance) with shining red eyes, inhuman speed and strength. Vlad's retinue is killed, and the blood of the wounded creature dissolves when exposed to sunlight which scares the creature to not pursue Vlad. Returning to his castle, Vlad learns from a local monk that the creature is a vampire, who was once a man who summoned a demon from the depths of hell and for dark powers before being cursed to remain in the cave until he is released by someone who drinks his blood, then drinks the blood of a human.Vlad celebrates an Easter feast with his wife Mirena (Sarah Gadon) and son Ingeras (Art Parkinson) when an Ottoman contingent arrives at the castle. Vlad offers them the usual tribute payment of silver coins, but the emissary notes that a battalion of Ottoman scouts has gone missing, implying that Vlad has had them killed, and demands an additional tribute of 1,000 boys to be trained as Janissaries, through the devşirme system. Vlad refuses, but his army is small and no match for the Turks. Mirena believes that, because of Vlad and Mehmed's (Dominic Cooper) history together as children, being close like brothers, if he were to ask, Mehmed would show him mercy. He approaches Mehmed II and asks him not to take the country's boys. When that fails, he offers himself in place of the boys; but the Sultan refuses and demands Vlad's son in addition. The Sultan sends the emissary to bring Vlad's son who tells his father that he is ready to join the Sultan's army, but Vlad kills the emissary and the soldiers with him.Knowing his actions will lead to war, Vlad returns to the Broken Tooth Mountain cave to seek help from the vampire. The vampire tells him there are consequences and offers him some of his blood, which will temporarily give Vlad the powers of a vampire. If he resists the intense urge to drink human blood for three days, he will turn back into a human. Otherwise, he will remain a vampire forever and will one day be called upon to help his maker. Vlad accepts the offer and drinks the vampire's blood, going through a painful and deathlike experience as he transforms.Vlad discovers he has been granted heightened senses, inhuman strength and speed, and the ability to transform into a flock of bats; but his skin slowly burns in direct sunlight. When he returns to Castle Dracula, the Ottoman army attacks, but Vlad single-handedly kills them all. He then sends most of the castle's subjects to Cozia Monastery for safety. Mirena learns of Vlad's curse as she sees Vlad holding silver to keep himself weak when near his people to avoid revealing his condition to them or attack them for blood. After Mirena kisses him, and they begin to have sex, Vlad's vampire senses start to take over, and he spots an artery pumping blood in her neck. He stops and resists, apologising to Mirena before fleeing into a nearby forest. There, a Romani named Shkelgim, who knows Vlad is a vampire, proclaims himself as his servant and offers his own blood; but Vlad resists. As they near the monastery, the Valachs are ambushed by Ottoman soldiers; and, while Vlad and his men successfully repel them, Vlad's sudden increased strength arouses suspicion among his subjects. The next day at the monastery, a monk learns of the curse and leads the Prince's subjects to turn on Vlad, trapping him in a burning building in the sunlight. Black smoke blocks out the sun, allowing an outraged Vlad to escape the fire, and he angrily reveals that he became a vampire for the sole purpose of protecting his people from the Ottoman suzerainty. Before he acts out against them, Mirena stops him and calms him down.That night, the Ottoman army marches on the monastery. Vlad commands an enormous swarm of bats to repel them; however, the soldiers are actually a decoy force, allowing a handful of Turks to infiltrate the monastery, kill many of the inhabitants and kidnap Ingeras. Mirena tries to defend her son, and falls from the edge of the monastery wall. Dying, Mirena pleads with Vlad to drink her blood before the sun rises to give him the strength to save their son. Vlad reluctantly drinks her blood, triggering his final transformation into a full-blooded vampire and granting him even greater powers. As he does so, he summons black storm clouds to blot out the sun, while the vampire loses his monstrous appearance and walks out of his cave, as his curse is broken. Vlad returns to the monastery and turns a small group of survivors and mortally wounded into vampires as well. At the Ottoman army's camp, Mehmed prepares for a massive invasion of Europe. Vlad and his vampires arrive, hidden by a large lightning storm, and easily massacre the terrified Ottoman soldiers, while Vlad himself goes after Mehmed, who is holding Ingeras captive. Aware that vampires are weakened by silver, Mehmed has lined the floor of his tent with silver coins, making Vlad's strength and speed that of a human, and impairing his vision, as Mehmed fights Vlad with a silver sword. He overpowers Vlad and prepares to impale his heart with a wooden stake, but Vlad turns into a flock of bats and evades him. Taking the name \"Dracula, Son of the Devil,\" he kills Mehmed with the stake and drinks his blood.As they leave Mehmed's tent, Dracula and Ingeras are confronted by the other vampires, who demand that his son be killed because he is human. The monk who had previously led the Valachs against Vlad appears and keeps the vampires at bay with a Christian cross. When one of the vampires attempts to kill Ingeras, Dracula impales him with a spear as a warning to the others not to harm his son. Dracula orders the monk to take Ingeras away, then uses his power to clear the black clouds in the sky. The sunlight burns the vampires into dust, while Dracula collapses into a charred corpse. With Vlad presumed dead and Europe saved from the Ottoman invasion, Ingeras is crowned the new Prince of Wallachia. However, Shkelgim secretly takes Dracula into a nearby tent and revives him with his blood.In the present day, Vlad meets a woman named Mina, who strikingly resembles Mirena, in the streets of a modern city (London), awhile the vampire who cursed Vlad, now in a more human form watches them from afar.","dracula_untold":"Theatrical release poster","language":"English Turkish","Reception":"As of January 11, 2015, the film grossed $56,280,335 in North America and $159,248,846 in other territories for a worldwide total of $215,529,201 against a budget of $70 million.[3]Dracula Untold was released in North America on October 10, 2014 across 2,885 cinemas.[41] It earned $1.3 million from Thursday late night showings from 2,133 theaters[42] and $8.9 million in its opening day.[43] The film debuted at #2 at the box office in its opening weekend grossing $24.5 million behind Gone Girl.[44] $4 million of the opening gross came from IMAX showings from 351 of its 2,887 locations which is the second-best October total behind only Gravity. 9 of the top 10 locations as well as 18 of the top 20 were in IMAX.[45] The film played 57% male and 61% over-25 years old.[46] In its second weekend the film 58% -and earned $9.9 million.[47]A few days ahead of its U.S. debut, Dracula Untold was released in 25 foreign markets and earned $21 million. It had a strong $5 million four-day opening in Mexico. The highest debuts came from Australia ($9 million), Germany ($4 million), Malaysia ($3 million) and France ($1 million).[48][49] The following weekend the film was released to over 42 foreign territories and earned $33.9 million.[50] The film went number one in nine of the 17 new released territories.[51] It earned $2.5 million from 155 IMAX screens for an overall total of 4.5 million and an international total of $8.5 million.[52] It went #1 in Bolivia, Colombia, Czech Republic, Ecuador, Philippines, Slovakia, Thailand, Trinidad and Vietnam.[53] The film was released to four new markets in its third weekend and earned $14.7 million from 59 territories where Brazil generated $2.7 million and Spain collected $1.8 million.[54] The film opened in Italy at #1 earning $3 million accounting 25% of the market shares. In Japan it earned $1.4 million.[55]Dracula Untold has received mixed to negative reviews from critics. Many critics criticized Dracula's characterization and pointed out plot holes, but praised Luke Evans' performance, the story, and the visuals. On Rotten Tomatoes, the film has a rating of 22% based on 113 reviews; the average rating is 4.4/10. The site's consensus reads, \"Neither awful enough to suck nor sharp enough to bite, Dracula Untold misses the point of its iconic character's deathless appeal.\"[56] On Metacritic, the film has a score of 40/100, based on 30 critics, indicating \"mixed or average reviews\".[57] The unfavorable critical aggregate scores contrast with an audience rating of A- from CinemaScore's opening night poll.[58]Frank Scheck of The Hollywood Reporter said, \"Much like the recent, widely reviled I, Frankenstein, this misconceived project mainly signals a need to go back to the drawing board.\"[59] The Village Voice's Alan Scherstuhl criticized the film, \"And so it was, and so it was dull, the greatest villain in all cinema bitten on the neck and drained of his hottest blood.\"[60] Simon Adams for Roger Ebert's website gave Dracula Untold a score of 2.5/4 along with an average review, \"If you can selectively ignore this litany of inanity, you may find some substantial earthy pleasures in Dracula Untold.\"[61] Kyle Anderson of Entertainment Weekly gave the film a C grade and wrote, \"It works neither as a sweeping historical epic nor as an action-horror hybrid.\"[62] Stephen Whitty wrote a negative review for The Star-Ledger, \"If this Dracula can kill hundreds of enemies by himself – and he can, and does, in several dull and protracted battle scenes – then where's the suspense? If he's become a monster for noble reasons, then where's the dark conflict?\"[63] The Seattle Times' Moira MacDonald said, \"It falls into that far-too-large category of studio offerings that aren't good enough to be noteworthy or terrible enough to be truly entertaining.\"[64]A. A. Dowd of The A.V. Club said, \"Neither the Dracula we need nor the one we deserve.\"[65] New York magazine's Bilge Ebiri wrote, \"I don't want to oversell this film. But in an era in which we've seen a lot of failed attempts to reinvent classic fantasy tales as CGI-action spectacles, it feels remarkably assured.\"[66] Film critic Mick LaSalle gave the film two stars out of four and wrote for San Francisco Chronicle, \"Here we have a vampire movie that brings together elements from other more popular movies.\"[67] Daniel Krupa from IGN said, \"Dracula Untold recasts the famous vampire as a dark superhero. It's fast-paced, shallow fun.\"[68] Tim Robey of The Telegraph positively said, \"This origin story, starring Luke Evans, really isn't as bad as it might have been.\" He later added, \"The intrigue can feel a little mechanical, but it doesn't overstay its welcome as badly as the clomping, similarly-designed Snow White and the Huntsman.\"[69] Michael O'Sullivan of The Washington Post reviewed and responded in negative, \"The film's problems aren't limited to liberal cadging from comic books. In fact, that's precisely what's best about the film, which occasionally boasts gorgeous visuals. But the movie doesn't know when to stop stealing.\"[70] Jordan Hoffman of New York Daily News said, \"The weapons, Turkish helmets and Romanian interiors are all gorgeous. If only the rest of this Lord of the Rings wanna-be were at the same level.\"[71] Kevin C. Johnson commented for St. Louis Post-Dispatch \"Dracula Untold feels longer than its 95-minute running time.\"[72]New York Post's Kyle Smith wrote, \"This Vlad the Impaler has all the edge of Vlasic the pickle.\"[73] Brian Truitt of USA Today said, \"At times Dracula Untold flirts with dullness so much that it might as well just stick a stake in the heart of Bram Stoker's legacy.\"[74] Toronto Star' Peter Howell asked, \"Whatever possessed the makers of Dracula Untold to think we'd be interested in a tragically unhip romance that backstories the infamous bloodsucker?\"[75] The Boston Globe's Peter Keough criticized the film, \"It's not so much untold as rewritten – if not by J. R. R. Tolkien than by some clever 12-year-old overstimulated by The Lord of the Rings.\"[76] Film critic Ben Kenigsberg reviewed the film for The New York Times, \"The movie is the latest multiplex filler to co-opt a classic tale only to drown it in computer-generated murk. Even the title has the ring of something created by committee.\"[77] James Berardinelli reviewed for website ReelViews, \"A generic vampire tale in the Underworld vein that comes closer to the infamous Van Helsing than a memorable re-interpretation of a legendary monster.\"[78] The Philadelphia Inquirer's David Hiltbrand said, \"The idea is to humanize one of the most fearful monsters in the Western crypt. But Dracula Untold goes way overboard, past domestication and into canonization.\"[79] Wesley Morris wrote for the website Grantland, \"Most of the time, I found myself feeling like I was waiting for a turn with the gaming controls.\"[80]Richard Corliss from Time magazine compared Dracula's origin story to Jesus Christ's story due to Dracula spending his childhood in a foreign land, and due to Dracula choosing to die (or become undead) in order to save his people. Corliss also complimented the film's use of its PG-13 rating by describing it as \"robust\". In his review, he stated, \"Most reviewers have slammed the movie, but it's not nearly as awful, or offal, as its critical odor.\" He later stated, \"[Evans] carries Untold by admirably fulfilling the two essential functions of a period-movie hero: to enunciate comic-book dialogue with Shakespearean authority and to look great with his shirt off.\"[81] Graham Killeen of Milwaukee Journal Sentinel gave a positive review and wrote, \"Dracula Untold tries to be The Lord of the Rings of horror movies. Surprisingly, it mostly succeeds.\"[82] Kofi Outlaw of Screen Rant gave a fairly moderate review stating, \"Dracula Untold is not a masterful or deep re-introduction to the franchise; but as basic genre fare, it's relatively fun in its depiction of the monster in a different light.\"[83] Los Angeles Times critic Gary Goldstein wrote a positive review saying, \"As effective and fat-free as its sinewy star, Luke Evans, Dracula Untold proves an absorbing, swiftly comprehensive origin tale.\"[84]","box_office":"$217.1 million[3]","cinematography":"John Schwartzman","production_company":"Legendary Pictures Michael De Luca Productions","directed_by":"Gary Shore","Music":"Ramin Djawadi's score for the film was released by Backlot Music on October 7 on CD.[31] Djawadi was originally chosen to work on the film's musical score after his work on Iron Man and Clash of the Titans, and after signing on to score the film, he gave up his job of scoring the film Edge of Tomorrow, which was given to Christophe Beck.[32] The official trailer features Lorde's cover of \"Everybody Wants to Rule the World,\" which was produced by Michael A. Levine and Lucas Cantor.[33]","release_dates":"October 10, 2014","Production":"Anybody who’s going to the film expecting a horror film, is going to be sorely disappointed. For me, it was telling a story. I was trying to tell a good drama, that has action-adventure elements to it.In 2007, director Alex Proyas was hired by Universal Studios to direct the film Dracula: Year Zero.[12] The film was to be produced by Michael De Luca and filmed in Australia.[13] Later, Universal ended the deals with Proyas and scheduled star Sam Worthington because of the high budget. It was announced on February 10, 2012, by Deadline.com that Irish director Gary Shore was in talks to direct.[4] Matt Sazama and Burk Sharpless wrote the script for the new film.[14] On April 25, 2013, The Hollywood Reporter confirmed that Universal had announced that the film would be released on August 8, 2014.[15] On May 20, 2013, First Minister of Northern Ireland Peter Robinson and Deputy First Minister of Northern Ireland Martin McGuinness announced that Universal would film Dracula in August in Northern Ireland.[16] On August 29, 2013, Variety reported that Legendary Pictures was considering co-financing the film.[17] Legendary's involvement in production was confirmed in May 2014.[18]On January 25, 2010, it was announced that Sam Worthington was in negotiations to play Vlad the Impaler and the film was set to release in 2011.[19] On August 19, Worthington was confirmed to star in the film.[20] On February 10, 2012, Deadline confirmed that Universal closed the deal with Worthington.[4] On April 8, 2013, actor Luke Evans joined the cast, replacing Worthington to play the role of Vlad the Impaler, the man who would become the mythological bloodsucker Dracula.[6] On May 2, 2013, Sarah Gadon joined the cast to star alongside Evans.[8] On May 8 Variety announced that Dominic Cooper was in talks to join the cast.[7] On July 11, 2013, Zach McGowan also signed on, to play the role of Shkelgim, a gypsy chief.[10] On July 26, Samantha Barks joined the cast to play a character from Eastern European folk tales known as Baba Yaga, a beautiful young woman who transforms into a savage witch; her scenes were later cut from the film.[21] Along with Barks more cast was added, including Charlie Cox, Ferdinand Kingsley, William Houston and Thor Kristjansson, the latter of whom would play the role of Bright Eyes, an Eastern European taken as a slave as a young boy and now an assassin in the Ottoman Army.[9] Art Parkinson then joined on to play the role of Ingeras, son of Dracula.[9]On October 15, 2014, it was announced that if the film was included in a rebooted Universal Monsters universe then Charles Dance's character \"Master Vampire\" could appear in several Universal Monsters films, much like Samuel L. Jackson in the Marvel Cinematic Universe.[22]On May 20, 2013, Universal confirmed that shooting would take place in Northern Ireland from August to November 2013.[23] The film's shooting officially began on August 5, 2013, starting in Roe Valley Country Park in NI.[24] The production company received permission for two days of shooting, on August 5–6, to film in the park.[25] Other location shooting took place throughout Northern Ireland.[26][27]In September 2014, actor Evans revealed that every day after work he got training all the time, rehearsed with the stunt guys, and ate just chicken, beef, fish and green vegetables to get ready for the shoot of the film.[28]On October 1, 2014, it was announced that reshoots had taken place shortly after the end of production to tie the film into the planned Universal Monsters franchise, which was being rebooted.[29] Producer Alissa Phillips confirmed at the UK premiere of the film that Dracula Untold was a part of the universe. She hoped that Evans' character might have a cameo in a future The Mummy film and also spoke of a potential sequel to Dracula to reboot the franchise.[5] In an interview with IGN, director Gary Shore stated, \"It's optional for them if they want to use it as that launching pad.\"[30] On October 15, The Hollywood Reporter reported that the ending scenes of the film hinted that the film Dracula Untold could be included into the monsters universe.[22]","produced_by":"Michael De Luca","starring":"Luke Evans|Dominic Cooper|Sarah Gadon|Art Parkinson|Charles Dance|","running_time":"92 minutes[2]","music_by":"Ramin Djawadi[1]","edited_by":"Richard Pearson","Release":"On April 25, 2013, Universal announced that the film would be released in theaters on August 8, 2014.[34] It was announced four months later that the film would be postponed until October 3, 2014.[35] The release date was pushed a third time to October 17, 2014.[36] The release date was changed for a fourth and final time to October 10, 2014, to give the film three weeks of play before Halloween.[37] The film was released in all formats including IMAX, and in over 25 foreign markets, on its opening weekend.[38]Dracula Untold was released on DVD and Blu-ray Disc on February 3, 2015.[39] The Blu-ray release comes with an alternate opening, deleted scenes, The Land of Dracula (Interactive Map), and Luke Evans: Creating a Legend.[40]","budget":"$70 million[3]"}