{"based_on":"Cabin in the Sky (musical)  by Vernon Duke & John La Touche","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot summary":"Little Joe, a man killed over gambling debts, is restored to life by angelic powers and given six months to redeem his soul and become worthy of entering Heaven—otherwise he will be condemned to Hell. Secretly guided by \"The General\" (the Lord's Angel), Little Joe gives up his shiftless ways and becomes a hardworking, generous, and loving husband to his wife Petunia, whom he had previously neglected. Unfortunately, demon Lucifer Jr. (the son of Satan himself), is determined to drag Little Joe to Hell. Lucifer arranges for Joe to become wealthy by winning a lottery, reintroduces Joe to beautiful gold-digger Georgia Brown, and manipulates marital discord between Joe and Petunia. Little Joe abandons his wife for Georgia, and the two embark on a life of hedonistic pleasure. As Little Joe and Georgia celebrate at a nightclub one evening, Petunia joins them, determined to win Joe back. Little Joe fights with Domino for Petunia and she prays for God to destroy the nightclub. A cyclone appears and leaves the nightclub in ruins, as Joe and Petunia lie dead in the ruins after being shot by Domino. Just as it appears that Joe's soul is lost forever, the angelic General informs him that Georgia Brown was so affected by the tragedy that she has donated all the money that he had given her to the church. On this technicality, Little Joe is allowed to go to Heaven with Petunia. As the two climb the Celestial Stairs, Joe suddenly wakes in his own bed. Joe had not been killed in the initial gambling-debt fracas, only wounded. All his supposed dealings with angels and demons were only a fever dream. Now genuinely reformed, Little Joe begins a new, happy life with his loving Petunia.","language":"English","Reception":"According to MGM records the film made $1,719,000 in the US and Canada and $234,000 elsewhere resulting in a profit of $587,000.[1][5][6]","cabin_in_the_sky":"Theatrical release poster","box_office":"$1,953,000[1]","cinematography":"Sidney Wagner","directed_by":"Vincente Minnelli Busby Berkeley (\"Shine\" sequence, uncredited)","release_dates":"April 9, 1943 (1943-04-09)|||||","Overview and history":"Produced by Arthur Freed and directed by Vincente Minnelli in his Hollywood debut, Cabin in the Sky in featuring an all-African American cast was an unusual production for its time. In the 1940s, movie theaters in many cities, particularly in the southern United States, refused to show films with prominent black performers, so MGM took a considerable financial risk by approving the film.The film was nominated for an Academy Award for Best Original Song for \"Happiness is a Thing Called Joe\" sung by Ethel Waters.[2]Some remember Cabin in the Sky for its intelligent and witty script, which some claimed treated its characters and their race with a dignity rare in American films of the time. Others, like actress Jean Muir, described Cabin in the Sky's racial politics as \"an abomination,\" arguing that moviegoers should write to the studios when they saw \"old stereotypes of Negro caricature\" like those in the film.[3] According to liner notes in the CD reissue of the film's soundtrack, Freed and Minnelli sought input from black leaders before production began on the film.After years of unavailability, Warner Home Video and Turner Entertainment released Cabin in the Sky on DVD on January 10, 2006.","produced_by":"Arthur Freed Albert Lewis","starring":"Ethel Waters Eddie \"Rochester\" Anderson Lena Horne Rex Ingram Louis Armstrong","running_time":"98 minutes","Songs":"One musical number, in which Horne sings a reprise of \"Ain't It the Truth\" while taking a bubble bath, was cut from the film prior to release, though it later appeared in a 1946 Pete Smith short subject entitled Studio Visit.[4] As Horne later said in the documentary That's Entertainment! III in which the excised performance was also featured, it was felt that to show a black woman singing in a bath went beyond the bounds of moral decency in 1943. (She did not state what she felt had changed in those three years to make it acceptable in 1946.) A second (non-bubble bath) performance of this song by Louis Armstrong was also cut from the final print, resulting in the famous trumpeter having no solo musical number in the film.","music_by":"Roger Edens Georgie Stoll George Bassman Hall Johnson","edited_by":"Harold F. Kress","written_by":"Marc Connelly (uncredited) Lynn Root (play) Joseph Schrank","budget":"$679,000[1]"}