{"country":"United States[3]","distributed_by":"Universal Pictures","screenplay_by":"Cinco Paul Ken Daurio","story_by":"Sergio Pablos","despicable_me":"Theatrical release poster","Plot":"Gru, a supervillain, has his pride injured when an unknown supervillain steals the Great Pyramid of Giza, an action that is described by his colleague Dr. Nefario as \"making all other villains look lame.\" Gru decides to do better, with the assistance of Dr. Nefario, by shrinking and stealing the Moon, an idea based on his childhood dream of being an astronaut, which was always disparaged by his mother Marlena. The plan is expensive and Gru seeks a loan from the Bank of Evil, where the president Mr. Perkins is impressed by the plan, but will only provide the money if Gru can obtain the necessary shrink ray first.Gru and his Minions steal the shrink ray from a secret base in East Asia, but the up-and-coming supervillain, Vector, who was also responsible for the Pyramid theft, immediately steals it from Gru, as revenge for freezing his head earlier at the Bank of Evil. Gru attempts to break into Vector's fortress to get the shrink ray back, but is defeated by numerous booby traps. However, he notices three orphan girls, Margo, Edith, and Agnes, who are able to easily walk into the base because they are selling cookies. Gru disguises himself as a dentist and adopts the girls from Miss Hattie's Home for Girls, planning on using them to infiltrate Vector's base so he can get the shrink ray back. However, Gru has difficulty nurturing them properly due to their rambunctiousness, their ballet classes, and his own ineptitude as a parent.Eventually, Gru and the girls arrive at Vector's fortress and Gru manages to steal the shrink ray. The girls then suggest a day at a theme park; Gru agrees, believing he can abandon the girls there, but he is later told by an attendant that they must be accompanied by an adult. He is then dragged around the theme park for the day, eventually warming up to the girls after they compliment him on blowing up a rigged carnival game to get Agnes a toy unicorn.Later, Gru contacts Mr. Perkins, stating that he finally has the shrink ray in his possession. Margo, Edith, and Agnes interrupt the meeting, and Perkins announces that he has lost confidence in Gru and will no longer fund his operations. As Gru tells the Minions he can no longer pay them for their services, the girls offer the contents of their piggy bank to fund the plan. The Minions then hand over their own savings, too. Gru, inspired, sacrifices parts of his lair to construct a spacecraft. Gru plans to steal the Moon when it is nearest the Earth, but this ends up being the same day as the girls' ballet recital. Gru becomes conflicted, and Dr. Nefario, seeing the recital as interfering with the plan, arranges for the girls to be returned to the orphanage. At the same time, Mr. Perkins informs Vector (who is revealed to be his son) of Gru's possession of the shrink ray and the adoption of the three girls, encouraging Vector to take action.Gru successfully shrinks and steals the Moon, but is too late to attend the recital — finding a note from Vector, who has kidnapped the girls, and will exchange the Moon for them. After arriving at Vector's headquarters, Gru readily makes the trade, but Vector reneges on the deal, flying off with the girls and the Moon, much to Gru's anger. Meanwhile, Dr. Nefario discovers that the effects of the shrink ray are temporary; the bigger the object was originally, the faster it will regain its original size. As the Moon starts to expand in Vector's ship, Gru, Dr. Nefario, and the Minions pull off a daring mid-air rescue of the girls just as the Moon explodes out of Vector's ship and launches itself back into orbit, with Vector trapped on it.Sometime later, Gru has readopted the girls and treats them as his daughters, writing them a bedtime storybook framed around his own experience. The film ends with the girls performing their own ballet recital for Gru, Marlena, Dr. Nefario, and the Minions.","language":"English","Reception":"The film received generally positive reviews from critics. Review aggregation website Rotten Tomatoes gives a rating of 81%, based on 191 reviews, with an average rating of 6.8/10. The site's critical consensus reads, \"Borrowing heavily (and intelligently) from Pixar and Looney Tunes, Despicable Me is a surprisingly thoughtful, family-friendly treat with a few surprises of its own.\"[23] Metacritic, another review aggregation website, assigned the film a score of 72 out of 100, based on 35 critics, indicating \"generally favorable reviews\".[24]Peter Travers of Rolling Stone gave the film three out of four stars, saying the directors were skilled at \"springing surprises\" from the writers' \"ingenious\" screenplay.[25] Peter Debruge of Variety gave the film a positive review, saying \"Since villains so often steal the show in animation, Despicable Me smartly turns the whole operation over to megalomaniacal rogue Gru.\"[26] Robert Wilonsky of The Village Voice gave the film a positive review, saying \"The result is pleasant and diverting, if ultimately forgettable, and it's one of the rare instances in the recent history of 3-D's resurrection as The Savior of Cinema in which the technology doesn't dim the screen or distract the focus.\"[27] Keith Uhlich of Time Out New York gave the film three out of five stars, saying \"The setup is pure Looney Tunes, and indeed, Despicable Me is at its best when trading in the anything-for-a-laugh prankery that was a specialty of the Termite Terrace crowd.\"[28] Roger Moore of the Orlando Sentinel gave the film three out of four stars, saying \"Despicable Me is a 3D cartoon comedy of whiplash-quick laughs, funny punch lines and a wickedly gimmicky appreciation for 3D.\"[29] Christy Lemire of the Associated Press gave the film a positive review, saying \"Kids will dig it, adults will smile with amusement, and no one will be any different afterward than they were walking into the theater.\"[30] Bill Goodykoontz of The Arizona Republic gave the film three and a half stars out of five, saying \"Neither as rich in story nor stunning in animation as Pixar offerings, Despicable Me instead settles for simply being goofy good fun, and it hardly seems like settling at all.\"[31]Carrie Rickey of The Philadelphia Inquirer gave the film two and a half stars out of four, saying \"Short, sweet-and-sour, and amusing rather than funny, Despicable Me can't help but be likable.\"[32] Colin Covert of the Star Tribune gave the film two and a half stars out of four, saying \"You'll probably leave the theater smiling, but don't expect to be emotionally engaged, Pixar-style. You'll be tickled, not touched.\"[33] Claudia Puig of USA Today gave the film three out of four stars, saying \"A whip-smart family movie that makes inventive use of the summer's ubiquitous 3-D technology is something worth cheering.\"[34] Tom Keogh of The Seattle Times gave the film three out of four stars, saying \"Despicable Me appeals both to our innocence and our glee over cartoon anarchy.\"[35] Jason Anderson of the Toronto Star gave the film three out of four stars, saying \"Despicable Me may not match the stratospherically high standards set by Up and WALL-E but that hardly matters when it’s this much fun.\"[36] Ty Burr of The Boston Globe gave the film three out of four stars, saying \"Despicable Me has enough visual novelty and high spirits to keep the kiddies diverted and just enough wit to placate the parents.\"[37] Roger Ebert gave the film three out of four stars, saying \"The film is funny, energetic, teeth-gnashingly venomous and animated with an eye to exploiting the 3-D process with such sure-fire techniques as a visit to an amusement park.\"[38] Michael Phillips of the Chicago Tribune gave the film two and a half stars out of four, saying \"By taking the \"heart\" part just seriously enough, and in the nick of time, the movie saves itself from itself.\"[39]Kim Newman of Empire gave the film three out of five stars, saying \"It's no first-rank CGI cartoon, but shows how Pixar's quality over crass is inspiring the mid-list. Fun, with teary bits, for kids; fresh and smart for adults.\"[40] Kenneth Turan of the Los Angeles Times gave the film two and a half stars out of four, saying \"The film throws so much ersatz cleverness and overdone emotion at the audience that we end up more worn out than entertained.\"[41] Stephen Whitty of the Newark Star-Ledger gave the film two and a half stars out of four, saying \"Unfortunately Despicable Me is just, predictably -- eh. And the one thing the larcenous Gru never steals is our heart.\"[42] Elizabeth Weitzman of the New York Daily News gave the film three out of five stars, saying \"Right now, any excuse for air conditioning will do. So it's a happy bonus to find that Despicable Me is more than just a heat-busting baby-sitter.\"[43] James Berardinelli of ReelViews gave the film three out of four stars, saying \"This is a smartly written comedy with a soft emotional core.\"[44] Kyle Smith of the New York Post gave the film three out of four stars, saying \"Despicable Me may not be the most sophisticated kids movie ever, but it stacks up against recent animated fare like How To Train Your Dragon the way The New York Review of Books compares to USA Today.\"[45] Ann Hornaday of The Washington Post gave the film three out of four stars, saying \"An improbably heartwarming, not to mention visually delightful, diversion.\"[46] Rick Groen of The Globe and Mail gave the film four out of four stars, saying \"This animated thing pretty near out-Pixars Pixar.\"[47] Mick LaSalle of the San Francisco Chronicle gave the film two out of four stars, saying \"When compared with the ambition and achievement of recent animated films, such as Coraline and Toy Story 3, Despicable Me hardly seems to have been worth making, and it's barely worth watching.\"[48]Bob Mondello of NPR gave the film an eight out of ten, saying \"It's all thoroughly adorable, and with an overlay that's nearly as odd as Carell's accent: Despicable Me looks a lot like other computer-animated pictures.\"[49] Mary F. Pols of MSN Movies gave the film four out of five stars, saying \"The movie finishes strong, managing to be sweet without being saccharine. It's no Toy Story 3, but Despicable Me is a solid alternative.\"[50] A.O. Scott of The New York Times gave the film two out of five stars, saying \"So much is going on in this movie that, while there's nothing worth despising, there's not much to remember either.\"[51] Laremy Legel of Film.com gave the film an A-, saying \"Despicable Me is darned cute. I know cute isn't to the lofty level of \"message storytelling\" but it can be entertaining to watch when done correctly.\"[52] Kirk Honeycutt of The Hollywood Reporter gave the film a positive review, saying \"Despicable doesn't measure up to Pixar at its best. Nonetheless, it's funny, clever and warmly animated with memorable characters.\"[53] Steve Persall of the Tampa Bay Times gave the film a B, saying \"Directors Pierre Coffin and Chris Renaud craft a fun stretch run, wrapping the story with warm, fuzzy funnies and nothing to suggest a sequel, which is probably wise.\"[54] Tasha Robinson of The A.V. Club gave the film a B, saying \"Until the \"creep + orphans = happy family\" formula starts demanding abrupt, unconvincing character mutations, Despicable Me is a giddy joy.\"[55] Marjorie Baumgarten of The Austin Chronicle gave the film three out of five stars, saying \"Everyone knows that the villains are usually the most interesting characters in any movie. So the makers of Despicable Me were wise to cut to the chase and make the megalomaniacal Gru the central character in this animated film.\"[56]Released on July 9, 2010, in the United States, Despicable Me opened at the number one spot at the box office and pulled in $56.3 million, making it the third biggest opening grossing for an animated film in 2010 behind Toy Story 3 and Shrek Forever After.[57] In its second weekend, the film dipped 42% to second place behind Inception with $32.8 million earned. The film then had another drop of 27% in its third weekend and finished in third place with $23.8 million. On August 5, 2010, the film crossed the $200 million mark, becoming the first Universal film to reach the milestone since 2007's The Bourne Ultimatum.[58]On the weekend lasting from September 3–5, 2010, it surpassed Shrek Forever After to become the second highest-grossing animated film of 2010 in the United States and Canada, behind Toy Story 3.[59] It was also the highest-grossing non-DreamWorks/non-Disney·Pixar animated film of all time in these territories, since overtaken by its sequel.[59] The film has made $251,513,985 in the United States and Canada as well as an estimated $291,600,000 internationally for a worldwide total of $543,010,705, against its $69 million budget.[4] This film is also Universal's sixth highest-grossing film (unadjusted for inflation)[60] and the tenth-highest-grossing animated feature of all-time in North America.[61] In worldwide earnings, it is the sixth biggest film of Universal Studios,[62] the fourth highest-grossing animated film of 2010 trailing Toy Story 3, Shrek Forever After, and Tangled, the 25th highest-grossing animated film of all time and the 9th highest-grossing film of 2010.[63]","box_office":"$543.1 million[4]","production_company":"Illumination Entertainment","directed_by":"Pierre Coffin Chris Renaud","Prequel":"A prequel feature film titled Minions, featuring the Minions as the main characters, was released on July 10, 2015.[78] Written by Brian Lynch, it is directed by Pierre Coffin and Kyle Balda, and produced by Chris Meledandri and Janet Healey.[78] The film, set in the 1960s, focuses on the Minions before they met Gru, where they compete for the right to become henchmen of an ambitious villain, Scarlet Overkill, voiced by Sandra Bullock.[79]","Music":"Despicable Me: Original Motion Picture Soundtrack is the soundtrack to the film of the same name, and it was released on July 6, 2010.[10] It featured new songs from the film written and performed by Pharrell Williams, and performances by Destinee & Paris, The Sylvers, Robin Thicke and the Bee Gees.[10]","release_dates":"June 19, 2010 (2010-06-19) (MIFF)[1][2]|July 9, 2010 (2010-07-09)||||","Production":"Despicable Me was originally developed by Sergio Pablos under the title Evil Me. He later participated in development during the early stages of the production.[8] In November 2008, Illumination Entertainment announced the beginning of the development on its first CGI animated film Despicable Me.[9]","produced_by":"Chris Meledandri John Cohen Janet Healy","starring":"Steve Carell|Jason Segel|Russell Brand|Kristen Wiig|Miranda Cosgrove|Will Arnett|Julie Andrews|","running_time":"95 minutes","Sequels":"A sequel, titled Despicable Me 2, was released on July 3, 2013. It is produced by the same team that was behind the first film - along with directors Pierre Coffin and Chris Renaud, and writers Cinco Paul and Ken Daurio. Steve Carell, Russell Brand, and Miranda Cosgrove reprise their roles; Kristen Wiig and Ken Jeong returned but voiced new characters. New cast members include Benjamin Bratt as Eduardo, Gru's nemesis, and Steve Coogan as Silas Ramsbottom.[76]On January 15, 2014, it was announced that a sequel, titled Despicable Me 3 will be released on June 30, 2017.[77]","music_by":"Heitor Pereira Pharrell Williams","edited_by":"Pamela Ziegenhagen-Shefland Gregory Perler","Release":"NBC (which is owned by Universal) had an extensive marketing campaign leading up to the film's release. Sneak peeks were shown in episodes of The Biggest Loser.[11] Despicable Me was also featured on Last Comic Standing when Gru comes in to audition.[11] IHOP restaurants promoted the film by introducing three new menu items, a kids' breakfast meal, and a drink all having the word \"minion\" in them.[12] Best Buy released a free smartphone application called \"Best Buy Movie Mode\", which translated what the Minions were saying during the end credits of the 3D theatrical release.[13] For the home media release of the film, the application was updated to translate the Minions' language throughout the entire film.[13]In May 2010, three books related to the movie were published, as well as the children's puppet book featured in the film. The first, My Dad the Super Villain (ISBN 0316083828), was rated as a preschool book.[14] The second, Despicable Me: The Junior Novel (ISBN 0316083801), was rated as being a Junior Reader for ages 8 to 12.[15] The third, Despicable Me: The World's Greatest Villain (ISBN 0316083771), was rated for ages 3–6 years.[16] The puppet book Sleepy Kittens (ISBN 031608381X) was written by Cinco Paul and Ken Daurio and illustrated by Eric Guillon.[17]A video game titled Despicable Me: The Game was released for the PlayStation 2, PlayStation Portable and Wii.[18] A Nintendo DS version was released under the name Despicable Me: Minion Mayhem.[19] Namco also released a version for the iPhone and iPad platform entitled Despicable Me: Minion Mania, developed by Anino Games.[20] An application for iOS and Androids was also released under the name Despicable Me: Minion Rush. It was developed by Gameloft and made available to the public in 2013.[21]Despicable Me was released on DVD, Blu-ray, and Blu-ray 3D on December 14, 2010. The release included three new short films, titled Home Makeover, Orientation Day and Banana.[22]","budget":"$69 million[4]"}