{"country":"United States","distributed_by":"American International Pictures","Plot":"After her prostitute mother and her john are clobbered to death with a hammer while they are asleep in bed, teenaged Ellie Masters (Melody Patterson) is sent to an isolated orphanage run by Mrs. Deere (Gloria Grahame) and her handyman, Tom Kredge (Len Lesser). Taking an avid interest in her welfare is detective Calvin Carruthers (Vic Tayback).Taking almost no interest at all, is social worker Harold Mullins (Milton Selzer) who is completely under Mrs. Deere's thumb. Unbeknownst to Ellie, Mrs. Deere and Tom are both brutal sadists, who run the orphanage like a concentration camp and the strong possibility that her mother's hammer-wielding killer is now stalking her. The night before Ellie's arrival, Ernest, one of the orphans, attempts to escape, but is chased into the woods by Kredge, who chops off his hand and leaves him to bleed to death.Ellie becomes acquainted with the other orphans, including Bunch (Terri Messina), a sixteen-year-old; Pete (Dennis Christopher); and Walter, whom Ellie is immediately attracted to. While exploring the orphanage, Ellie happens upon an infirmary, but is quickly escorted out. Unbeknownst to her, the bodies in the beds are actually corpses of former residents whom Mrs. Deere and Kredge keep in a freezer in the basement, and have posed in the beds when Mr. Mullins visits for a headcount; Mrs. Deere also keeps the corpse of her dead husband in the freezer, whom she removes on occasion for company.Mrs. Deere takes an immediate disliking toward Ellie, prompting Ellie to make a plan to run away and find her father; Kredge tells her he will help her leave, and asks her to meet him in the basement, where he attempts to rape her. Mrs. Deere interrupts and stops him. That night, Ellie awakens to a masked figure standing over her with a hammer. After stumbling in on Walter and Bunch in bed together, Ellie attempts to run away, but is locked in the basement by Kredge.When Mullins inquires about missing children and threatens to involve the police, Kredge and Mrs. Deere murder him and bring his body down to the freezer. The masked figure appears and kills Kredge; amidst the chaos, Ellie manages to escape, and the masked figure chases after her. Mrs. Deere drags Kredge's body into the freezer, but is locked inside by one of the orphan girls. Ellie flees into the woods, where she discovers Ernest's corpse. The masked figure confronts her, and removes the mask. He reveals himself to be Detective Carruthers. Ellie begs him to spare her, and he agrees to on the condition that she take his hand in marriage. She agrees, and Carruthers admits to Ellie that her mother had lost her virginity to him. As she realizes she's agreed to marry her father, Ellie laughs hysterically.","language":"English","cinematography":"Paul Hipp","directed_by":"Philip S. Gilbert","Home media":"Blood and Lace did not receive a home media release in the United States on either VHS or DVD. The film received a Blu-ray release from Shout! Factory on November 24, 2015, marking the film's first North American home media release in history.[1]","release_dates":"March 17, 1971 (1971-03-17)|||||","Production":"Blood and Lace was shot in 1970 in Los Angeles, California on a budget of $200,000[1] with the exterior forest scenes being shot in Runyon Canyon, which at the time was private property.[1] The house featured in the film as the Deere Orphanage was empty at the time of filming.[2] Star Melody Patterson was quoted as saying the production was enjoyable, as well as lauding Gloria Grahame's presence on-set.[3]Given the film's minuscule budget, the filmmakers utilized music and sound effects from free library archives, resulting in compositions and sonic elements reminiscent of 1950s and '60s horror and monster movies.[1] The film bore the working title The Blood Secret, which appears on the original print of the film.[1] It was, however, changed to Blood and Lace upon its theatrical release.","produced_by":"Ed Carlin Gil Lasky Chase Mishkin (associate producer)","starring":"Gloria Grahame Melody Patterson Milton Selzer Len Lesser Vic Tayback Dennis Christopher","running_time":"87 minutes","Significance":"Although largely decried by critics upon its release, Blood and Lace developed a cult following through its presence as a regular drive-in bill as well as through television syndication in the late 1970s.[1][3] The film's opening scene, which features a POV shot of the killer wielding a hammer while ascending the stairs and entering a bedroom has been oft compared to the opening shot of John Carpenter's Halloween (1978).[7] Fangoria has credited the film as being one of the first American \"proto-slasher films,\" predating Halloween, Black Christmas (1974), and The Texas Chain Saw Massacre (1974).[8]","edited_by":"Marcus Tobias","Release":"Blood and Lace was released on March 17, 1971 in the United States, and became a regular at drive-in theaters on double bills with other horror films.[1] It was paired with such films as Curse of the Crimson Altar (1968), Horror House (1970), Count Yorga, Vampire (1970), House of Dark Shadows (1970), Circus of Horrors (1960),[1] and Murders in the Rue Morgue (1971).[4] Many drive-ins also screened the film alongside an array of Vincent Price films.Upon its release, Blood and Lace was considered to be one of the \"sickest\" films to receive a GP rating (precursor to the PG rating), which allowed audience members of all ages to attend.[3] This was attributed to the film's exhibition of graphic murder scenes, namely the clawhammer murder scene at the beginning of the film. In retrospect, Melody Patterson said that she had \"never considered the film that gory because the effects were so bad. Even Vic Tayback's mask that he wears running around was phony looking.\"[3]The film received mostly negative critical reception.[1] The New York Times said of the film: \"There's a good deal of blood and a minimum of logic, or lace for that matter, in \"Blood and Lace,\" which was exposed in local theaters yesterday, to illustrate, we assume, that horror can be both vague and silly... [it is] a low-grade exercise in shadows, screams, traumas and slayings that are largely more laughable than shocking.\"[5] The New York Post said: \"The story manages to keep you guessing all the way to its macabre end, if you can stand it that long.\"[1] Ann Guarino of The New York Daily News said \"The cast tries to bring believability to the plot, but the audience couldn't help laughing in the wrong places.\"[6] The Motion Picture Guide gave the film a middling review, stating that it \"manage to keep some tension despite murky photography and muddy sound.\"[2]","written_by":"Gil Lasky","budget":"$200,000[1]"}