{"based_on":"A Soldier's Play  by Charles Fuller","a_soldier's_story":"Theatrical release poster","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Charles Fuller","Plot":"The time is 1944 during World War II. Vernon Waters (Adolph Caesar), a platoon sergeant of a unit of black soldiers, is very drunk and staggering along a road along Fort Neal, a segregated Army base in Louisiana. Waters' last words amidst his raucous laughter were \"They still hate you! They still hate you!\" before he is shot to death with a .45 caliber pistol.When Waters' body is found the next day, Captain Richard Davenport (Howard E. Rollins, Jr.), a black officer from the Judge Advocate General is sent to investigate, against the wishes of commanding officer Colonel Nivins (Trey Wilson). While the general consensus is that he was killed by local members of the Ku Klux Klan, others are doubtful, having heard that Waters' stripes and insignia were still on his uniform and aware that the Klan's typical M.O. is to remove them before lynching their victims.From the outset, Davenport is faced with obstacles. Colonel Nivins will only give him three days to conduct his investigation. Even Captain Taylor (Dennis Lipscomb), the one white officer in favor of a full investigation, is uncooperative and patronizing, fearing that a black officer will have little success in catching those responsible. While some black soldiers are happy and proud to see one of their own race wearing captain's bars, others are distrustful and evasive.Davenport learns that Waters' platoon was officially part of the 221st Chemical Smoke Generator Battalion and while eager to serve their country overseas, they are often assigned menial jobs in deference to their white counterparts. However, most are former baseball players from the Negro Leagues and grouped as a platoon in order to play ball, a task that gives them a good deal of popularity and triumph playing against white soldiers, and there is even talk of the platoon playing against the New York Yankees in an exhibition game.James Wilkie (Art Evans), a fellow sergeant whom Waters recently demoted to private for being drunk on duty, initially portrays Waters as a strict \"spit-and-polish\" disciplinarian but also a just, good-natured NCO who got on well with the men, especially the jovial and well-liked C.J. Memphis (Larry Riley). But as Davenport probes deeper, he uncovers Waters' true tyrannical nature and his disgust with his fellow black soldiers, particularly those from the rural South.An interview with Private Peterson (Denzel Washington) revealed how he stood up to Waters when he berated the men after another winning game. In retaliation, the sergeant challenged Peterson to a fight and beat him badly. Davenport then learns through interviews with other soldiers how Waters charged C.J. with the murder of a white MP, after a search conducted by Wilkie turned up a recently discharged pistol under C.J.'s bunk. Confronting him with the evidence, Waters provoked C.J. into striking him, whereupon the weapons charge was dismissed and C.J. was then charged with striking a superior officer.When C.J.'s best friend Bernard Cobb (David Alan Grier) visits him in jail, C.J. is suffering from intense claustrophobia and tells Cobb of a visit from Sgt. Waters, who admitted freely to C.J. that it was a set-up and that Waters had done it at least five times before to others like him, saying \"the Black race can't afford you no more...the day of the Geechee is gone, boy. And you're going with it.\" When Davenport asked Corporal Cobb what happened to C.J., he is told that the man hanged himself in his cell while awaiting trial. In protest, the platoon threw the last game of the season, while Waters was left profoundly shaken by the suicide.Davenport then finds out that two white officers coming from a military exercise, Captain Wilcox (Scott Paulin) and Lieutenant Byrd (Wings Hauser), had an altercation with the drunk sergeant a short time before his death. When questioned, both officers admit to physical assault when confronted by Waters on a drunken tirade, but deny killing him, revealing that they had not been issued .45 ammunition for the exercise as it was in short supply and it was reserved for MPs and soldiers on special duty. Though Taylor is convinced that Wilcox and Byrd are lying and is eager to arrest them, Davenport releases them.While a search has begun for Privates Peterson and Smalls who have both gone AWOL, Davenport questions Wilkie once more, and the demoted private is forced to admit that he planted the gun under C.J.'s bunk on Waters' orders. Though he hid it from everyone, Waters divulged in private to Wilkie his intense hatred of C.J. and others like him whom Waters felt were an unwelcome weight on the Black race. Davenport then asks why Waters didn't go after Peterson since they had the fight, and Wilkie tells him that Waters liked Peterson because he fought back and was planning to promote him. Davenport has Wilkie placed under arrest just as an impromptu celebration has begun outside after learning that the platoon is to be shipped out to join the fight overseas.Realizing that Peterson and Smalls were on guard duty the night of Waters' murder, and thus had been issued .45 ammunition for their pistols, Davenport interrogates Smalls after he has been found by the MPs and Smalls confesses that it was Peterson who killed Sergeant Waters, as revenge for C.J. When Peterson is captured and brought into the interrogation room, he confesses to the murder, saying \"I didn't kill much. Some things need getting rid of.\"The film ends with Taylor congratulating Davenport on getting his man and admitting that he will have to get used to Negroes being in charge. Davenport assures Taylor that he'll get used to it. \"You can bet your ass on that,\" he adds, as the platoon marches in preparation for their deployment to the European Theater.","language":"English","Reception":"The film holds an 89% rating on Rotten Tomatoes from a sample of 18 critics.","box_office":"$21,821,347[1]","cinematography":"Russell Boyd","production_company":"Columbia Pictures","directed_by":"Norman Jewison","release_dates":"September 13, 1984 (1984-09-13)|||||","Production":"Jewison and many of the cast members worked for scale or less under a tight budget with Columbia Pictures. \"No one really wanted to make this movie... a black story, it was based on World War II, and those themes were not popular at the box office\", according to Jewison. Warner Bros. turned it down, as did Universal's president, Ned Tanen, and UA and MGM followed suit. Columbia's Frank Price read the screenplay and was deeply interested, but the studio was hesitant about its commercial value, so Jewison offered to do the film for a $5 million budget and no salary. When the Directors Guild of America insisted he must have a fee, he agreed to take the lowest possible amount. The film ended up grossing $22.1 million.[3]Howard E. Rollins, Jr. had just received an Oscar nomination for his role in Ragtime and was cast as the lead. Most of the cast came from Broadway careers, but only Adolph Caesar, Denzel Washington, and William Allen Young appeared in both the movie and the original off-Broadway play with the Negro Ensemble Company in the New York version.A Soldier's Story was shot entirely in Arkansas. The \"Tynin\" exterior scenes were shot in three days in Clarendon. The baseball sequence was filmed in Little Rock at the historic Lamar Porter Field.[4]Bill Clinton (then Governor of Arkansas) dropped by during the shooting. He became very enthused about the project and later helped by providing the Arkansas Army National Guard in full regalia for a grand scene, since Jewison could not afford to pay an army of extras. Production was completed with their help at Fort Chaffee United States Army Ready Reserve base at Fort Smith (where Elvis Presley entered the military and received his first military haircut).","produced_by":"Norman Jewison","starring":"Howard E. Rollins, Jr.|Adolph Caesar|","running_time":"101 minutes","music_by":"Herbie Hancock","edited_by":"Caroline Biggerstaff Mark Warner","Musical score":"Herbie Hancock delivered an interpretative impromptu score. Patti Labelle and Larry Riley, who plays guitar, wrote and performed their own songs. The blues played a large role in the film's music.Unfortunately there was no known consideration given to the production of an official soundtrack due to the aforementioned budgetary restraints—this, despite the film's relative box office success."}