{"country":"United Kingdom","Plot":"The marriage of English country gentleman Tony Last and his wife Brenda is falling apart as Brenda begins an affair with social climber John Beaver. When the Last's eight-year-old son John Andrew is killed in a riding accident, Brenda informs Tony of her affair and her wishes for a divorce so she can marry Beaver. Tony is shattered, but initially agrees and intends to provide her with £500 a year. Beaver and his mother have pressed Brenda to demand £2,000 a year. This amount would require Tony to give up Hetton Abbey, his beloved Victorian/Gothic style house and estate. After determining that Brenda is aware that he would have to give up the estate, and knowing as she does how much he loves his home, he withdraws from the divorce arrangements, and announces that he intends to travel for six months. On his return, he says, Brenda may have her divorce, but without any financial settlement.Without the divorce settlement, Beaver loses interest in Brenda. She is reduced to poverty and Beaver leaves with his mother for California. Tony joins an explorer on an expedition in search of a supposed lost city in the Brazilian forest. The expedition fails and Tony is the last survivor. He is rescued by Mr Todd, a settler who rules over a small community in an inaccessible part of the jungle. The illiterate Mr Todd has a collection of the novels of Charles Dickens which Tony reads to him. When Mr Todd continues to demur in helping Tony return to civilization, Tony realises he is being held against his will. A search party finally reaches the settlement, but Todd has arranged for Tony to be drugged and hidden; he tells the party that Tony has died, and gives them his watch to take home. When Tony awakes he learns that his hopes of rescue have gone, and that he is condemned to read Dickens to his captor indefinitely. Back in England, Tony's death is accepted; Hetton passes to his cousins, who erect a memorial to his memory, while Brenda resolves her situation by marrying Tony's friend Jock Grant-Menzies.","language":"English","Reception":"The film received a rating of 46% according to Rotten Tomatoes.[4]Roger Ebert of the Chicago Sun-Times gave the film three out of four stars and observed, \"This is a peculiar movie, but a provocative one. The performances imply more than the dialogue explains, and there are passages where we cannot quite believe how monstrously the characters are behaving... \"A Handful of Dust\" has more cruelty in it than a dozen violent Hollywood thrillers, and it is all expressed so quietly, almost politely.\"[5]Vincent Canby of the New York Times praised Angelica Huston's portrayal of Mrs Rattery as the \"single most stunning performance\" but called the film \"both too literal and devoid of real point.\"[6]","a_handful_of_dust":"US Film poster","box_office":"$1,560,700[1]","directed_by":"Charles Sturridge","release_dates":"24 June 1988 (1988-06-24)|||||","produced_by":"Derek Granger","starring":"James Wilby|Kristin Scott Thomas|Rupert Graves|Anjelica Huston|Judi Dench|Alec Guinness|","running_time":"118 minutes","music_by":"George Fenton","written_by":"Tim Sullivan, Derek Granger, and Charles Sturridge; based on the novel by Evelyn Waugh"}