{"country":"Australia","screenplay_by":"Geoffrey Atherden","language":"English","Synopsis":"BabaKiueria revolves around a role-reversal, whereby it is Aboriginal Australians who have invaded and colonised the fictitious country of BabaKiueria, a land that has long been inhabited by white natives, the BabaKiuerians.The opening scene depicts a group of Aboriginal Australians in military uniforms coming ashore in a land they have not previously been to. In this land, they discover a number of European Australians engaged in stereotypical European Australian activities. The Aboriginal Australian explorers approach the group and the expedition's leader asks them, \"What do you call this place\"? One of the Europeans replies, \"Er... 'Barbecue Area'\".After around 200 years of Aboriginal occupation, white Australians have become a minority. Aboriginal people have assumed power, taken all of the available land and have mostly confined whites to suburban ghettos. They are expected to follow the laws and customs of the colonisers and their lifestyle is seen through the patronizing eyes of the majority culture. The latest manifestation of this is in a 'documentary' presented by Duranga Manika (Michelle Torres).[1][2][3]The remainder of the film follows Duranga Manika as she observes how white people are disempowered through poverty, are treated unfairly by the police - often with brutality and indifference, experience arbitrary dispossession, government inaction on white issues, white tokenism, white children being taken from their families only to be taught the values of the majority culture and white people being relocated because the government needs their home for \"something\". White people are now often characterized by society and in the media as lazy, unintelligent and untrustworthy and anyone who protests about the current circumstances is labeled as a 'troublemaker'. White rituals and cultural values are derided and dismissed as violent and meaningless. The BabaKiuerian government's paternalistic policies are defended by Wagwan, the Minister for White Affairs (Bob Maza) who was based on the then Premier of Queensland, Sir Joh Bjelke-Petersen.[1][2][3][4][5]The inversion of reality in BabaKiueria highlights the unfairness of Australia's past and present Aboriginal policies and the entrenched racism in society. This subversion of normality allows viewers to see what is wrong when one group tries to control and dominate another and questions the fairness of the current power structure in Australia.[5]","cinematography":"Julian Penney","directed_by":"Don Featherstone","release_dates":"1986","Production":"Much of BabaKiueria was filmed on location, including the Anzac March and the 'Ritual of Violence' (AFL Game). It was screened in the Australian Museum for many years.[4]","produced_by":"Julian Pringle","starring":"Michelle Torres|Bob Maza|Kevin Smith|","running_time":"29:00","music_by":"Peter Crosbie","edited_by":"Michael Honey","Impact and Reception":"Babakiueria has been used at times to educate police officers.[6]After it was screened at the Message Sticks Festival in 2012, Mahjid Heath noted that \"issues we were struggling with in the early 80's are still relevant and still define the political and national discourses today.\"[7]"}