{"based_on":"Characters  by Danilo Bach and Daniel Petrie, Jr.","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Larry Ferguson|Warren Skaaren|","story_by":"Eddie Murphy|Robert D. Wachs|","Plot":"Three years after the events of the first film Beverly Hills Police Captain Andrew Bogomil, Detective Billy Rosewood, and Sergeant John Taggart are trying to figure out who is behind the \"Alphabet Crimes,\" a series of mostly high end store robberies distinguished by their monogrammed envelopes with an alphabetical sequence the assailants leave behind. Complicating matters is the new \"political\" state of the Beverly Hills Police Department, headed by incompetent and verbally abusive new police chief Harold Lutz, who is doing everything he can to stay on Mayor Ted Egan's good side. Unimpressed when Rosewood calls the FBI to help solve the case, Lutz holds Bogomil responsible as commanding officer and suspends him, despite Bogomil's efforts to convince him that Rosewood was only following a hunch. Lutz also punishes Taggart and Rosewood by placing them on traffic duty. On the way home, Bogomil is shot and injured by Karla Fry, the chief hench-woman of Maxwell Dent, who secretly is the mastermind behind the Alphabet Crimes. Finding out about the shooting by a news report, Axel Foley abandons his current undercover duties and immediately flies out to Beverly Hills to help find out who shot Bogomil. Taggart and Rosewood agree to assist Axel because of Lutz's attempts to find an excuse to get them fired.Posing as an undercover FBI agent to get past Lutz with the aid of Detective Jeffrey Friedman, Axel soon starts making the connection between the robberies and Dent. He first finds out that the ammunition fired at one of the robberies was designed by Charles Cain, the manager of a gun club owned by Dent. Axel has Bogomil's daughter Jan use her connections as an insurance agent to find out about Dent's financial dealings. Dent is robbing his own businesses on purpose in order to finance firearms transactions with an arms dealer named Nikos Thomopolis and is discreetly using Cain as the front man for his operations. Bogomil was shot because his investigation was on the correct track into the case.Having foiled a robbery attempt at a bank depot, Axel is able to trick Dent's accountant Sidney Bernstein into using his computer and discovers that Dent and Karla are planning to leave the country. Axel also learns from Jan that all of Dent's businesses have had their insurance coverage canceled and are about to go bankrupt except his race track, which he is convinced is the next target. On the way to the race track, Axel solves the latest riddle sent to the police, and is convinced that this riddle was made easily solvable in order to implicate Cain as the Alphabet Bandit. However, Axel knows Cain is a patsy designed to throw the authorities off Dent's trail.The three arrive too late to stop the robbery and find Cain, shot by Karla, among those killed. While Lutz announces publicly that the Alphabet Crimes have been solved, Axel notices some red mud at the stables, which leads him, Taggart and Rosewood to Dent's oil field, where Dent is making his final arms deal with Thomopolis. The three get into a shootout with everyone involved in the deal. Dent confronts Axel in the warehouse, but Axel gets distracted by one of Dent's henchmen on the roof above him and Dent gets away. Dent then crashes through the wall in his car and Axel shoots Dent through the windshield, sending his car down a hill and erupting in flames, after running Axel over. Karla appears and is about to kill Axel, but is shot dead by Taggart.Just as the last thugs are about to flee, the police arrive upon the scene and arrest the rest of Dent's thugs and Thomopolis. Lutz and Mayor Egan arrive at the scene. Lutz tries to fire Rosewood and Taggart for their insubordination, and also tries to arrest Axel. However, both Taggart and Rosewood stand up to Lutz this time and prove that Dent was the real Alphabet Bandit and the rest of the alphabet crimes were about an arms deal. They are also able to convince Mayor Egan of Lutz's incompetence, (since Lutz would've gotten in the way had he known about their activities, due to his intentionally ignoring the truth from other cops) and the Mayor personally fires Lutz because he is tired of his abusive attitude towards his own men.Mayor Egan chooses Bogomil to replace Lutz as the new Police Chief. Axel returns to Detroit, but not before he gets chewed out by Inspector Todd over the phone, after Egan called Todd to congratulate him on allowing Axel to assist them on this case.","beverly_hills_cop_ii":"Theatrical release poster","language":"English","Reception":"Beverly Hills Cop II was one of the most anticipated films of 1987 and became a box office success upon release, despite not making as much as Beverly Hills Cop.[5][6] The film debuted at No. 1, earning $33 million on its opening weekend, a sales mark that would result in its being that year's highest-opening weekend debut. Beverly Hills Cop II made approximately $153,665,036, becoming the third biggest hit domestically at the box office that year, after Fatal Attraction and Three Men and a Baby, and the second highest-grossing film worldwide that year, behind Fatal Attraction.[7]The film received mixed reviews from critics. On Rotten Tomatoes, the film has a 46% \"rotten\" rating, based on 26 reviews, with an average rating of 4.9/10. The site's critical consensus reads, \"Eddie Murphy remains appealing as the wisecracking Axel Foley, but Beverly Hills Cop II doesn't take him – or the viewer – anywhere new enough to justify a sequel\".[8] On Metacritic, the film has a score of 48 out of 100, based on 11 critics, indicating \"mixed or average reviews\".[9]Desson Howe of The Washington Post called it \"a sequel that's as good as the original, if not better.\"[10] Roger Ebert gave the film one star out of four and wrote, \"What is comedy? That's a pretty basic question, I know, but Beverly Hills Cop II never thought to ask it.\"[11] Janet Maslin of The New York Times wrote that the film is a skillful clone of the first film that can't match that one's novelty or excitement.[12] Variety called it \"a noisy, numbing, unimaginative, heartless remake of the original film.\"[13] Sheila Benson of the Los Angeles Times wrote, \"It's hard to believe that the group who came up with the hard, clean edges of Top Gun, sleek and unfeeling though it may have been, could make a picture as crude, as muddled, as destructo-Derbyish as this one.\"[14]NominationsAwards","box_office":"$300 million[3]","cinematography":"Jeffrey L. Kimball","directed_by":"Tony Scott","Soundtrack":"The song \"Hold On\" as sung by Keta Bill plays during the scene wherein Axel, Rosewood, and Taggart confront Dent at the Playboy Mansion. However, the film's soundtrack CD released by MCA Records includes only a different song entitled \"Hold On,\" sung by Corey Hart. This song has different music and slightly altered lyrics. The film introduced George Michael's controversial song \"I Want Your Sex\". It also includes \"Cross My Broken Heart\" by The Jets (a Top 10 hit on the Billboard Hot 100) and \"Shakedown\" by Bob Seger (which became a No. 1 hit on that same chart), as well as \"Better Way\" performed by James Ingram. The Pointer Sisters scored a moderate hit with \"Be There,\" their single from the soundtrack. It was the second time the sisters had contributed to the Beverly Hills Cop franchise; they'd notched a top 10 single with \"Neutron Dance\" from the Beverly Hills Cop soundtrack. As with the first film, none of Harold Faltermeyer's soundtrack score has ever been released. However, Faltermeyer's 1988 album, Harold F, includes a song called \"Bad Guys\", which is used as part of the film's score—an instrumental section of the song plays during the opening jewelry store robbery scene, and also during several other scenes throughout the film.The soundtrack debuted at No. 8 on the Billboard charts and spent 26 weeks on the charts, a far cry compared to the 49 weeks spent by the first film's soundtrack. Despite this, one song from the album, \"Shakedown\", was nominated for an Academy Award and the Golden Globe Award for Best Original Song. However, another song from the album, \"I Want Your Sex\", won the Razzie Award for Worst Song.","production_companies":"Simpson/Bruckheimer Overbrook Entertainment","release_dates":"May 20, 1987 (1987-05-20)|||||","Production":"Paramount Pictures had planned a television series based on the first film. Murphy turned down the series but was willing to do a sequel.[4] Producers Simpson and Bruckheimer hired Tony Scott to direct due to his success with the 1986 blockbuster film Top Gun. The film was originally to be set and filmed in London and Paris; however, the script was re-written after Murphy expressed a reluctance to film outside the United States.[citation needed]","produced_by":"Don Simpson|Jerry Bruckheimer|","starring":"Eddie Murphy|Judge Reinhold|Jürgen Prochnow|Ronny Cox|John Ashton|Brigitte Nielsen|Allen Garfield|Dean Stockwell|Paul Reiser|","running_time":"103 minutes[1]","music_by":"Harold Faltermeyer","edited_by":"Chris Lebenzon|Michael Tronick|Billy Weber|","budget":"$20 million[2]"}