{"country":"United States","distributed_by":"Columbia Pictures","big_daddy":"Theatrical release poster","Plot":"Sonny Koufax (Adam Sandler) is an unreliable, unmotivated bachelor who lives in New York City and has declined to take on adult responsibility. He has a degree in law but has chosen not to take the bar exam since he was awarded $200,000 in a vehicle accident compensation 2 years prior, and lives off his restitution. He works one day a week as a tollbooth attendant, both in rebellion towards his father in whose footsteps he refuses to follow and because he enjoys his free and unburdened life.Finally having enough of Sonny's refusing to grow up, his girlfriend, Vanessa (Kristy Swanson), tells Sonny that she is going to break up with him unless he can prove to her that he can be a responsible adult. His roommate, Kevin Gerrity (Jon Stewart), decides to ask his podiatrist girlfriend Corinne (Leslie Mann) to marry him the day before he is leaving for China for his law firm. Sonny constantly teases Corinne, especially about her former occupation as a Hooters' waitress.Sonny awakens to find five-year-old Julian (Cole Sprouse and Dylan Sprouse) abandoned at his and Kevin's apartment, with a written explanation that Julian's mother is now declining to care further for Julian, and that Kevin is his biological father. Kevin denies fatherhood to Julian, and Sonny offers to handle it until he returns from China. Sonny poses as Kevin, intending to use Julian as a means to win Vanessa back. However, when Sonny introduces Julian to Vanessa, he finds out that she has already moved on and is now dating a much older man, Sid (Geoffrey Horne), who seems more mature and career-oriented, even having a \"5-year plan\".Sonny then takes Julian to his social worker, Arthur Brooks (Josh Mostel), telling him that Julian should return to his mother. Brooks tells Sonny that Julian's mother had died of cancer, thus explaining why she sent Julian to be with Kevin. He tells Sonny that they could take Julian, but he would have to live in a group home/orphanage. Sonny offers to keep Julian temporarily until Brooks finds a foster home for Julian. Sonny then calls his father, Lenny (Joseph Bologna), who is one of Florida's most respected lawyers, and is berated upon informing his father of his situation. After a conversation with Julian, Sonny decides to raise Julian his own way, giving Julian options instead of orders to let Julian decide for himself, all while teaching Julian new things such as baseball and pro wrestling. Julian also helps Sonny get a potential new girlfriend in Layla (Joey Lauren Adams), Corinne's sister, who is also a lawyer.Soon, Brooks leaves messages for Sonny, having found a foster home for Julian, and becomes concerned when unable to contact Sonny. Later, at a meeting at Julian's school, the teacher tells Sonny that Julian has taken up many bad habits of Sonny's, which causes him to rethink his parenting methods. He is able to turn himself and Julian around, but then Brooks arrives, having learned that Sonny has been posing as Kevin. He orders Sonny to surrender Julian to social services to avoid arrest. Sonny reluctantly gives Julian up and then promptly arranges a court case to determine Julian's future.In court, with himself and Layla as his counsel, numerous people that Sonny knows testify, telling the judge that he is a suitable father. Even Corinne, who harbors a deep hatred for Sonny, admits that he cares for Julian. Julian testifies as well, revealing relevant information regarding his original heritage. As a final straw, Sonny calls himself to the stand and asks his father, who is attending as well, to question him. Despite Lenny's gruff assertion that Sonny is not father material, Sonny quietly tells Lenny that the only reason he is doing this is because Lenny is scared that Sonny will fail. Sonny assures him that he will not fail, because he loves Julian the same way Lenny loves him. Moved by Sonny's sincerity, Lenny vouches for Sonny as well.Nonetheless, the judge is unconvinced and orders Sonny's arrest. Kevin, who connects Julian's testimony with a drunken fling he had during the 1993 World Series, realizes that he is Julian's biological father, apologizes to Corinne, and insists they drop the charges; custody is granted to Kevin (pending DNA results). Julian tearfully hugs Sonny, wanting Sonny to be his father. Sonny promises Julian that he will always be his friend and he will always consider Julian part of his family. With that Sonny hands Julian off to Kevin, watching the two slowly start to bond.One year, three months, and six days later, Sonny is revealed to have turned his life around. He is now a successful lawyer, is married to Layla, and they have a child of their own. He is related to Kevin, Julian, and even Corinne. Since he is Julian's uncle and Corrine adopted Julian. At Sonny's surprise birthday party at a Hooters restaurant, Sonny finds Vanessa working there as a waitress, with Sid working as a cook, revealing that Sid's \"five-year-plan\" has gone awry.","language":"English Italian","box_office":"$234.8 million[1]","cinematography":"Theo van de Sande","production_company":"Out of the Blue... Entertainment Jack Giarraputo Productions","directed_by":"Dennis Dugan","Soundtrack":"The film won a BMI Film Music Award.[citation needed] The soundtrack included the following:","release_dates":"June 25, 1999 (1999-06-25)","produced_by":"Allen Covert Adam Sandler Robert Simonds Jack Giarraputo","starring":"Adam Sandler Joey Lauren Adams Jon Stewart Rob Schneider Cole Sprouse Dylan Sprouse Leslie Mann Steve Buscemi Kristy Swanson Josh Mostel","running_time":"93 minutes","music_by":"Teddy Castellucci","edited_by":"Jeff Gourson","Release":"Big Daddy received generally mixed reviews from critics. On Rotten Tomatoes the film had an 40% rating by the critics.[3] The Rotten Tomatoes consensus says \"Adam Sandler acquits himself admirably, but his charm isn't enough to make up for Big Daddy's jarring shifts between crude humor and mawkish sentimentality.\" The film received a score of 41% on Metacritic.[2]The film won the People's Choice Awards for Favorite Comedy Motion Picture in 2000. At the 20th Golden Raspberry Awards, Big Daddy was nominated for five trophies including Worst Picture, Worst Director for Dennis Dugan, Worst Screenplay, and Worst Supporting Actor for Rob Schneider, with Adam Sandler winning Worst Actor.[4]","written_by":"Steve Franks Tim Herlihy Adam Sandler","budget":"$34.2 million[1]"}