{"based_on":"Dawn of the Dead  by George A. Romero","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"James Gunn","Comparisons to the original":"In the original film, the zombies moved very slowly and were most menacing when they collected in large groups. In the remake, the zombies are fast and agile. Many admirers of the original, as well as Romero himself, protested this change, feeling that it limited the impact of the undead.[24] This is somewhat borne out by the fact that the remake has almost no close-up shots of zombies that last more than a second or two. Snyder mentions this in the commentary track of the remake's DVD, pointing out that they seem too human when the camera lingers upon them for longer. However, it was for this change that Wizard Magazine ranked the zombies #5 on their \"100 Greatest Villains Ever\" list.The original had a smaller cast than the remake, allowing more screen time for each character. Many fans and critics criticized the resulting loss of character development.[25]In the original version, the story unfolds over several months, indicated by the advancing stages of Fran's pregnancy. In the remake, the events transpire within approximately one month, as evidenced by the supplemental feature The Lost Tape: Andy's Terrifying Last Days Revealed, located on the DVD in the special features section. Another big change from the original is that unlike Romero, Snyder treats zombification more like a disease, pointing to the bites as the source, instead of anyone who is dead turning into a zombie.Three actors from the original film have cameos in the remake, appearing on the televisions the survivors watch: Ken Foree, who played Peter from the original, plays an evangelist who asserts that God is punishing mankind; Scott H. Reiniger, who played Roger in the original, plays an army general telling everyone to stay at home for safety; and Tom Savini, who did the special effects for many of Romero's films and played the motorcycle gang member Blades in the original Dawn of the Dead, plays the Monroeville Sheriff explaining the only way to kill the zombies is to \"shoot 'em in the head\". Monroeville is also the location of the mall used in the 1978 film. In addition, a store shown in the mall is called \"Gaylen Ross\", an obvious tribute to actress Gaylen Ross, who played Francine in the original film.Writing in The Zombie Encyclopedia, Volume 2, academic Peter Dendle said that the original film \"served as a bridge between the talky, slow-paced 1970s horror and the fast-paced splatter to come in the 1980s\", whereas the 2004 remake \"generally forsakes slow-mounting suspense in favor of frenetic action\".[26]","Plot":"After a long shift, nurse Ana returns to her suburban neighborhood and her husband, Luis. Caught up in a date night, they miss an emergency news bulletin. The next morning, a neighborhood girl enters their bedroom and kills Luis, who immediately reanimates as a zombie and attacks Ana. She flees in her car but crashes and passes out. Upon waking, Ana joins with Police Sergeant Kenneth Hall, salesman Michael, petty criminal Andre and his pregnant wife Luda. They break into a nearby mall and are attacked by a zombified security guard, who bites Luda. They are confronted by three mall guards — C.J., Bart, and Terry. The guards make them surrender their weapons in exchange for refuge. They split into groups to secure the mall and then go to the roof. They see another survivor, Andy, stranded in his gun store across the parking lot.The next day, a truck carrying survivors enters the lot, pursued by zombies. C.J. and Bart refuse to let the survivors in, but are overruled and disarmed. The newcomers include Norma, Steve Marcus, Tucker, Monica, Glen, Frank and his daughter, Nicole. A sick woman is wheeled inside by wheelbarrow, only to die, reanimate and be killed. The group determines that the infection is passed by bites. Andre leaves to see Luda, who has kept her bite hidden from the group. They realize that Frank has been bitten and is a potential threat. Frank elects to be isolated. When he dies and turns, Kenneth shoots him.Over time, Kenneth and Andy start communicating by writing messages on a whiteboard. Romance buds between Ana and Michael and between Nicole and Terry. One day, the power goes out. CJ, Bart, Michael, and Kenneth enter the parking garage to activate the emergency generator and find a friendly dog inside. Zombies attack and kill Bart, forcing the others to retreat after setting the zombies on fire. Meanwhile, a zombified Luda - tied up by Andre - gives birth as Norma checks on the couple. Horrified, Norma kills Luda. Andre snaps; they exchange gunfire and both are killed. The others arrive to find a zombie baby, which they kill immediately.Concluding that staying in the mall is not a long-term choice, the group decides to escape. They plan to get to the local marina and travel on Steve's yacht to an island on Lake Michigan. They reinforce two shuttle buses in the parking garage and pack weapons and provisions on them. They also plan to pick up Andy. They strap food and a walkie-talkie onto the dog, Chips, and lower him into the parking lot. Chips gets into Andy's store safely, but a zombie follows through the dog door. Nicole, worrying about Chips, crashes the truck into the gun store and is trapped by a zombified Andy. Kenneth, Michael, Tucker, Terry, and C.J. reach the gun store via the sewers and kill Andy, rescuing Nicole. They grab ammunition and go back to the mall. When Tucker falls and breaks his legs, C.J. mercy kills him. Once inside, they are unable to lock the door, forcing a premature evacuation.Everyone boards the buses. When fighting the horde, Glen loses control of a chainsaw, accidentally killing himself and Monica. Blood splatters on the windshield, causing the bus to crash. Surviving the crash, Steve is killed by a zombie. While several others looks for survivors, Ana kills undead Steve and retrieves his boat keys. After taking the remaining bus to the marina, C.J. sacrifices himself so the others can escape. Michael reveals a bite wound and kills himself as Ana, Kenneth, Nicole, Terry, and Chips flee on the yacht.The movie ends with footage from Steve's camcorder. It shows the group running out of supplies before finally arriving at an island. There, they are pursued by a swarm of zombies. The camcorder is dropped, recording dozens of zombies chasing them, unfortunately leaving their fate unknown.","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 75% of 180 surveyed critics gave the film a positive review; the average rating is 6.7/10. The site's consensus reads: \"A kinetic, violent and surprisingly worthy remake of George Romero's horror classic that pays homage to the original while working on its own terms.\"[9] Metacritic rated it 58/100 based on 32 reviews.[10]Roger Ebert said the film \"works and it delivers just about what you expect when you buy your ticket\" but felt that it \"lacks the mordant humor of the Romero version\" and the \"plot flatlines compared to the 1979 version, which was trickier, wittier and smarter.\"[11] Scott Foundas of Variety described it as an unnecessary remake that will appeal mostly to young adult audiences who have not seen the original film.[12] Michael Rechtshaffen of The Hollywood Reporter wrote that the film \"has no patience for such subtleties\" as Romero's thematic concerns or suspense-building.[13] Elvis Mitchell of The New York Times wrote, \"Mr. Snyder's blood feast is strictly by the numbers: this second-rater could be the world's most expensive Troma film.\"[14] Manohla Dargis of the Los Angeles Times wrote, \"Good zombie fun, the remake of George A. Romero's \"Dawn of the Dead\" is the best proof in ages that cannibalizing old material sometimes works fiendishly well.\"[15] Mick LaSalle of the San Francisco Chronicle wrote, \"Instead, the new \"Dawn of the Dead\" satirizes itself and satirizes its genre, and, on its own unambitious terms, the movie succeeds. It's silly, witty and good-natured, not scary so much as icky, and not horrifying or horrible but consistently amusing.\"[16] Lisa Schwarzbaum of Entertainment Weekly rated it \"A\" and wrote, \"Commercial director Zack Snyder, making a killer feature debut, trades homemade cheesiness for knowing style, revels in the sophistication of modern special effects, and stomps off with the best remake – er, ”re-envisioning” – of a horror classic in memory.\"[17] Scott Tobias of The A.V. Club wrote that the remake streamlines the original film \"by discarding everything special about it in favor of pure visceral effect\".[18]Bloody Disgusting ranked the film eighth in their list of the \"Top 20 Horror Films of the Decade\", with the article saying \"Truly, you can analogize the two films [original and remake] based on their zombies alone – where Romero's lumbered and took their time (in a good way), Snyder's came at us, fast, with teeth bared like rabid dogs.\"[19] Rolling Stone ranked it #3 in their \"Top 10 Best Zombie Movies\".[20] It was third in Dread Central's \"Best Horror Films of the Decade\".[21]George A. Romero said, \"It was better than I expected. ... The first 15, 20 minutes were terrific, but it sort of lost its reason for being. It was more of a video game. I'm not terrified of things running at me; it's like Space Invaders. There was nothing going on underneath.\"[22] South Park parodied the film in the episode, \"Night of the Living Homeless\". The show's creators, Trey Parker and Matt Stone, called the film \"amazing\" in the episode's DVD commentary.[23]","box_office":"$102.4 million[2]","cinematography":"Matthew F. Leonetti","production_company":"Strike Entertainment New Amsterdam Entertainment","directed_by":"Zack Snyder","release_dates":"March 19, 2004 (2004-03-19)|||||","Production":"James Gunn is partially responsible for the screenplay although he received a solo writing credit. After he left the project to concentrate on Scooby-Doo 2: Monsters Unleashed, Michael Tolkin and Scott Frank were brought in for rewriting.[4] In a commentary track on the Ultimate Edition DVD for the original George A. Romero's Dawn of the Dead, Richard P. Rubinstein, producer of the original and the remake, explained that Tolkin further developed the characters, while Frank provided some of the bigger and upbeat action sequences.The mall scenes and rooftop scenes were shot in the former Thornhill Square Shopping Centre in Thornhill, Ontario and the other scenes were shot in the Aileen-Willowbrook neighborhood of Thornhill, Ontario. The set for Ana and Luis's bedroom was constructed in a backroom of the mall.[5] The mall was defunct, which is the reason the production used it; the movie crew completely renovated the structure, and stocked it with fictitious stores after Starbucks and numerous other corporations refused to let their names be used[5] (two exceptions to this are Roots and Panasonic). Most of the mall was demolished shortly after the film was shot. The fictitious stores include a coffee shop called Hallowed Grounds (a lyric from Johnny Cash's song \"The Man Comes Around\", which was used over the opening credits), and an upscale department store called Gaylen Ross (an in-joke reference to one of the stars of the original 1978 film).The first half of the film was shot almost entirely in chronological order,[5] while the final sequences on the boat and island were shot much later and at a different location (Universal Studios Hollywood) than the rest of the film, after preview audiences objected to the sudden ending of the original print.[5]Dawn of the Dead is the second film that co-starred actresses Lindy Booth and Kim Poirier. They first worked together on American Psycho 2.Deleted scenes were added back for the \"Unrated Director's Cut\" DVD edition.[6] Along with gore effects removed to obtain an MPAA R rating,[7] they include a clearer depiction of how the survivors originally break into the mall, and a short scene where the character of Glen regales the imprisoned C.J. and Bart with his reminiscing about his homosexual coming-of-age.The DVD release includes, as a bonus feature, the short film We Interrupt This Program, an expanded version of the fictional live broadcasts shown in the mall's televisions, which chronicles the worldwide effects of the zombie plague and the impact it has on a newscaster. Aside from featuring additional footage of cameos by actors from the original film, the film features Richard Biggs as the newscaster (in his final performance before his death in May 2004), and a voiceover cameo by Bruce Boxleitner as the President of the United States.","Cancelled sequel":"A sequel was planned but was later cancelled.[27] Zack Snyder stated that he would only be producing the sequel instead of reprising his role as the director due to working on Watchmen when he announced the film.[28] The script of Army of the Dead was written by Zack Snyder and Joby Harold. Filming for Army of the Dead was to start once they got a director as the producing studios had approved the script. Also according to Deborah Snyder, the film was set in Las Vegas, and the town had to be contained to stop the outbreak of zombies.[29][30] The film's producing studios were Universal Studios (who released the first) and Warner Bros. Entertainment (who released most of Snyder's films since 300) and the film was set to be directed by Matthijs van Heijningen Jr., director of The Thing, the 2011 prequel to John Carpenter's 1982 cult classic of the same name.[31]","produced_by":"Richard P. Rubinstein|Marc Abraham|Eric Newman|","starring":"Sarah Polley|Ving Rhames|Jake Weber|Mekhi Phifer|","running_time":"100 minutes[1]","dawn_of_the_dead":"Promotional poster, still under the original release date.","music_by":"Tyler Bates","edited_by":"Niven Howie","Release":"In the United Kingdom, Dawn of the Dead and Shaun of the Dead were originally scheduled to be released the same week, but due to the similarity in the names of the two films and plot outline, UIP opted to push back Shaun's release by two weeks. It was screened out of competition at the 2004 Cannes Film Festival.[8]The film grossed $59 million at the US box office and $102 million worldwide.[2]","budget":"$26 million[2]"}