{"country":"United States","distributed_by":"Miramax Films","Novel":"In Japan, the screenplay of Chasing Amy was adapted into a novel by Kenichi Eguchi and published by Aoyama Publishing. The unique concept of the book is that it is roughly half-novel, half-manga, with Moyoko Anno providing the art for the comic book pages.[26] In an episode of SModcast, Smith revealed that while he was thrilled to have a manga based on his film, he was shocked when he read the novelization, as the characters' sexual histories, which are just mentioned in conversation in the film, are depicted in the novel's manga illustrations as very sexually graphic flashbacks.","Plot":"Holden McNeil (Ben Affleck) and Banky Edwards (Jason Lee) are comic book artists and lifelong friends. Holden is the friendly, more mild-mannered half of the duo; Banky, meanwhile, is the loud and fiery half. Everything is going well for them until they meet fellow comic book artist Alyssa Jones (Joey Lauren Adams) at a comic book convention in New York where they are promoting their comic Bluntman and Chronic. Holden is attracted to Alyssa, but soon learns that she is attracted to women. The two begin hanging out, and a deep friendship develops. Eventually, Holden is no longer able to contain his feelings, and confesses his love to Alyssa. She is initially angry with him, but that night, the two begin a romantic relationship.This new development worsens the tension between Holden and Banky, who hates and mistrusts Alyssa and is disturbed by her and Holden's relationship. Banky investigates and uncovers dirt on Alyssa's past, and he reports to Holden that Alyssa participated in a threesome with two guys during high school, which gave her the nickname \"Finger Cuffs\". Holden is deeply upset by this revelation, having previously believed that he is the first man Alyssa had ever slept with. He angrily confronts Alyssa while attending a hockey game, and clumsily attempts baiting her into confessing. During a tearful argument, she tells Holden about her \"many\" youthful sexual experimentations. She apologizes for letting him believe that he was the only man she had been with. However, she refuses to apologize for her past, and Holden leaves feeling disillusioned and furious.Later, during lunch with Jay and Silent Bob (Jason Mewes and Kevin Smith), Silent Bob reveals that he was once in a relationship similar to Holden's. Despite the fact that he was in love with his girlfriend, Amy, his neurosis about her adventurous sexual past caused him to sabotage the relationship and leave her. Angry at himself for letting her go, he has \"spent every day since then chasing Amy, so to speak.\"Moved by Silent Bob's story, Holden devises a plan to fix both his relationship with Alyssa and his estranged friendship with Banky. He invites them both over and tells Alyssa that he would like to get over her past and remain her boyfriend. He also tells Banky that he realizes that Banky is in love with him—kissing him passionately to prove the point. Holden suggests a threesome. Though initially shocked, Banky agrees to participate, whereas Alyssa explains to Holden that it will not save their relationship. Before leaving, she states that she loves him, but she will not be his \"whore.\" Banky also leaves the apartment, instantly ending their friendship.One year later, both Banky and Holden are busy promoting their own respective comics at a convention in New York. It is revealed that Holden has dissolved their partnership over Bluntman and Chronic, leaving the viewer with the assumption that he sold the publishing and creative rights over to Banky (which is corroborated in the beginning of Jay and Silent Bob Strike Back). Banky smiles sadly at seeing his old friend, who silently congratulates him for his success on his own comic. Banky gestures over to a booth hosted by Alyssa, and provides wordless encouragement to Holden to go talk to her. He has a brief, quietly emotional conversation with Alyssa, and gives her a copy of Chasing Amy, his new comic based on their failed relationship. After Holden leaves, Alyssa's new girlfriend (Virginia Smith) arrives and asks who she was talking to. A shaken, misty-eyed Alyssa feigns indifference and replies, \"Oh, just some guy I knew.\"","language":"English","Reception":"On a budget of $250,000, the film grossed a total of $12,021,272 in theaters.[1][2][4] Chasing Amy played at three locations and earned $52,446 upon its opening weekend in the United States.[5] The following week, the film was expanded to a further twenty-two theaters where it grossed $302,406.[6] During the 18–20 April 1997 weekend, Chasing Amy was screened at a further 494 locations, where it earned $1,642,402 and moved into the Top 10.[7]Chasing Amy received positive reviews from critics. Review aggregation website Rotten Tomatoes gave the film a score of 88% based on reviews from 83 critics, with a rating average of 7.4 out of 10.[8] According to the site's summary of the critical consensus, \"Chasing Amy explores gender roles, sexual mores, and the limits of friendship with a mixture of sensitivity, raw honesty, and director/screenwriter Kevin Smith's signature raunchy humor.\"[8] Metacritic, which assigns a score of 1–100 to individual film reviews, gives the film an average rating of 71 based on 28 reviews.[9] Audiences polled by Cinemascore gave the film a grade A-minus.[10]Roger Ebert of the Chicago Sun-Times said \"While the surface of his film sparkles with sharp, ironic dialogue, deeper issues are forming, and Chasing Amy develops into a film of touching insights. Most romantic comedies place phony obstacles in the way of true love, but Smith knows that at some level there's nothing funny about being in love: It's a dead serious business, in which your entire being is at risk.\"[11] Ebert believed the film was an improvement over Smith's previous effort Mallrats and he added that Adams was a discovery.[11] Charles Taylor, writing for Salon, quipped \"Chasing Amy isn't going to single-handedly save romantic comedy, but Smith (Clerks) has made the only romantic comedy in quite a while that acknowledges, even celebrates, the fact that love and sex are emotional anarchy.\"[12]Academic critics have criticized the movie for its stereotypical portrayal of lesbians,[13] and its limited views on sexuality, for instance \"while individual lesbian characters may now have some range and depth and narrative engagement, lesbian culture is still depicted (if depicted at all) in the narrowest and most stereotypical of ways.\"[14]","box_office":"$12 million[2]","Cultural references":"In a scene originally written for Mallrats, several principal characters share memories of sexual escapades gone awry. This scene reveals the character's own emotional \"sex scars\" and was purposefully created—down to the style of dialogue and set dressing—to mirror a scene from Steven Spielberg's Jaws in which Quint and Hooper share the physical scars they've both earned from encounters with sharks.[27]","chasing_amy":"Theatrical release poster","cinematography":"David Klein","production_company":"View Askew Productions","directed_by":"Kevin Smith","Home media":"A special edition DVD was released with 1.85:1 anamorphic widescreen picture and Dolby 5.1 surround sound. It includes the following bonus features: Audio commentary from cast and crew; Introduction by Smith; deleted scenes; outtakes; and a theatrical trailer.Chasing Amy was originally released as a Criterion Collection Laserdisc. Smith raised eyebrows when he recorded the running commentary for the Laserdisc, as he started it by saying, \"This is a Laserdisc, and I'd like to take a moment to say 'fuck DVD'.\" When Criterion released the DVD—which re-uses the Laserdisc running commentary—Smith recorded a special introduction in which he apologized for the comment and jokingly attributed it to Jason Mewes.It was rumored that 2007 would see the release of a Chasing Amy X DVD, in a similar vein as the Clerks X DVD and the Mallrats: 10th Anniversary DVDs. But at Comic-Con 2007, Smith confirmed that a special \"supplementary\" DVD would be released the following year to go along with the Criterion Collection DVD released earlier that will just have more extras on it.[23] Smith later said Criterion rejected the idea of a special edition as \"double dipping\", but he is hopeful that new featurettes can be included on a future Blu-ray Disc release of the film.[24]Smith revealed in early 2009 at a Q&A session in Vancouver that he and the film's cast were currently recording new material for an upcoming Criterion Blu-ray release of the film.[25]","release_dates":"April 4, 1997 (1997-04-04)|||||","produced_by":"Scott Mosier","starring":"Ben Affleck Joey Lauren Adams Jason Lee Dwight Ewell Jason Mewes Kevin Smith","running_time":"113 minutes","music_by":"David Pirner","edited_by":"Scott Mosier Kevin Smith","written_by":"Kevin Smith","budget":"$250,000[1]"}