{"Cast":"Cannonball Run featured an all-star cast, including these actors:[5]","country":"United States[1] Hong Kong[2]","Box office and reception":"A huge commercial success, The Cannonball Run' earned $72,179,579,[4] making it the sixth highest grossing film of 1981, behind Raiders of the Lost Ark, On Golden Pond, Superman II, Arthur, and Stripes.[15]Reviews, however, were generally negative. Roger Ebert gave the film a half-star out of four, calling it \"an abdication of artistic responsibility at the lowest possible level of ambition. In other words, they didn't even care enough to make a good lousy movie\".[16] Variety described the film as \"full of terribly inside showbiz jokes and populated by what could be called Burt and Hal's Rat Pack, film takes place in that redneck never-never land where most of the guys are beer-guzzling good ole boys and all the gals are fabulously built tootsies.\"[17] Vincent Canby of The New York Times called the film \"inoffensive and sometimes funny. Because there are only a limited number of variations that can be worked out on this same old highway race, don't bother to see it unless you're already hooked on the genre.\"[18] Review aggregation website Rotten Tomatoes retrospectively collected 29 reviews to give the film a score of 31%.[19]The film was nominated for a Razzie Awards for Worst Supporting Actress for Fawcett.[20]","distributed_by":"20th Century Fox","the_cannonball_run":"Theatrical release poster by Drew Struzan","Litigation":"In June 1980, 24-year-old stuntwoman Heidi Von Beltz was critically injured in a car crash during production of the film. Von Beltz was a world-class skier with no previous stunt driving experience. As the original stunt person scheduled to perform the stunt had an emergency family illness and left the production, the stunt coordinator under Hal Needham and then Von Beltz fiancee, Bobby Bass, called her to the set for a stunt that he described was to be \"a piece of cake\"[21] and in which she would operate a smoke machine from the passenger seat.[22] Von Beltz did the stunt because the production was running seriously behind schedule. Her car was struck by a van that made the wrong move, and she was not wearing restraints because seat belts had been removed from her vehicle prior to the accident. The proper safety parts had not been delivered to the set. Because of the schedule demands, filming resumed with the car not in safe condition.[23] She survived, but was left a quadriplegic. When it became clear that Von Beltz's personal injury lawsuit would exceed all available primary insurance coverage, the production's excess insurer, Interstate Fire (a subsidiary of Hollywood's favorite insurer, Fireman's Fund Insurance Company) sued Von Beltz and her employer, Stuntman Inc., for a declaratory judgment that Von Beltz's lawsuit was not covered under its policy. In 1988, the U.S. Court of Appeals for the Ninth Circuit ruled that there was a duty to defend, and that there was also a duty to indemnify to the extent that Von Beltz was seeking recovery for mental injuries (the exclusion for bodily injuries was ruled to be enforceable).[24]","Plot":"Race teams have gathered in Connecticut to start a cross-country car race. One at a time, teams drive up to the starters' stand, punch a time card to indicate their time of departure, then take off.Among the teams:At the starting line, observing from the shadows, is Mr. Arthur J. Foyt (a play on the name of racer A. J. Foyt), a representative of the \"Safety Enforcement Unit\", who tries to stop the race because of its environmental effects and safety issues. In the car with Foyt (George Furth) is a photographer and tree lover, Pamela Glover (Fawcett).Beyond the starting line, JJ and Victor (driving their ambulance) come across Foyt and Glover, who have been involved in a minor fender-bender. Glover implores JJ and Victor to help, but when they tell Foyt to enter the ambulance through the back door, they kidnap Glover and take off without Foyt.As the race progresses, Victor occasionally turns into his alter ego, superhero \"Captain Chaos\". The very spooky Dr. Van Helsing (Jack Elam) and his huge hypodermic needle are also in the ambulance to \"help\" keep Glover quiet during the race.Various teams are shown either evading law enforcement, most of which deal with talking their way out of a possible ticket, or concocting crazy schemes to outmaneuver their opponents.The primary rivalry is between the ambulance and the Ferrari. In Ohio, Fenderbaum and Blake are able to convince Victor to pull over the ambulance in order to bless the patient on board. While Blake carries out the blessing, Fenderbaum flattens one of the ambulance's rear tires. JJ gets his revenge in Missouri by convincing a nearby police officer that the two men dressed as priests are actually sex perverts who are responsible for the flashing victim in the ambulance.The leading teams find themselves stopped on a desert highway, waiting for construction workers to clear the road. A biker gang (led by Peter Fonda) shows up and begins harassing Compton and Finch. It quickly gets out of hand and a free-for-all fistfight ensues. \"Captain Chaos\" emerges again to fight the bikers. Naturally, the Subaru team also joins in (Jackie Chan puts his martial arts skills to work) and fists and kicks fly. The construction crew announces that the road is open, so teams sprint back to their cars for the race to the finish.The ambulance falls behind the pack until Victor once again becomes Captain Chaos. The vehicles all arrive at the final destination at the same time, so it's a foot race to the finish line. JJ hands his team's time card to Victor, then ambushes the remaining racers, leaving only Victor and one of the Lamborghini women, Marcie.Just when it appears Victor will reach the time clock first, a spectator shouts that her \"baby\" has fallen into the water. Victor, still in his Captain Chaos persona, rushes to save the baby (later revealed to be her dog), allowing Marcie to clock in first and win the race.JJ is furious and never wants to see Captain Chaos again, but Victor replies that he doesn't care, because he really wants to be Captain USA. Foyt reappears and blames everyone for ruining the American highway. Seymour offers a cigar and tells Foyt to use the lighter in his car, which activates an ejection seat when pushed. Nothing happens at first, but when Seymour presses the button, he (Seymour) goes flying into the water.","language":"English","box_office":"$72,179,579[4]","Remake":"Warner Bros has acquired the rights to the Cannonball Run franchise and set Etan Cohen to write and direct Cannonball. Andre Morgan and Alan Gasmer are producing.[25]","cinematography":"Michael Butler","production_company":"Golden Harvest","directed_by":"Hal Needham","release_dates":"June 19, 1981 (1981-06-19)|||||","Production":"The film continued director Hal Needham's tradition of showing bloopers during the closing credits (a practice he started with Smokey and the Bandit II). Jackie Chan says this inspired him to do the same at the end of most of his films.The film is based on the 1979 running of the Cannonball Baker Sea-To-Shining-Sea Memorial Trophy Dash, an actual cross-country outlaw road race held four times in the 1970s, starting at the Red Ball Garage on 31st Street in New York City (later the Lock, Stock and Barrel Restaurant in Darien, Connecticut) and ending at the Portofino Inn in Redondo Beach, California, in Los Angeles. The race had previously inspired the (unrelated) 1976 films Cannonball and The Gumball Rally.The screenwriter was automotive journalist Brock Yates, who had conceived the real-life Cannonball Baker event. Yates had originally proposed the race as a writer for Car and Driver.[9] The race had only one rule: \"All competitors will drive any vehicle of their choosing, over any route, at any speed they judge practical, between the starting point and destination. The competitor finishing with the lowest elapsed time is the winner.\"Yates' team was the only participant in the original 1971 running, and in the March 1979 race, formed one of 46 teams with director Hal Needham to compete with a 150-MPH van converted into an ambulance, with LA doctor Lyell Royer, and Brock's second wife, Pamela Reynolds, riding as the patient on the gurney. Although the ambulance never made it to the finish line — the transmission gave out 50 miles short of the Redondo Beach finish line [10] — Yates made it to the movie as a race official and Needham as an EMT, and the ambulance itself was used in the movie as did the transmission going out. The ambulance was stopped once, in Pennsylvania; that event made it into the movie, as did a cop stopping traffic in Kansas, exiting from a rodeo, to let the ambulance pass unimpeded.[11]The Right Bra team was put together by rail-thin auto writer Judy Stropus, race driver Donna Mae Mims and Peggy Niemcek, whose husband was part of another entry, driving a Cadillac limo. In the movie, it became a two-woman team led by buxom Adrienne Barbeau driving a Lamborghini, but as auto writer Stropus said decades later, \"a little editorial license never hurt anyone.\"[12] Yates points out in his book Cannonball![13] that Stropus's version of the race does not mention the baptism with green fluid from the porta-potty the three girls experienced when the limo overturned.The characters J.J. and Victor participate in the Cannonball Run in an ambulance: a heavily modified Dodge Tradesman van. In the beginning, J.J. says to himself \"we could get a black Trans Am\", then answers his own question with \"Nah that's been done,\" a reference to the Smokey and the Bandit films of Burt Reynolds and director Hal Needham.In an attempt to appear legitimate to law enforcement, the team of J.J. and Victor hires Doctor Nikolas Van Helsing, a frightening, yet friendly, physician of questionable skill played by Jack Elam. They kidnap attractive young photographer Pamela Glover (Farrah Fawcett) — whom they nickname \"Beauty\" — to be their cover patient. Beauty vehemently opposes her beastly captors at first, but eventually warms to the race and to J.J.\"I did that film for all the wrong reasons,\" said Reynolds later. \"I never liked it. I did it to help out a friend of mine, Hal Needham. And I also felt it was immoral to turn down that kind of money. I suppose I sold out so I couldn't really object to what people wrote about me.\"[14]","produced_by":"Albert S. Ruddy","starring":"Burt Reynolds|Jackie Chan|Roger Moore|Farrah Fawcett|Dean Martin|Sammy Davis, Jr.|Dom DeLuise|","running_time":"95 minutes","music_by":"Al Capps","edited_by":"Donn Cambern William D. Gordean","written_by":"Brock Yates","budget":"$16–18 million[3]"}