{"country":"France Italy Germany","distributed_by":"Pathé (UK/France) Miramax films (USA)","Plot":"Julius Caesar is celebrating his victory over all of Gaul, but Lucius Detritus has kept from him that one village has managed to resist them. Detritus travels to the garrison near the village where Caius Bonus (Crismus Bonus), the garrison's commanding Centurion, explains that the Gauls have a magic potion, which makes them invincible. Detritus decides to capture the potion for himself, and hearing that the clever Asterix and permanently invincible Obelix are the backbone of the Gaulish forces, attempts and fails to eliminate them.A false soothsayer arrives at the village and predicts the arrival of Romans and treasure; despite Asterix's protests, the village believe him, wherefore when a Roman tax collector arrives, they drive off his forces and take the gold. The \"soothsayer\" later drugs and hypnotises Asterix to create a diversion while he recaptures the tax money; but news of the theft reaches Caesar, who comes to the garrison himself, demanding the legion attack. Upon witnessing the defeat of his army, he demands Detritus subdue the village or be fed to the lions.Detritus disguises himself and some men as Druids and kidnaps Panoramix (Getafix) at a Druid conference. Asterix disguises Obelix as a legionary, and they enter the garrison to rescue the Druid, but are separated. Asterix joins Getafix in the dungeon, where the pair resist Detritus' demands to make the magic potion, until he tortures Idefix (Dogmatix). Detritus uses the potion to throw Caesar into a cell (locked in an iron mask), and takes command with an oblivious Obelix as his bodyguard. Obelix later helps Asterix, Getafix, Dogmatix, and Caesar escape.Caesar co-operates with the Gauls to defeat Detritus, who mounts an attack on the villagers using his own magic potion. To defeat him, Panoramix brews a special version of the potion which creates dozens of duplicates of Asterix and Obelix. Caesar is returned to power, and grants the village its freedom.","language":"French","box_office":"$73.2 million","cinematography":"Tony Pierce-Roberts","directed_by":"Claude Zidi","Soundtrack":"Soundtrack by Jean-Jacques Goldman and Roland Romanelli","release_dates":"3 February 1999 (1999-02-03) (France)|14 April 2000 (2000-04-14) (United Kingdom)||||","asterix_&_obelix_take_on_caesar":"Theatrical poster","produced_by":"Vittorio Cecchi Gori Claude Berri","starring":"Christian Clavier Gérard Depardieu Roberto Benigni Laetitia Casta","running_time":"109 min","music_by":"Jean-Jacques Goldman Roland Romanelli","edited_by":"Hervé de Luze Nicole Saunier","written_by":"René Goscinny Gérard Lauzier","budget":"$48 million (274 mil. francs)"}