{"based_on":"Disney's Cinderella|Cendrillon by Charles Perrault|","Impact":"After the release and success of Cinderella, as well as Maleficent, Alice in Wonderland, The Jungle Book and Alice Through the Looking Glass‍—‌Walt Disney Pictures has announced the development of several other live-action remakes from their Animated Classics series.[111][112] Since the releases of these five films, Disney has announced the development of live-action adaptations of Beauty and the Beast,[113] Mulan,[114] Dumbo,[115] Winnie the Pooh,[116] Pinocchio,[117] Fantasia,[118] The Sword in the Stone[119] The Black Cauldron,[120] Peter Pan,[121] and The Little Mermaid.[122] The company also has plans for live-action spin-offs of Peter Pan, One Hundred and One Dalmatians and Snow White and the Seven Dwarfs along with a live-action prequel to Aladdin.[123][124][125][126]","country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","screenplay_by":"Chris Weitz|","Plot":"Ella is born to loving parents living on a beautiful estate in a peaceful kingdom. Since childhood, she is taught by her mother to believe in magic, allowing her to befriend the animals on the estate, especially the mice. Everything is perfect until Ella's mother falls ill. On her deathbed, she asks Ella to always have courage and be kind. Ella's father eventually remarries Lady Tremaine, the widow of an old friend, who has two daughters of her own: Drisella and Anastasia. Ella welcomes her new step-family, despite the stepsisters' unpleasant attitudes.When Ella's father goes abroad for business, Lady Tremaine reveals her cruel and jealous nature, as she pushes Ella to give up her room to the stepsisters for the attic. Sadly, Ella's father dies during the trip, causing Lady Tremaine to dismiss all servants to save money and place all the chores on Ella. On one cold evening, Ella sleeps by the fireplace for warmth, but wakes up next morning covered in \"cinders\". Her step-family consequently mock Ella as \"Cinderella\", and forbid her from eating with the family.Crushed by their cruelty, Ella rides off into the woods, where she meets Kit, an apprentice from the palace, who is part of a hunting party chasing a stag. Not knowing Kit is actually the prince of the kingdom, Ella admonishes him for hunting the stag, and pleads for the stag's freedom, which Kit agrees. Touched by his kindness, Ella takes a liking of Kit. Kit is likewise enchanted by Ella's charm, kindness, and unique outlook on life. The two part without Kit learning of Ella's name, but not before both express the wish to see each other again. The king, upon learning he has little time left, insists Kit takes a bride, who should be a princess for the advantage of the kingdom, at the upcoming royal ball. Kit persuades his father to invite every eligible maiden in the land to the ball, in hope of seeing Ella.When the ball is announced, the Tremaine family is ecstatic at the prospect of marrying into royalty. Ella is also excited to attend the ball for the chance to see Kit. She fixes up her mother's old pink dress when Lady Tremaine refuses to buy her a new one. On the night of the ball, Ella tries to join her step-family on the way out, but Lady Tremaine, together with her daughters, ridicule and tear up Ella's dress, then leave without her. Losing courage, Ella runs into the garden in tears and meets an old beggar woman, who reveals herself to be Ella's fairy godmother. The fairy godmother proceeds to magically transform a pumpkin into a magnificent carriage, four mice into white horses, two lizards into footmen, a goose into a coachman, and finally Ella's ripped dress into a gorgeous blue gown, complete with a pair of magical glass slippers. Before sending Ella on her way to the ball, the fairy godmother warns the magic will be broken at the last stroke of midnight.At the ball, the entire court is entranced by Ella, especially Kit. Nervous but happy to see each other, Ella and Kit have a perfect first dance, as if the two have been partners their entire lives. This irritates the Grand Duke, as he has promised Kit to Princess Chelina of Zaragoza, a fact that Lady Tremaine overhears.While surprised by Kit's true identity, Ella nonetheless has a marvelous time with Kit, touring the palace grounds and Kit's secret garden. But before Ella can tell Kit her name, the clock begins striking as midnight approaches, forcing Ella to flee and accidentally drop one of her glass slippers on the palace steps. She manages to get away at the final stroke of midnight, but the spell wears off and causes the animals and Ella's dress to revert. Ella hides the one glass slipper she has under the floorboards of her room as a keepsake, reasonably content that her one night will become a beautiful memory.The king dies soon after, but not before giving his son permission to marry Ella if he wishes. Not knowing Ella's identity and whereabouts, Kit, once becoming king, declares his love and intention to marry the \"mystery princess who wears glass slippers to the ball\", if she is willing. Excited at the news, Ella hurries to retrieve the glass slipper in her possession, only to find her stepmother holding it. Having deduced that Ella is the mystery princess, Lady Tremaine demands to be made the head of the royal household in exchange for allowing Ella to come forth and marry Kit, and once queen, Ella is to ensure that Drisella and Anastasia be married off to wealthy husbands. Ella refuses, Lady Tremaine smashes the slipper and locks Ella in the attic. Lady Tremaine then takes the shattered slipper and identity of the mystery princess to the Grand Duke in exchange for the title of countess and advantageous marriages for her daughters. The Grand Duke tries to convince Kit to forget the mystery princess with the shattered slipper, but this only makes Kit even more determined to find her.The Grand Duke and the Captain of the Guards lead the mission to find the mystery princess by trying the remaining slipper on all of the maidens in the land, but the magical slipper refuses to fit. When they arrive at Ella's estate, the shoe fits neither of the stepsisters. As they turn to leave, Ella's singing of \"Lavender's Blue\" is heard through a window that the mice have opened. The Grand Duke tries to ignore this, but Kit reveals himself to be one of the guards. Kit asks the Captain to investigate the source of the singing. Once Ella is found, Lady Tremaine attempts to forbid her from trying on the shoe on the grounds that she is Ella's mother, but she is overruled by the Captain, as Ella curtly tells Lady Tremaine that she has never been, and never will be, her mother.Ella and Kit are thereby reunited, and Kit recognizes Ella even without the shoe, which fits her perfectly. Promising to take each other as they are, Ella and Kit leave the house as Ella offers forgiveness to her stepmother. Afterward, Ella's step-family, along with the Grand Duke, leave the kingdom never to return.At last, Ella and Kit are married. The Fairy Godmother narrates that they become the land's most beloved monarchs, ruling with the courage and kindness that Ella has promised her mother, and that they live happily ever after.","language":"English","Reception":"Cinderella grossed $201.2 million in North America and $342.4 million in other territories for a worldwide total of $543.5 million, against a budget of $95 million.[3] It is the twelfth highest-grossing film of 2015 in any genre.[59] The film had a worldwide opening of $132.45 million,[60] and an IMAX opening of $9 million.[61] Deadline.com calculated the net profit of the film to be $164.77 million, when factoring together all expenses and revenues for the film.[62]In the U.S. and Canada, Cinderella opened on Friday, March 13, 2015, across 3,845 theaters, and earned $23 million.[63] The film's Friday gross included a $2.3 million late night run.[63] It topped the box office during its opening weekend as projected, earning $67.9 million,[64] including a record $5 million from 358 IMAX theaters, and became Disney's biggest 2D PG-rated opening of all time.[65][66] It is director Kenneth Branagh's biggest opening of his career (breaking 2011's Thor record), the fourth-highest Disney opening in March,[67] and the seventh-highest opening in March overall (not counting for inflation).[68][69] Audiences during its opening weekend comprised 66% female, 66% families, 26% adults, 8% teenagers, 31% under the age of 12 and 9% 50 years and older.[61] Cinderella finished its first week at the box office with $87.55 million, which was very high end of the film's lofty pre-release expectations.[70] In its second weekend, the film declined 49% to $35 million and was surpassed by The Divergent Series: Insurgent, dropping to #2.[71] The drop was in between two of Disney's previous live-action fantasy films, Oz the Great and Powerful (48%) and Maleficent (51%).[72] In North America, Cinderella is the ninth highest-grossing 2015 film.[73]Outside North America, box office analysts predicted as much as $60 million opening.[74] The film made its debut outside of North America on the same weekend as its wide North American release and earned an estimated $62.4 million from 31 countries,[60] including $4 million from IMAX theaters.[61] It topped the box office for two non-consecutive weekends.[75] It opened in China with $25 million, the biggest March opening in the country,[60] and Russia with $7.3 million.[60] The opening in these two countries were considered impressive given that both the countries are famous for their keenness for 3D films rather than 2D.[60] Other high openings occurred in the UK, Ireland and Malta ($5.6 million), Mexico ($5 million), Japan ($4.8 million), France ($3.3 million), and Brazil ($3.7 million).[75][76] In Australia, where the release date was coinciding with the Cricket World Cup finale, it managed to open with $3.4 million.[75] Italy opened with $4.6 million and topped the box office for three consecutive weekends.[60][75] It also topped the Japanese box office for five consecutive weekends.[77] It became the second-highest grossing Disney live-action film in China, behind Pirates of the Caribbean: On Stranger Tides and in the Philippines, behind Maleficent.[78] In total earnings, its largest markets outside of the US and Canada are China ($71.1 million), Japan ($46 million) and the UK, Ireland and Malta ($29.2 million).[77][79][80]Cinderella received mostly positive reviews from critics.[81] On review aggregator website Rotten Tomatoes, the film holds an 83% approval rating, based on 211 reviews, with a rating average of 7.1/10. The site's critical consensus reads, \"Refreshingly traditional in a revisionist era, Kenneth Branagh's Cinderella proves Disney hasn't lost any of its old-fashioned magic.\"[82] Metacritic assigned the film a weighted average score of 67 out of 100, based on 47 critics, indicating \"generally favorable reviews\".[83] According to CinemaScore, audiences gave the film a grade of \"A\" on an A+ to F scale.[84]David Rooney of The Hollywood Reporter reviewed the film at the Berlin Film Festival and praised the special effects, the screenplay, and Blanchett's performance and said that \"anyone nostalgic for childhood dreams of transformation will find something to enjoy in an uplifting movie that invests warm sentiment in universal themes of loss and resilience, experience and maturity.\"[85] Peter Debruge of Variety said, \"It’s all a bit square, big on charm, but lacking the crackle of Enchanted or The Princess Bride. But though this Cinderella could never replace Disney’s animated classic, it’s no ugly stepsister either, but a deserving companion.\"[86] Guy Lodge of The Guardian gave the film three stars out of five and said, \"While it might have been nice to see the new-model Cinderella follow Frozen's progressive, quasi-feminist lead, the film's naff, preserved-in-amber romanticism is its very charm.\"[87] Scott Mendelson of Forbes admired the film's visual effects, production design, and called the costume design as Oscar-worthy, adding, \"with an emphasis on empathy and empowerment, Walt Disney's Cinderella is the best film yet in their 'turn our animated classics into live-action blockbuster' subgenre.\"[88]Richard Corliss of Time magazine said that Branagh's Cinderella successfully updates and revitalizes Disney's \"ill-conceived\" animated film, and praised the empowered Ella, the visuals, and Blanchett's performance.[89] Katy Waldman of Slate similarly deemed the film a commendable and authentic upgrade that does not undermine its heroine while maintaining its classic splendor and charm.[90] Joe Morgenstern of The Wall Street Journal commended James' and Blanchett's performances, the sets, costumes and minimal digital effects, as well as Branagh's direction, stating he \"set a tone of lushly sustainable fantasy that's often affecting, frequently witty, seldom cloying, nearly free of self-comment and entirely free of irony.\"[91] Likewise, Claudia Puig of USA Today complimented the performances along with Branagh and screenwriter Chris Weitz for \"ground[ing] this romantic tale with sincerity amid the dazzle.\"[92] Los Angeles Times' Betsy Sharkey praised Blanchett's and James' performances and considered the film a \"poetically, if not prophetically, imagined storybook fable\" that succeeds because of its earnestness, humor, its lack of modern-day pretenses, and Branagh's \"singular focus\".[93] Lawrence Toppman of The Charlotte Observer proclaimed, \"This version has more psychological depth than usual and answers questions we may always have had. Branagh's 'Cinderella' does something extraordinarily rare among fairy-tale adaptations: It leaves out nothing we want and adds nothing we don't.\"[94] Noting the religious themes and symbols of the film, cultural commentator Fr. Robert Barron writes that due to Branagh's traditional telling of the story, \"he actually allows the spiritual -- indeed specifically Christian -- character of the tale to emerge.\"[95]","box_office":"$543.5 million[3]","cinematography":"Haris Zambarloukos","production_company":"Walt Disney Pictures Kinberg Genre","directed_by":"Kenneth Branagh","Music":"On June 7, 2013, news confirmed that composer Patrick Doyle would score the film, with the music having an emphasis on romance.[31][32] Doyle has previously scored several Branagh films, including Hamlet and Thor.[33] He has also scored the Disney·Pixar computer-animated fantasy-comedy film Brave.[34] Doyle recorded the film's score with the London Symphony Orchestra at the Air Lyndhurst Studios in London.[35]The soundtrack debuted at No. 60 on the Billboard 200, selling 8,000 copies in its first week.[36]","release_dates":"February 13, 2015 (2015-02-13) (Berlin)|March 13, 2015 (2015-03-13) (United States)||||","Production":"In May 2010, following the box office success of Tim Burton's Alice in Wonderland, which was the second-highest grossing film of 2010 and earned over $1 billion at the box office worldwide,[5] Walt Disney Pictures began developing a new film adaptation of Cinderella, commissioning a live-action reimagining based on a script by Aline Brosh McKenna and produced by Simon Kinberg.[6] In August 2011, Mark Romanek was brought on to direct.[7] On February 29, 2012, it was announced that Chris Weitz would revise McKenna's script.[8][9] In January 2013, Romanek left the project due to creative differences, as he was developing a version that was darker than Disney wanted.[10] Later that month, Disney negotiated with Kenneth Branagh to take over as director.[11][12]Cate Blanchett was the first actor to sign on, when it was announced in November 2012 that she would be playing Lady Tremaine, Cinderella's evil stepmother.[13] In March 2013, Emma Watson was in talks to portray Cinderella, but a deal could not be worked out.[14][15] Gabriella Wilde, Saoirse Ronan, Alicia Vikander, Bella Heathcote and Margot Robbie were also considered for the part, but deals could not be worked out due to scheduling and other conflicts.[15][16]On April 30, 2013, Lily James was cast as the title character.[17][18] A week later, Richard Madden was cast as Prince Charming, who was named Kit in the film.[19] In June 2013, it was reported that Holliday Grainger and Sophie McShera joined the film as Cinderella's two evil stepsisters, Anastasia and Drisella.[20][21] Later that month, Helena Bonham Carter was cast as the Fairy Godmother.[22] In August 2013, Hayley Atwell and Ben Chaplin joined the cast to play Cinderella's mother and Cinderella's father.[23] In September 2013, Stellan Skarsgård's role as the Grand Duke was confirmed.[24] On September 23, 2013, it was announced that Derek Jacobi was cast as the King, Prince Kit's father, and Nonso Anozie as the Captain, a loyal friend to the Prince.[24]Three-time Oscar-winning costume designer Sandy Powell was in charge of the costumes for the film. Powell began working on concepts for the characters’ looks almost two years before principal photography began in the summer of 2013. Powell said she was aiming for the look of \"a nineteenth-century period film made in the 1940s or 1950s.\"[25][26]For the stepmother and stepsisters, Powell had a very clear idea about the look; \"They are meant to be totally ridiculous on the outside—a bit too much and overdone—and ugly on the inside.\"[26] The silhouette of the prince came from the original animation, however she created a more fitted look and less masculine colors. Some of the prince costumes were dyed to accentuate Madden’s eyes.[25]The ball gown was inspired by the Disney animated film in its color and shape; \"The gown had to look lovely when she dances and runs away from the ball. I wanted her to look like she was floating, like a watercolor painting.\"[25] The dress was made with more than a dozen fine layers of fabric, a corset and a petticoat. Nine versions of the Cinderella gown were designed, each with more than 270 yards of fabric and 10,000 crystals. It took 18 tailors and 500 hours to make each dress.[25]The wedding dress was another difficult project. \"Creating the wedding dress was a challenge. Rather than try to make something even better than the ball gown, I had to do something completely different and simple... I wanted the whole effect to be ephemeral and fine, so we went with an extreme-lined shaped bodice with a long train\", said Powell. It took 16 people and 550 hours to complete the silk-organza, hand painted dress. While the crew photographed James in the gown, the actress stood too close to an electric heater and the dress caught on fire; the top layer of the dress had to be redone because only one wedding dress was created due to time and budget constraints.[25]For the glass slipper, Powell took inspiration from a 1950s shoe she saw in a museum. Since glass does not sparkle, they decided to use crystal instead. Swarovski partnered with Disney to make the famous shoe. Powell went directly to Swarovski headquarters in Austria to meet the product developers. It took 6 digital renderings of the shoes until they found the right one for the film. Swarovski made eight pairs of crystal shoes for the film, though none were actually wearable. Consequently, the leather shoes James wore on set had to be digitally altered into crystal. Alongside the slipper, Swarovski provided more than 7 million crystals that were used in costumes and 100 tiaras for the ball scene.[27]Principal photography on Cinderella began on September 23, 2013.[24] The film was shot at Pinewood Studios in Buckinghamshire, England, where Disney's Pirates of the Caribbean: On Stranger Tides and Maleficent were also filmed,[28] and at various other locations including Blenheim Palace, Windsor Castle, Cliveden, Old Royal Naval College, and Black Park.[12] Although the royal palace is mainly computer-generated, it has been modeled after the Zwinger in Dresden, Germany.[29]Post-production began in December 2013, and was completed in August 2014.[12] The finished film was rated PG for \"mild thematic elements\" by the MPAA.[30]","produced_by":"Simon Kinberg|Allison Shearmur|David Barron|","starring":"Lily James|Richard Madden|Cate Blanchett|Stellan Skarsgård|Holliday Grainger|Derek Jacobi|Helena Bonham Carter|","running_time":"105 minutes[1]","cinderella":"Theatrical release poster","music_by":"Patrick Doyle","edited_by":"Martin Walsh","Release":"The film had its world premiere on February 13, 2015 at the 65th Berlin International Film Festival,[37][38] and was released on March 13, 2015.[39] Theatrically, it was accompanied by Walt Disney Animation Studios' short film Frozen Fever, featuring the characters from Frozen.[40] On February 10, 2015, IMAX Corporation and Disney announced plans to digitally re-master the film into the IMAX format and release it in IMAX theaters globally on the scheduled release date.[41]The first official presentation of the film occurred at Disney's three-day D23 Expo in August 2013.[42][43] The film was previewed at CinemaCon in Las Vegas, Nevada, in March 2014, with a teaser showing Cinderella hearing about her father's death, meeting the prince while riding through the forest, her mother's ball gown being torn apart by her step-family, and a comedic bit where the Fairy Godmother transforms a pumpkin into a carriage.[44][45]The first official trailer debuted on May 15, 2014. In the minute-long teaser, which doesn't include any footage from the film, a sparkling glass slipper is slowly revealed over a black background.[46][47] The second official trailer, two-and-a-half minutes long and containing footage from the film, debuted on Good Morning America on November 19, 2014, with a 15-second trailer preview released two days prior.[48][49] In its first 24 hours of release, the trailer was viewed 4.2 million times on YouTube and 33 million times on Facebook, the highest views among all Disney films in history, except for Marvel Studios releases.[50] The movie's official poster was also released on November 19, featuring James as Cinderella and photographed by Annie Leibovitz.[51] Disney released an international trailer on December 16, 2014.[52] A new trailer was released on January 1, 2015.[53] On February 11, 2015, Disney released a final trailer for the film.[54]In October 2014, a licensing agreement between Disney and Turner Broadcasting was announced, in which Cinderella would premiere across Turner's cable network portfolio (including TBS and TNT) in the Spring of 2017.[55]Walt Disney Studios Home Entertainment released Cinderella on Blu-ray combo pack, Digital HD, DVD, and \"Disney Movies Anywhere\" on September 15, 2015.[56] Blu-ray bonus features include an alternate opening, the Frozen Fever short, and the featurettes: \"Staging The Ball\", \"Ella's Furry Friends\", \"A Fairy Tale Comes to Life\", and \"Costume Test Fun\". Five deleted scenes with an introduction by Kenneth Branagh are included exclusively on \"Disney Movies Anywhere\".[57] The film debuted in second place on the home media sales charts behind Furious 7.[58]","budget":"$95 million[2]"}