{"based_on":"Babes in Toyland (1903 operetta) by Glen MacDonough Anna Alice Chapin","country":"United States","distributed_by":"Loew's, Inc.","screenplay_by":"Frank Butler Nick Grinde","Plot":"Stannie Dum (Stan Laurel) and Ollie Dee (Oliver Hardy), live in a shoe (as in the nursery rhyme There Was An Old Woman Who Lived In A Shoe), along with Mother Peep (the Old Woman), Bo Peep (Charlotte Henry), a mouse resembling Mickey Mouse (and actually played by a live monkey in a costume), and many other children. The mortgage on the shoe is owned by the villainous Silas Barnaby (Henry Brandon), who is looking to marry Bo Peep. Knowing the Widow Peep is having a difficult time paying the mortgage, Barnaby offers the old woman an ultimatum – unless Bo Peep agrees to marry him he will foreclose on the shoe. Widow Peep refuses, but is worried about where she'll get the money to pay the mortgage. Ollie offers her all the money he has stored away in his savings can, only to learn that Stannie has taken it to buy peewees (a favored toy consisting of a wooden peg with tapered ends that rises in the air when struck with a stick near one end and is then caused to fly through the air by being struck again with the stick). He and Stannie set out to get the money for the mortgage from their boss, the Toymaker (William Burress). But Stannie has mixed up an order from Santa Claus (building 100 wooden soldiers at six feet tall, instead of 600 soldiers at one foot tall) and one of the soldiers, when activated, wrecks the toy shop. Stannie and Ollie are fired without getting the money.The two then hatch a plan to sneak into Barnaby's house and steal the mortgage, but are again foiled by their incompetence. Barnaby has them arrested on a burglary charge, and the two are sentenced to be dunked in the ducking stool and then banished to Bogeyland. But Barnaby agrees to drop the charges if Bo Peep will marry him. She reluctantly agrees, but not before Ollie suffers the dunking.Stannie and Ollie come up with a new scheme. At the wedding, Ollie is present to give the bride away. After the nuptials, but before the ceremonial kiss, Ollie asks for the \"wedding present\" (the mortgage) from Barnaby. After inspecting it, Ollie tears it up, and then lifts the bride's veil — to reveal Stannie, who had worn Bo Peep's wedding dress to the ceremony. Bo Peep is still free, and the mortgage is gone. Ollie teases Stan about having to live with Barnaby as Stan cries saying \"I don't LOVE him\".Enraged, Barnaby plots his revenge, eventually hitting on the idea of framing Bo Peep's true love, Tom, Tom, the Piper's Son (Felix Knight), on a trumped-up charge of \"pignapping\", and getting him banished to Bogeyland. Barnaby proceeds to abduct Little Elmer (Angelo Rossitto), one of the Three Little Pigs, and then has a henchman plant false evidence (including sausage links) in Tom-Tom's house. Tom-Tom is put on trial, convicted, and banished to Bogeyland, which he is taken to on a raft by two dunkers across an alligator infested river. A distraught but brave Bo Peep follows him.Meanwhile, Ollie and Stannie find evidence implicating Barnaby in the pignapping, including the fact that the alleged sausage links presented as evidence at Tom-Tom's trial are made of beef. They later find the kidnapped pig alive in Barnaby's cellar.A manhunt commences for Barnaby, who flees to Bogeyland through a secret passageway at the bottom of an empty well. Stannie and Ollie eventually follow Barnaby down the well. Meanwhile, Bo Peep crosses the river to Bogeyland, finds Tom-Tom and explains Barnaby's trickery to him.In a sequence cut from many of the later television prints (the version shown on WPIX in New York retains this sequence), Tom-Tom sings Victor Herbert's Go to Sleep, Slumber Deep to Bo-Peep in an enormous cave set with giant spider webs. Barnaby catches up to Tom-Tom and Bo-Peep, and attempts to abduct Bo-Peep but gets into a fight with Tom-Tom, who gives Barnaby a well-deserved thrashing. An enraged Barnaby grabs a large stick and beats a stalactite to summon an army of Bogeymen, who chase Bo-Peep and Tom-Tom through the caverns of Bogeyland. The lovers run into Stannie and Ollie, who help them escape back through the well and are welcomed by the town, who now realize Barnaby's treachery. Barnaby leads an invasion of Toyland on a fleet of rafts in a scene reminiscent of the painting of Washington Crossing the Delaware.Ollie and Stan tell their story to Old King Cole (Kewpie Morgan), the King of Toyland, and the townspeople as two Bogeymen scale the wall and open the gate. The crowd flees in panic as the army of torch-wielding Bogeymen attacks Toyland. Ollie and Stannie run and hide in the toy shop warehouse. There they discover boxes of darts and use them to fight off the Bogeymen, thanks to Stan's skill with the game of \"peewees\" (and help from the three little pigs and the mouse). Stan and Ollie then empty an entire box of darts into a cannon, but as the two search for the last remaining darts, they realize instead that they should activate the wooden soldiers. The \"march\" alluded to in the film's title begins as the soldiers march out of the toy shop (filmed in a stop-motion animation sequence by Roy Seawright[3]). The scene changes to live action as the soldiers attack the Bogeymen with the bayonets of their rifles. Barnaby is defeated and trapped and covered by blocks that spell \"rat\", while the Bogeymen are routed and driven back into Bogeyland, where alligators appear to feast on them, although this is never made clear. The kingdom of Toyland is saved. Stan and Ollie decide to give the Bogeymen a parting shot with the dart-filled cannon. As Stan aims the cannon and lights the fuse, and Ollie turns away to avoid the loud blast, the barrel of the cannon flips backwards and unleashes the barrage of darts on Ollie, covering his back with darts. The film ends with Stan pulling them out one by one as Ollie winces.","Bogeyland":"Bogeyland is the abode of the \"bogeymen\" in the 1934 film (and the 1961 Technicolor remake from Walt Disney). In the story, Bogeyland is separated from Toyland by a crocodile-infested river situated just outside the gate of Toyland. It is a dark, cavernous place, where twisted cypress trees grow, and many stalactites and stalagmites protrude from its rocky landscape.Citizens of Toyland who commit serious crimes are banished to Bogeyland.[10] Those banished to Bogeyland never return; they are inevitably eaten alive by the bogeymen. The miserly Silas Barnaby (a character based on the English nursery rhyme \"There Was A Crooked Man\") has a secret tunnel to Bogeyland at the bottom of his well. In the climax of the film, Barnaby leads an army of bogeymen out of Bogeyland in an attempt to conquer Toyland, but is thwarted by Toyland's army of wooden soldiers.[11]","language":"English","Reception":"Reviews from critics were positive. Andre Sennwald of The New York Times called it \"an authentic children's entertainment and quite the merriest of its kind that Hollywood has turned loose on the nation's screens in a long time.\"[4] Variety proclaimed it \"a film par excellence for children. It's packed with laughs and thrills and is endowed with that glamour of mysticism which marks juvenile literature.\"[5] \"It's certainly far more successful than was last year's Alice in Wonderland, and the children will probably be far less bored by it than they generally are by those films designed especially for them\", John Mosher wrote in The New Yorker.[6] Film Daily called it \"delightful musical fantasy\" and \"dandy entertainment\".[7] \"It's been many a long day since I've had so much pure (and I MEAN pure!) fun as I had watching this picture\", wrote the Chicago Tribune.[8]The movie was popular at the box office[9] Babes in Toyland was one of many feature films with Stan Laurel and Oliver Hardy. However, many years later in a filmed interview, Hal Roach admitted that on its first release the film lost money. After it appeared in theaters, it was re-released several times with the title constantly changed to make it seem to audiences that they were going to see a different film. Like the later M-G-M film, The Wizard Of Oz (which despite its popularity, was also a box-office disappointment on its first release in 1939), it was television which made Babes In Toyland the beloved classic it has become over the decades. It surfaced as a holiday movie on TV as March of the Wooden Soldiers, where it was rerun annually on some local affiliates for many years. On one local Atlanta station, the film was shown as a Thanksgiving special only a few weeks before the release of the 1961 Disney Technicolor remake, so that those who saw it and then saw the Disney version over the Christmas holiday had the experience of seeing two different versions of the same work within a few weeks of each other.A holiday staple, many television stations in the United States showed this film near Thanksgiving/Christmas holiday season each year during the 1960s and 1970s. In New York City, it continues to run (as of 2015) on WPIX as March of the Wooden Soldiers, airing on that station in daytime on Thanksgiving Day and Christmas Day. It also runs nationally on occasion on This TV.","cinematography":"Francis Corby Art Lloyd","production_company":"Hal Roach Studios Metro-Goldwyn-Mayer","babes_in_toyland":"theatrical release poster (1934)","directed_by":"Gus Meins Charley Rogers","References":"NotesBibliography","release_dates":"November 30, 1934[1]","Alternative versions":"In 1948, the 79-minute Babes in Toyland was edited into a 73-minute version for Lippert Pictures' theatrical reissue and was retitled March of the Wooden Soldiers. The very beginning of the opening tune \"Toyland\" was trimmed and the \"Go To Sleep (Slumber Deep)\" number was cut completely. Also missing was Barnaby's attempted abduction of Little Bo-Peep and his ultimate fistfight with Tom-Tom. Because no copyright notice was included, some believe this version immediately went into the public domain (in the United States), even though the original Babes in Toyland is still under copyright by Prime TV Inc., which was succeeded-in-interest by Tribune Broadcasting, owners of WPIX, which was to play an even bigger part in this film's history.[12] When the film was sold to television, the TV prints retained the opening credit's music but used specially made for TV opening credits showing puppets of Laurel and Hardy in traditional 1930s attire and hats.The complete film was restored and colorized for TV showings and video release in 1991 by The Samuel Goldwyn Company.[13][14] In 2006, the complete print was again restored and colorized by Legend Films, using the latest technology.[13][15][16] Although the Legend Films release was advertised under its reissue title, both the color and black-and-white prints featured the original title and opening credits.[15][17] Both colorized versions correctly depict Laurel's hair as being red, not medium brown as it appears in other colorized Laurel and Hardy movies. Legend Films has also released a 3-D-converted version of the film on Blu-ray.The film has been distributed by many motion picture and home video companies over the decades. Thunderbird Films released 16 mm prints in the 1970s drawn from a heavily spliced (and incomplete) master. Today the underlying rights are with Tribune, while the distribution rights are with MGM (which holds the non-Samuel Goldwyn-produced films in the Goldwyn Company library, and in a twist of irony, originally released this film, making this one of the few pre-May 1986 MGM films and/or TV series not currently owned by Warner Bros./Turner Entertainment Co. that remains with its original distributor). An \"official\" version has been released on DVD by MGM in a pristine print and containing the original main and end title sequences. On September 14, 2010, Legend Films released the movie on Blu-ray titled March of the Wooden Soldiers With Laurel & Hardy. This Blu-ray also contains the animated 1948 short Rudolph the Red-Nosed Reindeer.","produced_by":"Hal Roach","starring":"Stan Laurel Oliver Hardy Charlotte Henry Felix Knight Henry Brandon Florence Roberts Virginia Karns","running_time":"77 minutes 67 minutes (Britannic cut March of the Wooden Soldiers)","Songs":"The film featured only six musical numbers from the enormous stage score, though that was fitting for a musical with only a 78-minute running time. Included in the film, in the order in which they were performed, were \"Toyland\" (opening), \"Never Mind Bo-Peep\", \"Castle in Spain\", \"Go to Sleep (Slumber Deep)\", and \"March of the Toys\" (an instrumental piece). Also included was an instrumental version of \"I Can't do the Sum\" for the running theme of Laurel and Hardy's scenes. The opening song was performed by Mother Goose and an offscreen chorus; most of the rest were sung by Bo Peep and/or Tom-Tom. While none of the songs were performed by Laurel and Hardy, the two briefly danced and marched in a memorable scene to \"March of the Toys\". Another song, \"Who's Afraid of the Big Bad Wolf?\" was not one of the original stage songs, but did appear in the Three Little Pigs segment, heard only as an instrumental piece.","music_by":"Victor Herbert (operetta) Frank Churchill Ann Ronell","edited_by":"Bert Jordan William H. Terhune"}