{"country":"United States","distributed_by":"Dimension Films","screenplay_by":"Scott Stewart","Plot":"In a suburban street, the Barrett Family consisting of father Daniel (Josh Hamilton), mother Lacy (Keri Russell), older son Jesse (Dakota Goyo), and younger son Sammy (Kadan Rockett) hosts a barbecue and invites their friends, the Jessops. At night, Jesse and Sammy communicate with each other from their beds via walkie-talkie. Jesse is reading scary stories about The Sandman, which frightens Sammy.Lacy wakes up at night and checks on her boys before heading down to the kitchen where she discovers the refrigerator door open with its contents spread out all over the floor. The backdoor is also wide open. The next day, she and Daniel believe an animal broke in, although Lacy questions why the vegetables were eaten while the meat remained untouched.Daniel has a job interview, which doesn't go well; and he receives a notice in the mail that their mortgage payment is late. In the middle of the night, Lacy wakes up and heads down to the kitchen. She discovers all of their canned and packaged foods stacked up in towers all over the kitchen counters, floor, and table. The chandelier over the dining table appears to project a strange sign on the ceiling. She brushes it off as a nightmare. In the morning, the police come to see if there was a break in, but they find nothing. The police officer suggests Daniel reconnect his home security system despite the cost. The next night, the alarm is set off, waking up the family. Daniel shuts it off and notices that all doors and windows are still locked. The alarm company calls and says was a malfunction in the system because it shows that all entry points were breached at the same time. Lacy and Daniel then notice all of their photographs have disappeared from their frames. The alarm company sends over a technician in the morning who determines that nothing was breached.The strange events increase in frequency and escalate in danger. While Sammy is playing soccer with the other kids, he wets himself, stares into space, and screams. Lacy, who is at home, witnesses hundreds of birds crashing into the house. At night, Lacy is awakened by a sound and hears Sammy talking. When she goes to check on him, she sees an alien figure standing over his bed. She screams and turns on the light, only to find an empty room. Daniel and Lacy run from room to room, looking for Sammy, when Daniel sees him in the front yard, walking away from the house. They retrieve him, but Sammy has no idea why he is outside. Immediately after this experience, Daniel installs security cameras around the house.The next day, Lacy has a viewing at a house for sale. As she's pitching the house to a couple, she becomes unable to speak and enters a trance. She walks towards the glass door and begins to bash her head repeatedly against it before waking up in her own bed. She finds a bruise forming on her forehead and notices that she blacked out for six hours. The scientist investigating the birds flying into her home calls Lacy and tells her the birds came from three different flocks migrating from three different directions, and it was as if something was \"drawing\" the birds to her home. Lacy begins to search online for answers and finds articles on UFOs along with pictures other children have drawn that are very similar the ones Sammy has drawn of a child and three grey figures holding hands beside a house.That night, Lacy wakes up around midnight and finds Daniel standing in the backyard in a catatonic state, his mouth agape in apparent terror. His nose begins to bleed heavily. He wakes up with no memory of what happened. Lacy and Daniel watch the video camera footage of Daniel getting out of bed and walking outside, and Lacy tells him about the things she read about UFOs, though Daniel dismisses her.Sammy goes to the pool with the Jessops the next day but refuses to go swimming. Shelly (Annie Thurman) attempts to take off his shirt and discovers a strange formation of bruises all over his chest. Jesse and his friend Kevin Ratner (L. J. Benet) sneak into the woods behind a golf course where Kevin shoots at Jesse with a pellet gun. Jesse freezes in a standing position and has a seizure that causes his eyes to roll back into his head. He is taken to the hospital, where the doctors inform Lacy and Daniel that Jesse is covered in strange symbols that had to have been branded onto his body. Because of Jesse's age, the doctor informs Lacy and Daniel that he must notify Child Protective Services. When Daniel hears that Ratner and Jesse were together just prior to the incident, he believes that Ratner is the one who hurt Jesse; he attacks Ratner in his front yard before being knocked out by Ratner's dad, drawing the ire of Jesse. Jesse returns from the hospital, and the Jessops now also believe that the Barretts are abusing their children.That night, Daniel is watching upstairs and finds Sammy sleeping; and, when he attempts to wake him, Sammy sits up and has black holes where his eyes should be. Daniel awakes from this dream in a sweat and then returns to look at the footage of the camera, going frame by frame until, in one frame distorted by static, he sees three dark figures standing over the beds of everyone in the family. He now believes Lacy's claim that there is an extraterrestrial force at work. They seek the help of a specialist, Edwin Pollard (J. K. Simmons), who calls the beings \"The Grays\". Pollard informs them that many others have suffered the same fate as the Barretts, with most cases ending in a child abduction. Edwin states that, among other things, sickness and nosebleeds are signs that a family is experiencing Gray activity, as is the drawing that Lacy discovered. Lacy finds a wall in Edwin's apartment covered in newspaper articles about missing children. Edwin warns the Barretts that the person who the Grays first show interest in is usually the one who is abducted, and that they should be hyper-protective of Sammy, whom he believes has been \"chosen\". He states that their only hope is work together to save Sammy in hopes the aliens will move on to another family.Daniel goes out and buys a shotgun and boards up the windows of the house while Lacy buys an aggressive guard dog. The family spend July 4 inside their home, eating dinner and recounting earlier July 4ths for the boys. While watching fireworks on the TV, the transmission is cut to static, all the lights begin to flicker and the dog starts barking ferociously at the boarded up front door. Lacy sends Jesse into his room with Sammy and tells him not to take his eyes off of his brother. She stands guard outside the door with a knife in hand. Downstairs, Daniel has his gun pointed at the front door as bright lights shine around it. The screws holding the boards in place unscrew on their own, and all the power in the house cuts out.Upstairs Lacy hears the TV in her bedroom turn on. She walks towards it, unaware of a Gray standing directly behind her, and becomes trapped in her room. Daniel fires into the bright light, hoping to hit one of the Grays. He then runs upstairs and gets Jesse and Sammy into his and Lacy's room where they barricade themselves in and huddle together on the bed. The TV begins to flicker again, and the Grays can be seen in the room surrounding the bed. Lacy sees them and screams and Jesse blacks out. Jesse awakes in the foreclosed house from earlier in the film. He finds his mother dead in the bloodied kitchen before witnessing his father commit suicide. Seeing his brother, he chases after Sammy before reawakening in the upstairs hallway of his house. Daniel, Lacy, and Sammy are all together, staring at Jesse in concern and bewilderment. The Grays appear in front of Jesse, there is flash of light, and he is abducted.Three months later, Lacy and Daniel are suspects in Jesse's disappearance, and they've moved into an apartment. Pollard cuts out a newspaper article about Jesse's disappearance and hangs it on his wall with all the other pictures of missing children. As Lacy is going through old things, she finds pictures that Jesse drew as a child that involved three grey figures holding his hand in front of a house. Remembering that Jesse was sick for the longest time as a child, she realizes now that it was Jesse, and not Sammy, whom the Grays first showed interest in, and thus that he was the one who had been chosen. As she realizes this, the walkie-talkie begins to go off with feedback, and she and Sammy both hear Jesse's faint voice calling Sammy's name.","language":"English","Reception":"Dark Skies received mixed reviews from film critics. It holds a 40% \"rotten\" rating on Rotten Tomatoes based on 78 reviews, with the site consensus being: \"Dark Skies writer director Scott Stewart has a solid cast, an interesting premise, and some admirable ambitions, but he can't figure out what to do with any of them, and the result is a dull, muddled effort that will bore all but the most devoted horror buffs.\"[16] It has 50% rating on Metacritic based on 19 reviews.[17] Michael O'Sullivan of The Washington Post wrote that \"[t]he movie builds a moderate, if less than monumental, level of spookiness, regardless of your ignorance. It’s a workmanlike piece of suspense.\" He gave the film 2 out of 4 stars.[18] In a moderately favourable review for The New York Times, Andy Webster praised the film for the \"consummate dexterity\" with which it employed worn-out horror devices.[19]","box_office":"$26.4 million[2]","cinematography":"David Boyd","production_company":"Entertainment One Blumhouse Productions","directed_by":"Scott Stewart","Home media":"The film was released on DVD and Blu-Ray on May 28, 2013.","dark_skies":"Theatrical release poster","release_dates":"February 22, 2013 (2013-02-22) (United States)|||||","Production":"Production commenced on August 3, 2012.[5] Locations for filming included Los Angeles and Valencia, CA (College of the Canyons)[6] The film was directed by Scott Stewart[7] and produced by Jason Blum,[8][9][10] Jeanette Brill and Couper Samuelson.[11] The film's screenplay was written by Stewart;[11] the original script by Stewart took about six weeks to finish writing.[12]","produced_by":"Jason Blum Couper Samuelson Jeanette Brill","starring":"Keri Russell Josh Hamilton Dakota Goyo Kadan Rockett J. K. Simmons","running_time":"97 minutes[1]","music_by":"Joseph Bishara","edited_by":"Peter Gvodas","Release":"Dark Skies was released in the United States on February 22, 2013[13][14] and in the United Kingdom on April 5, 2013.[15]","budget":"$3.5 million[2]"}