{"boys'_night_out":"theatrical film poster","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Ira Wallach","story_by":"Arne Sultan Marvin Worth","Plot":"Three married men, George (Tony Randall), Doug (Howard Duff), and Howie (Howard Morris), and divorcé Fred (James Garner) are friends who commute to work from Greenwich, Connecticut, to New York City on the same train. Seeing Fred's philandering boss, Mr. Bingham (Larry Keating), with his mistress sets the men to fantasizing about sharing the expense of an apartment in the city as a love nest. As a gag, they give Fred the task of finding an unrealistically inexpensive apartment and a blonde \"companion\" to go with it.Fred rents a luxurious suite from Peter Bowers (Jim Backus), who is desperate to find a tenant because the previous occupant was a highly publicized murder victim. By chance, Cathy (Kim Novak), a knockout of a blonde, also answers the advertisement for the apartment. Fred explains that the place has already been taken, but that he is also looking for a beautiful young \"housekeeper\" for his friends. To his surprise, she accepts the job. The boys are delighted; each tells his wife that he is taking a course one night a week to improve his mind so he can stay in New York overnight.Unbeknownst to the men, Cathy is actually a sociology graduate student writing her thesis on the \"adolescent fantasies of the adult suburban male.\" Her skeptical advisor, Dr. Prokosch (Oskar Homolka), objects, \"Can you look like 'yes' and act like 'no?' ... This a nice girl hasn't learned.\" Cathy responds, \"No? This is what a nice girl has learned best.\" When they start calling on her individually in the evenings, she encourages them to talk, all the while secretly recording their conversations.Cathy deftly avoids being seduced by the married men, although each lets the others think he has slept with her. She supplies what each one really wants: Howie is starved for more substantial food than his dieting wife will provide; Doug likes to repair things that are conveniently broken each week (his status-conscious wife does not want their neighbors to see him tinkering about the house); George enjoys talking about himself, but his spouse keeps finishing his sentences. Fred, however, is a different story: he is very attracted to Cathy and, disgusted by his friends' fabricated stories, refuses to use his night.In the end the wives become suspicious, and on the advice of Fred's mother, Ethel (Jessie Royce Landis), hire private investigator, Ernest Bohannon (Fred Clark) to find out what is going on. Based on his report, they assume the worst and confront their husbands. All three married men confess that nothing happened, and Cathy reveals that she is just doing research.After getting over the shock, Fred marries Cathy. Everyone learns a lesson and the boys' night out is no more; instead, the couples go out together.","language":"English","Reception":"Financed by Novak's Kimco production company & Filmways Pictures – and, it turned out, its first and last production – Boys' Night Out was intended to resurrect Novak's career, which had hit a snag at the age of 29 with the death of Columbia Pictures' production head Harry Cohn,[2] but it was not a financial or critical success.[3] According to MGM records it incurred a loss of $262,000.[4] Although Novak's career was not resurrected, it did propel James Garner's forward.[2]","cinematography":"Arthur E. Arling","production_company":"Kimco Filmways Pictures","directed_by":"Michael Gordon","DVD":"Boys' Night Out was released to DVD by Warner Home Video on December 22nd, 2010 via its Warner Archive DVD-on-demand service as a Region 1 DVD.","release_dates":"June 21, 1962 (1962-06-21) (US))|||||","produced_by":"Martin Ransohoff","starring":"Kim Novak James Garner Tony Randall","running_time":"115 minutes","music_by":"Frank De Vol","External links":"ğ","edited_by":"Tom McAdoo","budget":"$1.5 million[1]"}