{"country":"United States","distributed_by":"Cannon Film Distributors","barfly":"Theatrical release poster","Plot":"Henry Chinaski (Mickey Rourke) is a destitute alcoholic who lives in a rundown apartment and works menial jobs when he can find them. An intelligent man and keenly aware of his circumstance, he finds solace in expressing his feelings and perceptions of the world through writing poetry and short stories.At night, he frequents a local establishment where he drinks, hangs out with other down and out alcoholics, and gets into altercations with patrons along with a tough guy bartender he hates, named Eddie (Frank Stallone). One night, Henry comes into the bar very drunk; he begins to drink uncontrollably out of other customers' glasses and Eddie promptly throws him out into the street. The next day Henry wakes up determined to focus on beating Eddie.During routine evening stops at the local bar, Henry constantly challenges Eddie, in a quest to prove to himself and others that he could beat the sober and tough talking Eddie, who represents everything Henry despises, including shallowness and self-promotion. His regular fights with Eddie in the back alley behind the bar attract other bar goers who cheer for their favorite and place wagers on the fight. The Bar owner, who has faith in Henry, bets on him. This time, however, Henry wins and thus the Bar owner wins his bet which he gives to Henry so that he can buy a couple drinks for the night, as he is no longer welcome at his regular bar.Henry then staggers on to another establishment. There, he meets Wanda (Faye Dunaway), a fellow alcoholic and a kept woman, who, lonely in her own right, invites Henry to drink with her, with booze she buys on her lover's account at the liquor store. She invites Henry to her shabby apartment to drink whiskey, and he quickly takes up residence with her. They share a bed and drink to excess, on the tab of Wanda's older lover. The next day they set out to get jobs to live the booze soaked life together, Henry takes Wanda to his usual establishment for celebratory drinks before he departs for an interview.Things become very acrimonious between Henry and Eddie when Henry discovers that Wanda has slept with Eddie. Nevertheless, Henry stays with Wanda and continues to drink his nights away with her by his side, writing during the day, and submitting his work to magazines and book publishers.In the meantime, Henry is tracked down by a wealthy female book publisher, Tully Sorenson, who has been impressed with his writing and is interested in publishing his work. She finds him through a private investigator she has hired, who breaks into Henry's apartment one afternoon and takes pictures of some of Henry's writing to verify to Tully the promise of Henry's work. Knowing Henry is destitute, Tully pays him an \"advance\" of five hundred dollars and takes him back to her home where, after pouring some drinks for the two of them, the two sleep together.At first, Henry is impressed with the promise of wealth and security, including an endless supply of booze that working for Tully could provide. However, he begins to realize that he is uncomfortable being involved with Tully, romantically or professionally, because of class differences, telling her that she is \"trapped in a cage with golden bars\". Henry determines he must leave, that returning to his life of destitution and alcoholism is the only truth he knows.After leaving Tully's house, Henry returns to his usual bar and to Wanda. Tully heads out to see if she can change his mind, and finds him at the bar where a drunken, jealous Wanda proceeds to beat her up. When Henry doesn't intercede, Tully realizes that Henry does not care about her and doesn't want her help. So she leaves the bar and gives up on publishing his work, realizing that her pursuit of him was futile.The film ends with Henry buying drinks for all of his \"friends\" at the bar. Eddie suspects Henry has no money and is itching for a fight, so he tells Henry that he owes him forty dollars for the drinks. To Eddie's surprise, Henry pays with some of the advance he received from Tully and sarcastically leaves a tip for Eddie, saying, \"Buy a drink on me.\" Eddie calls Henry out and they go out behind the bar for another fight. As Henry and the other barflies follow Eddie out the door, the camera pans out to the front of the bar to the sound of punches and the crowd cheering the two men on.","language":"English","Reception":"Barfly received positive reviews from critics, as it holds a 78% rating on Rotten Tomatoes based on 18 reviews.","box_office":"$3,221,568","cinematography":"Robby Müller","production_company":"American Zoetrope","directed_by":"Barbet Schroeder","Popular culture connections":"Barfly is referenced in the 2009 movie Precious.Several Barfly quotes are referenced in the NOFX song, \"Green Corn\" (including the title itself), from their 1991 album Ribbed.Other movies based on the life or writings of Bukowski include Bukowski: Born into This (2003 documentary), Tales of Ordinary Madness (1981), Crazy Love (1987), and Factotum (2005). Actor James Franco is said to be working, as of 2011, on a movie version of Ham on Rye.[6]The film was mentioned in a Season 5 episode of the television series, Entourage. One of the show's characters, Johnny Drama (who plays an actor in the show), claims that he did three days as an extra on the movie.","release_dates":"October 16, 1987","produced_by":"Presenter: Francis Ford Coppola Exec. producer: Menahem Golan Yoram Globus Producer: Tom Luddy Fred Roos Barbet Schroeder","starring":"Mickey Rourke|Faye Dunaway|Alice Krige|J.C. Quinn|Frank Stallone|","running_time":"97 minutes","music_by":"Jack Baran","edited_by":"Éva Gárdos","written_by":"Charles Bukowski","budget":"$3 million"}