{"country":"United States","distributed_by":"Sony Pictures Classics The Criterion Collection","language":"English","Reception":"Crumb was met with wide acclaim from critics, earning a 95% rating on Rotten Tomatoes.[6] The late critic Gene Siskel rated Crumb as the best film of the year.[7] Roger Ebert gave the film four (of four) stars, writing that \"Crumb is a film that gives new meaning to the notion of art as therapy.\"[8] In The Washington Post, Desson Howe's review was similarly positive.[9] The San Francisco Chronicle rated the film as \"wild applause\", as critic Edward Guthmann called the film \"one of the most provocative, haunting documentaries of the last decade.\" He also noted that Robert Crumb and wife Aline had drawn a \"scornful\" cartoon about the film in The New Yorker.[10]Critic Jeffrey M. Anderson called it \"one of the most brave and honest films I've ever seen\", and listed its characteristics as those of \"great documentary\", giving it four (of four) stars.[11]Despite strong reviews, Crumb was not nominated for the Academy Award for Best Documentary Feature (the nominating committee reportedly stopped watching the film after only twenty minutes). The Oscar snub of Crumb, and the same year's equally acclaimed Hoop Dreams, caused a media furor which forced the Academy of Motion Picture Arts and Sciences to revamp its documentary nomination process.[12] Zwigoff stated in an interview that: “The Academy Award thing had much more to do with the fact that at the time, a lot of the documentary membership was made up of distributors of documentary films. The rules have changed since then. But they would just vote for the films they distributed because it was in their financial interest to do so.” He continued: “I just assumed they were disgusted with the film.\"[13]In 2008, Entertainment Weekly named Crumb the 14th best film of the last 25 years.[14] In 2012 Slant Magazine ranked the film #74 on its list of the 100 Best Films of the 1990s, calling it \"Arguably the greatest of all nonfiction films.\"[15] Morgan Spurlock named it to his list of 50 Documentaries to See Before You Die.The film won several major critical accolades:","box_office":"$3,174,695","Synopsis":"Crumb is about the experiences and characters of Robert Crumb and his family, particularly his brothers, Maxon and Charles, as well as Robert's wife Aline Kominsky-Crumb and his children. (Crumb's sisters declined to be interviewed.)The movie chronicles Crumb's career, highlighting his creations \"Keep On Truckin',\" Fritz the Cat, and his pioneering role in the genesis of underground comix. Interviews with his family members and ex-girlfriends (such as Kathy Goodell), and commentary from critics like Robert Hughes and Trina Robbins, as well as selections from Crumb's vast artist output, shed light on Crumb's psychology and darkly cynical perspective on life.Portraits emerge as well of older brother Charles, who committed suicide before the film was released,[2] and youngest brother Maxon, a panhandler who painted to assuage his inner demons. Though filmmaker Zwigoff had the consent of the Crumb brothers, some questioned the ability of the more disturbed brothers to provide that consent.[3] The involvement of Charles and Maxon, which Zwigoff felt was just as important to Robert's story as anything else, led Zwigoff to title the film Crumb to imply the importance of all three brothers. [4]","cinematography":"Maryse Alberti","directed_by":"Terry Zwigoff","crumb":"Theatrical release poster","release_dates":"April 28, 1995 (1995-04-28)|||||","Production":"Robert Crumb initially did not want to make the film, but eventually agreed. There was a rumor, accidentally created by Roger Ebert, that Terry Zwigoff made Crumb cooperate by threatening to shoot himself. Ebert later clarified this in the audio commentary of the film's Criterion Collection re-release. Ebert notes that “it may be true that Zwigoff’s life was saved because he did make the film.”[5]During the nine years that it took to make the documentary Zwigoff said he was “averaging an income of about $200 a month and living with back pain so intense that I spent three years with a loaded gun on the pillow next to my bed, trying to get up the nerve to kill myself.”[5]","produced_by":"Terry Zwigoff Lynn O'Donnell David Lynch","starring":"Robert Crumb Aline Kominsky-Crumb Charles Crumb Maxon Crumb","running_time":"120 minutes","music_by":"David Boeddinghaus","edited_by":"Victor Livingston"}