{"country":"Mexico","distributed_by":"Prime Films S.L. (Spain) October Films (United States)","Plot":"In the year 1536, an alchemist in Veracruz developed a mechanism that could give eternal life. In 1937, an old building collapsed and the alchemist, who has marble-white skin, is killed when his heart is pierced by the debris. Investigators never revealed what else was discovered in the building: basins filled with blood from a corpse.In the present, an old antique dealer, Jesús Gris, notices that the base of an archangel statue is hollow. He opens it and finds a 450-year-old mechanical object. After winding the ornate, golden, scarab-shaped device, it suddenly unfurls spider-like legs that grip him tightly, and inserts a needle into his skin which injects him with an unidentified solution.A living insect — entombed within the device and meshed with the internal clockwork — produces the solution. However, Gris is unaware of this detail until later. Eventually, he discovers that his health and vigor are returning in abundance, as is his youth. His skin loses its wrinkles, his hair thickens and his sexual appetite increases. He also develops a thirst for blood. This at first disgusts him, but he eventually succumbs to the temptation.Meanwhile, a rich, dying businessman, Dieter de la Guardia, who has been amassing information about the device for many years, has been searching for the archangel statue with the cronos device. He has appropriated several archangels already. He sends his thuggish nephew, Angel, to purchase the archangel at the antique shop.During a party, Gris sees blood on a men's room floor and decides to lick it. Angel finds Gris and tries to beat him into giving up the device. When Gris faints, Angel places his body inside a car and pushes it off a cliff. Gris dies but later revives and escapes from an undertaker's establishment before he can be cremated. He later reads the program for his funeral and opens his mouth which had been sewn shut. He returns to his home where his granddaughter, Aurora, lets him in. He works on a letter to his wife in which he comments on the changes that his body has made and tells her that after completing some 'unfinished business' he will return to her. He notices that his skin burns in the presence of sunlight and sleeps in a box to avoid it.Eventually, he and Aurora bring the device to Dieter's business headquarters, where the businessman offers him a \"way out\" in exchange for the device. Gris comments on his damaged skin and the businessman tells him to peel it off because he has new skin underneath, which is marble-white like the dead alchemist. Gris agrees to hand it over in exchange for knowing the \"way out\", whereupon Dieter stabs him. Before being able to strike the killing blow to the chest, Dieter is incapacitated by Aurora. The mortally wounded Dieter is found and killed by his nephew, Angel, who is tired of waiting for his inheritance. Angel confronts Gris on the rooftop of the building and beats him severely. Gris throws them both off the roof, killing Angel. Upon awakening, Gris destroys the device after he is tempted to feed off his granddaughter, and returns home. Gris lies dying in bed. Aurora and his wife are by his side.","language":"Spanish English","Reception":"The film was very well received by critics; Rotten Tomatoes reported that 89% of the critics gave the film positive reviews, with an average rating of 7.3 and the critical consensus being: \"Guillermo del Toro's unique feature debut is not only gory and stylish, but also charming and intelligent.\"[5] It was also entered into the 18th Moscow International Film Festival.[6]In the early 2010s, Time Out conducted a poll with several authors, directors, actors and critics who have worked within the horror genre to vote for their top horror films.[7] Cronos was placed at number 96 on their top 100 list.[8]In North America, the film was given limited release to 2 theaters where it grossed $17,538 its opening weekend and grossed a total of $621,392 playing at a total of 28 screens.[2]","box_office":"$621,392[2]","cinematography":"Guillermo Navarro","production_company":"Fondo de Fomento Cinematográfico Instituto Mexicano de Cinematografía Universidad de Guadalajara Iguana Producciones Ventana Films","directed_by":"Guillermo del Toro","Home media":"Cronos was first released in 2003 as a \"10th Anniversary Edition\" with some extras. On 7 December 2010, The Criterion Collection released Cronos on both DVD and Blu-ray. The disc contains two audio commentaries by cast and crew, a video tour of del Toro's home office, several interviews, and Geometria, a short film written and directed by del Toro.[9]","narrated_by":"Jorge Martínez de Hoyos","release_dates":"3 May 1993 (1993-05-03) (Cannes)|3 December 1993 (1993-12-03) (Mexico)||||","cronos":"Theatrical release poster","produced_by":"Arthur H. Gorson Bertha Navarro Alejandro Springall","starring":"Federico Luppi Ron Perlman Claudio Brook Margarita Isabel Tamara Shanath","running_time":"92 minutes[1]","music_by":"Javier Álvarez","edited_by":"Raúl Dávalos","written_by":"Guillermo del Toro","budget":"$2 million[citation needed]"}