{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"In 1870 1st Lt. Curtis McQuade (Hamilton), a cavalry officer without field experience, arrives from the East at Fort Canby, the remote, understaffed post where he was born as the son of the then-post commander. He attempts to adjust to this new life under the once-disgraced Captain Maddocks (Boone), a wily but embittered veteran of Indian fighting who served under McQuade's father. They immediately clash when Maddocks demonstrates to the cocksure McQuade that the general knowledge of the West he gained as a child at Canby is not enough to permit him to command men in the field.On the day McQuade reports, Maddocks is burying four troopers from a patrol led by Lt. Porter (Chamberlain), killed in a running fight with a large band of \"hostiles\" believed to be Comanches. They have also brought back a severely traumatized little girl, the only survivor of the massacre of a family at a distant ranch. The funeral casts gloom on the otherwise festive visit of Tracey Hamilton, also from the East and soon to wed Maddocks' second-in-command, Lt. Tom Gresham (Douglas). McQuade had previously been romantically involved with Tracey and immediately renews their affair. Gresham is assigned to lead another patrol to the suspected location of the hostiles but on the evening of his departure discovers the affair and an ugly scene ensues.When Maddocks learns the next day that Gresham deviated from his orders, he leads McQuade and the troop in search of him without success. Finally one night they discover the bodies of Gresham and his men when they stop to bivouac. McQuade is shaken that his indiscretion may have caused Gresham to be dispirited and unwary but Maddocks is more pragmatic, disgusted that Gresham allowed himself to be fatally distracted. Prohibited by standing orders from conducting a retaliatory attack, Maddocks divides what is left of his troop, sending McQuade and nine men, including wise and seasoned 1st Sgt. Rodermill (O'Connell), to a nearby mesa as bait to lure the hostile band into attacking first.The tactic works but McQuade's small group is hard-pressed by their attackers. Maddocks arrives with the main body in time to win the engagement but Rodermill is killed. McQuade discovers that their opponents were not Comanches at all, but Apaches, which Maddocks knew all along, having learned to \"out-think them all.\" Maddocks is satisfied that a change in McQuade's attitude means that he is on the road to becoming a good officer. Upon his return to Canby, McQuade finds Tracey leaving, taking the little girl to her relatives in the East. Maddocks consoles McQuade with the thought that bachelors make the best soldiers because \"they have nothing to lose but their loneliness.\"","language":"English","Reception":"According to MGM records the film recorded a loss of $42,000.[4]","cinematography":"William W. Spencer","production_company":"Robert J. Enders Productions Metro-Goldwyn-Mayer","directed_by":"Joseph M. Newman","release_dates":"September 26, 1961 (1961-09-26)|||||","Production":"The film starred a number of young actors under contract to MGM including George Hamilton, Richard Chamberlain, Carole Wells and James Douglas.[1]George Hamilton made the movie \"to avoid the Ivy curse\" and play a different kind of role.[2]The movie is notable for starring three well-known actors in relatively minor roles. Charles Bronson of Death Wish fame and rock musician Duane Eddy star as troopers, while Richard Chamberlain portrays Lieutenant Porter. Slim Pickens and Arthur O'Connell also had roles.It was Robert Ender's first movie as an independent producer for MGM.[3]","produced_by":"Stanley Bass Robert Enders","starring":"Richard Boone George Hamilton Luana Patten Arthur O'Connell Charles Bronson Richard Chamberlain Duane Eddy Slim Pickens","running_time":"97 minutes","music_by":"Harry Sukman","External links":"","edited_by":"Ferris Webster","written_by":"James Warner Bellah"}