{"distributed_by":"New Yorker Films","Plot":"Jo is a taxi driver in Chinatown, San Francisco who, along with his nephew Steve, are seeking to purchase a cab license of their own. Jo's friend Chan Hung was the go-between to finalize the transaction but at the beginning of the film, Chan has disappeared, taking Jo's money with him. The two men begin their search for Chan by speaking with a series of Chinatown locals, each of whom has a different impression of Chan's personality and motivations. The portrait that is created is incomplete and, at times, contradictory. As the mystery behind Chan's disappearance deepens, Jo becomes paranoid that Chan may be involved in the death of man killed during a \"flag-waving incident\" between opposing supporters of the People's Republic of China (mainland China) and the Republic of China (Taiwan). In the end, Chan remains missing but through his daughter, he returns Jo and Steve's money. Jo, holding a photo of Chan where his face is completely obscured, eventually accepts that Chan is an enigma, saying in a voiceover, \"here's a picture of Chan Hung but I still can't see him.\"[3]","Themes and Analysis":"Chinese America and AbsenceThe absence, ambiguity and lack of definite character in the film are central themes in Chan Is Missing, and reflect how the film takes on the challenge of being an early Chinese/Asian American feature narrative. Chan Is Missing is able to use the absence of Chan to fill that space with a series of a broad and complicated portrait of San Francisco's Chinese American community. According to Diane Mei Lin Mark, who wrote the framing essay for the movie's published screenplay, \"this very presentation of diversity among Chinese American characters in a film is a concept largely untested in American movies.\"[3] The diversity is addressed in the film in at least two ways. First, there is Chan himself, who every character seems to have a different impression of. In a voiceover monologue at the end of the film, Jo explains, \"Steve thinks that Chan Hung is slow with it, but sly when it comes to money. Jenny thinks that her father is honest and trustworthy. Mrs. Chan thinks her husband is a failure because he isn't rich. Amy thinks he's a hard-headed political activist...Presco thinks he's an eccentric who likes mariachi music.\"[3] Chan, it would seem, is meant to stand in for the Chinese American community as a whole.Second, there is also an eclectic cast of other Chinese American characters that Steve and Jo encounter while looking for Chan. That includes a female attorney who speaks in overly dense academic language about Chan's difficulty grasping \"layman's language,\" (the irony being that the film's audience cannot grasp her language either because of use of jargon). There is also Henry, the cook, who wears a Samurai Night Fever T-shirt while singing \"Fry Me to the Moon\" as he stir-fries in the kitchen. Both Chan and the film's characters suggest that Chinese America, is also impossible to easily summarize or characterize.Film scholar Peter Feng suggests that Chan Is Missing can be understood via the metaphor of a doughnut: \"Each character...holds a doughnut that contains the possibilities of for Chinese American identity in its center.\"Each of the film's characters only serve to widen that hole, thus \"widening the space for spectatorial subjectivity and by extension, Asian American subjectivity.\" [7]Sound and LanguageSound is strategically deployed throughout the film to enhance the atmosphere. As Jo begins to suspect that Chan might be involved in a murder cover-up, Jo's paranoia is echoed through an explicitly ominous score. There is also a scene where Jo and Steve go to the Manilatown Center and during their conversation with a Center employee (Presco), the camera moves from the men to focusing on a loudspeaker and loud, ambient noise in the scene obscures their conversation. This un-joining of the speaker and subject leaves the viewer disoriented, which only adds to the general mystery of the film and its plot. A similar scene happens when Jo speaks with Chan's wife and her home and loud music is also used to obscure their conversation.In the original theatrical version of Chan Is Missing, there are no subtitles provided for scenes where characters are either speaking in Mandarin or Cantonese. This is a common technique in Wang's film. As he told an interviewer regarding his 2008 film, A Thousand Years of Good Prayers, \"I didn’t want subtitles because the audience should experience what those two are experiencing and not have any more information. Yet you could still understand. Sometimes the specifics of a language are not as important as the music of the language and the body language of the language.'[8]","language":"English/Cantonese/Mandarin","Critical reception":"Chan is Missing is highly acclaimed. On Rotten Tomatoes, the movie has a 100% rating with 10 votes, while IMDb gives it a 7/10 with 729 votes.Roger Ebert of the Chicago Sun-Times awarded the film 3 out of 4 stars and wrote that the film is \"whimsical treasure of a film that gives us a real feeling for the people of San Francisco's Chinatown\" and it \"has already become something of a legend because of the way it was filmed\" that it demonstrates a \"warm, low-key, affectionate and funny look at some real Chinese-Americans\" and went to say \"almost without realizing it, we are taken beyond the plot into the everyday lives of these people.\"[4]Vincent Canby of The New York Times said in his review that \"Chan Is Missing is not only an appreciation of a way of life that few of us know anything about; it's a revelation of a marvelous, completely secure new talent.\"[5]A review by Dennis Schwartz stated that, “It's breezy and warmly done, a low-key comedy that takes you into an ethnic group that has rarely been captured on film in such a revealing way. A true Indy film, and a delight.”[6]Wayne Wang's primary distribution goal was to have the film, “play at festivals and college campuses,” and as one of the first Asian American feature films, audience reactions to it spanned a spectrum of responses, sometimes dependent on the ethnicity of the viewer. One Chinese American viewer claimed the movie was written for a white audience because “…there being so much explaining, so many footnotes...” says Lem. Also according to Sterrit we see that “…its initial audience has not been an ethnic one, Chinese viewers are being wooed through newspaper ads…” Furthermore, the Asians were ‘wooed’ to watch the film by the white reviewers who reviewed the movie in the Asian press, therefore raising questions about whom the film catered to. Peter X. Feng believes the success of this movie was through, “the art-house audiences and brought the Asian Americans into the theaters.” He also states that, “Reviews in the Asian American press often simply advertise the screenings; but the lengthier reviews usually refer to how white reviewers see Chinese Americans and how Asian American texts are received by non-Asian audiences.”[7]","cinematography":"Michael Chin","directed_by":"Wayne Wang","release_dates":"April 24, 1982 (1982-04-24)|||||","produced_by":"Wayne Wang","starring":"Wood Moy Marc Hayashi","running_time":"80 minutes","music_by":"Robert Kikuchi-Yngojo","edited_by":"Wayne Wang","written_by":"Wayne Wang Isaac Cronin, Terrel Seltzer","budget":"$22,000[1]"}