{"country":"United States Canada United Kingdom","distributed_by":"Buena Vista Pictures","DVD release":"Buena Vista Home Entertainment released the film on Region 1 DVD on March 2, 2004. It is in anamorphic widescreen format with audio tracks in English and French, and subtitles in Spanish. Bonus features include commentary with director Mike Figgis; deleted scenes and an alternate ending; Rules of the Game, in which Figgis discusses the components of a psychological thriller; and Cooper's Documentary, in which he discusses the process of making the film within the film.","cold_creek_manor":"Theatrical release poster","Plot":"Cooper (Dennis Quaid) and Leah Tilson (Sharon Stone) are living in a cramped New York City apartment with their two children, Kristen (Kristen Stewart) and Jesse (Ryan Wilson). While on a business trip overseas, Leah's boss informs her of an available promotion within the company, but only if she's willing to have an affair with him. She calls Cooper while he is dropping the kids off at school but, before she can speak to him, Jesse is nearly hit by a car in the early morning traffic. Although he isn't hurt, Leah returns home immediately and they decide living in the city is no longer a safe option for their family.They relocate to a huge, decaying mansion out in the country, which is still filled with the possessions of the previous family who disappeared years earlier. Cooper, an unmotivated documentary filmmaker, is intrigued and sees it as an opportunity to get back into work. While cleaning up one morning, he finds many Polaroid photographs of the family including nude shots of a teenage girl. Jesse finds old clothes in his bedroom closet belonging to a young boy his age called Grady, and a book with a strange riddle written inside.They go for breakfast at the local diner where they meet and befriend the owners, Ray and Ellen Pinski and their daughter, Stephanie. Many residents of the town, including the crass waitress of the diner, Ruby (Juliette Lewis), have heard they're now living at the manor and feel offended that they haven't taken the time to put the old family's belongings into storage, which causes immediate tension. Meanwhile, the family get settled in and Cooper decides to commit its history to making a new film.One morning, they find the previous owner Dale Massie (Stephen Dorff) in their home, and they feel inclined to ask him to stay for breakfast. He tells them he's recently been released from prison and needs help finding work, so he pressures Cooper into hiring him to help with the renovations on the house. Later on, Cooper meets Sheriff Annie Ferguson (Dana Eskelson), Ruby's sister, who informs him that Dale's aging and slightly demented father is living in a nearby nursing home. Cooper goes to visit him, hoping to glean some details about the house's sinister past. Disjointed comments made by the elderly man lead him to believe that Dale murdered his wife and children, and he begins to search his 1,200-acre (4.9 km2) property for their remains. Meanwhile, although Dale initially proves to be a good worker, the underlying sense of menace he projects is unsettling and makes the family uncomfortable. Then a series of terrifying incidents start to occur, including finding dozens of poisonous snakes in their house. Although he has no proof, Cooper becomes suspicious of Dale, believing he put them there on purpose, and fires him.That night, Leah informs Cooper about her boss's proposition and also tells him that she was going to say yes, but that was the day Jesse was hit by the car and it put everything into perspective for her. Cooper storms out and spends the night at the local bar where he speaks with Ruby, Dale's girlfriend, who warns Cooper about him saying, \"Don't fuck with him. He'll rip your fucking head off.\" Dale becomes angry with her being drunk and needy that he hits her, which shocks Cooper to find out how monstrous he can be. On the way home, Cooper realizes he is being followed. He speeds up but because he is intoxicated, hits something and causes him to crash. In the morning, Kristen finds her new horse dead in their backyard pool. She blames her father but Cooper is certain it was a deer he hit and not the horse.Cooper becomes more and more suspicious when he finds other evidence such as Grady's braces in the front yard. Then, all of his suspicions are confirmed when he and Leah discover three skeletons in Devil's Throat, a deep well that is hidden in the woods. Using a walkie talkie, he contacts Sheriff Ferguson, unaware she has been attacked and disabled by Dale at the police station, who punctures the tires on Cooper's truck and sets Leah's car on fire to prevent them from escaping. Trapping them in the house in the middle of a storm that has knocked out the electricity, he forces them to rely on their wits and physical prowess to save themselves. Dale finally corners Cooper and Leah on the roof after chasing them through the mansion. Dale, now raving mad, openly declares his insanity as well as his intent to kill them (with a family sheep killing tool/mallet) and throw them down the Devil's Throat like his family. However, the couple is able to turn the tables on their tormentor by charging him with a line of rope that knocks him off his feet. They quickly tie him down against a roof lantern (skylight) before he can break free. Cooper takes the killing tool and taunts Dale as Dale had done to him, before shattering the skylight, sending the screaming Dale to his death.The film cuts to show that the bodies of Dale's family are now rightly entombed in the family graveyard at Cold Creek Manor and that Cooper and his family have finally attained their wanted peace.","language":"English","Critical reception":"The movie received negative reviews from critics. It holds a 12% rating on Rotten Tomatoes, based on 109 reviews.[2]Stephen Holden of the New York Times observed, \"A serious filmmaker like Mike Figgis can be forgiven, I suppose, for slumming, when he's got a cast as stellar as the one that infuses the scream-by-numbers thriller Cold Creek Manor with more psychological credibility than its screenplay merits.\" He said the film \"belongs to the Cape Fear tradition of thrillers in which the mettle of a civilized family man is tested in a life-or-death struggle with crude macho evil.\"[3]Roger Ebert of the Chicago Sun-Times rated the film 1½ stars and called it \"an anthology of cliches\" and \"a thriller that thrills us only if we abandon all common sense.\" He added, \"Of course preposterous things happen in all thrillers, but there must be at least a gesture in the direction of plausibility, or we lose patience.\"[4]Edward Guthmann of the San Francisco Chronicle said, \"As haunted-house thrillers go, Cold Creek Manor is more ludicrous than the average but at the same time more handsomely produced. Hokum with a big-budget gloss, it's a simple, formulaic nail-biter ... The script ... grafts from every possible thriller – most of which had pilfered their predecessors – and loads on implausibilities until we wonder why the actors play it seriously.\"[5]Peter Travers of Rolling Stone rated the film one star and commented, \"It's sad to see risk-taking director Mike Figgis do a generic thriller for a paycheck and then not even screw with the rules . . . the only things haunting this movie are cliches.\"[6]Steve Persall of the St. Petersburg Times graded the film D and thought \"all this bad acting and run-of-the-thrill dialogue might be entertaining if something would just happen besides a silly snake scare and a wan truck chase. The movie plays like an all-star episode of This Old House for the first hour, a telenovela for the next 30 minutes, then, finally, a hack boogeyman flick in the last reel. This isn't a movie, it's channel surfing.\"[7]Todd McCarthy of Variety called the film \"a woefully predictable imperiled-yuppie-family-under-siege suspenser that hardly seems worth the attention of its relatively high-profile participants. Taking a break from his multiple-perspective digicam experiments, helmer Mike Figgis displays at best a half-hearted interest in delivering the commercial genre goods, while Dennis Quaid and Sharon Stone fish in vain to find any angles to play in their dimension-free characters.\"[8]","box_office":"$29.1 million[1]","cinematography":"Declan Quinn","production_company":"Touchstone Pictures Red Mullet Cold Creek Manor Productions","directed_by":"Mike Figgis","release_dates":"September 17, 2003 (2003-09-17) (premiere)|September 19, 2003 (2003-09-19) (United States)||||","Production":"The film was shot on location in Cambridge, Kitchener, Ayr, and Toronto (all in Ontario).The soundtrack includes \"All My Ex's Live in Texas\" by George Strait and \"On the Road Again\" by Canned Heat.","Box office":"The film opened in 2,035 theaters in the United States on September 19, 2003, and grossed $8,190,574 in its opening weekend, ranking #5 at the box office, behind Underworld, Secondhand Lions, The Fighting Temptations, and Once Upon a Time in Mexico. It eventually earned $21,386,011 in the US and $7,733,423 in foreign markets, for a total worldwide box office of $29,119,434.[1]","produced_by":"Mike Figgis Annie Stewart","starring":"Dennis Quaid Sharon Stone Stephen Dorff Juliette Lewis Kristen Stewart Christopher Plummer","running_time":"118 minutes[1]","music_by":"Mike Figgis","edited_by":"Dylan Tichenor","written_by":"Richard Jefferies"}