{"country":"United Kingdom","distributed_by":"IFC Films (North America)","Plot":"Boogie Woogie is a comedy of manners, its cast of characters devouring each other in a small world awash with big money. Set against the backdrop of contemporary London and the international art scene, it casts an eye over the appetites and morality of some of its major players. Dealers, collectors, artists, and wannabes vie with each other in a world in which success and downfall rest on a thin edge.","language":"English","Reception":"Richard Clayton—in a Sunday Times article about the film that focuses on \"who inspired its unsavoury characters\"—called it \"The Devil Wears Prada and Hangs Out at Private Views, but with a lot more sex and naughty bits.\"[1] According to a National Public Radio review, \"just about all the acting in this otherwise pedestrian satire is fabulous, and for want of other diversions you might amuse yourself itemizing all the squandered talent\"; the film conflates \"black comedy with cynicism\" and \"ends, dispiritingly, pretty much where it began.\"[5] The Daily Beast called it a \"dead-on satire of the contemporary art world that is loved by the very audience it savages.\"[6] Rex Reed called it a \"tepid spoof that only occasionally evokes a reluctant smile\" and said it \"failed to capture the nuances or craft a more brutal, incisive exposé of the art milieu.\"[7]","cinematography":"John Mathieson","directed_by":"Duncan Ward","boogie_woogie":"Theatrical release poster","release_dates":"26 June 2009 (2009-06-26) (EIFF)|16 April 2010 (2010-04-16) (United Kingdom)||||","Production":"Danny Moynihan's novel for Boogie Woogie was published in 2000, based on his hedonistic New York years.[2]Dennis Hopper originally held the option to adapt the novel into a screenplay for a film to be set in New York City; later, Moynihan's friend, Duncan Ward, a documentary film-maker, became involved, with Rachel Weisz agreeing to play the \"central, nubile gallerist\" role eventually portrayed by Graham.[2]After Weisz dropped out, producers switched the film's location to London for cost reasons; Moynihan \"discovered then-unknown Amanda Seyfried living around the corner in Chelsea\" and got her cast as an \"art-world nymphet\"; Charlotte Rampling, a family friend of Moynihan's, got a cameo appearance.[2] Principal photography took place in London in December 2006.[4]","produced_by":"Danny Moynihan Kami Naghdi Christopher Simon Cat Villiers","starring":"Gillian Anderson, Alan Cumming, Heather Graham, Danny Huston, Christopher Lee","music_by":"Janusz Podrazik","edited_by":"Kant Pan","written_by":"Danny Moynihan"}