{"Cast":"Also cast as part of Eden Sinclair's team were Adrian Lester as Sergeant Norton, Chris Robson as Miller, and Leslie Simpson as Carpenter. The names Miller and Carpenter were nods to directors George Miller and John Carpenter, whose films influenced Marshall's Doomsday.[7] Sean Pertwee and Darren Morfitt portrayed the team's medical scientists, Dr Talbot and Dr Stirling, respectively. MyAnna Buring portrayed Kane's daughter Cally.[10] Emma Cleasby played Eden's mother at the start of the film.","country":"United Kingdom|United States|Germany|South Africa[1]|","distributed_by":"Universal Pictures","Plot":"In 2008, an unknown killer virus, dubbed \"The Reaper Virus\" infected Scotland. Unable to contain the outbreak or cure the infected, The UK government built a massive 60-foot wall that isolated Scotland from the rest of Britain. The quarantine was deemed a success; however, the extreme method employed by the government destroyed diplomatic and economic relations between the UK and the rest of the world. This led to massive unemployment, civil unrest and extreme economic turmoil, causing the UK to collapse into a dystopia.In 2035, 27 years after the quarantine, during a raid, police discover several people infected with Reaper Virus. The Prime Minister John Hatcher shares with domestic security chief Captain Nelson satellite footage of survivors in Scotland. Believing a cure may exist, Hatcher orders Nelson to send a team into Scotland to find medical researcher Dr. Kane, who was working on a cure when Scotland was quarantined. Nelson chooses Major Eden Sinclair to lead the team.Sinclair's team crosses the wall and goes to Glasgow, Dr. Kane's last known location. In Glasgow, while searching the local hospital for survivors, Sinclair and her team are ambushed by a group of marauders. Sgt. Norton and Dr. Stirling manage to escape, while the team suffers heavy casualties. Sinclair and Dr. Talbot are captured by what turns out to be a huge gang of brutal cannibals. Sinclair is interrogated by the gang's leader, Sol, who plans to use her as leverage to cross the wall and leave Scotland. He leaves and joins the rest of the gang, who grill Dr. Talbot and eat him. With the help of Cally, another prisoner, Sinclair escapes and kills Viper, Sol's lover. After meeting with Norton and Stirling, they escape on a train. Cally reveals that she and Sol are Kane's children. Unsatisfied with Kane's rule, Sol left to create his own army.Meanwhile, Hatcher plans secretly to isolate the central London area because of the infection. However, an infected man breaks into his office and tries to kill him. Nelson shoots and kills the man, but his blood splatters on Hatcher. Michael Canaris, Hatcher's right hand man, quarantines him and takes his place as de facto Prime Minister. Hatcher later commits suicide.After leaving the train, Sinclair's group are arrested by soldiers armed with archaic weapons and armor. They are taken to a medieval castle and imprisoned. Their leader, Marcus Kane, tells Sinclair the truth: there is no cure, only people with a natural immunity. Originally a medical researcher, he was devastated when his family was left behind during the quarantine. After losing of his wife, Kane became a twisted, sadistic leader. He sentences Sinclair and her group to death, pitting Sinclair against Telamon, his executioner, in a small fighting ground to entertain his followers. Sinclair subdues then kills Telamon. During the duel, the rest of the group escapes, retrieves their equipment and rescue Sinclair.Sinclair, Norton, Stirling and Cally escape to a fallout shelter entrance on horseback. They locate an underground facility in the forest and find an intact 2007 Bentley Continental GT, which they fuel up. Kane's medieval knights arrive them and kill Norton. Sinclair and the others drive the Bentley back to the quarantine wall. On the way, they are intercepted by Sol's gang, who seeks to avenge Viper's death. After a high-speed chase, Sol and many of his men are killed and Sinclair's group escape.The car is tracked down by a government gunship. Canaris arrives and reveals he will let the virus continue as a form of population control and profit. Cally's blood is to be used as a vaccine for the virus. Calley and Stirling board the gunship, while Sinclair chooses to stay behind. Nelson flies into the quarantine zone to speak with Sinclair and she gives him a recording of the conversation, the evidence to bring down Canaris. The recording is later broadcast to the rest of the country. Sinclair retrieves Sol's head and returns to his gang. Looking at the head, they cheer, accepting Sinclair as their new leader.","language":"English","box_office":"US$22,211,426 (worldwide) £1,034,659[3] (United Kingdom)","cinematography":"Sam McCurdy","directed_by":"Neil Marshall","production_companies":"Rogue Pictures Crystal Sky Pictures Intrepid Pictures","release_dates":"14 March 2008 (2008-03-14) (United States)|9 May 2008 (2008-05-09) (United Kingdom)||||","Production":"Director Neil Marshall lived near the ruins of Hadrian's Wall, a Roman fortification built to defend England against Scotland's tribes. The director fantasised about what conditions would cause the Wall to be rebuilt and imagined a lethal virus would work. Marshall had also visualised a mixture of medieval and futuristic elements: \"I had this vision of these futuristic soldiers with high-tech weaponry and body armour and helmets—clearly from the future—facing a medieval knight on horseback.\" The director favoured the English/Scottish border as the location for a rebuilt wall, finding the location more plausible than a lengthy boundary between the United States and Canada. Additionally, Scotland is the home to multiple castles, which fit Marshall's medieval aspect.[11]The lethal virus in Doomsday differs from contemporary films like 28 Days Later and 28 Weeks Later by being an authentic plague that actually devastates the population, instead of infecting people so they become aggressive cannibals or zombies. Marshall intended the virus as the backdrop to the story, having survivors scavenge for themselves and set up a primitive society. The director drew from tribal history around the world to design the society. Though the survivors are depicted as brutal, Marshall sought to have \"shades of gray\" by characterising some people in England as selfishly manipulative.[11]The director intended Doomsday as a tribute to post-apocalyptic films from the 1970s and 1980s, explaining, \"Right from the start, I wanted my film to be an homage to these sorts of movies, and deliberately so. I wanted to make a movie for a new generation of audience that hadn't seen those movies in the cinema—hadn't seen them at all maybe—and to give them the same thrill that I got from watching them. But kind of contemporise it, pump up the action and the blood and guts.\" Cinematic influences on Doomsday include:[12]Marshall also cited Metalstorm (1983),[13] Zulu (1964),[14] and works of director Terry Gilliam like The Fisher King (1991) as influences in producing Doomsday.[15] Marshall acknowledged that his creation is \"so outrageous you've got to laugh\". He reflected, \"I do think it's going to divide audiences... I just want them to be thrilled and enthralled. I want them to be overwhelmed by the imagery they've seen. And go back and see it again.\"[16]Rogue Pictures signed Marshall to direct Doomsday in October 2005,[17] and in November 2006, actress Rhona Mitra was signed to star in Doomsday as the leader of the elite team.[4] Production was budgeted at £17 million,[2] an amount that was triple the combined total of Marshall's previous two films, Dog Soldiers (2002) and The Descent (2005).[16] The increase in scale was a challenge to the director, who had been accustomed to small casts and limited locations. Marshall described the broader experience: \"There's fifty or more speaking parts; I'm dealing with thousands of extras, logistical action sequences, explosions, car chases — the works.\"[11]Production began in February 2007 in South Africa,[18] where the majority of filming took place.[2] South Africa was chosen as a primary filming location for economic reasons, costing a third of estimated production in the United Kingdom.[19] Shooting in South Africa lasted 56 days out of 66 days, with the remaining ten taking place in Scotland. Marshall said of South Africa's appeal, \"The landscape, the rock formations, I thought it was about as close to Scotland as you're likely to get, outside of Ireland or Wales.\"[20] In Scotland, secondary filming took place in the city of Glasgow, including Haghill in the city's East End, and at Blackness Castle in West Lothian,[21] the latter chosen when filmmakers were unable to shoot at Doune Castle.[20] The entire shoot, involving thousands of extras, included a series of complex fight scenes and pyrotechnical displays.[16] The director sought to minimise the use of computer-generated elements in Doomsday, preferring to subscribe to \"old-school filmmaking\".[11] In the course of production, several sequences were dropped due to budgetary concerns, including a scene in which helicopter gunships attacked a medieval castle.[22]A massive car chase scene was filmed for Doomsday, described by Marshall to be one part Mad Max, one part Bullitt (1968), and one part \"something else entirely different\".[23] Marshall had seen the Aston Martin DBS V12 used in the James Bond film Casino Royale (2006) and sought to implement a similarly \"sexy\" car. Since the car company did not do product placement, the filmmakers purchased three new Bentley Continental GTs for US$150,000 each.[16] The film also contains the director's trademark gore and violence from previous films, including a scene where a character is cooked alive and eaten.[13] The production was designed by Simon Bowles who had worked previously with Marshall on \"Dog Soldiers\" and \"The Descent\". Paul Hyett, the prosthetic make-up designer who worked on The Descent, contributed to the production, researching diseases including sexually transmitted diseases to design the make-up for victims of the Reaper virus.[24]The visual effects for Doomsday stemmed from the 1980s stunt-based films, involving approximately 275 visual effects shots. While filmmakers did not seek innovative visual effects, they worked with budget restrictions by creating set extensions. With most shots taking place in daylight, the extensions involved matte paint and 2D and 3D solutions. The visual effects crew visited Scotland to take reference photos so scenes that were filmed in Cape Town, South Africa could instead have Scottish backgrounds. Several challenges for the visual effects crew included the illustration of cow overpopulation in line with a decimated human population and the convincing creation of the rebuilt Hadrian Wall in different lights and from different distances. The most challenging visual effects shot in Doomsday was the close-up in which a main character is burned alive. The shot required multiple enhancements and implementations of burning wardrobe, burning pigskin, and smoke and fire elements to look authentic.[25]Neil Marshall's car chase sequence also involved the use of visual effects. A scene in which the Bentley crashes through a bus was intended to implement pyrotechnics, but fire marshals in the South African nature reserve, the filming location for the scene, forbade their use due to dry conditions. A miniature mock-up was created and visual effects were applied so the filming of the mock-up would overlay the filming of the actual scene without pyrotechnics. Other visual effects that were created were the Thames flood plain and a remote Scottish castle. A popular effect with the visual effects crew was the \"rabbit explosion\" scene, depicting a rabbit being shot by guns on automatic sensors. The crew sought to expand the singular shot, but Neil Marshall sought to focus on one shot to emphasize its comic nature and avoid drawing unnecessary sympathy from audiences.[25]Marshall originally intended to include 1980s synth music in his film, but he found it difficult to combine the music with the intense action. Instead, composer Tyler Bates composed a score using heavy orchestra music.[22] The film also included songs from the bands Adam and the Ants, Fine Young Cannibals, Siouxsie and the Banshees, Frankie Goes to Hollywood, and Kasabian.[10] The song \"Two Tribes\" by Frankie Goes to Hollywood was the only song to remain in the film from the first draft of the screenplay. \"Spellbound\" by Siouxsie and the Banshees was a favorite song of the director, who sought to include it. Marshall also hoped to include the song \"Into the Light\" by the Banshees, but it was left out due to the producer disliking it and the cost being too high to license it.[26]","produced_by":"Benedict Carver Steven Paul","starring":"Rhona Mitra|Bob Hoskins|Adrian Lester|Alexander Siddig|David O'Hara|Malcolm McDowell|","running_time":"105 minutes (United States) 108 minutes (United Kingdom)","doomsday":"Theatrical release poster","music_by":"Tyler Bates","edited_by":"Andrew MacRitchie Neil Marshall","Release":"For its theatrical run, the film was originally intended to be distributed by Focus Features under Rogue Pictures, but the company transferred Doomsday among other films to Universal Pictures for larger-scale distribution and marketing beginning in 2008.[27] Doomsday was commercially released on 14 March 2008 in the United States and Canada in 1,936 theatres, grossing US$4,926,565 in its opening weekend and ranking seventh in the box office,[28] which Box Office Mojo reported as a \"failed\" opening.[29] Its theatrical run in the United States and Canada lasted 28 days, ending on 10 April 2008, having grossed US$11,008,770.[28] The film opened in the United Kingdom, Republic of Ireland, and Malta on 9 May 2008, grossing a total of US$2,027,749 in its entire run.[30] The film's performance in the UK was considered a \"disappointing run\".[31] The film premiered in Italy in August 2008, grossing an overall US$500,000.[32] Worldwide, Doomsday has grossed US$22,211,426.[28]\"The director of top horror flicks The Descent and Dog Soldiers was given more money for his latest effort, but many thought he wasted it on a collection of flashy set pieces without much interlinking plot in between.\"Doomsday was not screened for critics in advance of its commercial opening in cinemas.[33] The film received mixed reviews from critics. Rotten Tomatoes reported that 50% of critics gave the film positive write-ups, based on a sample of 68, with an average score of 5.2/10. The website's consensus reads, \"Doomsday is a pale imitation of previous futuristic thrillers, minus the cohesive narrative and charismatic leads.\"[34] At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, the film has received an average score of 51, based on 14 reviews.[35]Alison Rowat of The Herald perceived Doomsday as \"decidedly everyday\" for a thriller, with Marshall's script having too many unanswered questions and characters not fully developed despite a decent cast. Rowat said, \"In his previous films, Marshall made something out of nothing. Here he does the opposite\". The critic acknowledged the attempted homages and the B-movie approach but thought that \"there has to be something more\".[36] Steve Pratt of The Northern Echo weighed in, \"As a writer, Marshall leaves gaping holes in the plot while as a director he knows how to extract maximum punch from car chases, beatings and fights without stinting on the gore as body parts are lopped off with alarming frequency and bodies squashed to a bloody pulp.\"[37] Philip Key of the Liverpool Daily Post described the film, \"Doomsday is a badly thought-out science fiction saga which leaves more questions than answers.\"[38]Alonso Duralde of MSNBC described Doomsday: \"It's ridiculous, derivative, confusingly edited and laden with gore, but it's the kind of over-the-top grindhouse epic that wears down your defenses and eventually makes you just go with it.\" Duralde believed that Mitra's character would have qualified as a \"memorable fierce chick\" if the film was not so silly.[39] David Hiltbrand of The Philadelphia Inquirer rated Doomsday at 2.5 out of 4 stars and thought that the film was better paced than most fantasy-action films, patiently building up its action scenes to the major \"fireworks\" where other films would normally be exhausted early on.[40]Reviewer James Berardinelli found the production of Doomsday to be a mess, complaining, \"The action sequences might be more tense if they weren't obfuscated by rapid-fire editing, and the backstory is muddled and not all that interesting.\" Berardinelli also believed the attempted development of parallel storylines to be too much for the film, weakening the eventual payoff.[41] Dennis Harvey of Variety said Neil Marshall's \"flair for visceral action\" made up for Doomsday's lack of originality and that the film barely had a dull moment. He added, \"There's no question that Doomsday does what it does with vigor, high technical prowess and just enough humor to avoid turning ridiculous.\" Harvey considered the conclusion relatively weak, and found the quality of the acting satisfactory for the genre, while reserving praise for the \"stellar\" work of the stunt personnel.[42] Peter Hartlaub of the San Francisco Chronicle also praised the film's stunts, noting that it was reminiscent of \"the beauty of the exploitation film era\". Hartlaub said of the effect, \"Hire a couple of great stuntmen and a halfway sober cinematographer, and you didn't even need a screenwriter.\"[43]Matt Zoller Seitz of The New York Times saw Rhona Mitra's character as a mere impersonation of Snake Plissken and considered the film's major supporting characters to be \"lifeless\". Seitz described his discontent over the lack of innovation in the director's attempted homages of older films: \"Doomsday is frenetic, loud, wildly imprecise and so derivative that it doesn’t so much seem to reference its antecedents as try on their famous images like a child playing dress-up.\"[44]Scotland's tourism agency VisitScotland welcomed Doomsday, hoping that the film would attract tourism by marketing Scotland to the rest of the world. The country's national body for film and television, Scottish Screen, had contributed £300,000 to the production of Doomsday, which provided economic benefits for the cast and crew who dwelt in Scotland. A spokesperson from Scottish Screen anticipated, \"It's likely to also attract a big audience who will see the extent to which Scotland can provide a flexible and diverse backdrop to all genres of film.\"[45]In contrast, several parties have expressed concern that Doomsday presents negativity in England's latent view of Scotland based on their history. Angus MacNeil, member of the Scottish National Party, said of the film's impact: \"The complimentary part is that people are thinking about Scotland as we are moving more and more towards independence. But the film depicts a country that is still the plaything of London. It is decisions made in London that has led to it becoming a quarantine zone.\"[45]Doomsday was not nominated nor considered as a possible contender at the BAFTA Scotland awards despite being one of the largest productions in Scotland in recent[when?] memory; £2 million was spent on local services. Director Neil Marshall applied for membership with the organisation to add \"fresh blood\", but Doomsday was not mentioned during jury deliberations. According to a spokesperson from the organisation, the film was not formally submitted for consideration, and no one directly invited the filmmakers to discuss a possible entry. Several of BAFTA Scotland's jury members believed that the criteria and procedures for a Scottish film were unclear and could have been more formalised.[46]Doomsday was used as inspiration in building a haunted house for Halloween Horror Nights in Orlando.[47]Doomsday was the first Blu-ray title released by Universal Pictures after the studio's initial support of the now-folded HD DVD format.[48] The unrated version was released on DVD and Blu-ray on 29 July 2008 in the United States, containing an audio commentary and bonus materials covering the film's post-apocalyptic scenario, visual effects, and destructive vehicles and weapons.[49] IGN assessed the unrated DVD's video quality, writing, \"For the most part, it's a crisp disc that's leaps above standard def.\" The audio quality was considered up to par with the film's loud scenes, though IGN found volume irregularity between the loud scenes and the quiet scenes. IGN called the commentary \"a pretty straight-up behind-the-scenes take on the movie and a bit over-congratulatory\". It found the \"most fascinating\" featurette to be about visual effects, while deeming the other featurettes skippable.[50]","written_by":"Neil Marshall","budget":"£17 million[2]"}