{"country":"United States","deliver_us_from_eva":"Theatrical release poster","distributed_by":"Focus Features","Plot":"Evangeline (Eva for short) Dandridge works for The Los Angeles Health Department as an inspector, a job most suitable for her bossy and perfectionist nature. She and her sisters, Kareenah, Bethany, and Jacqui, have been taking care of each other since their parents died when they were young. As a result of the combination of her personality and her family's circumstances, Eva's level of involvement in her sisters' lives causes a high level of tension between her and her sisters' significant others (Mike, Tim, and Darrell, respectively).While the significant others are out at a bar complaining about how interfering Eva is, they come across Mike's old friend Ray Adams. Ray is a \"Master Player\" who can handle even the most difficult women. The guys hire Ray to seduce Eva and convince her to move away with him so they can finally be free of her meddling. Little do they know Eva has already been offered a new job in Chicago.After a disastrous first date, Ray tells the guys that Eva is too difficult for even him to handle and offers to return their money. However, when he runs into Eva while at work delivering meat to local restaurants they make amends and begin a relationship. Eva and Ray fall in love, and Eva even temporarily abandons her shrewish ways. But when things start to get serious, Eva's sisters all start comparing their relationships to Ray and Eva's relationship, making things even worse than before. After they find out about Eva's job offer, the significant others panic and attempt to break up the blossoming romance, claiming their wives never let them hear the end of the latest with Eva and Ray, and that Eva intends to stay in the city. Things get so complicated that the men finally hatch a daring plan: kidnap Ray, lie to Eva about his death in an accident and cajole her into leaving the city.Eva believes them and arranges a tearful funeral for her \"dead\" boyfriend, but in the middle of the service Ray appears, having escaped his prison, and the whole truth comes out. An angry Eva dumps Ray, leaves the city and resolves to start a new life. But Ray hasn't quite given up. He shows up at Eva's job on a white horse and persuades her to forgive him. She agrees to take him back, split up the inheritance, and apologizes for her interference in her sisters' relationships.","language":"English","Reception":"Deliver Us from Eva received mixed reviews from critics, as it holds a 44% rating on Rotten Tomatoes based on 81 reviews.The film opened at No. 6 in the U.S. Box office in the weekend of February 7, 2003, raking in $6,648,374 USD in its first opening weekend.","box_office":"$22,573,594","cinematography":"Alexander Gruszynski","directed_by":"Gary Hardwick","release_dates":"February 7, 2003 (2003-02-07)","produced_by":"Paula Weinstein Barry Levinson Paddy Cullen Len Amato","starring":"LL Cool J Gabrielle Union Essence Atkins Duane Martin Mel Jackson Meagan Good","running_time":"105 minutes","music_by":"Marcus Miller","edited_by":"Earl Watson","written_by":"James Iver Mattson B. E. Brauner Gary Hardwick"}