{"distributed_by":"Universal Pictures","screenplay_by":"David M. Evans","story_by":"Ken Richards Janus Cercone","Plot":"Deuce Cooper (Matt LeBlanc) is a farm boy who arrives at an open tryout for the Santa Rosa Rockets minor league baseball team. He makes the team after blowing away the scouts with his 'rocket' arm as well as having a strong training camp. Deuce also befriends a chimpanzee, 'Ed,' after being told he is his new roommate/teammate. After they move in to their apartment, Deuce develops a relationship with his neighbor, Lydia. Also, Ed becomes very close with her daughter, Elizabeth. Deuce's game really begins to take off as well as Ed's and the team becomes a league contender. Deuce's coach, Chubb, thinks Deuce can be an MLB starter if he keeps his head on straight. But after the owners sell Ed to make a buck, Deuce takes matters into his own hands and goes to find Ed only to see him being tortured by a pair of goons. Deuce saves Ed but Ed escapes and finds a truck of Frosted Bananas and doesn't realize he is stuck inside the trailer, which is ice cold. Ed ends up in the hospital from almost freezing to death before the final game of the season and Deuce questions his own ability to continue playing without his best friend. Deuce ends up playing and struggles right off the bat. But when Ed, Elizabeth and Lydia arrive at the game together, Deuce turns up the heat and the Rockets take the championship. Ed, Deuce, Lydia and Elizabeth then become a family and live happily ever after.","Reception":"The film was overwhelmingly panned by critics and was a box office disappointment. Based on 16 reviews, Ed has a 0% \"rotten\" rating according to Rotten Tomatoes. It received four Razzie Award nominations for Worst Picture, Worst Screenplay (David M. Evans), and Worst Screen Couple (for LeBlanc and Ed the mechanical chimp), losing all of those categories to Striptease starring Demi Moore. LeBlanc was also nominated for Worst New Star for his role, but \"lost\" to Pamela Anderson in Barb Wire.","box_office":"$6,288,000","cinematography":"Alan Caso","directed_by":"Bill Couturié","release_dates":"March 15, 1996 (1996-03-15)|||||","produced_by":"Rosalie Swedlin Bill Finnegan[1]","starring":"Matt LeBlanc Jack Warden Jim Caviezel Jayne Brook","running_time":"94 minutes","music_by":"Stephen Endelman","edited_by":"Robert K. Lambert Todd E. Miller","budget":"$24 million"}