{"country":"United Kingdom","distributed_by":"United Artists","633_squadron":"Theatrical release poster","Plot":"When the Norwegian resistance leader, Royal Norwegian Navy Lieutenant Erik Bergman, travels to Great Britain to report the location of a German V-2 rocket fuel plant, the Royal Air Force's No. 633 Squadron is assigned to destroy it. The squadron is led by Wing Commander Roy Grant, an ex-Eagle Squadron pilot (an American serving in the RAF before the US entered the war).The plant is in a seemingly impregnable location beneath an overhanging cliff at the end of a long, narrow fjord lined with numerous anti-aircraft guns. The only way to destroy the plant is by collapsing the cliff on top of it, a job for 633 Squadron's fast and manoeuvrable de Havilland Mosquitos. The squadron trains in Scotland, where there are narrow glens similar to the fjord. There, Grant is introduced to Bergman's sister, Hilde. They are attracted to each other, despite Grant's aversion to wartime relationships.The Norwegian resistance is tasked with destroying the anti-aircraft defences of the facility immediately before the scheduled attack. When unexpected German reinforcements arrive, Bergman returns to Norway to try to gather more forces. However, he is captured while transporting desperately needed weapons, taken to Gestapo headquarters and tortured for information. Since Bergman knows too much, he must be silenced before he breaks. Grant and newly married Flying Officer Bissell are sent in with a single Mosquito to bomb the Gestapo building. Though they are successful, their shot-up Mosquito fighter-bomber crashes on its return, and Bissell is wounded and becomes blind. A tearful Hilde thanks Grant for ending her brother's suffering.Still worried, Air Vice-Marshal Davis decides to move up the attack to the next day. However, the resistance fighters are ambushed and killed, leaving the defences still intact. Although Grant is given the option of aborting, he decides to press on. The factory is destroyed at the cost of the entire squadron, though a few crews are able to ditch in the fjord. Grant crash-lands but a local man helps Grant's navigator, Flying Officer Hoppy Hopkinson, pull the wounded wing commander from the burning wreckage. Back in Britain, Davis tells a fellow officer who is aghast at the losses, \"You can't kill a squadron.\"","language":"English","Reception":"633 Squadron had its world premiere on 4 June 1964 at the Leicester Square Theatre in the West End of London. While critics derided the wooden acting and hackneyed plot, especially the miscast Mirisch Pictures contract star George Chakiris, the aerial scenes were considered spectacular and with Ron Goodwin's music remained the main attraction. The extensive footage of the Mosquito was also of considerable interest to aviation enthusiasts. 633 Squadron appears on the list of \"The 100 Greatest War Films\" voted by the public of the UK and is featured in the 2005 documentary of the same name.","box_office":"$1,700,000 (US/Canada) Please note this figure is rentals accruing to distributors not total gross.[2]","Historical accuracy":"The Royal Air Force (RAF) did not form a unit called \"633 Squadron\" during the Second World War. However, there was a 613 Squadron, equipped with Mosquitos, and credited with an attack on a Dutch Central Population Registry building on 11 April 1944, where the Germans held their Dutch Gestapo records.A multinational Allied war effort is depicted: in addition to an American central character, the film features members of the Norwegian resistance, airmen from India, New Zealand and Australia. This reflects three historical facts: first, airmen of many nationalities joined the RAF proper; second, under the British Commonwealth Air Training Plan, airmen from Commonwealth air forces were frequently assigned to RAF units and; third, many squadrons belonging to Commonwealth air forces, or European governments-in-exile were under the operational control of the RAF during the war.[14]The film draws from many of the real operations of 617 Squadron, in particular their attack on the German battleship Tirpitz in a Norwegian fjord, although that squadron used four-engine Avro Lancaster heavy bombers to carry the Barnes Wallis designed, 6-ton Tallboy Earthquake bombs, not the twin-engine de Havilland Mosquitos depicted. The Mosquito, however, was used by 618 Squadron, also involved with another of Barnes Wallis' \"bouncing bombs\" called High Ball. Though High Ball was never used operationally, 618 Squadron was used as a special operations unit and is, probably, the closest match to \"633\".The one plane raid on Gestapo Headquarters to kill Erik before he talked bore similarities to the Oslo Mosquito raid.The original plot however, has a similarity to a real mission dispatched by the RAF. The novel plot did not mention the nature of the target, only that it was a highly rated objective in Norway that could not be reached by the RAF until the Mosquito became operational. There was such a target, the molybdenum mine in Knaben in southern Norway. Typical of the mineral wealth that Hitler stated was worth the sacrifice of a significant portion of the Kriegsmarine, Knaben could produce four-fifths of the German war machine's requirements for molybdenum, an important element in the production of armour plate. The mine at Knaben was too small to hit in a night raid, and sending heavy, long-range bombers in daylight would have met with disaster. Light bombers such as the Blenheim were ideal for the job, but did not have the necessary range. Knaben was within the range of the Mosquito, however, and 139 Squadron was given the task on 3 March 1943. Nine Mosquitoes were dispatched. All placed their bombs on target, though one failed to return. The target was out of action for some time and was later visited by the United States Army Air Forces's Eighth Air Force.The \"jeep\" partly hidden behind a bush in one of the Scottish Highlands training sequences is a post-war Land Rover, and the \"German halftrack\" is an Alvis Saracen.The \"German fighters\" are actually Nord Pingouin (French licence-built variants of the Messerschmitt Bf 108 Taifun) sports and touring aircraft, which frequently were substituted for the superficially similar Messerschmitt Bf 109 fighter in films of this period.","cinematography":"Edward Scaife","production_company":"Mirisch Films","directed_by":"Walter Grauman","Home media":"633 Squadron was released on Region 2 DVD on 5 May 2003. The movie is presented in Widescreen 2.35:1 format and Dolby Digital 2.0 sound. The original trailer is included as an extra.","Soundtrack":"The musical score of 633 Squadron was written by the British composer Ron Goodwin and became well known to the public after the film's initial release.","release_dates":"4 June 1964 (1964-06-04)|||||","Production":"Authentic period aircraft were used instead of models or special effects to create many of the aerial sequences. In part, this was because 633 Squadron was the first film shot in colour in Panavision widescreen format, a choice that made the use of archival film (a common expedient and cost-saving measure in previous films) problematic. However, some aerial sequences were created using models and these are very obvious due to the unrealistic ways the models move.The film and the novel follow the same basic plot, but many details were changed for the film. In the novel on which the film was based, Roy Grant was British. Robertson, a U.S. actor, was cast because he was popular internationally at the time and because an American central character improved the production's access to finance and worldwide audiences. Additionally, Robertson was an experienced pilot, owned a Supermarine Spitfire and was personally interested in making the film as an accurate portrayal of wartime flying. Although he was refused permission to fly for the purposes of the film, his scenes stand out as a realistic depiction of operational flying.[5] When Robertson expressed reservations about the script, producer Walter Mirisch engaged U.S. scriptwriter Howard Koch, resident in London, to rewrite the film to placate him.[6] At the end of the film it is unclear whether Grant survives the mission or not. However, in the book he does survive, although he is taken captive as a prisoner of war. In the novel, much more time was devoted to the men of the squadron's personal lives than we see in the finished film. Several more 633 Squadron books were written to follow up the original story, but these were never adapted.The scenes were shot in the Scottish Highlands near Glencoe, with most of the attack sequences filmed above Loch Morar and Loch Nevis. The distinctive outline of the island of Eigg can be seen behind some of the cockpit shots. While the spectacular aerial scenes used real aircraft, more dangerous sequences were created with models.RAF Bovingdon substituted for the fictional RAF Sutton Craddock bomber airfield. The riverbank where Robertson's character romances Maria Perschy's was also used in a similar early scene in the Bond film From Russia with Love. Some scenes were filmed at Staverton Airport, Gloucestershire, and the nearby Churchdown Hill could be seen in some shots.The Lairig Ghru in the Cairngorms was used for the training flight sequences and scenes with the Norwegian resistance.Walter Grauman, the director, collected flying period aircraft, creating the \"Mirisch Air Force\" or M.A.F. as it was dubbed.[3] Grauman's wartime experience as a North American B-25 Mitchell bomber pilot helped create an authentic aviation epic.[7]The film features eight De Havilland Mosquitos, a superlative aircraft nicknamed the \"Wooden Wonder\" by wartime crew due to its innovative structure, remarkable versatility and unprecedented levels of performance. As the Royal Air Force had recently retired the type in 1963, civilian operators leased mostly former converted bomber examples (TT Mk 35) to the RAF for target-towing.[8] Scouring RAF airfields at Exeter, South Devon, Henlow, Shawbury and the Central Flying School at Little Rissington provided not only ten authentic aircraft, but also vehicles and equipment from the war.[9]Eight Mosquitos were primarily used, five airworthy and others that could be taxied on runways or used as set dressing. The airworthy TT 35 Mosquitos were converted to resemble a fighter-bomber variant (FB Mk VI). The TT 35 models had their clear nosecones and side windows painted over and dummy machine gun barrels fitted. One airworthy Mosquito was a T3 with a solid nose, which only required the fitting of dummy gun barrels. It lacked the two-stage Merlin engines, V-shaped windscreen and bulged bomb bay of the TT 35s. At least one surplus Mosquito was destroyed in a simulated crash scene.[10]The Mosquitos used in the film were:No German aircraft of the right type were available; consequently Messerschmitt Bf 108 aircraft were used to represent the Messerschmitt Bf 109.[11]Also, in the beginning scenes of the film, Lieutenant Eric Bergman's original escape from Norway is in a Miles Messenger.[11]The primary camera aircraft, a North American B-25 Mitchell set up as a camera ship by Greg Board (of The War Lover fame) and flown by him, also appears in the film, dropping Bergman back into Norway. The director and former Mitchell bomber pilot Walter Grauman was delighted to fly the B-25 himself, acting as co-pilot in the right-hand seat.A technical advisor, former RAF Group Captain Thomas Gilbert \"Hamish\" Mahaddie,[12] told Walter Mirisch that, considering the number of aircraft used in the film, Mirisch \"commanded the 14th largest air force in the world\" at the time.[13]","produced_by":"Cecil F. Ford Lewis J. Rachmil","starring":"Cliff Robertson George Chakiris","running_time":"102 minutes","Influence":"The film's climax shows the squadron flying through a deep fjord while being fired on by anti-aircraft guns. George Lucas stated that this sequence inspired the \"trench run\" sequence in Star Wars.[15]633 Squadron is well known in the UK for its regular appearances on television, and became almost a part of the Christmas schedule. Although erroneously considered a sequel, the film Mosquito Squadron is similar to 633 Squadron and influenced by it, even using footage from the original.The musical score served as the basis for the background music in the Commodore 64 port of the arcade game 1942.","music_by":"Ron Goodwin","edited_by":"Bert Bates","written_by":"Frederick E. Smith (novel) James Clavell Howard Koch","budget":"$1,300,000[1]"}