{"based_on":"Billy Lynn's Long Halftime Walk  by Ben Fountain","country":"United States","distributed_by":"TriStar Pictures","screenplay_by":"Jean-Christophe Castelli","billy_lynn's_long_halftime_walk":"Teaser poster","language":"English","cinematography":"John Toll","production_company":"Bona Film Group[1] Film4 The Ink Factory Studio 8 TriStar Productions","directed_by":"Ang Lee","release_dates":"November 11, 2016 (2016-11-11)|||||","Production":"Slumdog Millionaire's Oscar-winning screenwriter, Simon Beaufoy, was in 2014 adapting the novel for the screen, a Film4 film production in collaboration with a U.S. production company, The Ink Factory, and Sony Pictures' TriStar division. Also involved in the production are China's Bona Film Group and Studio 8, which is backed by the Chinese conglomerate Fosun.[3][4][5] Ang Lee would direct the film.[6][7] On February 25, 2015, a newcomer Joe Alwyn was set to star for the title role as Billy Lynn in the film.[8] Same day, Deadline revealed that director was showing interest in casting Garrett Hedlund for another major role in the film.[9] Steve Martin was also set on March 3, 2015, to star as Norm Oglesby.[10] Hedlund was confirmed on March 6, 2015, to play Sergeant Dime, the dynamic leader of the Bravo Company squad.[11] Beau Knapp was added to the cast on March 13, 2015, to play Crack, a man with violent tendencies.[12] Kristen Stewart was added to the cast on April 1, 2015, to play the role of Kathryn, Billy's older sister.[13] Same day, Ben Platt was also added to the cast to play Josh, the Dallas Cowboys organization worker and the person in charge of the Bravo Squad at the football stadium.[14] Vin Diesel and Chris Tucker were set on April 8, 2015, to star in the film as Shroom and Albert.[15]Filming began in the second week of April 2015, in Locust Grove, Georgia.[16][17] Filming will also take place in Atlanta and in Morocco.[14] There would be an interior scene shot in High Frame Rate 3D in Downtown Atlanta on April 17, 2015.[18] Ang Lee confirmed at CinemaCon that the film will be shot 120 frames per second which is the highest frame rate for a film to date. On May 14, 2015, filming was taking place at AmericasMart in Downtown Atlanta.[19]","produced_by":"Simon Cornwell|Stephenson Cornwell|Marc Platt|Tom Rothman|Rhodri Thomas|Ang Lee|","starring":"Kristen Stewart|Chris Tucker|Garrett Hedlund|Vin Diesel|Steve Martin|Joe Alwyn|","music_by":"Jeff Danna Mychael Danna","edited_by":"Tim Squyres","Release":"The film is scheduled to be released on November 11, 2016, by TriStar Pictures in 3D and IMAX 3D.[20]","budget":"$44–48 million[2]"}