{"country":"United States","Film content":"In Moore's discussions with various people—including South Park co-creator Matt Stone, the National Rifle Association's then-president Charlton Heston, and heavy metal musician Marilyn Manson—he seeks to explain why the Columbine massacre occurred and why the United States' violent crime rate (especially concerning crimes committed with firearms) is substantially higher than those of other nations.The film's title refers to the story that Eric Harris and Dylan Klebold—the two students responsible for the Columbine High School massacre—attended a school bowling class at 6:00 AM on the day they committed the attacks at school, which started at 11:17 AM. Later investigations showed that this was based on mistaken recollections, and Glenn Moore of the Golden Police Department concluded that they were absent from school on the day of the attack.[8]Moore incorporates the concept of bowling into the film in other ways as well. For example, the Michigan Militia use bowling pins for their target practice. When interviewing former classmates of the two boys, Moore notes that the students took a bowling class in place of physical education. He suggests that this might have very little educational value and the girls he interviews generally agree, noting how Harris and Klebold led introverted lifestyles and careless attitudes towards the game, and that nobody thought twice about it. Moore questions whether the school system is responding to the real needs of students or if they are reinforcing fear. Moore also interviews two young residents of Oscoda, Michigan. Moore suggests a culture of fear created by the government and the media leads Americans to arm themselves, to the advantage of gun-making companies. Moore suggests that bowling could have been just as responsible for the attacks on the school as Marilyn Manson, or even President Bill Clinton, who launched bombing attacks on Serbia at the time.[9]An early scene depicts a bank in Michigan that gives customers a free hunting rifle when they make a deposit of a certain size into a time deposit account.[10] The film follows Moore as he goes to the bank, makes his deposit, fills out the forms, and awaits the result of a background check before walking out of the bank carrying a brand new Weatherby hunting rifle. Just before leaving the bank, Moore asks: \"Do you think it's a little dangerous handing out guns at a bank?\"[11]About 20 minutes into the film, The Beatles song \"Happiness Is a Warm Gun\" plays during a montage in which footage of the following is shown:Early in the film, Moore links the violent behavior of the Columbine shooters to the presence of a large defense establishment manufacturing rocket technology in Littleton. It is implied that the presence of this facility within the community, and the acceptance of institutionalized violence as a solution to conflict, contributed to the mindset that led to the massacre.Moore conducts an interview with Evan McCollum, Director of Communications at a Lockheed Martin plant near Columbine, and asks him:So you don't think our kids say to themselves, 'Dad goes off to the factory every day, he builds missiles of mass destruction.' What's the difference between that mass destruction and the mass destruction over at Columbine High School?McCollum responds:I guess I don't see that specific connection because the missiles that you're talking about were built and designed to defend us from somebody else who would be aggressors against us.The film cuts to a montage of American foreign policy decisions, with the intent to counter McCollum's statement by citing examples of how the United States has frequently been the aggressor nation. This montage is set to the song \"What a Wonderful World\", performed by Louis Armstrong.The following is a transcript of the onscreen text in the Wonderful World segment:The montage ends with handheld-camera footage of United Airlines Flight 175 crashing into the South Tower of the World Trade Center on September 11, 2001, the audio consisting solely of the emotional reactions of the witnesses, recorded by the camera's microphone. On the website accompanying the film, Moore provides additional background information for this section.[13]Moore contrasts his portrayal of the U.S. attitude toward guns and violence with the attitude prevailing in areas of Canada where gun ownership is at similar levels to the U.S. He illustrates his thesis by visiting neighborhoods in Canada near the Canada–U.S. border, where he finds front doors unlocked and much less concern over crime and security. In regards to the film, Farber states “Moore's thesis, which he later elaborated in Fahrenheit 9/11, is that the fear-mongering that permeates American society contributes to our epidemic of gun violence\". We are also shown news stories being covered in Canada and how they don’t follow the “if it bleeds it leads” mentality. This adds to Moore's argument that the media is driving America's fear as well as their need for protection. The cartoon \"A Brief History of the United States of America\" encompasses Moore's view of where the fear in America started and how it's progressed and changed over the years.[14]In this section, there is a montage of several social pundits stating possible causes for gun violence. Many claim links with violence in television, cinema, and computer games; towards the end of the montage, however, the same people all change their claims to Marilyn Manson's responsibility. Following this is an interview between Moore and Marilyn Manson. Manson shares his views about the United States' climate with Moore, stating that he believes U.S. society is based on \"fear and consumption\", citing Colgate commercials that promise \"if you have bad breath, [people] are not going to talk to you\" and other commercials containing fear-based messages. Manson also mentions that the media, under heavy government influence, had asserted that his influence on the acts of Klebold and Harris was far greater than that of President Clinton, who ordered more bombings on Kosovo on April 20, 1999, than any other day during the Balkans campaign. When Moore asks Manson what he would say to the students at Columbine, Manson replies, \"I wouldn't say a single word to them; I would listen to what they have to say, and that's what no one did.\"[15]Moore follows up his climate of fear thesis by exploring popular explanations as to why gun violence is so high in the United States. He examines Marilyn Manson as a cause, but states that more German citizens listen to Marilyn Manson (per capita) and that the country has a larger Goth population than the United States, with less gun violence (Germany: 381 incidents per year). He examines violent movies, but notes that other countries have the same violent movies, showing The Matrix with French subtitles (France: 255 incidents per year). He also examines video games, but observes that many violent video games come from Japan (Japan: 39 incidents per year). He concludes his comparisons by considering the suggestion that the United States' violent history is the cause, but notes the similarly violent histories of Germany, Japan, France, and the United Kingdom (68 incidents per year). Moore ends this segment with gun-related-deaths-per-year statistics of the following countries:Moore takes two Columbine victims, Mark Taylor and Richard Castaldo (along with Brooks Brown, who remains unidentified during the segment), to the headquarters of American superstore KMart in Troy, Michigan, ostensibly to claim a refund on the bullets still lodged in their bodies. After a number of attempts to evade the issue, a KMart spokesperson says that the firm will change its policy and phase out the sale of handgun ammunition; this comes after Moore and the victims go to the nearest KMart store in Sterling Heights, Michigan, purchase all of their ammunition, and return the next day with several members of the media. \"We've won,\" says Moore, in disbelief. \"That was more than we asked for.\"[16]","Awards and nominations":"During the screening at the 2002 Cannes Film Festival the film received a 13-minute standing ovation.[34] It also won \"Most Popular International Film\" at the 2002 Vancouver International Film Festival.Moore was both applauded and booed at the Academy Awards on March 23, 2003, when he used his acceptance speech as an opportunity to proclaim his opposition to the United States-led invasion of Iraq and the presidency of George W. Bush, which had begun just a few days earlier.[35]The film was nominated for the prestigious Grand Prix of the Belgian Syndicate of Cinema Critics.In 2005, Bowling for Columbine was voted the third most popular film in the British Channel 4 program The 50 Greatest Documentaries of all time.","distributed_by":"United Artists Metro-Goldwyn-Mayer","bowling_for_columbine":"Theatrical release poster","language":"English","Reception":"Reviews for the film were overwhelmingly positive, with a 96% rating on Rotten Tomatoes,[17] and therefore a \"certified fresh\" award. Another score aggregator, Metacritic, which assigns a normalized rating in the 0–100 range based on reviews from top mainstream critics, calculated an average score of 72 based on 32 reviews, signifying 'generally favorable reviews'. Michael Wilmington of the Chicago Tribune wrote, \"It's unnerving, stimulating, likely to provoke anger and sorrow on both political sides—and, above all, it's extremely funny.\"[18] A.O. Scott of The New York Times wrote, \"The slippery logic, tendentious grandstanding, and outright demagoguery on display in Bowling for Columbine should be enough to give pause to its most ardent partisans, while its disquieting insights into the culture of violence in America should occasion sober reflection from those who would prefer to stop their ears.\"[19]Some reviews were not as unequivocally glowing. Desson Thomson of The Washington Post thought that the film lacked a coherent message, asking \"A lot of this is amusing and somehow telling. But what does it all add up to?\"[20]","Criticism":"In Michael Wilson's documentary Michael Moore Hates America, bank employees from the branch at which Moore is handed a free hunting rifle assert that they were misled during filming of the segment. They say that the bank's policy was to conduct background checks on rifle recipients and mail the rifles to a licensed gun dealer, but Moore's agents, under the pretext of \"doing a story on unique businesses across America\", convinced bank employees to have his rifle presented to him on camera the morning after filming his account opening. Further, they counter that contrary to the film's supposition that the bank kept hundreds of guns on their premises, the gun which was handed to Michael Moore in the film was shipped overnight from a vault in a branch 300 miles away. Moore denied that this sequence was staged but acknowledged the timing was compressed for production reasons. He reminded his readers that North Country Bank is a licensed firearms dealer and, in addition to its ATF license number, he produced out-takes where bank employee Jan Jacobson confirms on camera that rifles are secured locally on bank premises.[21][22]The American Prospect published a piece by Garance Franke-Ruta criticizing the film for ignoring the role that municipal governance plays in crime in the United States, and ignoring African-American urban victims of violence while focusing on the unusual events of Columbine. \"A decline in murders in New York City alone—from 1,927 in 1993 to 643 in 2001—had, for example, a considerable impact on the declining national rate. Not a lot of those killers or victims were the sort of sports-hunters or militiamen Moore goes out of his way to interview and make fun of.\"[23]After the release of the film, Lockheed Martin spokesperson Evan McCollum clarified that the plant no longer produces missiles (the plant manufactured parts for intercontinental ballistic missiles with a nuclear warhead in the mid-1980s), but rockets used for launching satellites:I provided specific information to Moore about the space launch vehicles we build to launch spacecraft for NASA, NOAA, the Dept. of Defense and commercial customers, including DirecTV and EchoStar.[24]Erik Möller argues that Moore's question was not limited to the Littleton-area Lockheed Martin facility:First, note the word \"our\" in Moore's question. Moore is not from Colorado -- his question is generic, not meant to refer specifically to the Lockheed Martin plant in question. ... Of course, critics [David Hardy, et al.] have conveniently ignored the fact that Lockheed Martin does supply weapons of mass destruction to the US military, and that the company is the nation's largest military contractor.[24]South Park co-creator Matt Stone—who grew up in Littleton—agreed to talk with Moore about his hometown and the shooting in the film. Although he did not feel that Moore mischaracterized him or his statements in the film, he harbored ill feelings about the cartoon \"A Brief History of the United States of America\". Both Stone and his fellow South Park creator Trey Parker felt that the cartoon was done in a style very similar to theirs. Also, its proximity to Stone's interview may have led some viewers to believe, incorrectly, that they created the cartoon. \"It was a good lesson in what Michael Moore does in films. He doesn't necessarily say explicitly this is what it is, but he creates meaning where there is none by cutting things together,\" Stone remarked in a later interview.[25] As a humorous retort to this, Stone and Parker portrayed Moore as \"a gibbering, overweight, hot-dog-eating buffoon\" who ultimately commits a suicide bombing against the protagonists in their 2004 film, Team America: World Police.[26]For the final scene of the film, Moore visits Charlton Heston in his home and asks him about American firearm violence. Heston's response includes the suggestions that the United States has a \"history of violence\" and more \"mixed ethnicity\" than other countries.[27][28] Moore then asks Heston if he would like to apologize for leading NRA rallies in Flint, Michigan (Moore's hometown) after the shooting death of a six-year-old girl at Buell Elementary School and in Littleton after the Columbine shooting, upon which Heston walks out of the interview.[29] Moore was later criticized for his perceived ambush of the actor.[30]","box_office":"$58 million","production_company":"Alliance Atlantis Dog Eat Dog Films Salter Street Films","Gross income":"With a budget of $4 million, Bowling for Columbine grossed $58,008,423 worldwide, including $21,576,018 in the United States.[36] The documentary also broke box office records internationally, becoming the highest-grossing documentary in the United Kingdom, Australia, and Austria. These records were later eclipsed by Moore's next documentary, Fahrenheit 9/11.[37]","directed_by":"Michael Moore","narrated_by":"Michael Moore","release_dates":"October 11, 2002 (2002-10-11)|||||","produced_by":"Michael Moore Kathleen Glynn Jim Czarnecki Charles Bishop Michael Donovan[1] Kurt Engfehr","running_time":"119 minutes","MPAA rating":"The film is rated R by the Motion Picture Association of America, which means that children under the age 17 were not admitted to see the film theatrically unless under supervision. Film critic Roger Ebert chastised the MPAA for this move as \"banning teenagers from those films they most need to see\".[31] Ebert had criticized the MPAA rating system on previous occasions.[32] The film was noted for \"some violent images and language\".[33]","music_by":"Jeff Gibbs","edited_by":"Kurt Engfehr","written_by":"Michael Moore","budget":"$4 million"}