{"distributed_by":"20th Century Fox (United Kingdom) The Samuel Goldwyn Company (United States)","Plot":"A former nude model and prostitute, Ruth is manageress of a London drinking club frequented by racing drivers, living in a flat above with her illegitimate son Andy. Another child is in the custody of her estranged husband's family. In the club she meets David, an immature young man from a well-off family who wants to succeed in motor racing but suffers from lack of money and overuse of alcohol. Ruth falls for his looks and charm, but it is a doomed relationship. Without a job he cannot afford to marry her and his family would never accept her. When he makes a drunken scene in the club, she is fired and made homeless. A wealthy admirer secures a flat for her and her son but she still sees David. When she tells him she is pregnant, he does nothing about it and she miscarries. Distraught, she goes to a house in Hampstead where she believes David is at a party. He comes out and goes with a girl to a pub. Ruth waits outside the pub and, when he emerges, kills him with five shots. She is arrested, tried and hanged.","language":"English","Reception":"The film made a comfortable profit[1]and currently holds a 90% approval rating on the review aggregate website Rotten Tomatoes.[2]","box_office":"£850,000 (UK) $3 million (US) $1 million (other territories)[1]","directed_by":"Mike Newell","Awards":"Mike Newell won Award of the Youth at the 1985 Cannes Film Festival for Dance with a Stranger. Miranda Richardson won Best Actress at the Evening Standard British Film Awards, while Ian Holm won Boston Society of Film Critics Awards 1985 for this and other films.","release_dates":"March 1, 1985 (UK) August 9, 1985 (United States)","produced_by":"Roger Randall-Cutler","starring":"Miranda Richardson Rupert Everett","running_time":"102 min.","dance_with_a_stranger":"Film poster","music_by":"Richard Hartley Theme song by Mari Wilson","External links":"","written_by":"Shelagh Delaney","budget":"£1,360,000[1]"}