{"based_on":"Captain America  by Joe Simon Jack Kirby","Cast":"Additionally, John Slattery and Kerry Condon reprise their roles as Howard Stark and F.R.I.D.A.Y. from previous MCU films.[85][86] Martin Freeman is introduced as Everett K. Ross, a member of the Joint Counter Terrorism Center and a character associated with Black Panther in the comics.[87][88] Freeman described Ross as someone who \"works for the American government...[and] works in conjunction with the superheroes, and certain agencies that help to tame the superheroes' power\".[89] Feige added that Ross would appear briefly in the film, with the intent being to expand on the character's role in future films.[66] Marisa Tomei appears as May Parker, Peter Parker's aunt;[90] John Kani appears as T'Chaka, father of T'Challa;[85] Hope Davis appears as Maria Stark, Tony Stark's mother;[91] and Gene Farber appears as Vasily Karpov, the Hydra official who oversees the Winter Soldier program.[92] Alfre Woodard, who portrays Mariah Dillard in the MCU TV series Luke Cage, appears in the film as Miriam Sharpe, the mother of an American citizen killed in the battle of Sokovia. Woodard was suggested for the role by Downey, before Marvel Studios learned of her casting in Luke Cage.[93] Jim Rash appears as a faculty member at MIT,[94][95] while Stan Lee makes a cameo appearance as a FedEx deliveryman,[96][95] and co-director Joe Russo cameos as Theo Broussard, a doctor murdered by Zemo.[97][92] Damion Poitier, who appeared as Thanos in The Avengers before Josh Brolin was cast in the role, appears as one of Crossbones' mercenaries.[92]","country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","screenplay_by":"Christopher Markus Stephen McFeely|","Plot":"In 1991, the brainwashed super-soldier James \"Bucky\" Barnes is dispatched from a Hydra base in Siberia to intercept an automobile carrying a case of super-soldier serum. In the present day, approximately one year after Ultron's defeat in the nation of Sokovia at the hands of the Avengers,[N 1] Steve Rogers, Natasha Romanoff, Sam Wilson, and Wanda Maximoff stop Brock Rumlow from stealing a biological weapon from a lab in Lagos. Rumlow blows himself up, hoping to kill Rogers. When Maximoff tries to displace the blast into the sky with telekinesis, it destroys a nearby building, killing several Wakandan humanitarian workers.U.S. Secretary of State Thaddeus Ross informs the Avengers that the United Nations (UN) is preparing to pass the Sokovia Accords, which will establish a UN panel to oversee and control the team. The team is divided: Tony Stark supports oversight because of his role in Ultron's creation and Sokovia's destruction, while Rogers has more faith in his own judgment than that of the government. At a conference in Vienna where the accords are to be ratified, a bomb kills King T'Chaka of Wakanda. Security footage indicates the bomber is Barnes, whom T'Chaka's son, T'Challa, vows to kill. Informed by Sharon Carter of Barnes' whereabouts and the government's intentions to kill him, Rogers intends to bring in Barnes—his childhood friend and war comrade—himself. Rogers and Wilson track Barnes to Bucharest and attempt to protect him from the authorities, but all three and T'Challa are arrested.Helmut Zemo tracks down and kills Barnes' old Hydra handler, stealing a book containing the trigger words that activate Barnes' brainwashing. Infiltrating the facility where Barnes is held, Zemo recites the words to make Barnes obey him. He questions Barnes, then sends him on a rampage to cover his own escape. Rogers stops Barnes and sneaks him away. When Barnes regains his senses, he explains that Zemo is the real Vienna bomber and wanted the location of the Siberian Hydra base, where other brainwashed \"Winter Soldiers\" are kept in cryogenic stasis. Unwilling to wait for authorization to apprehend Zemo, Rogers and Wilson go rogue, and recruit Maximoff, Clint Barton, and Scott Lang to their cause. With Ross's permission, Stark assembles a team composed of Romanoff, T'Challa, James Rhodes, Vision, and Peter Parker to capture the renegades. Stark's team intercepts Rogers' team at Leipzig/Halle Airport, where they fight until Romanoff allows Rogers and Barnes to escape. The rest of Rogers' team is captured and detained at the Raft prison, while Rhodes is partially paralyzed after being inadvertently shot down by Vision, and Romanoff exiles herself.Stark discovers evidence that Barnes was framed by Zemo and convinces Wilson to give him Rogers' destination. Without informing Ross, Stark goes to the Siberian Hydra facility and strikes a truce with Rogers and Barnes, unaware they were secretly followed by T'Challa. They discover that the other super-soldiers have been killed by Zemo, who shows them footage from Hydra's archives; it reveals that Barnes killed Stark's parents during his mission in 1991. Enraged that Rogers kept this from him, Stark turns on them both, dismembering Barnes' robotic arm. Rogers disables Stark's armor and departs with Barnes, leaving his shield behind. Satisfied that he has avenged his family's death in Sokovia by irreparably fracturing the Avengers, Zemo attempts suicide, but T'Challa stops him and he is taken to the authorities.In the aftermath, Stark provides Rhodes with exoskeletal leg braces that allow him to walk again, while Rogers breaks his allies out of the Raft. In a mid-credits scene, Barnes, granted asylum in Wakanda, chooses to return to cryogenic sleep until a cure for his brainwashing is found. In a post-credits scene, Parker tests a new gadget.","language":"English","Reception":"As of June 30, 2016[update], Captain America: Civil War has grossed $404.6 million in North America and $743.7 million in other territories for a worldwide total of $1.148 billion.[3] By May 10, 2016, the film had grossed $737.8 million, surpassing the entire theatrical gross of its predecessor, Captain America: The Winter Soldier ($714.4 million).[213] It is currently the highest grossing film of 2016,[214] as well as the fourth highest-grossing superhero film of all-time.[215]Two weeks ahead of its release, Fandango announced that the film outsold all previous Marvel Cinematic Universe films at the same point in the sales cycle,[216] and by its opening week, had reached the highest advance sales for a superhero film, representing 90% of the site's weekend ticket sales.[217] Captain America: Civil War earned $75.5 million on its opening day. The film's Friday gross included $25 million from Thursday previews, the second-highest Thursday preview gross among Marvel films, with $3.1 million of the $25 million coming from IMAX theaters, a new Marvel record. The film went on to earn $61.2 million on Saturday and $42.4 million on Sunday, for a total opening weekend gross of $179.1 million, the third-highest for a Marvel film and fifth-highest of all time. Of the $179.1 million, $16 million was from IMAX, the second best for an MCU film.[218] Initial projections for Captain America: Civil War had it earning between $175–200 million on its opening weekend,[219][220] with the projection being revised to $172–178 million after Friday.[218] BoxOffice called it \"the safest box office bet\" since Star Wars: The Force Awakens.[221] The film remained at number one in its second weekend,[222] and fell to second in its third, behind The Angry Birds Movie.[223] In its fourth weekend, Captain America: Civil War became the highest grossing film of 2016 in North America,[224] and by June 17, 2016, became the first film of 2016 to surpass $400 million.[225]Captain America: Civil War's opening in 15 countries on April 27, 2016, earned $14.9 million,[168] followed by $23.8 million the next day from 15 more countries, and $45.3 million two days later from 8 additional countries, for a three-day total of $84 million.[226] Its first weekend brought a total of $200.4 million,[172] after being projected to earn anywhere between $180–250 million,[227] with $9.4 million coming from IMAX. The film debuted at number one in all countries outside of Japan.[172] The film stayed at number one in its second weekend, earning $217 million, with existing territories seeing a 55% decline in earnings, while surpassing the entire international earnings of previous Captain America films, along with other MCU films. For IMAX in its second weekend, Captain America: Civil War earned $31 million, a new record for a day-and-date opening for a Marvel film.[228] By its third weekend, the film remained at number one in some territories, being overtaken by The Angry Birds Movie in others, and became the top film of 2016 and fourth-highest grossing superhero film outside of North America.[229]It set records for the largest opening day in Mexico ($7.3 million),[226] opening day of 2016 in France ($2.4 million),[168] the second-largest opening day in Brazil ($2.7 million)[226] and the United Arab Emirates,[228] the largest superhero opening day in the Netherlands,[226] and the largest superhero opening in Turkey and Ukraine.[228] It set opening weekend records in Brazil ($12.9 million), Mexico ($20.4 million), and the Philippines ($7.7 million), and was the second-largest opening weekend in Hong Kong ($6.9 million) and Thailand ($9.4 million). In the United Kingdom, the film earned the second-largest opening day and weekend of 2016 with $20.5 million, while France had the top 2016 opening weekend with $10.1 million. Germany had the best four-day opening of 2016 with $8.1 million, and Spain had the second-largest three-day opening of 2016 with $4.2 million.[172] For South Korea, the film was the largest non-Korean opening and largest Marvel opening in history.[173] China had the second best IMAX opening ($9.5 million), as well as the second-largest opening weekend for a Hollywood film ($95.6 million),[228] with the film eventually becoming the third-highest Disney release in the country after 10 days,[229] and the second largest superhero film.[215] Japan was one of the few markets not to have the film open at number one, debuting third with $4.2 million, behind Detective Conan: The Darkest Nightmare ($5.3 million) and Zootopia ($4.8 million).[230]The film's largest markets as of June 6, 2016[update], are China ($190.4 million), South Korea ($62.8 million), and the United Kingdom ($53.2 million).[231]The review aggregator website Rotten Tomatoes reported a 90% approval rating, with an average rating of 7.6/10, based on 314 reviews. The website's critical consensus reads, \"Captain America: Civil War begins the next wave of Marvel movies with an action-packed superhero blockbuster boasting a decidedly non-cartoonish plot and the courage to explore thought-provoking themes.\"[232] Metacritic, which uses a weighted average, assigned a score of 75 out of 100, based on 52 critics, indicating \"generally favorable reviews\".[233] Audiences polled by CinemaScore gave the film an \"A\" on a scale of A+ to F.[218]Justin Chang of Variety called it \"the most mature and substantive picture to have yet emerged from the Marvel Cinematic Universe.\"[234] Sheri Linden of The Hollywood Reporter said, \"Call it 'civil war' or call it brand extension; call it a 'cinematic universe' or a corporate behemoth—the latest Marvel extravaganza furthers the studio's cross-pollination of action franchises in a way that's sure to satisfy devotees.\"[235] Robbie Collin of The Daily Telegraph wrote, \"This is the cinematic superhero showdown you've dreamt of since childhood, precisely because that's everything—and all—it wants to be.\"[236] Catherine Shoard of The Guardian called it, \"a huge aspartame rush of a film: a giant irresistible snack, not nutritious, but very tasty.\"[237] Richard Roeper of the Chicago Sun-Times wrote, \"Kudos to co-directors Anthony and Joe Russo and the team of writers for juggling more than a dozen comic-book characters and nearly that many plot lines, and only occasionally getting us (and by us I mean me) lost in the geek weeds.\"[238] Kenneth Turan of the Los Angeles Times said, \"If you live and breathe Marvel, this is one of the MCU's stronger offerings. If you are a spy coming in from the cold, the answer is not so clear.\"[239] A. O. Scott of The New York Times wrote, \"Captain America: Civil War does not in any way transcend the conventions of the genre. On the contrary: It succeeds because it doesn't really try.\"[240]Conversely, Stephen Whitty of the New York Daily News said, \"Although it's called Captain America: Civil War, the latest Marvel movie is actually a supersized Avengers picture—overstuffed to bursting. And sometimes during its two and a half hour running time, it just goes bust.\"[241] Mick LaSalle of the San Francisco Chronicle said, \"As a work of thought, Civil War is compromised, but at least there are thoughts to compromise. As an action film, it has its moments, but aside from the big opening sequence—the action scenes are a bit flat.\"[242] Andrew O'Hehir writing for Salon said, \"Much of Captain America: Civil War is just the laborious working-out of leftover dangling plot elements from Captain America: The Winter Soldier two summers ago.\"[243]","box_office":"$1.148 billion[3]","captain_america:_civil_war":"Theatrical release poster","cinematography":"Trent Opaloch","production_company":"Marvel Studios","directed_by":"Anthony Russo Joe Russo|","Music":"Henry Jackman, the composer for Captain America: The Winter Soldier, returned to score the sequel.[159] In July 2015, Jackman said that the industrial elements of the track \"The Winter Soldier\" from the previous film's soundtrack were a good indication of what the soundtrack to Civil War would sound like, though he cautioned it was \"just a jumping off point since the Russos are looking for something new—similar with a twist.\"[160] Jackman ultimately described the final score for Civil War as more symphonic and orchestral than Winter Soldier's.[161] A soundtrack album was released by Hollywood Records on May 6, 2016.[162]","release_dates":"April 12, 2016 (2016-04-12) (Dolby Theatre)|May 6, 2016 (2016-05-06) (United States)||||","Production":"\"This is the Civil War of the Cinematic Universe, which will be greatly inspired by the \"Civil War\" of the comic universe, but we have a very different continuity going on. So this will be Civil War based off all the other films you've seen up until this point, particularly Winter Soldier and Age of Ultron...It's not about the secret identity thing, as much as it is about, overall, who reports to who, and who can agree to [an] oversight committee. Because as of now, in [Age of Ultron], there is no more security council, there is no S.H.I.E.L.D., obviously. Stark is paying for [the Avengers], Captain America is running it, and things occur that will make governments begin to question.\"In March 2014, Anthony and Joe Russo confirmed that they had signed on to return as directors for a third Captain America film, along with Chris Evans as Captain America, Kevin Feige as producer, and Christopher Markus and Stephen McFeely as screenwriters.[8][99] Markus and McFeely had been working on the screenplay since late 2013,[100] while the Russo brothers began work in February 2014.[101][102] The re-hiring of the directors, three months before the release of Captain America: The Winter Soldier, came as a result of impressive test screenings of that film with Marvel executives.[8]In an April 2014 interview, Joe Russo described the project as a continuation of the story from Captain America: The Winter Soldier: \"What’s nice about the film is that...it's a two-parter. There's a journey that the Winter Soldier goes on that isn't complete yet. The next movie, it would seem logically to want to be about the completion of that journey. [sic]\"[103] That month, Marvel announced a release date of May 6, 2016,[104] and Trent Opaloch, who was the cinematographer on The Winter Soldier, said he would return for the sequel.[105] In July, Markus and McFeely stated that they were midway through a first draft for the film, on which principal photography was expected to begin in April 2015.[106] The following month, they stated that they were looking to make the tone of the film \"an amalgam\" of The First Avenger and The Winter Soldier,[107] with the Russos likening it to a psychological thriller, citing Seven, Fargo, and The Godfather as influences,[6] along with westerns and Brian De Palma's films.[84] The Russos also stated that \"a good portion of [Civil War is] actually funnier than Winter Soldier\" with a more comedic tone and lighter moments throughout.[108]In August 2014, the Russos stated that the film would be set \"a couple years\" after The Winter Soldier left off and would continue to both focus on Steve Rogers' relationship with Bucky Barnes and explore the political themes related to Captain America, with Anthony saying, \"The character was invented for an explicitly political purpose. So it's hard to get away from that nature.\" The Russos also said that they would be \"bringing some new elements to the table that will give us a twist on Winter Soldier\",[10] and indicated that filming was scheduled to begin in Atlanta in April 2015. They described themselves as \"ecstatic\" with a first draft of the screenplay submitted by Markus and McFeely, and also stated that the film's title would be announced \"in a month or so at most\", and that the concept and title for the film came from Feige, who has had it \"for a while\". Joe stated, \"We can pitch out characters that we think would be interesting in the story. There's incredible room to move,\" and Anthony added that the film has to wrap itself around Feige's idea.[101][109] In September, Joe expanded by saying the film would have another \"big idea that alters the universe as a whole in some way\" similar to S.H.I.E.L.D. falling in The Winter Soldier, with the rest of the film, such as the characters, story, and tone, left open to the Russos' and writers' interpretation.[109]By October 2014, Robert Downey Jr. had entered final negotiations to reprise his role as Tony Stark / Iron Man in the film. Downey was added in order for the film to adapt the 2006–07 \"Civil War\" comic book storyline written by Mark Millar, which pitted Iron Man against Captain America.[21] At the end of the month, it was confirmed that Sebastian Stan would return as Bucky Barnes/Winter Soldier.[27] A few days later, Marvel revealed that the film would be titled Captain America: Civil War, confirming Downey's appearance and announcing that Chadwick Boseman would appear in the film as Black Panther ahead of his own solo film.[18][41][42] Feige also confirmed that the film would be the first in the MCU's Phase Three slate of films.[98] Anthony Russo stated that adapting the \"Civil War\" storyline was not always the intended storyline and direction for the film when the brothers initially signed on to return as directors.[110] Markus expanded on this, saying the original concept for a third Captain America film \"never got to draft\", with Feige at some point telling the writing team to begin adapting \"Civil War\" around their original ideas. McFeely also added that, despite the shift in direction for the film, \"The central theme, even the way Zemo is operating, are from that [early] iteration.\"[111]McFeely said that the idea of basing a film on \"Civil War\" had \"been on and off the table for a while\" at Marvel Studios, explaining, \"it's a challenge to do it and make sure that all the characters that we've established, and everyone's established in the MCU are serviced and sound correct. Because there's a difference between the characters in \"Civil War\", which was written in 2006, 2007. The MCU doesn't exist [when it was written]. There isn't a Robert Downey, Jr. or Chris Evans who has helped create the character[s] so we need to make sure that that template gets adjusted and what have you in order to make sure it services these characters and not just sort of rip off their parts and make them look like them.\"[112] Joe Russo added that the \"essence\" of \"Civil War\" was used, such as \"the concept of registration, the notion that heroes need to be either monitored or controlled because their power can be scary\" being applicable. Anthony Russo expanded, \"in a lot of ways [superhero registration] can be a political issue, and we didn't want the conflict of the movie to solely exist on that level. We wanted to figure out very personal reasons why everyone's relationship to this idea of registration is going to become complicated. That's what the relationship between Steve and Bucky allowed us to do, to get very personal in terms of why people would lean one way or the other.\"[13] Executive producer Nate Moore added that \"it felt like it was kind of the right time\" to adapt \"Civil War\" given The Avengers, plus many of the Phase Two films (Thor: The Dark World, The Winter Soldier and Avengers: Age of Ultron), all dealt with \"world-ending experiences. We felt like we had to tell the next step in that story, which is what happened? What is the world's reaction?\"[6]In November 2014, Daniel Brühl joined the ensemble cast in an unspecified role,[32][113] while Anthony Mackie and Frank Grillo were confirmed to return as Sam Wilson / Falcon and Brock Rumlow / Crossbones, respectively.[32][76] Following the November 2014 hacking of Sony Pictures' computers, emails between Sony Pictures Entertainment co-chairman Amy Pascal and president Doug Belgrad were released, stating that Marvel wanted to include Spider-Man (whose film rights are licensed to Sony) in the film. However, talks between the studios concerning this were believed to have broken down.[114] In February 2015, Sony Pictures and Marvel Studios reached a licensing deal for the use of Spider-Man in an MCU film,[115] and reports indicated that the character would indeed appear in Civil War.[116][117] The Russos stated they were lobbying for months to include the character in the film.[108]In January 2015, Mackie revealed that, in addition to Atlanta, filming locations would include Puerto Rico and Berlin,[118] while the Russo brothers confirmed that Scarlett Johansson would return in the film as Natasha Romanoff / Black Widow,[23] and editor Jeffrey Ford, who worked on The Winter Soldier, signed on for Civil War.[119] In March 2015, Jeremy Renner was revealed to be reprising his role as Clint Barton / Hawkeye.[38] The next month, it was revealed that the film would be converted to 3D in post-production,[120] and that Brühl would be playing Helmut Zemo.[81] Additionally, Elizabeth Olsen revealed she would reprise her role in the film as Wanda Maximoff / Scarlet Witch.[53]Principal photography began on April 27, 2015,[120][121] in Fayette County, Georgia at Pinewood Atlanta Studios,[122] under the working title Sputnik.[123] Other filming locations in the Atlanta metropolitan area included the Buckhead district of Atlanta;[124] the Peachtree Christian Church in Midtown Atlanta,[125] Downtown Atlanta,[126] including an area near Philips Arena known as The Gulch, which served as the market in Lagos;[127] Norcross, Georgia;[124] Porsche's headquarters in Atlanta at Aerotropolis Atlanta, which served as the Avengers' headquarters in the film;[35] and the Atlanta Civic Center, which served as the IBID (Infection Disease Development) laboratory in Lagos; while its interiors doubled as MIT and a third part was used for a Berlin location.[127] Trent Opaloch served as director of photography,[105] while Chad Stahelski and David Leitch were second unit directors.[128]In early May, Marvel announced that Martin Freeman was cast in an unspecified role,[87] while also reprising roles in the film would be Paul Bettany as Vision, Don Cheadle as James Rhodes / War Machine, Paul Rudd as Scott Lang / Ant-Man, Emily VanCamp as Sharon Carter, and William Hurt as Thaddeus \"Thunderbolt\" Ross, respectively.[36][62] Samuel L. Jackson, who appeared as Nick Fury in the two previous Captain America films, said he was \"surprised\" to discover that he would not be in Captain America: Civil War, after \"the Russo Brothers told [him he] was.\"[129] Moore stated that Fury was not included \"because he didn't add anything to the Civil War story they were telling\",[84] while Markus stated that they did not want him to choose any particular side because \"that's not his place in the universe\".[130]After the reveal of the film's full cast, many outlets and fans began referring to the film as \"Avengers 2.5 \", given the variety and ensemble nature of the cast, usually reserved for the Avengers films, and the fact that the film no longer felt like a Captain America-centric one, as with The Winter Soldier.[131][132][133][134][135] In response to this, Feige said, \"What's fun about Civil War though is, as you know from the comics, it's a very simple story. And it really has to be, to accommodate that many players. It's very much a Captain America movie and it's very much a sequel to the Winter Soldier in ways I don't think people [will expect].... It's a very simple structure that allows you to have these amazing character interactions in a way that I don't think becomes overwhelming.\"[136] Feige also revealed that Hope van Dyne / Wasp was in an original draft of the film, after receiving the Wasp costume at the end of Ant-Man, but was cut because \"there are so many characters in Civil War that we didn't want to do her a disservice,\" saying Marvel was \"saving\" the character for a better environment to reveal van Dyne in the Wasp costume for the first time and see \"her dynamic with Scott [Lang] in a way it could play out\".[137]On each of the character's ties to the plot, Anthony Russo added that each character was examined on a personal level to see how they would respond to the idea of registration and whether the stakes would be good or bad for them.[13] On the portrayal of each character, Joe Russo said that he and his brother had strong \"emotional\" and \"psychological connection[s] to [these] characters\" as children, adding, \"We want to reach into that and understand what elementally motivated you to love the character. That's what we try to bring out in the characters now.\" He also mentioned that they were \"trying to honor the feeling of naturalism and to honor the feeling of reality [with the film]. The harder we can pull these characters into reality, the better for us...it's important for us that these characters live in the world that we live in because it makes them more real and it makes our experience of watching them more passionate and more well-rounded.\"[72]At the end of May, the Russo brothers, along with Feige and Pascal, held a screen test in Atlanta for six teenage actors that were being eyed for the role of Peter Parker / Spider-Man, with the actors testing against Downey and Evans for \"chemistry\";[75][110][138] Tom Holland was cast as the character the next month, to also appear in a solo film.[67] The Russos \"were pretty vocal about who we wanted for the part\", pushing to cast an actor close to the age of Peter Parker in the comics, in order to differentiate from the previous portrayals. They also praised Holland for having a dancing and gymnastics background.[66] At the time, Marvel did not confirm his involvement in Civil War,[68][139] due to being contractually obligated not to talk about his inclusion publicly.[66] The Russos discussed this, saying that the various business deals and agreements stemming from the sharing of the character rights, such as on a promotional and commercial level, \"were always lagging slightly behind how we were using the character. We were always in danger of upsetting the deal—there were still sensitive issues going on between the two studios that they needed to agree on.\"[140] Holland was confirmed to appear in the film in July 2015, by Jonathan M. Goldstein, one of the writers of the solo Spider-Man film,[69] and later by Entertainment Weekly from a set visit.[66] Jon Watts, director of Spider-Man: Homecoming, was on set for the filming of Spider-Man's scenes, in order to \"see what they were doing with it, and that informed where we eventually took it,\" and provide \"ideas about this and that.\"[141] Anthony Russo stated that, despite Marvel telling them to have a \"plan B\" should the deal with Sony fail, the Russos never created one because \"it was very important to us to reintroduce\" Spider-Man in the film, adding, \"We only have envisioned the movie with Spider-Man.\"[142]By the end of June, filming reached the halfway mark,[143] with production moving to Germany in early August.[144] Filming locations in Germany included the Olympic Stadium in Berlin,[145] and the Leipzig/Halle Airport in Schkeuditz.[146] Additional filming also took place in Puerto Rico and Norway,[36][118][147] and was scheduled to in Iceland.[36] Principal photography wrapped on August 22, 2015.[148][149]Captain America: Civil War was the first film to use IMAX's digital 2D cameras, made in partnership with Arri, which was a customized version of the Arri Alexa 65. According to Joe Russo, approximately fifteen minutes of the film, the sequence where the two factions fight at Leipzig/Halle Airport, which was described as having \"incredible scale to it\" and referred to by the directors as the \"splash panel\", were shot with the cameras.[58][120] Opaloch noted that there were discussions late in pre-production to shoot the entire film with the Alexa 65 cameras. However, because of how close the idea was passed to the start of shooting as well as it being \"such a large-scale undertaking\", it was decided to only use them for the airport sequence, with the rest of film being shot on Arri Alexa XT digital cameras. For the airport sequence, Opaloch rigged the Alexa 65s to a Technocrane, a Steadicam, a dolly as well as a drone for flyover shots, which had its own dedicated team operating it. Because of the amount of resolution the Aleax 65s offered, Opaloch chose to use medium close-ups instead of close-ups, and for his wide shots, hold the shot a bit longer, \"maybe with a slight camera move that allows the viewer to take it all in.\"[150]In September 2015, Mark Ruffalo, who plays Bruce Banner / Hulk in the MCU films, stated that his character was originally in the Civil War script, but was removed due to the end of Age of Ultron, as Marvel did not \"want to reveal where [he is] and why\" in this film.[151] Markus added that as soon as the Hulk joined a side, the fight would be quickly over, saying, \"You've got to kind of choose your roster [of characters] depending on what kind of fight you want to have.\"[66] He later explained that he contemplated having the Hulk appear at the very end of the film, but decided against it, feeling that he was over-stuffing the film with characters, adding, \"[The Hulk] has clearly gone somewhere at the end of [Age of] Ultron, and that's a story. Don't blow it off and put it in a little tiny chunk just to put in a little extra filigree on our movie.\"[152] That November, Joe Russo stated that the theme of the film was betrayal, calling it \"extremely emotional. [The film] hinges on that emotion, and on a very personal level we didn't want [it] to become about politics and people arguing about platitudes. The third act is built around a very personal moment between [Captain America and Iron Man].\"[13] The Russos spent a great deal of time with Markus, McFeely, and Moore to ensure each character's emotional arc tracked through the entire film correctly, though realized that at some point \"you have to sacrifice logic for expediency\".[84]Speaking about the post-production process in January 2016, the Russo brothers said, \"This has been the easiest post process we've ever had on a film. We're very happy with how the movie was. Everyone is very happy with where the movie was. For us, the tricky thing is the effects because it's a very complicated movie and there are some really big sequences in the film. The effects are on a much larger scale than the work we did on Winter Soldier. That's the part that becomes really difficult because you don't have a lot of time and everyone has very high standards. So everyone starts killing themselves at this point...we'll be done with the movie in two and a half months.\"[108] They also stated that the film would be doing \"a few reshoots\" in mid-to-late January.[108][153] In February, Freeman's character was revealed to be Everett Ross,[88] and Gwyneth Paltrow was reported to have joined the film for the January reshoots, reprising her role as Pepper Potts;[154] however, in April 2016, it was revealed that Paltrow does not appear in the film,[155] with Anthony Russo explaining that Paltrow's contract with Marvel had ended after Iron Man 3, and \"we decided early on that we could make Pepper’s break-up [with Tony Stark] have an emotional impact without actually having a scene with her.\"[16] On March 16, 2016, the Russo stated the film was \"about a week and a half away from\" completion,[156] with Joe adding that the film would have a post-credits scene, with the possibility for two or three total.[73] The film was completed on April 4, 2016.[157] Later in April, Alfre Woodard and Jim Rash were revealed to be cast in the film,[94] while Feige explained that Black Panther director Ryan Coogler contributed some dialogue for Black Panther in several scenes during reshoots.[158] At the film's premiere, it was revealed that Marisa Tomei appears in the film as May Parker, Peter Parker's aunt.[90]Nearly 20 visual effects studios worked on Captain America: Civil War including Industrial Light & Magic (ILM), Lola VFX, Method Studios, Luma Pictures, Dneg, Image Engine, Trixter, Cinesite, and The Third Floor amongst others. Lola VFX de-aged Downey Jr. in a scene that involved a younger holographic version of himself. Lola VFX's visual effects supervisor, Trent Claus said, \"In this case, we analyzed footage of Mr. Downey at the approximate age that we wanted to target, which was around the time of the film Less Than Zero [when Downey was in his early 20s].\" He also noted the difficulty of the scene, due to it being close to 4,000 frames, and the fact that Downey was moving his head from side to side multiple times. Lola also worked on visual effects for the Vision.[147] The Third Floor extensively previsualized the film including the fight scene at Leipzig/Halle Airport. Gerardo Ramirez, the Previs and Postvis Supervisor for The Third Floor said:We visualized most of the major scenes in the film, some that were more story driven and some that were more action and story driven. The Russos used various methods for planning and they used each department for what it does best. The early edits were a combination of storyboards, previs and stunt performance clips. Stunts would choreograph the hand-to-hand action while the storyboards would be used for character story moments and previs was used for the big action scenes that involved many digital characters.[147]Method Studios, which worked on 440 shots, was responsible for the helicopter sequence in the middle of the film and the climatic fight between Iron Man, Bucky, and Captain America. The original intent for the helicopter sequence was to place the scene next to the Paul-Löbe-Haus, where the Bundestag meets; however, the location was not allowed to be shown in the film, resulting in Method needing to create a full CGI background. For the climatic fight, one of the challenges for Method was getting the color of Iron Man's suit correct, opting to go with a more \"classic Iron Man look versus the really glossy car paint look\" that Iron Man had in the previous Avengers films. ILM was primarily responsible for the visual effects during the large-scale fight sequence at the airport, along with creating the digital assets for all of the characters. VFX supervisor Russell Earl, stated that the 20 minute scene grew to be an almost fully digital sequence explaining, \"We ultimately ended up replacing 99% of everything that was shot with the actors being lifted from the background. Originally both Spider-Man and Black Panther were planned to be photographed elements but we ended up almost completely replacing them.\" Luma Pictures, who also worked on Winter Soldier, was assigned with completing shots of Bucky's arm and his metal brainwashing chair. They also worked on Bucky's escape from the task force lobby and designed Iron Man's new hybrid nanotechnology armor, which was an homage to the character's Bleeding Edge armor from the comics. Their work totaled approximately 200 shots.[147]","produced_by":"Kevin Feige","starring":"Chris Evans|Robert Downey Jr.|Scarlett Johansson|Sebastian Stan|Anthony Mackie|Don Cheadle|Jeremy Renner|Chadwick Boseman|Paul Bettany|Elizabeth Olsen|Paul Rudd|Emily VanCamp|Tom Holland|Frank Grillo|William Hurt|Daniel Brühl|","running_time":"147 minutes[1][2]","Future":"According to Feige, Civil War is the conclusion of the Captain America trilogy that began with The First Avenger.[246] While it is the final standalone Captain America film in Evans' contract with Marvel Studios,[247] Evans stated in September 2015 that he was open to extending his contract past the two-part Avengers: Infinity War, the final films on his contract at the time.[248]","music_by":"Henry Jackman","edited_by":"Jeffrey Ford|Matthew Schmidt|","Release":"Captain America: Civil War premiered at the Dolby Theatre on April 12, 2016,[163] and was screened at CinemaCon 2016 on April 13.[164] The film's Southeast Asia premiere was held on April 21 at the Marina Bay Sands resort in Singapore,[165] while the European premiere took place at Vue Cinemas in Westfield London on April 26.[166] The film was released internationally starting from April 27,[167] releasing in 61 countries its first weekend,[168] including the United Kingdom on April 29,[169] and in North America on May 6,[104] in 3D and IMAX 3D.[120][170] In North America, the film opened at over 4,200 theaters, of which 3,300 were in 3D, along with 378 IMAX theaters, 480 premium large-format, and 161 D-Box locations.[171] Internationally, the film opened in 955 IMAX theaters,[172] while South Korea saw Civil War open in an \"unprecedented\" 1,989 theaters.[173] In September 2014, TNT acquired the cable broadcast rights for Captain America: Civil War to air two years after its theatrical release.[174]In early July 2015, Marvel began a viral marketing campaign for Ant-Man featuring Leslie Bibb, reprising her role from the Iron Man films as journalist Christine Everhart, reporting for the faux news program, WHIH Newsfront. In one program, Everhart discusses events leading to Captain America: Civil War.[175] The post-credit scene for Ant-Man featured footage shot by the Russo brothers for Captain America: Civil War,[176][177] showing Wilson and Rogers with Barnes in their custody, and unable to contact Stark because of \"the accords\"; Wilson mentions that he \"know[s] a guy\", implying Lang.[178] Feige explained that when the post-credit sequence appears in Civil War it may appear with \"different takes...different angles.\"[176] Stan said the scene was shot in early May 2015, and would appear in the middle of Civil War.[31] The first footage of the film debuted in August 2015 at the D23 Expo.[33] Additional footage was shown in September 2015 at the Asia Pop Comic Convention.[179] The footage shown at the D23 Expo and 2015 Asia Pop Comic Convention received an overwhelmingly positive response from the audiences.[180]The first trailer for the film debuted on Jimmy Kimmel Live! on November 25, 2015, and within hours became the number one trending topic on Twitter.[181] The trailer was viewed 61 million times in the first 24 hours of release, surpassing the 34 million views of Avengers: Age of Ultron in 2014.[182] Scott Mendelson of Forbes called the trailer a \"doozy\" and noted that the early debut ahead of the release of Star Wars: The Force Awakens was a \"good show\" on behalf of Disney as it was \"a way to not get lost amid the 8,000 other trailers debuting with Star Wars\". Mendelson also noted that based on the trailer's content, the film was being \"sold as Captain America 3, as opposed to Avengers 2.5 or Iron Man 4,\" which could help keep the film's box office expectations in check.[183]On February 4, 2016, Marvel released their own version of the Facebook \"#FriendsDay\" video for Captain America. The video mirrors those created by Facebook for users to celebrate the anniversary of Facebook's founding, and features images of Captain America's \"friends\" the Winter Soldier, Thor, Falcon and Hawkeye along with \"a tag that says 'You've done a lot together.'\" to highlight moments from previous films. The video concludes with an image of Captain America and Iron Man being torn in half. Jennifer Konerman of The Hollywood Reporter called the video \"timely\" and its contents \"especially relevant considering the storyline\" of Civil War.[184] Three days later, a teaser debuted during Super Bowl 50, which received the most social media activity out of all the film trailers released that day.[185][186] Anthony Breznican of Entertainment Weekly said the footage \"actually feels a little more like a teaser [than a full trailer], since it shows some new shots, but really doesn’t reveal much more about the story.\" Additionally, he felt the chanting \"unseen voices calling out, 'United...We...Stand' and 'Divided...We...Fall'\" had \"a football stadium vibe\", complimenting it appearing during the Super Bowl.[187] Mendelson added that Marvel did not need to follow the model used for The Winter Soldier during Super Bowl XLVIII of showing a longer trailer after the teaser since Civil War was \"frankly [a] higher-profile sequel.\" Overall, Mendelson felt the spot was \"only a little less low-key and small(er)-scale as the trailer that debuted in\" November 2015, and sold the \"real world\" aspect \"with character drama and mostly real-world action between would-be superheroes.\"[188]Four days later, on Valentine's Day, the Facebook campaign was continued, with Marvel creating a \"faux-status update\" for Captain America, showing his relationship status had changed to \"In a Complicated Relationship with Iron Man\".[189] At The Walt Disney Company's annual shareholder meeting in the Auditorium Theatre in March, CEO Bob Iger presented a clip from the film to \"generous applause\".[190] From March 7 to March 10, Marvel released individual posters for characters in the film,[191] continued its Facebook campaign with two teaser videos showcasing the participants on \"Team Cap\" and \"Team Iron Man\", and released a second trailer.[192] The trailer was viewed close to 95 million times within the first 24 hours of release, surpassing the views achieved by the first trailer. In addition, 240,000 social media posts across Twitter, Tumblr, Instagram, and Facebook, among others, were made related to the trailer, surpassing the 81,000 the Age of Ultron trailer received in 2014.[193] According to internet analytics firm ZEFR, the trailer was viewed over 62 million times from YouTube and Facebook over four days, making it the second most viewed trailer at the time, behind the 64.6 million views for the first Star Wars: The Force Awakens trailer.[194] It also became the top trailer in 2016 through March 13, 2016, according to research firm ListenFirst, to receive the most likes, retweets and other engagement on Twitter.[195] The trailer continued to be the top viewed trailer on YouTube and Facebook for three straight weeks according to ZEFR, receiving more than 96 million total views since its release.[196]Mendelson called the trailer \"a textbook case for unnecessary second pitches...Is there anyone out there who watched that first teaser back in December and said 'Hmm, it looks good and all, but I need more evidence'?\" He added that he was \"a little disappointed by the big Spider-Man reveal,\"[167] having previously wondered, after a Spider-Man character poster was not released with the others, if Marvel would have the \"courage\" to not include the character in any marketing materials before the film's release, letting the \"Peter Parker scenes the film has to offer be something that is a surprise for theatrical moviegoers and/or something that drives post-opening weekend buzz\".[191] Mendelson's colleague at Forbes Mark Hughes felt differently, noting that the trailer was targeting the general audience rather than just fans by giving \"us more explanation [and context] of why a clearly major battle is raging between Captain America and Iron Man\",[197] and by including Spider-Man since \"there are plenty of surprises in these movies, and since we all already know Spider-Man is in Civil War, refusing to let us see him would frankly be a bit weird and pointless....it's common for average filmgoers to hear some final bit of information or see some final image and feel compelled, inspired, or otherwise driven to go out to the movies that day. There are any number of factors that can come into play...and the world needed to see [Spider-Man] because it’s the sort of value-added element that can make [a] difference\".[198] Graeme McMillan of The Hollywood Reporter felt that the Spider-Man reveal \"alone makes the trailer\", describing it as feeling \"like the comic book character come to life. That awkward, voice-cracking, 'hey everyone' was as humble, playing-it-cool and cocky as he should be.\"[199]With the film seemingly continuing plot threads first introduced in Age of Ultron, Mendelson wondered \"to what extent the whole 'Consequences galore!' narrative of Civil War will improve Age of Ultron. As much great stuff as that movie has...[it ultimately shows] the main hero foolishly/recklessly [bring] a world-killing threat to Earth and lots of really bad stuff goes down and yet no one seems to care at the end...What does it mean if Civil War does retroactively improve Age of Ultron? Will we be at a point where we really can’t judge a franchise installment on its own merits because a future installment may well fix the flaws a couple years down the line?\"[167] McMillan continued some of Mendelson's thinking, feeling that Marvel was \"in an awkward place with Civil War\" regarding superhero destruction moving forward. He wondered how superhero oversight would \"actually prevent the kind of destruction that it's meant to stop...unless the bad guys all agree to play by the new rules\" as well. \"Worse still...the destruction caused by superhero fights [should now be] foremost in viewers' heads...the audience won't be able to enjoy the sight of the Hulk smashing a random minion through a wall without thinking of the property damage and/or whoever was standing on the other side of that wall. After Civil War, can Marvel go back to pretending that everyone is okay after any large scale event ever again?\"[199]Also in March, Marvel, in partnership with the National Academy of Sciences Science & Entertainment Exchange, Dolby Laboratories, Broadcom, and Synchrony Bank, announced the \"Girls Reforming the Future Challenge\", aimed at females aged 15 through 18 in STEM (Science, Technology, Engineering, and Mathematics education) fields, to submit projects they feel can change the world and have far-reaching effects. Five winners would attend the world premiere at the Dolby Theatre, and receive a tour of Walt Disney Studios and a $500 saving account from Synchrony Bank, with one grand prize winner receiving an internship at Marvel Studios.[163] On April 10, Evans debuted an exclusive clip of the film during the 2016 MTV Movie Awards.[200] Throughout the month, the Russo brothers and the cast promoted the film in Paris, Beijing, Singapore, Berlin and London.[201] At the end of the month, Marvel released additional viral marketing video of WHIH Newsfront, featuring Bibb once again reprising her role as Everhart. In the program, Everhart discusses with \"political analyst\" Will Adams, portrayed by Al Madrigal, the cost the Avengers bring for saving the world, and if they should have regulation from the government.[202] Additional Newsfront segments saw William Sadler reprise his role as President Matthew Ellis, including an \"exclusive\" interview and his reaction to the incident involving the Avengers in Lagos.[203][204]On May 2, 2016, Evans, Renner, and executives from Marvel rang the opening bell of the New York Stock Exchange in honor of the film's theatrical release.[205]At the 2015 Licensing International Expo, Disney Consumer Products announced that they would partner with licensees including Hasbro, Lego, Funko, Hot Wheels, Rubies, Mad Engine, C-Life, Jay Franco, Global Brand Group, Kellogg's, Hallmark and American Greetings to sell merchandise related to the film;[206] Coca-Cola,[207] Google, Samsung, Wrigley, Harley Davidson, Audi, Synchrony Financial, Pringles, Keebler, Pizza Hut, Pop Secret, Mouser Electronics, and Vivo, among other brands, were also licensees for the film.[208] Paul Gitter, senior VP of licensing for Marvel at Disney Consumer Products said that they will build off the success of licensed products for Avengers: Age of Ultron, including a focus on a celebration of Captain America's 75th anniversary, female apparel, healthy living and travel, and on marketing newer characters such as War Machine, Falcon, Vision, Black Widow and Black Panther. \"The Avengers team is both aspirational and hugely merchandisable, made up of multiple, unique heroes coming together with amazing skills, cool vehicles and a high tech headquarters,\" said Gitter. \"Captain America: Civil War not only gives us new storytelling for our favorite superheroes, but also introduces new ones allowing us to expand product lines for kids and fans.\"[206] As part of the $200 million marketing effort for the film, Harley Davidson created two customized motorcycles for the film, Audi debuted a commercial directed by the Russos featuring unreleased scenes from the film, while Pizza Hut debuted collectible boxes and Kellogg's, Pringles, and Keebler products featured virtual reality experiences. The lead-up to the film's release culminated in a massive online vote across Google, YouTube, and Twitter for either Team Captain America or Team Iron Man.[208]Marvel Comics released a four-issue comic prelude by writer Will Corona Pilgrim and artist Szymon Kudranski, beginning in December 2015, that adapted the events of Iron Man 3 and Captain America: The Winter Soldier.[209] On February 10, Marvel Comics released another comic prelude, a single-issue infinite comic set between The Winter Soldier and Civil War.[210] Written again by Pilgrim, the comic is told from the perspectives of Barnes, Rumlow, and Rogers, showing how each ended up where they begin Civil War. Art for each character's perspective is provided by Lee Ferguson, Goran Sudžuka, and Guillermo Mogorron, respectively.[211]Captain America: Civil War will be released on digital download by Walt Disney Studios Home Entertainment on September 2, 2016, and released on Blu-ray, Blu-ray 3D and DVD on September 13, 2016. The digital and Blu-ray releases include behind-the-scenes featurettes, audio commentary, deleted scenes, a blooper reel, and an exclusive preview of Doctor Strange.[212]","budget":"$250 million[3]"}