{"country":"India","distributed_by":"Chiragdeep International","language":"Hindi","Reception":"The movie was 1993's biggest Bollywood hit and ran in the theaters for 12 weeks. The domestic distribution share was 8.5 crore against 1.96 crore cost.[2]Aankhen was responsible for jump-starting or reenergizing the careers of a few actors. Govinda, for example, struggling at the time spawned many other comedy hits such as Raja Babu, Coolie No. 1, and Saajan Chale Susral, after the commercial success of Aankhen. Although he starred in hits like Hatya (1988), Swarg (1990), and Shola aur Shabnam (1992), his double role in Aankhen established him as the \"Comedy King of Bollywood\" at that time. One of the lead heroines of the movie, Raageshwari, started singing later.","Synopsis":"Hasmukh Rai (Kader Khan) has a problem. As a matter of fact, two problems — his two sons: Munnu (Chunky Pandey) and Bunnu (Govinda Ahuja). The brothers are notorious slackers up to no good, and involved in elaborate practical jokes. It comes to Hasmukh's attention that his sons have been lying to him about their college grades — in studies and sports — and have not been attending school for the last three years. As a result, they are kicked out of college and, ultimately, their home. Later, one of their practical jokes gets out of hand, and Bunnu disappears, presumed dead. Munnu gets involved in the conspiracy of killing Bunnu. Meanwhile, from a small Indian village, Bunnu's identical cousin, Gauri Shankar, arrives in town. He is mistaken for Bunnu which leads to hilarious misunderstandings and constant uproar.","cinematography":"Siba Mishra","directed_by":"David Dhawan","Soundtrack":"The lyrics are written by Indeevar. The songs are as follows:","aankhen_आँखें":"Theatrical Realese Poster","release_dates":"9 April 1993","produced_by":"Pahlaj Nihalani","starring":"Govinda Chunky Pandey Raj Babbar","running_time":"170 min.","music_by":"Bappi Lahiri","edited_by":"Nand Kumar","written_by":"Anees Bazmee"}