{"country":"United States","distributed_by":"IFC Films","Plot":"Big Bad Love shares its title and characters with those in Mississippi writer Larry Brown's short story collection, particularly those in the book's final story, \"92 Days\".[3]The main character is an unsuccessful alcoholic writer, motivated by desire for his estranged wife (played by Debra Winger) and the urging of his Vietnam War buddy Monroe (played by Paul Le Mat) to continue to write. He is angry, yet hopeful that he will sell a story. When tragedy strikes a close friend and his daughter, Leon is forced to rethink his way of life.","language":"English","Reception":"New York Times reviewer By A. O. Scott wrote, \"For every moment of breathtaking strangeness -- as when Leon, after a road accident, awakens in a field of kudzu strewn with manuscript pages -- there is an overly stylized scene in which literary self-consciousness suffocates lived reality\", \"(the film) is a self-indulgent celebration of self-indulgence\".[1] Lisa Schwarzbaum of Entertainment Weekly wrote, \"Howard's Big Bad Love bewilders -- a whole lot of opulent Southern atmosphere about some stunted, opaque characters\".[2] Ken Fox of TV Guide writes \"The film's few saving graces include Dickinson's sardonic southern belle; Winger's welcome return to the screen after a five-year absence; and Howard's voice-over readings of Brown's powerful prose, which ultimately saves the film from itself.\",[4] while Rachel Gordon of Filmcritic wrote, \"For his feature debut as director, Howard impressively mixes fantasy sequences with the depressing reality of pushing creativity as hard as you can against a tide of guilt\",[5] and Kevin Thomas of the Los Angeles Times wrote, \"Big Bad Love is brave and admirable for the trust that it puts in a viewer's intuition and willingness in going along with it right through to its rewarding finish.\"[6]","box_office":"$104,294","cinematography":"Paul Ryan","directed_by":"Arliss Howard","Production notes":"It was filmed on location in parts of Mississippi.","release_dates":"Cannes Film Festival: May 12, 2001 United States: February 22, 2002","produced_by":"Arliss Howard","starring":"Arliss Howard Debra Winger Paul Le Mat Rosanna Arquette Angie Dickinson Michael Parks","running_time":"111 minutes","edited_by":"Jay Rabinowitz","Release":"Big Bad Love had international release at film festivals before and after its 2002 theatrical release, including the 2001 Cannes Film Festival,[7] the 2001 Toronto Film Festival,[8] the 2001 Austin Film Festival,[9] and the 2002 Wisconsin Film Festival.[10]","written_by":"Arliss Howard Jim Howard Larry Brown (book)"}