{"original_network":"MTV","Television series":"Series one featured eight episodes and focused on each of the Sanchez members. Each episode would have them, friends and family talking about each of the Sanchez members on a certain topic the episode is about, with stunts performed in between each part of the interviews. The last episode had a psychiatrist review each of the Sanchez members behavior throughout the series.The first series received mixed reactions, with some people calling it a lackluster imitation of the American show Jackass, while others complained that it pushed the boundaries of taste too far, due to the extreme stunts and strong profanity, as well as full-frontal male nudity. The boys are praised by others for their fun-loving hedonism and courage in their dangerous stunts. One review claims 'They make Jackass look like the Royal Shakespeare Company', and also on the cover of the Dirty Sanchez: The Movie DVD, there is a similar quote by MAXIM saying \"Makes Jackass Look Like The Teletubbies.\"The second series also featured eight episodes but focused on the Sanchez members trying out different jobs for one week. The first episode had them working in a hair salon. The second episode had them working on a construction site. The third episode had them train to perform a martial arts show. The fourth episode had them train to be Royal Marines. The fifth episode had them train to be fire fighters and the sixth episode had them train to be cowboys. Episodes seven and eight were a Behind the... and Best of... the series. The series became the biggest hit in MTV UK history and is still the only MTV UK series to be broadcast in the United States.[citation needed]The third series featured six episodes and focused on the Sanchez members touring six different countries to perform six live shows with their tour manager, Johnny B, in Europe. The tour began in Sweden, then to Germany, Czech Republic, Greece, Italy and finished in Spain.The fourth series featured seven episodes that goes behind the scenes of the movie and shows the boys reactions to each sin that they had to perform in each of the countries.The first spin-off series, called MTV Wrecked, was hosted by Pritchard and Dainton, which saw them get two contestants to do Dirty Sanchez styled stunts in order to crown a winner. The series would feature eight episodes.The second spin-off series once again only featured Pritchard and Dainton. The series followed them looking for the ultimate 'highs' in Brazil, Mexico, Philippines, Australia, Cambodia, South Africa, India and Japan. They did painful stunts in order to get a 'buzz', they did naked skydiving, had painful tattoos to fit in with Filipino tribes, and tasted old remedies and substances such as ayahuasca and psilocybin mushrooms which are used in foreign countries to experience different feelings including hallucinations and euphoria. This series also featured eight episodes.","no._of_series":"4","no._of_episodes":"39 (including spin-offs)","directed_by":"Becky Staniforth","original_release":"2 July 2003 (2003-07-02) – 2008","Dirty Sanchez: The Movie":"Dirty Sanchez: The Movie, a reality film based upon the series, was released on 22 September 2006. It is in the format of a world tour [1] and incorporates stunts related to the seven deadly sins. Stunts are on a larger scale and more extreme than stunts shown in the TV show. The film also features the first cross over battle between two stunt groups. In their tour of Japan, the Dirty Sanchez team battles the Tokyo Shock Boys to see who is more extreme. In the end the Tokyo Shock Boys refuse to do a live show with Dirty Sanchez due to their disgusting antics.The DVD of Dirty Sanchez: The Movie was released on 22 January 2007 by Pathé Distribution Ltd.The movie premiered on television on MTV at 10:30pm on 5 August 2007. Many of the scenes and stunts were cut short or not shown due to censorship reasons[citation needed]. TMF broadcast the movie later that month.The movie premiered at the 2007 Tribeca Film Festival. Described as Jackass on crack, the film is about \"wicked nasty stunts such as liposuction drinking games, beer enema shotguns, things that shouldn't be done with male genitalia, and more....\"[2] Former drug smuggler Howard Marks makes an appearance as Satan.[3]The film was released on DVD in North America on September 11, 2007 by Dimension Extreme and Alliance Atlantis.Critic Peter Bradshaw of The Guardian gives the film a score of 3 out of 5. He admits the film is not in good taste but describes it as a film \"you feel guilty and ashamed for enjoying\" and jokes \"for sheer self-destructive lunacy they might deserve an award\".[4]The [[Daily Mail]] abhorred the film, saying it should have been banned.[5]The website Rotten Tomatoes gave the film an average rating of 4.5/10","Soundtrack":"Front and Rear End:Jobs for the Boyos:European Invasion:Dirty Sanchez the Movie:This is the track listing from the Soundtrack CDSanchez Get High – Pritchard 'V' Dainton:","external_links":"Website","starring":"Matthew Pritchard Dan Joyce Michael Locke Lee Dainton","running_time":"22–30 minutes","Pritchard vs Dainton – The Rise and Falls":"Pritchard vs Dainton -–The Rise and Falls is an upcoming documentary based on the series, directed by Jim Hickey and produced by Lee Dainton.[6] It details the series' ten-year history, including interviews with the team and never-before seen footage from various episodes. Scheduled for release in March 2014, it was in production for roughly six months but was restrained by MTV, who owned the rights to the series' footage.[7] Pritchard and Dainton started a crowdfund on Kickstarter for £10,000 on 5 February 2014 to purchase the rights. Within two days the target was reached. It is narrated by Howard Marks, who had a brief appearance in the Dirty Sanchez movie as Satan.","Dirty Sanchez: Stage Show":"At the 2004 and 2005 Carling weekend at the Reading and Leeds festivals, the Dirty Sanchez team performed a variety of stunts live onstage at the cabaret tent, including being dragged across a sandpapered stage on bare buttocks, and smoking a bong filled with their own urine, and with their own pubic hair instead of marijuana. They also appeared at the Leeds leg of the festival in 2006.On 1 June 2007, Dirty Sanchez confirmed a full stage show with DJ at Reading Festival 2007.They also performed live in the summer of 2007 every Monday at Bar M in Ibiza.In 2009, Dirty Sanchez toured Australia with The Dudesons during the Soundwave Festival."}