{"directed_by":"Tarun Majumdar","country":"India","story_by":"Sharadindu Bandyopadhyay","Music":"The music director of the film is Hemanta Mukherjee. The film has many uses of Rabindra Sangeet such as Charana Dharite, Ei korechho bhalo and also Bodhu Kon Alo Laaglo Chokhe, Guru Guru Guru Guru Ghono Megho which was the part of the play 'Chitrangada' in the movie. There was also a song which was originally written by Saradindu Bandopadhyay himself titled as Janam Abdhi. The music of the film was a huge hit upon release and is still popular today.All lyrics written by Rabindranath Tagore, Pulak Bandyopadhyay, Sharadindu Bandyopadhyay and Hridayesh Pandey, all music composed by Hemanta Mukherjee.[8]","release_dates":"1980","Plot":"Kedar Chatujye (Tapas Paul), a dim-witted simpleton, is exiled to his uncle’s house in a small town in Bihar by his father, who is extremely angry with him for being unable to pass his B.A. exams after three attempts. The simple-minded Kedar becomes the butt of all jokes of his cousin Santu (Ayan Banerjee) gang of friends led by Bhombol Bhattacharjee also known as Bhombolda (Anup Kumar).He falls in love with Saraswati (Mahua Roychoudhury) a girl with a strong, no-nonsense character who is the elder sister of Santu’s betrothed Beena (Debashree Roy). Saraswati’s parents too are impressed by Kedar’s decency and simplicity; she softens up to Kedar. However, Bhombolda and his gang create misunderstandings between the two. An extremely disappointed Saraswati decides to marry a rich boy from Bhagalpur (Kaushik Banerjee). But at the end, Bhombolda and Boudi (Sandhya Roy) realise that Kedar has a heart of gold and admits his wrongdoing leading Saraswati getting married to Kedar.","starring":"Mahua Roychoudhury, Tapas Paul, Debasree Roy, Ayan Banerjee, Sandhya Roy, Ruma Guha Thakurta, Anup Kumar","running_time":"154 minutes","language":"Bengali","music_by":"Hemanta Mukherjee","edited_by":"Ramesh Joshi, Shakti Pada Roy","cinematography":"Shakti Banerjee"}