{"original_language":"English","place_premiered":"Australia","Film version":"The play was adapted to a 1976 film by the playwright and directed by Bruce Beresford. John Hargreaves plays Don Henderson with Jeanie Drynan as Don's wife Kath. Ray Barrett plays Mal, Don's mentor, and Pat Bishop is his wife. Graham Kennedy plays Mack, Graeme Blundell is the repressed Australian Liberal Party supporter and Veronica Lang his obedient wife. Kerry (Candy Raymond) is the attractive and assertive artist and Evan (Kit Taylor) is her uptight and possessive partner. Cooley (Harold Hopkins) comes with his young girlfriend Susan (Clare Binney).In the film the setting is relocated to the suburb of Westleigh in the northern suburbs of Sydney. The film also deviates from the stage version by increasing the level of profanity and contains full frontal nudity and sex scenes.Pat Bishop won the AFI Award for Best Actress in a Leading Role, Veronica Lang won the AFI Award for Best Actress in a Supporting Role, Bruce Beresford won the Best Direction award, David Williamson won the Best screenplay award, and the film won the edit and sound award.The video clip to You Am I's 1998 single \"What I Don't Know 'bout You\" is a tribute to 'Don's Party'. It features classic scenes from the movie re-enacted by noted Australian actors, including Stephen Curry, Ben Mendelsohn, Matt Day, Tania Lacy and Nadine Garner.In 1973 Phillip Adams was approached to make the film by Jack Lee, who wanted to direct. At the time Adams felt that comedies were the only genre of film likely to redeem themselves financially in Australia, so he felt he would easily be able to raise finance for the movie, which he did not think would cost more than $300,000. However Adams was busy at the time working on the Australia Council, which held up his involvement for 12 months; at the end of that time, Australia was in the middle of a credit squeeze and he found it more difficult than he expected to get the money.[4]Problems then emerged with the director Lee wanted to make the film into a broader comedy, which made Williamson uncomfortable and Adams was worried about raising finance with Lee attached, so Lee pulled out.[5] Adams approached Ken Hannam but he lacked sympathy for the characters and found them too aggressive.[4] Tim Burstall and Peter Weir were approached but they also turned down the film. Eventually Adams approached Bruce Beresford, who agreed.There was some discussion that the events of the play be updated to the 1975 Federal election, but in the end it was decided to keep the screenplay faithful to the original play as it was widely believed in 1975 that Labor would lose - which was not the case in 1969. The setting was relocated to Sydney, in part because it was felt it would be cheaper but also to ensure audiences did not feel the movie was \"too Melbourne\".[5] The budget was raised from the Australian Film Commission and private investors, mainly exhibitors.[2]Adams wanted to cast Paul Hogan as Cooley but the actor declined. Ray Barrett had played that role in London but was considered too old to do it on film, and was given the part of Mal instead. He was changed from being an ex-student to a lecturer to allow for his age. Graeme Blundell took his role in order to escape typecasting as Alvin Purple. Barry Crocker was originally meant to play Don but was replaced by John Hargreaves.[4]Shooting began in January 1976 and took roughly five weeks, using a house in Westleigh, Sydney as the main location.[2]John Gorton played a cameo as himself as a tribute to his contribution in helping re-establish the Australian film industry.Phillip Adams originally distributed the film himself. Don's Party grossed $871,000 at the box office in Australia,[6] which is equivalent to $4,503,070 in 2009 dollars.Williamson rated the film highly saying it was \"very well done\".[7]","Plot":"Don Henderson is a schoolteacher living with his wife Kath and baby son in suburban Melbourne. On the night of the 1969 federal election Don invites a small group of friends to celebrate a predicted Australian Labor Party (ALP) election victory, much to the dismay of his wife. To the party come Mal, Don’s university mentor, and his bitter wife Jenny, sex-obsessed Cooley and his latest girlfriend, nineteen-year-old Susan, Evan, a dentist, and his beautiful artist wife Kerry. Somehow, two Liberal supporters, Simon and Jody also come.As the party wears on it becomes clear that Labor, who are supported by Don and most of the guests, are not winning. As a result, the drinking goes up a few notches, and the sniping between Don and his male friends about their failed aspirations gets uglier, as does their behaviour toward the women. Mack, a design engineer whose wife has just left him, pulls out a nude photo of her for his friends' approval. Crass womaniser Cooley pursues the available women. The disillusioned wives exchange tales of their husbands' subpar sexual performance. By the end of the night, Don and some of his friends have begun to grasp the emptiness of their compromised lives.","genre":"Comedy-drama","date_premiered":"1971","written_by":"David Williamson","setting":"Suburban house","Sequel: Don Parties On":"In 2010 Williamson wrote Don Parties On, which opened the 2011 season of the Melbourne Theatre Company. Directed by Robyn Nevin, this sequel premiered on 13 January 2011 at the Arts Centre Playhouse.[8]Don Parties On revisits many of the original characters as Don and Kath throw another party on the night of the 2010 Australian federal election. The relationships between the returning characters have changed, and there are also new characters: Cooley's wife Helen, Don and Kath's son Richard, Richard's lover Roberta, and his daughter Belle.[9]Williamson said he wrote the play for two reasons:One was, what had happened to Don and his friends? The 20-somethings of Don’s Party were starting to ask themselves how their lives were going to pan out. Would their hopes and dreams be realised? Forty years later they know exactly how things have panned out – who has succeeded and who has failed and what criteria do you use to evaluate such questions in any case? Secondly, what has happened to Australia politically and socially in the intervening years? How has the landscape changed? [7]"}