{"country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"David Rabe","story_by":"Daniel Lang","Plot":"The story is presented as a flashback of Max Eriksson, a Vietnam veteran. A platoon of American soldiers is on patrol when they are suddenly attacked by the Viet Cong. While on flank security, the ground cracks under Eriksson as he is above a Viet Cong tunnel. Sergeant Tony Meserve pulls Eriksson out of the hole and eventually, the Americans stave off the attack.The platoon takes a break outside a river village in the Central Highlands. While relaxing and joking around, one of the platoon members, Specialist 4 \"Brownie\" Brown, is killed when the Viet Cong ambushes them. Shortly afterward, Private First Class Antonio Diaz arrives as Brownie's replacement.Frustrated because his squad has been denied leave for an extended period, Meserve orders the squad to kidnap a Vietnamese girl, Than Thi Oanh, to be their sex slave. Eriksson strenuously objects, but Meserve silences him and ostracizes him from the rest of the squad, later threatening to kill Eriksson if he dares an attempt to interfere. The girl is forcibly taken to the squad's next command post and is repeatedly beaten and raped by all the men but Eriksson.The squad later takes up a position near a railroad bridge overlooking a Viet Cong river supply depot. Meserve has Diaz order air support for an assault on the depot, then orders Oanh to be killed. Before the squad can kill her, Eriksson fires his rifle into the air, exposing them to the nearby Viet Cong. In the midst of the firefight, Oanh tries to escape. Eriksson tries to save her but is stopped by Meserve, who knocks Eriksson down with the butt of his gun. Eriksson watches helplessly as the entire squad shoots Oanh numerous times until she falls off the bridge.After the battle, Eriksson wakes up in a hospital. He jeopardizes both his life and military career (thanks in large part to indifferent superiors, who prefer to bury the matter) to expose the crime. Eventually, an attempt on Eriksson's life is made by Corporal Thomas E. Clark, who tries to kill Eriksson while he is using the latrine. Eriksson takes action by confronting Meserve and his men, and using a shovel, strikes Clark across the face, scaring the rest of the men.Eriksson then meets a chaplain at the bar and tells him the story of the girl. There is an investigation and the four men who participated in the rape and murder are court martialed: Meserve receives ten years hard labor and a dishonorable discharge, Clark is sentenced to life in prison, Private First Class Herbert Hatcher receives fifteen years hard labor, Diaz receives eight years hard labor.At the end of the film, Eriksson wakens from a nightmare to find himself on a J-Church transit line in San Francisco, just a few seats from a Vietnamese-American student who resembles Oanh (same actress). She disembarks at Dolores Park and forgets her scarf, and Eriksson runs after her to return it. As she thanks him and turns away, he calls after her in Vietnamese. She surmises that she reminds him of someone, and adds that he's had a bad dream. They go their separate ways and Eriksson is somewhat comforted.","language":"English","Reception":"Casualties of War opened in 1,487 theatres, and ranked number 4 in box office for the first week of its release. It went on to gross $18,671,317, making it a box office loss. Most of the reviews were positive, and it garnered an 84% rating on Rotten Tomatoes based on 43 reviews.WinsNominations","box_office":"$18,671,317[2]","cinematography":"Stephen H. Burum","directed_by":"Brian De Palma","casualties_of_war":"Theatrical poster","release_dates":"August 18, 1989 (1989-08-18)|||||","Production":"The film was based on the real-life incident on Hill 192, and on Daniel Lang's book of the same title, but all names and some details of the story were altered.The novel was published in 1969.[4] Film rights were bought by David Susskind who was to produce the film for Warner Bros.[5] Pete Hamill wrote a script and Jack Clayton was to direct.[6] However the film was not made. In the late 1970s Susskind announce he would make the film for ABC-TV.[7] This did not eventuate.In 1979 David Rabe mentioned the project to Brian De Palma, who was interested but was unable to raise the money to finance it. Some years later Rabe had written a script, and De Palma attached Michael J. Fox and Sean Penn as actors. They almost succeeded in getting the film financed at Paramount, but ultimately decided not to proceed when the budget went from $17 million to $20 million. De Palma then went on to make The Untouchables which was a big hit; Dawn Steel had liked the project at Paramount, and when she became head of production at Columbia Studios, Casualties of War was the first film she green-lit.[8][1][9]\"Historically Vietnam War movies have been very profitable,\" said Steel. \"All of them. Platoon, Full Metal Jacket, Apocalypse Now, The Deer Hunter. You're looking at movies that have never been not pretty successful, but very successful. The foreign numbers have been extraordinary.\"[1]The film was shot in early 1988, mostly on location in Thailand, with some filming in San Francisco.[10] The bridge location was filmed in Kanchanaburi, Thailand, which was the same as the famous Bridge on the River Kwai.This film was Fox's third major dramatic role. He had previously starred in Light of Day and Bright Lights, Big City. John C. Reilly and John Leguizamo make their screen debuts in the film, and the latter would again star with Penn in another picture by De Palma, 1993's Carlito's Way.\"Let's be honest,\" said Fox at the time. \"If this movie makes a buck and a half it's going to be things like Bikini's Away for me. But to fail doing something unexpected is no disgrace. To fail doing the ordinary is a disaster. This movie is about how much you will risk if you have nothing to gain.\"[10]","produced_by":"Art Linson","starring":"Michael J. Fox|Sean Penn|","running_time":"113 minutes","music_by":"Ennio Morricone","edited_by":"Bill Pankow","Release":"The movie debuted at number four. It was criticised by Vietnam Veteran Groups.[11]The theatrical cut of the film was released on DVD in 2001. This version has the original 113 minute running time. An extended cut of the film was released on DVD in 2006, that contains two scenes cut from the original release. One has Eriksson being interrogated by the two investigators, and the other is the defense attorney trying to discredit Eriksson during the trial. This extended version has a running time of 119 minutes.","budget":"$22.5 million[1]"}