{"country":"Italy Spain United States[1]","distributed_by":"Euro International Film (Italy) United Artists (US & UK)","screenplay_by":"Luciano Vincenzoni Sergio Donati Sergio Leone Dialogue: Roberto De Leonardis Carlo Tritto","story_by":"Sergio Leone Sergio Donati","Plot":"In Revolution-torn 1913 Mexico, Juan Miranda, a Mexican outlaw leading a bandit family, robs a coach of wealthy men and rapes a female passenger who insulted him. Passing by on a motorcycle is John (Seán) H. Mallory, an early Irish Republican explosives expert, who is working in Mexico as a silver mine blaster. Discovering his skill with dynamite and nitroglycerin, Juan relentlessly tries to force John to join him on a raid on the Mesa Verde National Bank.John, meanwhile, has made contact with revolutionaries and intends to use his explosives in their service. The bank is hit as part of an orchestrated revolutionary attack on the army organized by physician Dr. Villega. Juan, interested only in the money, is shocked to find that the bank has no funds and instead is used by the army as a political prison. John, Juan and his family end up freeing hundreds of prisoners, causing Juan to become a \"great, grand, glorious hero of the revolution.\"The revolutionaries are chased into the hills by an army detachment led by Colonel Günther Reza. John and Juan volunteer to stay behind with two machine guns and dynamite. Much of the army's detachment is destroyed while crossing a bridge, which is blown up by John. Colonel Reza, who commands an armoured car, survives. After the battle, John and Juan find most of their comrades, including Juan's father and children, have been killed by the army in a cave. Grief-stricken and enraged, Juan goes out to fight the army single-handed and is captured. John sneaks into camp, where he witnesses executions of many of his fellow revolutionaries by firing squad. They had been informed on by Dr. Villega, who has been tortured by Colonel Reza and his men. This evokes in John memories of a similar betrayal by Nolan, his best friend in Ireland. Nolan's betrayal forced John to kill him and two British soldiers, making him a fugitive and forcing him to flee Ireland. Juan faces a firing squad of his own, but John arrives and blows up the wall with dynamite just in time. They escape on John's motorcycle.John and Juan hide in the animal coach of a train. It stops to pick up the tyrannical Governor Don Jaime, who is fleeing (with a small fortune) from the revolutionary forces belonging to Pancho Villa and Emiliano Zapata. As the train is ambushed, John, as a test of Juan's loyalty, lets him choose between shooting the Governor and accepting a bribe from him. Juan kills Jaime, also stealing the Governor's spoils. As the doors to the coach open, Juan is greeted by a large crowd and again unexpectedly hailed as a great hero of the revolution, the money taken away by revolutionary General Santerna.On a train with commanders of the revolution, John and Juan are joined by Dr. Villega, who has escaped. John alone knows of Villega's betrayal. They learn that Pancho Villa's forces will be delayed by 24 hours and that an army train carrying 1,000 soldiers and heavy weapons, led by Colonel Reza, will be arriving in a few hours, which will surely overpower the rebel position. John suggests they rig a locomotive with dynamite and send it head on. He requires one other man, but instead of picking Juan, who volunteers, he chooses Dr. Villega. It becomes clear to Villega that John knows of the betrayal. John nonetheless pleads with him to jump off the locomotive before it hits the army's train, but Villega feels guilty and stays on board. John jumps in time and the two trains collide and explode, killing Villega and a number of soldiers.The revolutionaries' ambush is successful, but as John approaches to meet Juan, he is shot in the back by Colonel Reza. An enraged Juan guns down the Colonel with a machine gun. As John lies dying, he continues to have memories of Nolan, and of a young woman they both apparently loved. Juan kneels by his side to ask about Dr. Villega. John keeps the doctor's secret and tells Juan that he died a hero of the revolution. As Juan goes to seek help, John, knowing his end is near, sets off a second charge he secretly laid in case the battle went bad. Horrified by his friend's sudden death, Juan stares at John's burning remains, before turning to the camera and asking forlornly, \"What about me?\"","language":"Italian English Spanish","Themes":"Despite the politically charged setting, Duck, You Sucker! was not intended as a political film: Leone himself said that the Mexican Revolution in the film is meant only as a symbol, not as a representation of the real one, and that it was chosen because of its fame and its relationship with cinema, and he contends that the real theme of the film is friendship:[5]I chose to oppose an intellectual, who has experienced a revolution in Ireland, with a naïve Mexican… you have two men: one naïve and one intellectual (self-centred as intellectuals too often are in the face of the naïve). From there, the film becomes the story of Pygmalion reversed. The simple one teaches the intellectual a lesson. Nature gains an upper hand and finally the intellectual throws away his book of Bakunin's writings. You suspect damn well that this gesture is a symbolic reference to everything my generation has been told in the way of promises. We have waited, but we still are waiting! I have the film say, in effect \"Revolution means confusion\".Another theme is amoral non-engagement: Juan is very loyal to his family (consisting of his six children, each from a different mother), but he cannot be trusted by anyone else. He is also very cynical about priests, and he doesn't care about codified law. This relates most closely to those aspects of Southern Italian life observed by Edward Banfield and others.[5]The film also explores the relationship between Mexican bandits and peasant communities at the time of the revolution, idealised by figures like Juan José Herrera and Elfego Baca, which Leone may have had in mind in his creation of the character of Juan.[5]","box_office":"4,731,889 admissions (France)[2]","cinematography":"Giuseppe Ruzzolini","production_company":"Rafran Cinematografica Euro International Film San Miura United Artists","directed_by":"Sergio Leone","release_dates":"29 October 1971 (1971-10-29TItaly)","Production":"The development of Duck, You Sucker! began during the production of Once Upon a Time in the West, when Sergio Leone’s collaborator Sergio Donati presented him with an early treatment of the film.[4] Around the same time, political riots had broken out in Paris, and the concepts of revolution and left-wing nationalism had become popular among university students and filmmakers across Europe. Leone, who had used his previous films to deconstruct the romanticization of the American Old West, decided to use Duck, You Sucker! to deconstruct the romanticized nature of revolution, and to shed light on the political instability of contemporary Italy.[4]Leone, Donati and Luciano Vincenzoni worked together on the film’s screenplay for three to four weeks, discussing characters and scenes for the film. Donati, who had previously acted as an uncredited script doctor for The Good, the Bad and the Ugly, conceived Juan Miranda’s character as an extension of Tuco from The Good, the Bad and the Ugly. Meanwhile, Leone was largely responsible for the character of John Mallory, and the film’s focus on the development of John and Juan’s friendship.[4] At times, however, Leone, Donati, and Vincenzoni found that they had highly differing opinions about how the film should be made, with Leone wanting to have the film produced on a large scale with an epic quality, while Donati and Vincenzoni perceived the film as a low-budget thriller.[4]Leone never intended to direct Duck, You Sucker!, and wanted the film to be directed by someone who could replicate his visual style. Peter Bogdanovich, his original choice for director, soon abandoned the film due to perceived lack of control.[4][5] Sam Peckinpah then agreed to direct the film after Bogdanovich's departure, only to be turned down for financial reasons by United Artists. Donati and Vincenzoni, noting the director's frequent embellishment of the facts concerning his films, claim that Peckinpah did not even consider it - Donati stated that Peckinpah was \"too shrewd to be produced by a fellow director\".[5] Leone then recruited his regular assistant director, Giancarlo Santi, to direct, with Leone supervising proceedings, and Santi was in charge for the first ten days of shooting. However, Rod Steiger refused to play his role as Juan unless Leone himself directed, and the producers pressured him into directing the film. Leone reluctantly agreed, and Santi was relegated to second unit work.[5][4]The inspiration for the firing squad scene came from Francisco Goya, and in particular from his set of prints The Disasters of War. Leone showed the prints to director of photography Giuseppe Ruzzolini in order to get the lighting and color effects he wanted.[5] The film is believed to have been influenced by Peckinpah's The Wild Bunch, and it shares some plot elements with Pat Garrett and Billy the Kid, a western film also starring Coburn and released a year later.[6] Leone biographer and film historian Sir Christopher Frayling noted that Duck, You Sucker! was made in a period of Italian cinema where filmmakers were ‘rethinking’ their relationship with fascism and the Nazi occupation of Rome. He has identified numerous references to both World Wars in the film, such as Colonel Reza’s commanding of an armored car resembling a Nazi tank commander, the massacre of Juan’s family (which bares similarities to the Ardeatine massacre of 1944), and an execution victim resembling Benito Mussolini.[4]Casting the lead roles of Duck, You Sucker! proved to be a difficult process. The role of John Mallory was written for Jason Robards, who had played Cheyenne in Once Upon a Time in the West.[4] However, the studio wanted a bigger name for his character. Clint Eastwood was then approached by Leone for the role, but he saw it as just a different take of the same character he had already played in the Dollars Trilogy, and he also wanted to end his association with the Italian film industry. As a result, he declined the offer and starred in Hang 'Em High instead.[7] George Lazenby was then approached to play John, but he declined. A young Malcolm McDowell, then mostly known for his performance in if...., was considered for both John and Nolan, John’s Irish friend, but Leone eventually settled on James Coburn to play John.[5][4] Coburn had previously been considered for other Leone projects, including A Fistful of Dollars and Once Upon a Time in the West. He had also previously been considered for a role in another United Artists-financed Zapata Western, Sergio Corbucci's The Mercenary, but Franco Nero was later cast in what was originally his role.[8]The role of Juan Miranda was written for Eli Wallach, based on his performance of Tuco in The Good, the Bad and the Ugly, but Wallach had already committed to another project with Jean-Paul Belmondo. After Leone begged Wallach to play the part, he dropped out of the other project to play Juan. However, the studio never wanted Wallach; they wanted an actor who had more international appeal, and Rod Steiger had already been signed on by that point. Leone offered no compensation to Wallach, and Wallach subsequently sued.[9][4]Leone was initially dissatisfied with Steiger's performance in that he played his character as a serious, Zapata-like figure.[5] As a result, tensions rose between Steiger and Leone numerous times, including an incident that ended with Steiger walking off during the filming of the scene when John destroys Juan’s stagecoach. However, after the film’s completion, Leone and Steiger were content with the final result, and Steiger was known to praise Leone for his skills as a director.[4]Exterior filming mostly took place in Andalucía, Spain. Some of the locations used previously featured in Leone's Dollar Trilogy films; for example, the Almería Railway Station, used for the train sequence in For a Few Dollars More, returns in this film as Mesa Verde's station. The flashback scenes with Sean and friends were shot at Howth Castle in Dublin, and Toner's Pub on Baggot Street, Dublin.[4] As filming progressed, Leone modified the script: as he did not originally plan on directing Duck, You Sucker, he thought the script was \"conceived for an American filmmaker\".[5] Duck, You Sucker! was one of the last mainstream films shot in Techniscope.[10]The musical score for Duck, You Sucker! was composed by Ennio Morricone, who collaborated with Leone in all his previous projects. Elvis Mitchell, former film critic for the New York Times, considered it as one of Morricone's \"most glorious and unforgettable scores\".[6] He also sees \"Invention for John\", which plays over the opening credits and is essentially the film's theme, \"as epic and truly wondrous as anything Morricone ever did\".[6] A soundtrack album was released in the United States in 1972,[6] and many tracks can be found in Morricone's compilation albums. Music was recorded in April 1971 and second recording sessions in August/September 1971. A 35th anniversary OST was issued in 2006 with previously never released recording session and alternate takes.","duck,_you_sucker!_(giù_la_testa)":"US theatrical poster by Robert McGinnis, with the original title","Release and reaction":"The film was moderately successful in Italy, where it grossed 2 billion lire on its first run.[11]It was the fourth most popular movie of the year in France.[2]Duck, You Sucker! failed to gain any substantial recognition from the critics at the time of debut, especially compared to Leone's other films, winning him only a David di Donatello for Best Director. Since then, however, it has received a more favorable reception: On the review aggregator Rotten Tomatoes, the film has a 90% rating.[12] The Chicago Reader praised it for its \"marvelous sense of detail and spectacular effects\".[13] The New York Observer argues that Leone's direction, Morricone's score and the leads' performance \"ignite an emotional explosion comparable to that of Once Upon a Time in the West\". In Mexico, where the film is known as Los Héroes de Mesa Verde, it was refused classification and effectively banned until 1979 because it was considered offensive to the Mexican people and the Revolution.[14]The film was originally released in the United States in 1972 as Duck, You Sucker!, and ran for 121 minutes. Many scenes were cut because they were deemed too violent, profane or politically sensitive, including a quote from Mao Zedong about the nature of revolutions and class struggle.[15][16][4] Theatrical prints were generally of poor quality, and the film was marketed as a light-hearted spiritual successor to the Dollars Trilogy,[17][16] not at all as Leone intended it, and it did not succeed in gaining press notice. In part because of this, United Artists reissued the film under the new name of A Fistful of Dynamite, meant to recall the notoriety of A Fistful of Dollars.[17][16] According to Peter Bogdanovich, the original title Duck, You Sucker! was meant by Leone as a close translation of the Italian title Giù la testa, coglione! (translated: \"Duck Your Head, Asshole!\"), which he contended to be a common American colloquialism. (The expletive coglione (a vulgar way to say \"testicle\") was later removed to avoid censorship issues.)[18][4] One of the working titles, Once Upon a Time… the Revolution,[6] was also used for some European releases.[17][16][4]In 1989, Image Entertainment released the film on laserdisc, including some material cut from the original US version and lasting 138 minutes. This version was released in Europe as Once Upon a Time… the Revolution, again intended to evoke an earlier Leone film, Once Upon a Time in the West.[17]Subsequent re-releases have largely used the title A Fistful of Dynamite,[19][20] although the DVD appearing in The Sergio Leone Anthology box set, released by MGM in 2007, used the original English language title of Duck, You Sucker!.[21][22]The film's first English language DVD was released by MGM in the UK in 2003. This version of the film runs 154 minutes and is almost complete, but it uses a truncated version of the film's final four-minute-long flashback. In 2005, following the restoration of Leone's The Good, the Bad and the Ugly, MGM re-released the film in the UK with more supplemental material, the aforementioned flashback scene reinstated and with a newly created 5.1 surround soundtrack. The restored version had a brief art house theatrical run in the U.S. and was subsequently released there in a \"Collector's Edition\" in 2007.[22] The remastered surround tracks have attracted criticism online for the replacement of certain music cues throughout the film (most prominently during the last two flashback scenes and the end credits) and for censoring at least two expletives from the film's soundtrack. Furthermore, it has been reported that the mono soundtrack included on the 2007 Collector's Edition is not the original mix, but simply a fold-down of the surround remaster.[23]Duck, You Sucker! was shown in 2009 as part of the Cannes Classics series of the 62nd Cannes Film Festival.[24] The print used for the festival was restored by the Cineteca di Bologna and the film laboratory Immagine Ritrovata.On October 7, 2014, MGM released the film on Blu-ray disc, akin to their Blu-ray releases of the Dollars Trilogy.[25]","produced_by":"Fulvio Morsella","starring":"Rod Steiger James Coburn Romolo Valli","running_time":"157 minutes","music_by":"Ennio Morricone","edited_by":"Nino Baragli"}