{"country":"United States","distributed_by":"Orion Pictures","Background":"The film's name is based on the nickname for Durham, North Carolina, which has been called \"Bull Durham\" since the 1800s, when W. T. Blackwell and Company named its product \"Bull\" Durham tobacco, which soon became a well-known trademark. In 1898, James B. Duke purchased the company and renamed it the American Tobacco Company. By this time, the nickname Bull Durham had already stuck.The film's writer and director, Ron Shelton, played minor league baseball for five years after graduating from Westmont College in Santa Barbara, California. Initially playing second base for the Baltimore Orioles' farm system, he moved from the Appalachian League to California and then Texas before finally playing AAA baseball for the Rochester Red Wings in the International League. Shelton quit when he realized he would never become a major league player. \"I was 25. In baseball, you feel 60 if you're not in the big leagues. I didn't want to become a Crash Davis\", he said.[4]He returned to school and earned a Master of Fine Arts in sculpture at the University of Arizona before moving to Los Angeles to join the city's art scene. However, he felt more kinship in telling stories than in creating performance art. His break into filmmaking came with scriptwriting credits on the films Under Fire and The Best of Times .[4]","Plot":"\"Crash\" Davis (Costner), a veteran of 12 years in minor league baseball, is sent down to the single-A (advanced) Durham Bulls for a specific purpose: to educate hotshot rookie pitcher Ebby Calvin LaLoosh (Robbins, playing a character loosely based on Steve Dalkowski)[2][3] about becoming a major-league talent, and to control Ebby's haphazard pitching. Crash immediately begins calling Ebby by the degrading nickname of \"Meat,\" and they get off to a rocky start.Thrown into the mix is Annie (Sarandon), a \"baseball groupie\" and lifelong spiritual seeker who has latched onto the \"Church of Baseball\" and has, every year, chosen one player on the Bulls to be her lover and student. Annie flirts with both Crash and Ebby and invites them to her house, but Crash walks out, saying he's too much a veteran to \"try out\" for anything. Before he leaves, Crash further sparks Annie's interest with a memorable speech listing the things he \"believes in\", ending with \"I believe in long, slow, deep, soft, wet kisses that last three days... Good night\".Despite some animosity between them, Annie and Crash work, in their own ways, to shape Ebby into a big-league pitcher. Annie plays mild bondage games, reads poetry to him, and gets him to think in different ways (and gives him the nickname \"Nuke\"). Crash forces Nuke to learn \"not to think\" by letting the catcher make the pitching calls (memorably at two points telling the batters what pitch is coming after Nuke rejects his calls), and lectures him about the pressure of facing major league hitters who can hit his \"heat\" (fastballs). Crash also talks about the pleasure of life in \"The Show\" (Major League Baseball), which he briefly lived for \"the 21 greatest days of my life\" and to which he has tried for years to return.Meanwhile, as Nuke matures, the relationship between Annie and Crash grows, until it becomes obvious that the two of them are a more appropriate match, except for the fact that Annie and Nuke are currently a couple.After a rough start, Nuke becomes a dominant pitcher by mid-season. By the end of the movie, Nuke is called up to the majors and the Bulls, now having no use for his mentor, release Crash. This incites jealous anger in Crash, who is frustrated by Nuke's failure to recognize all the talent he was blessed with. Nuke leaves for the big leagues, Annie ends their relationship, and Crash overcomes his jealousy to leave Nuke with some final words of advice. Crash then presents himself at Annie's house and the two consummate their attraction with a weekend-long lovemaking session. Crash then leaves Annie's house to seek a further minor-league position.Crash joins another team, the Asheville Tourists, and breaks the minor-league record for career home runs. We see Nuke one last time, being interviewed by the press as a major leaguer, reciting the clichéd answers that Crash had taught him earlier. Crash then retires as a player and returns to Durham, where Annie tells him she's ready to give up her annual affairs with \"boys\". Crash tells her that he is thinking about becoming a manager for a minor-league team in Visalia. The film ends with Annie and Crash dancing in Annie's candle-lit living room.","bull_durham":"Theatrical release poster","language":"English","Reception":"Bull Durham debuted on June 15, 1988 and grossed $5 million in 1,238 theaters on its opening weekend. It went on to gross a total of $50.8 million in North America, well above its estimated $9 million budget.[10]\"A few months after it came out, I was having dinner at a restaurant called The Imperial Gardens. A man came up and asked if I was Ron Shelton. I said yes, and he said, 'Somebody would like to meet you.' So I followed him—I didn't realize at the time it was Stanley Donen, the director—and he brought me over to his best friend, Billy Wilder. Wilder looked up and said, 'Great fuckin' picture, kid!' I said, 'Mr. Wilder, that's the best review I've ever had!'\"The film was well-received critically. It currently has a rating of 97% on Rotten Tomatoes. Metacritic reported the film had an average score of 73 out of 100, based on 16 reviews. In David Ansen's review for Newsweek magazine, he wrote that the film \"works equally as a love story, a baseball fable and a comedy, while ignoring the clichés of each genre\".[4] Vincent Canby praised Shelton's direction in his review for the New York Times; \"he demonstrates the sort of expert comic timing and control that allow him to get in and out of situations so quickly that they're over before one has time to question them. Part of the fun in watching Bull Durham is in the awareness that a clearly seen vision is being realized. This is one first-rate debut\".[11] Roger Ebert praised Susan Sarandon's performance in his review for the Chicago Sun-Times: \"I don't know who else they could have hired to play Annie Savoy, the Sarandon character who pledges her heart and her body to one player a season, but I doubt if the character would have worked without Sarandon's wonderful performance\".[12] In his review for Sports Illustrated, Steve Wulf wrote, \"It's a good movie and a damn good baseball movie\".[13] Hal Hinson, in his review for the Washington Post, wrote, \"The people associated with Bull Durham know the game ... and the firsthand experience shows in their easy command of the ballplayer's vernacular, in their feel for what goes through a batter's head when he digs in at the plate and in their knowledge of the secret ceremonies that take place on the mound\".[14] Richard Corliss, in his review for Time, wrote, \"Costner's surly sexiness finally pays off here; abrading against Sarandon's earth-mama geniality and Robbins' rube egocentricity, Costner strikes sparks\".[15]Bull Durham was named Best Screenplay of 1988 by New York Film Critics' Circle.[16] The film became a minor hit when released, and is now considered one of the best sports movies of all time.[17] In 2003, Sports Illustrated ranked Bull Durham as the \"Greatest Sports Movie\".[18] In addition, the film is ranked number 55 on Bravo's \"100 Funniest Movies.\"[19] It is also ranked #97 on the American Film Institute's \"100 Years...100 Laughs\" list, and #1 on Rotten Tomatoes' Top Sports Movies[20] list of the 53 best reviewed sports movies of all time. Entertainment Weekly ranked Bull Durham as the fifth best DVD of their Top 30 Sports Movies on DVD.[21] The magazine also ranked the film as the fifth best sports film since 1983 in their \"Sports 25: The Best Thrill-of-Victory, Agony-of-Defeat Films Since 1983\" poll[22] and #5 on their \"50 Sexiest Movies Ever\" poll.[23] In June 2008, AFI revealed its \"Ten top Ten\"—the best ten films in ten \"classic\" American film genres—after polling over 1,500 people from the creative community. Bull Durham was acknowledged as the fifth best film in the sports genre.[24][25]In 2003, a 15th anniversary celebration of Bull Durham at the National Baseball Hall of Fame was canceled by Hall of Fame president Dale Petroskey. Petroskey, who was on the White House staff during the Reagan administration, told Robbins that the actor's public opposition to the US-led war in Iraq helped to \"undermine the U.S. position, which could put our troops in even more danger.\"[26] Costner, a self-described libertarian, defended Robbins and Sarandon, saying, \"I think Tim and Susan's courage is the type of courage that makes our democracy work. Pulling back this invite is against the whole principle about what we fight for and profess to be about.\"[26]For years, Ron Shelton has contemplated making a sequel and remarked, \"I couldn't figure out in the few years right after it came out, what do you do? Nuke's in the big leagues, Crash is managing in Visalia. Is Annie going to go to Visalia? I've been to Visalia. That will test a relationship ... It was not a simple fable to continue with – not that we don't talk about continuing it, now that everyone's in their 60s\".[6]Actor Trey Wilson, who played Durham manager Joe Riggins, died of a cerebral hemorrhage at age 40, seven months after this film's release.American Film Institute recognitionAcademy AwardsGolden Globe AwardsWriters Guild of America AwardBoston Society of Film CriticsLos Angeles Film Critics AssociationNational Society of Film Critics1988 New York Film Critics Circle Awards","box_office":"$58 million[1]","cinematography":"Bobby Byrne","directed_by":"Ron Shelton","Home media":"Bull Durham was originally released on DVD on October 27, 1998 and included an audio commentary by writer/director Ron Shelton.[27] A Special Edition DVD was released on April 2, 2002 and included the Shelton commentary track from the previous edition, a new commentary by Kevin Costner and Tim Robbins, a Between The Lines: The Making Of Bull Durham featurette, a Sports Wrap featurette, and a Costner profile.[28] A \"Collector's Edition\" DVD celebrating the film's 20th anniversary was released on March 18, 2008 and features the two commentaries from the previous edition, a Greatest Show on Dirt featurette, a Diamonds in the Rough featurette that explores minor league baseball, The Making of Bull Durham featurette, and Costner profile from the previous edition.[29]","narrated_by":"Susan Sarandon","release_dates":"June 15, 1988 (1988-06-15)|||||","Production":"According to Shelton, \"I wrote a very early script about minor league baseball; the only thing it had in common with Bull Durham was that it was about a pitcher and a catcher.\"[5] That script was titled, The Player To Be Named Later; a single anecdote from that script made it into Bull Durham.[4] For Bull Durham, Shelton \"decided to see if a woman could tell the story\" and \"dictated that opening monologue on a little micro-recorder while I was driving around North Carolina.\"[5]Crash was named after Lawrence \"Crash\" Davis but was modeled after Pike Bishop, the lead character William Holden played in The Wild Bunch: a guy who \"loved something more than it loved him.\"[5] Annie Savoy's name was a combination of the nickname (\"Annies\") that baseball players gave their groupies and the name of a bar; she was a \"High Priestess [who] could lead us into a man's world, and shine a light on it. And she would be very sensual, and sexual, yet she'd live by her own rigorous moral code. It seemed like a character we hadn't seen before.\"[5] After Shelton returned to Los Angeles from his road trip, he wrote the script for Bull Durham in \"about twelve weeks.\"[5]When Shelton pitched Bull Durham, he had a hard time convincing a studio to give him the opportunity to direct.[4] Baseball movies were not considered a viable commercial prospect at the time and every studio passed except for Orion Pictures who gave him a $9 million budget (with many cast members accepting lower-than-usual salaries because of the material), an eight-week shooting schedule, and creative freedom.[4] Shelton scouted locations throughout the southern United States before settling on Durham in North Carolina because of its old ballpark and its location, \"among abandoned tobacco warehouses and on the edge of an abandoned downtown and in the middle of a residential neighborhood where people could walk\".[6]Shelton cast Costner because of the actor's natural athleticism. Costner was a former high school baseball player and was able to hit two home runs while the cameras were rolling and, according to Shelton, insisted \"on throwing runners out even when they (the cameras) weren't rolling\".[7] He cast Robbins over the strong objections of the studio, who wanted Anthony Michael Hall instead.[8] Shelton had to threaten to quit before the studio backed off.[5]Producer Thom Mount (who is part-owner of the real Durham Bulls) hired Pete Bock, a former semi-pro baseball player, as a consultant on the film. Bock recruited more than a dozen minor-league players, ran a tryout camp to recruit an additional 40 to 50 players from lesser ranks, hired several minor-league umpires, and conducted two-a-day workouts and practice games with Tim Robbins pitching and Kevin Costner catching.[4] Bock made sure the actors looked and acted like ballplayers and that the real players acted convincingly in front of the cameras. He said, \"the director would say, 'This is the shot we want. What we need is the left fielder throwing a one-hopper to the plate. Then we need a good collision at the plate.' I would select the players I know could do the job, and then we would go out and get it done\".[9]","produced_by":"Thom Mount Mark Burg","starring":"Kevin Costner|Susan Sarandon|Tim Robbins|Trey Wilson|Robert Wuhl|","running_time":"108 minutes","music_by":"Michael Convertino","edited_by":"Robert Leighton Adam Weiss","written_by":"Ron Shelton","budget":"$7 million"}