{"based_on":"Billy Budd  by Herman Melville","country":"United Kingdom","distributed_by":"Allied Artists","screenplay_by":"Peter Ustinov Robert Rossen DeWitt Bodeen","Plot":"In the year 1797, the British naval vessel HMS Avenger press gangs into service a crewman \"according to the Rights of War\" from the merchant ship The Rights of Man. The new crewman, Billy Budd (Terence Stamp), is considered naive by his shipmates, and they attempt to indoctrinate him in their cynicism. But Budd's steadfast optimism is impenetrable, as when he is asked to critique the horrible stew the crew must eat, he offers \"It's hot. And there's a lot of it. I like everything about it except the flavor.\" The crew discovers Budd stammers in his speech when under anxiety.Though Budd manages to enchant the crew, his attempts at befriending the brutal master-at-arms, John Claggart (Robert Ryan), are unsuccessful. Claggart is cruel and unrepentant, a man who believes he must control the crew through vicious flogging; savaging them before they can prey on him.Claggart orders Squeak (Lee Montague) to find means of putting Budd on report and to implicate him in a planned mutiny. He then brings his charges to the Captain, Edwin Fairfax Vere (Peter Ustinov). Although Claggart has no reason to implicate Budd in the conspiracy, Budd becomes a target because Billy represents everything that Claggart despises: humility, innocence, and trust in humanity. Vere summons both Claggart and Budd to his cabin for a private confrontation. When Claggart makes his false charges that Budd is a conspirator, Budd stammers, unable to find the words to respond, and he strikes Claggart, killing him with a single blow.Captain Vere assembles a court-martial. Vere and all the other officers on board are fully aware of Budd's simplicity and Claggart's evil, but the captain is also torn between his morality and duty to his station. Vere intervenes in the final stages of deliberations (which are in full support of Budd). He argues the defendant must be found guilty for even striking Claggart, Budd's superior, not to mention killing him. Vere's soul is in turmoil over the decision he must make. His arguments to pursue the letter of the law succeed, and Budd is convicted.Condemned to be hanged from the ship's yardarm at dawn the following morning, Budd takes care to wear his good shoes. At Budd's final words, \"God bless Captain Vere!\", Vere crumbles, and Billy is subsequently hoisted up and hanged on the ships rigging. At this point the crew is on the verge of mutiny over the incident, but Vere can only stare off into the distance, the picture of abdication, overtaken by his part in the death of innocence. Just as the crew is to be fired upon by the ship's marine detachment, a French vessel appears and commences cannon fire on the Avenger, and the crew eventually returns fire. In the course of battle a piece of the ship's rigging falls on Vere, killing him in an act of poetic justice. The ship's figurehead is also shot off while a narrator tells of Budd's heroic sacrifice.","language":"English","cinematography":"Robert Krasker","production_company":"Anglo Allied Harvest Films","directed_by":"Peter Ustinov","billy_budd":"Original film poster","release_dates":"12 November 1962 (1962-11-12)|||||","Production":"Not commonly a director of films, Ustinov also produces and co-stars in the feature. His dedication to the film appears to emanate from his identification with the characters in the story. He said, \"I am an optimist, unrepentant and militant. After all, in order not to be a fool an optimist must know how sad a place the world can be. It is only the pessimist who finds this out anew every day.\" On the novel itself, Melville had been writing poetry for 30 years when he returned to fiction with \"Billy Budd\" in late 1888. Still unfinished when he died in 1891, it was forgotten. Melville's biographer accidentally stumbled upon it when going through a trunk of the writer's papers in his granddaughter's New Jersey home in 1919. Melville's widow worked to help complete it, and it was finally published in 1924. Over the years other unsatisfactory versions were published, but it wasn't until Melville's original notes were found that the definitive version was ultimately published in 1962. Coincidentally, this movie version, made in Europe and England, was released the same year.","produced_by":"Peter Ustinov","starring":"Robert Ryan Peter Ustinov Melvyn Douglas Terence Stamp","running_time":"123 minutes","music_by":"Antony Hopkins","edited_by":"Jack Harris"}