{"country":"United States","distributed_by":"Columbia TriStar Home Video","story_by":"Mark 'Crash' McCreery Cary Solomon Chuck Konzelman","Plot":"Quentin Kemmer (Devon Gummersall) is a shy security guard and obsessive comic book fan who dreams of becoming a superhero like his favorite comic book character The Arachnid Avenger, and going out with his next-door neighbor Stephanie Lewis (Amelia Heinle). When his partner is killed during a botched robbery at the research laboratory where he works, Quentin is fired and he injects himself with an experimental serum derived from spiders. The next day he is wracked with a severely high fever and spends most of the day unconscious. After he recovers he discovers that he has developed increased strength.Later that night, Stephanie is attacked and almost raped by a stalker until Quentin intervenes and kills the man, leaving before Stephanie can see him. Quentin later returns to his apartment and finds Stephanie being interviewed by Detective Frank Grillo (Dan Aykroyd) in hopes of identifying her savior. At first Quentin is thrilled that he is finally able to live his dream of becoming a superhero. However, as the days go by he begins to develop more spider-like abilities including being able to shoot webs from his abdomen, and his body becoming more spider-like. Later, Quentin is overwhelmed with an insatiable hunger but is unable to eat solid food. Arriving at a local store in an effort to find something to satisfy his hunger, he happens upon a man attempting to rape a young woman and attacks him, severely injuring the man. Expecting the woman to be grateful, he is surprised when she yells at him in anger as the man was her boyfriend. When she attempts to call the police Quentin encases her in webbing, Police Officer Williams (Christopher Cousins) arrives on the scene and attempts to free the woman but is attacked by Quentin.The next day the police converge on the store and find the man’s body which has been sucked dry of all fluids and the woman in a state of shock. Detective Grillo is confused by the state of the man’s body and by the presence of what appears to be spider webs at the scene as well as Williams’ badge even though his body is missing. Horrified at what he is becoming as his body mutates even further, and afraid of hurting anyone else, Quentin holes himself up in his room in an effort to prevent any more murders.The next night, he is overwhelmed by his insatiable hunger and ventures out, murdering two young men who used to pick on him. Trying to get to the bottom of the murders, Frank interviews the head of the research department where Quentin used to work where he discovers that scientists were working on a way to transfer properties from spider into humans. Now realizing that the killer might have injected himself with the lab’s serum and theorizing that Quentin might be the killer, Frank visits Quentin’s apartment but finds no one apparently home. After discovering the same webbing found at the store, Frank enters the apartment’s basement where he discovers dozens of bodies encased in webbing. Meanwhile, Frank’s wife Trixie (Theresa Russell) has followed her husband who she believes is hiding Officer Williams with whom she was having an affair. Trixie is then attacked by an almost completely metamorphosed Quentin who flees when Frank attempts to rescue her, but arrives too late to save her and she dies in his arms. Entering the apartment Quentin kidnaps Stephanie and takes her to an abandoned building nearby. Frank arrives at the building and finds Stephanie strung up in a large spider’s web. Before he can free her Quentin (now a grotesque mixture of man and spider) appears and begs Frank to kill him. Frank at first refuses to do so, but the animal side of Quentin takes over and he lunges at Stephanie, forcing Frank to open fire on him. Mortally wounded, Quentin manages to live long enough to hear Stephanie thank him for saving her before he expires.","language":"English","Reception":"Critical reception for the film has been mostly negative.TV Guide awarded the film 2 / 4 stars, criticizing Gummersall's performance, and its special effects calling them \"goofy\".[5] Steve Van Pelt from Filmthreat.com gave the film 1 / 4 stars stating, \"Not a single one of those powerful filmmakers out there could come up with an original idea if it bit into them with the inch-long fangs of an engineered Super Spider\".[6] Rich Rosell from Digitally Obsessed.com, which grades film on a scale from A to F awarded the film a grade C. Rosell praised the film's special effects that transformed actor Devon Gummersall into a human spider but complained about the film's dull story commenting, \"Stan Winston's Creature Features series is tied at 1-1, with this weak entry balanced against the entertaining initial release of She Creature. The story here is shamefully weak, and seems to borrow handily from The Fly for most of its intended, but poorly executed, dramatic tension. The campy superhero parallels mostly fall flat\".[7] Movie-gazette.com gave the film 3 / 10 stars calling it \"A bizarre mix of comic book camp and “The Fly”-style horror\".[8] It currently has a 4.2 / 10 rating on IMDb.[9]","earth_vs._the_spider":"DVD Cover Art","cinematography":"Thomas L. Callaway","production_company":"Creature Features Productions LLC","directed_by":"Scott Ziehl","release_dates":"October 7, 2001 (2001-10-07)|||||","Production":"\"B-films are what got me into the business, [and] I have a great deal of love for the movies of the Fifties and have really enjoyed bringing them to a new audience.\"Earth vs. the Spider was the first film a series of made-for-TV film remakes produced by special effects artist Stan Winston,[3] the first series to be produced by Winston's newly formed production company Stan Winston Productions and released by Cinemax.[1] The film's script, like the others in the series differed significantly from the original film which was about a town plagued by a giant spider. Co-creator Stan Winston described the film's plot as being about, \"a young man whose attempt to become a Spider-Man type superhero goes disastrously wrong, leaving him with a Jekyll-and-Hyde type personality disorder\". Winston also stated that he planned to release a series of action figures based on the first five characters in the series including one based on the \"Quentin Arachnid\",[1]","produced_by":"Lou Arkoff Samuel Z. Arkoff","starring":"Dan Aykroyd Amelia Heinle Devon Gummersall Christopher Cousins Mario Roccuzzo John Cho Theresa Russell","running_time":"90 minutes","music_by":"David Reynolds","Release":"The film premiered on Cinemax television on October 7, 2001 making it the first in the series.[1] 2 years later Sony Pictures Entertainment released the film on DVD on July 6, 2004.[4]"}