{"based_on":"novel by Ross Macdonald","Cast":"The Textones (Carla Olson, Joe Read, George Callins, Phil Seymour and Tom Jr Morgan) appear in the film performing their song You Can Run as produced by Ry Cooder.","country":"United States","distributed_by":"Paramount Pictures","Plot":"Returning to the small Florida town where he grew up, Billy Turner (Judd Nelson) learns that his father has been killed. With little help from the police, Billy will take matters into his own hands and go up against a ruthless local mob in a desperate search to find the killer.","language":"English","Release and reception":"Highly anticipated at the time by Brat Pack fans, Blue City was considered a disappointment by many and is best remembered today mainly due to its very poor reception by critics upon release.[6][7] Judd Nelson's performance was particularly criticised.[8]It was nominated for 5 Golden Raspberry Awards in the 7th Golden Raspberry Awards, but won None: Worst Actor (Nelson) (lost to Prince in Under the Cherry Moon) Worst Actress (Sheedy) (lost to Madonna in Shanghai Surprise) Worst Supporting Actor (Scott Wilson) (lost to Jerome Benton in Under the Cherry Moon) Worst Director (lost to Prince for Under the Cherry Moon) Worst Picture (lost in a tie to Howard the Duck and Under the Cherry Moon).[9]The film earned $2.7 million in its first weekend and was a box office disappoinment.[8]Ally Sheedy later said she \"didn't particularly like\" the film:Michelle Manning and I had been close friends. And she was so excited about the chance to direct that my feeling was it would be really great to work with someone I really liked and help contribute to their first big project. I was very naive, I guess, because I kept hoping it would turn out OK, that somehow all the stuff that was missing would miraculously appear when they edited it all together. I guess that's not the way it works, so I was disappointed.[10]","box_office":"$6,947,787","cinematography":"Steven B. Poster","directed_by":"Michelle Manning","release_dates":"May 2, 1986 (1986-05-02)|||||","Production":"The novel was originally published in 1947.[2] It was compared to the work of Dashiell Hammett, in particular Red Harvest.[3]Walter Hill wrote the script with Lukas Heller; it was originally intended to star a leading man in his mid-30s but by the mid 1980s a number of popular young male actors had emerged, so the script was rewritten to accommodate one of them. (The lead in the original novel was a man in his early 20s, although a war veteran.) Hill handed over directing duties to Michelle Manning. It was Manning's first film as director although she worked with Sheedy and Nelson on The Breakfast Club as a producer.[4]\"I don't think I'll become Samantha Peckinpah,\" said Manning, \"but I don't think as a woman that I should have to make a movie with girls in locker rooms putting on make up.\"[4]Filming started in February 1985.[4] Preview audiences disliked the movie's ending so it was reshot.[5]The motorcycle used is apparently the same 1978/9 750cc Triumph Bonneville T140E used by Richard Gere in An Officer and a Gentleman (1982) in which David Caruso also appeared.[citation needed]","produced_by":"William Hayward Walter Hill","starring":"Judd Nelson|Ally Sheedy|","running_time":"83 minutes","blue_city":"Theatrical release poster","music_by":"Ry Cooder, the Textones","edited_by":"Ross Albert","written_by":"Lukas Heller Walter Hill","budget":"$10 million"}