{"country":"United States","distributed_by":"TriStar Pictures","Plot":"Danny and Bernie are two single men who live in Chicago. When Danny meets Debbie at Mother Malone's (\"Mother's\"), a bar in the Chicago Gold Coast, the two start a relationship from a one-night stand. The film follows the couple for the first year of their relationship: their meeting after a softball game, her moving in with him, mutual friction at Thanksgiving, their breakup on New Year's Eve, his apology and declaration of love on St. Patrick's Day, and their reconciliation at a softball game.","language":"English","Reception":"The film was a box office success, grossing $38,702,310 domestically.[3] It was the 26th highest-grossing movie of 1986,[4] and the 10th highest-grossing R-rated movie of 1986.[5]The movie gained positive reviews.[6][7] Roger Ebert gave the film 4 out of 4 stars, writing in his review that \"About Last Night . . . is one of the rarest of recent American movies, because it deals fearlessly with real people, instead of with special effects.\"[8] The lead performances were especially praised, with Ebert writing \"Lowe and Moore, members of Hollywood's \"Brat Pack,\" are survivors of last summer's awful movie about yuppie singles, St. Elmo's Fire. This is the movie St. Elmo's Fire should have been. Last summer's movie made them look stupid and shallow. About Last Night . . . gives them the best acting opportunities either one has ever had, and they make the most of them.\"[8]The film holds a 61% rating on Rotten Tomatoes based on 28 reviews.","about_last_night":"Theatrical release poster","box_office":"$38,702,310 (domestic)[1]","cinematography":"Andrew Dintenfass","directed_by":"Edward Zwick","Soundtrack":"The film's music soundtrack album was released on EMI Records. The album includes music by Sheena Easton, Michael Henderson, John Oates; as well as Jermaine Jackson, Bob Seger, and John Waite.[9]","release_dates":"July 2, 1986","produced_by":"Jason Brett Stuart Oken Arnold Stiefel (executive) E. Darrell Hallenbeck (associate)","starring":"Rob Lowe|Demi Moore|James Belushi|Elizabeth Perkins|","running_time":"113 min","music_by":"Miles Goodman","edited_by":"Harry Keramidas","written_by":"Tim Kazurinsky Denise DeClue"}