{"bad_santa":"Theatrical release poster","country":"United States","distributed_by":"Dimension Films (North America) Columbia Pictures (Other territories)","Plot":"Willie T. Stokes (Billy Bob Thornton) and his dwarfed assistant Marcus (Tony Cox) are professional thieves. Every year, Willie disguises himself as a department store Santa Claus and Marcus disguises himself as an elf in order for both of them to rob shopping malls blind at night, with Marcus' wife Lois (Lauren Tom) as their getaway driver and accomplice. Marcus takes his duty as an elf extremely seriously, but Willie is a sex addicted alcoholic, and is gradually unable to perform his Santa duties appropriately with children, plus likewise a diminish in his safe-cracking performance, much to Marcus' dismay. When they are hired at the fictional Saguaro Square Mall in Phoenix the following year, the vulgar remarks made by Willie shock the prudish mall manager Bob Chipeska (John Ritter), who brings it to the attention of security chief Gin Slagel (Bernie Mac).At the mall, Willie is visited by Thurman Merman (Brett Kelly), a friendly but exceedingly naive and gullible, overweight boy who thinks Willie is really Santa. Thurman is a constant target of bullying by a teenage gang of skateboarders. At a bar, Willie meets Sue (Lauren Graham), a woman with a Santa Claus fetish, and they begin a sexual relationship. Willie is harassed by a man in the bar, but Thurman intervenes. Willie gives Thurman a ride home, then enters the boy's house where he lives with his senile grandmother (Cloris Leachman). Thurman reveals that his mother died, and his father, Roger, is away \"exploring mountains\" (meaning he is actually in jail for embezzlement) until next year. Willie tricks Thurman into letting him steal from the house safe and steals a BMW owned by Thurman's father.Bob informs Gin that he overheard Willie having sex with a woman in a mall dressing room; Gin starts to investigate. Willie goes to his motel room and sees it being raided, causing him to take advantage of Thurman's naivete and live in his house, much to Thurman's delight. The next day, Marcus gets angry at Willie for taking advantage of Thurman, and states his disapproval of Willie's sex addiction when Willie makes a rude remark about Thurman's grandmother.Gin's investigation of Willie includes visiting Thurman's imprisoned father, Roger, who indirectly reveals/learns that Willie is staying with Thurman illegally. He confronts Willie and Marcus at the mall, and takes them to a bar. There, he reveals that he has figured out their plan, blackmailing them for half of the cut to keep silent. Marcus tries to reason with Gin for a smaller cut, but Gin is adamant at half. With Willie and Marcus now in a corner, their partnership begins to falter, which is exacerbated further when Willie shows up to work clearly drunk/hungover and destroys the Santa attraction, much to Marcus' and Gin's shock.Willie attempts to commit suicide by inhaling vehicle exhaust fumes. He gives Thurman a letter to give to the police, confessing all his misdeeds and information about a heist that will take place in the mall on Christmas Eve. Willie notices Thurman's black eye, which persuades him to make an example of the skateboarding bullies. The next day, he confronts and beats up the gang's leader, frightening the other members into stopping their acts towards Thurman. A renewed sense of purpose for Willie has him attempt to train Thurman in boxing and self-defense by using Marcus as a test bully; the training doesn't go so well, with all three getting hurt in their crotches.Enraged at Gin for blackmailing him, Marcus and Lois set up a trap for Gin, feigning needing a jump start for their vehicle from Gin's. Lois hits Gin with the car, then Marcus kills him via electrocution.As Christmas draws closer, Willie and Thurman set up for the holiday, with help from Sue. On Christmas Eve, when the heist is almost complete, Willie goes to get Thurman a pink stuffed elephant that he had wanted for Christmas. Just as he gets the elephant, Marcus reveals to Willie that he intends to kill him, fed up with his increasing carelessness year after year. Lois tells him to hurry up and kill Willie so they can get away with the money and merchandise. But just as Marcus is about to shoot Willie, the police swarm the trio, tipped off by the letter Willie gave to Thurman. When Marcus opens fire, the police shoot at him and Willie flees. Determined to give Thurman his present, he leads the police on a chase to Thurman's house, ignoring orders to freeze. He is repeatedly shot on Thurman's porch, but survives.The epilogue is told through a letter from Willie, who is in a hospital recovering. He expresses his gratitude for Thurman in giving the letter to the police and his name was cleared of unarmed robbery adding that he (Willie) will be working for the police as a sensitivity counselor. The shooting of an unarmed Santa embarrassed the police (which Willie referred to as \"more fucked up than Rodney King\"), and Sue is granted guardianship over Thurman and his house until Thurman's father is released. Willie also explains that Marcus (identified as \"Santa's Little Helper\") and Lois are doing time behind bars for their actions, while expressing hope that Roger is wise to avoid the two. Willie ends the letter by telling Thurman that he should be let out of the hospital soon and for him (Thurman) to be ready for his return. When the lead skateboard bully harasses Thurman again, Thurman finally stands up to him by kicking him hard in the crotch and riding his bike away while flipping him off.","language":"English","Reception":"An editorial in The Washington Times likened the movie to an \"evil twin\" of Miracle on 34th Street and chided The Walt Disney Company for allowing such a beloved figure as Santa Claus to be trashed by Miramax, then a Disney subsidiary.[8]On Rotten Tomatoes, the film has a 78% \"Certified Fresh\" rating, based on 213 reviews, with an average rating of 6.7/10. The site's critical consensus reads, \"A gloriously rude and gleefully offensive black comedy, Bad Santa isn't for everyone, but grinches will find it uproariously funny\".[9] On Metacritic, the film has a score of 70 out of 100, based on 38 critics, indicating \"generally favorable reviews\".[10]Roger Ebert of the Chicago Sun-Times gave the film 3½ stars out of four.[11]Billy Bob Thornton was nominated for a Golden Globe Award for Best Actor – Motion Picture Musical or Comedy and a Satellite Award for Best Actor – Motion Picture, but lost both awards to Bill Murray of Lost in Translation.The film grossed over $60 million domestically and more than $76 million in total worldwide.[1]","box_office":"$76.5 million[1]","cinematography":"Jamie Anderson","production_company":"Tryptich Pictures","directed_by":"Terry Zwigoff","Home media":"In the U.S, a theatrical version, an unrated version, a director's cut and a Blu-ray Disc version (which includes unrated and director's cut) have all been released. According to dvdtown.com, the special features for the theatrical cut of the film included: a behind-the-scenes special, outtakes, and deleted scenes. The unrated edition was released June 22, 2004 and had all of the above plus a 'Badder Santa' gag reel and over seven minutes of unseen footage. The director's cut was released October 10, 2006 and contained the new version of the film (as Zwigoff originally intended it). It also had a new commentary (in addition to the rest of the features: outtakes, deleted/alternate scenes, and the behind-the-scenes feature). The Blu-ray Disc version released November 20, 2007 contained the unrated version and the director's cut of the movie. Among its special features were director's commentary, an interview with Zwigoff and editor Robert Hoffmann, along with other features ported over from the previous unrated version's release in addition to a showcase feature.","release_dates":"November 21, 2003 (2003-11-21)|||||","Production":"Bad Santa, Zwigoff's fourth film, was his most mainstream, following the limited releases of Crumb and Ghost World. The original screenplay was written by Glenn Ficarra and John Requa. Prior to filming, Ethan and Joel Coen and Zwigoff did rewrites on the script,[3] although by WGA rules, they were uncredited.Jack Nicholson and Bill Murray[4][5] were both interested in playing the role of Willie, but were already filming Something's Gotta Give and Lost in Translation, respectively.[citation needed]In an interview in 2012, Zwigoff revealed the difficulty of the films production, explaining how he and the writers tried to get the tone of the script right and also revealing creative differences between himself, the Coen Brothers and Bob and Harvey Weinstein. The Coen Brothers didn't agree with the casting of Tony Cox as Marcus, and the Weinsteins filmed additional sequences with another director without Zwigoff's approval, in order to make the film more mainstream.[6]The following pieces of music were used in the film:[7]","produced_by":"John Cameron Sarah Aubrey Bob Weinstein","starring":"Billy Bob Thornton Tony Cox Lauren Graham Brett Kelly Lauren Tom John Ritter Bernie Mac","running_time":"95 minutes","Sequel":"On October 29, 2015, it was announced that Billy Bob Thornton would return for Bad Santa 2, and that filming would begin in Montreal in January 2016 for a scheduled release of Christmas 2016.[12] On November 3, 2015, it was announced that Mean Girls director Mark Waters would direct the film.[13] On November 19, 2015, it was announced that Kathy Bates would join the cast as Willie's mother, and that Brett Kelly and Tony Cox would reprise their roles from the first film.[14] On December 21, 2015, it was announced that Bad Santa 2 would be released on November 23, 2016.[15] On January 6, 2016, Christina Hendricks joined the cast.[16]","music_by":"David Kitay","edited_by":"Robert Hoffman","written_by":"Glenn Ficarra John Requa","budget":"$23 million[1]"}