{"distributed_by":"Lions Gate Entertainment","confidence":"Confidence film poster","Plot":"A group of grifters rip off their latest mark and celebrate, while de facto leader of the group Jake Vig (Edward Burns) explains the art of the con. When one of the four (Louis Lombardi) is found shot to death, the other three learn that the latest money they stole actually belonged to a local L.A. crime lord called The King (Dustin Hoffman). Jake proposes that the grifters work for the King and steal money from Morgan Price (Robert Forster), a rival who owns a bank.Jake enlists the aid of his remaining partners, Gordo (Paul Giamatti) and Miles (Brian Van Holt), and also convinces an independent con artist named Lily (Rachel Weisz) to round out their foursome. The King, a ruthless killer who suffers from ADHD, demands that one of his men, Lupus (Franky G), also come along.The con involves bribing a bank vice president into wiring money offshore. The plan hits a snag when Special Agent Gunther Butan (Andy García) shows up in L.A., looking to finally bust Jake, whom he has followed for years. Butan forces corrupt LAPD detectives Omar Manzano (Luis Guzmán) and Lloyd Whitworth (Donal Logue) to switch their allegiance from Jake to him.After hearing about Butan's arrival, a nervous Jake pulls the plug on the whole con. He screams at Lily, making her walk out. Lupus gets Jake to reconsider nixing the con, hinting that The King will torture and kill the grifters if the plan falls short. The con is back on, though now without Lilly's help.The bribed bank VP wires the money to Gordo in Belize. Gordo brings it to Ontario Airport, where he is met by both Butan and The King's men, both sides after the $5 million in a duffle bag. Butan arrests The King and confiscates the money.Gordo disappears. Lupus, thinking the King has the money, reveals he was the one who killed Jake's grifter friend. Lupus holds Jake at gunpoint, but is shot by Travis (Morris Chestnut), a henchman for Morgan Price. It turns out that when Lily walked out, she went straight to Price himself and revealed the entire con, which was taking place that minute. Price told Travis to locate Jake and find out exactly how the con was engineered, to stop such a thing from ever happening again.Travis takes Jake to an abandoned lot and forces him to explain the entire story. A furious Lily takes out a gun and kills Jake. Travis demands that he and Lily both disappear immediately. Minutes later, Butan arrives in a car and Jake sits up from a pool of blood, unharmed.The final parts of the con are revealed. Lily's \"quitting\" was faked—a set-up to confuse Lupus. Butan is actually an old confidant of Jake's. He managed to \"confiscate\" the money and arrest The King at the same time. Butan has the money and it's split five ways. Jake was wearing squibs to fake his own death in the lot.In the end, everyone was in on everything except for The King and Lupus (the first marks), Price and Travis (the second, bigger marks), and the two corrupt LAPD detectives, who have been arrested. The four grifters reunite and celebrate.","language":"English","Reception":"Confidence received good reviews from critics, as the film holds a 70% rating on Rotten Tomatoes.Roger Ebert of the Chicago Sun-Times said, \"Confidence is a flawless exercise about con games, and that is precisely its failing: It is an exercise. It fails to make us care, even a little, about the characters and what happens to them. There is nothing at stake. The screenplay gives away the game by having the entire story narrated in flashback by the hero, who treats it not as an adventure but as a series of devious deceptions which he can patiently explain to the man holding a gun on him--and to us. At the end, we can see how smart he is and how everybody was fooled, but we don't care. ... That's not to say the movie, directed by James Foley, is badly made. It's great-looking, with its film noir reds and greens and blues, its neon Bud Ice signs, its shadows and mean streets, its sleazy strip clubs and its use of wipes and swish-pans (sideways, up, down, sometimes two at a time). You know this is a crime movie, which is nice to be reminded of, except that every reminder also tells us it's only a movie, so that there is no possibility that we can commit to the characters, worry about them, want them to succeed or fail.\" [1]","box_office":"US $23,014,206","Remake":"The film was remade in Bollywood titled Ek Khiladi Ek Haseena.","cinematography":"Juan Ruiz Anchía","directed_by":"James Foley","release_dates":"April 25, 2003 (2003-04-25)|||||","Production":"The movie was filmed on location at the Deep Nightclub in Hollywood, in Los Angeles and in Ontario, California.","produced_by":"Scott Bernstein Michael Burns Marc Butan","starring":"Edward Burns Rachel Weisz Andy García Paul Giamatti Luis Guzmán Donal Logue Brian Van Holt Robert Forster Franky G Leland Orser with Morris Chestnut and Dustin Hoffman","running_time":"97 min.","music_by":"Christophe Beck Dave Crawford","edited_by":"Stuart Levy","written_by":"Doug Jung","budget":"US$15 million"}