{"country":"United States","distributed_by":"Orion Pictures Metro-Goldwyn-Mayer (video and DVD)","Plot":"Jesse Lujack (Richard Gere) is a cocky, nihilistic drifter in Las Vegas, obsessed with Marvel Silver Surfer comic books, the rock and roll music of Jerry Lee Lewis and Monica Poiccard (Valérie Kaprisky), a UCLA architecture undergraduate whom he knows only from a weekend fling in Vegas. As the film opens late at night, he steals a Porsche, intending to drive to Los Angeles. As he speeds down the highway and looks through the owner's possessions, he discovers a handgun in the vehicle's glovebox. Seeing his reckless driving, a policeman gives chase and Jesse is forced off the road and becomes stuck. When the policeman orders him to step away from the car, Lujack impulsively grabs the gun and (apparently accidentally) shoots the officer. Fleeing to Los Angeles, Lujack finds his picture splashed all over the newspaper and TV news as the \"cop killer.\"On the run, under the alias of Jack Burns, he breaks into Monica's apartment and waits for her to return home. She discovers him naked in her bed. She initially declines his advances but later has sex with him in her shower. He then moves in with her. She is captivated by this reckless American and resumes her affair with him. However, she is a star student with big plans and Jesse is jealous of the powerful, successful men in her life.After Jesse's photograph appears in the newspaper, he is recognized on the street right after dropping Monica off at a groundbreaking ceremony downtown. The police find her and question her on the street. She seems increasingly ambivalent about Jesse, repelled by his instability but drawn to his sense of risk and danger; she does not turn him in. When the police start following her right before Jesse comes back to pick her up, she impulsively accepts his offer to flee to Mexico together.On the way to Mexico, Monica finds that her picture is on the front page of the national newspaper alongside Jesse's. Realizing the impossibility of her romantic fantasy, she phones the police, but then returns to tell him she did so and plead with him. The police corner them on the street, and he sings Jerry Lee Lewis' \"Breathless\" to her before grabbing a gun from the ground at his feet as she runs towards him. The film ends in a freeze-frame of Jesse turning to face the police with the gun.","language":"English","Reception":"The film grossed $19,910,002 in the United States.[1] It received mixed reviews; most critics questioned the wisdom of casting Valerie Kaprisky, a French UCLA student who had had very limited acting experience.The film has since gained minor cult status. American director Quentin Tarantino cited it as one of the \"coolest\" movies, commenting: \"Here's a movie that indulges completely all my obsessions - comic books, rockabilly music and movies.\"[2] The Silver Surfer poster in Freddy Newandyke's apartment seen in Reservoir Dogs is a homage to Jesse's Silver Surfer-obsession.[3]","box_office":"$19,910,002","cinematography":"Richard H. Kline","directed_by":"Jim McBride","breathless":"Theatrical release poster","Soundtrack":"There is no official soundtrack released. Along with the incidental music for the movie, provided by Jack Nitzsche, these are the songs that are featured in the film:","release_dates":"May 13, 1983","produced_by":"Martin Erlichman","starring":"Richard Gere|Valérie Kaprisky|","running_time":"97 min.","music_by":"Jack Nitzsche","edited_by":"Robert Estrin Rachel Igel","written_by":"Original screenplay François Truffaut Jean-Luc Godard Screenplay L. M. Kit Carson Jim McBride","budget":"$7 million"}