{"country":"UK / USA","distributed_by":"The Samuel Goldwyn Company","Plot":"The film begins with a small IRA team, including Martin Fallon (Mickey Rourke) and Liam Docherty (Liam Neeson), watching as two British Army Land Rovers approach the roadside bomb they have set for them. At the last minute, a school bus overtakes the army vehicles and detonates the bomb as it passes, killing the children. After most of the team escape the scene pursued by the soldiers, Fallon travels to London in a bid to escape the past. In London, he is approached by a contact who asks him to take on one last job on behalf of local gangster Jack Meehan (Alan Bates) and his brother Billy Meehan (Christopher Fulford). They offer Fallon money, a passport and passage to the US if he kills a rival gangster. Initially reluctant, he nonetheless takes on the job. However, as he is carrying out the hit in a graveyard, he is seen and confronted by the local Catholic priest, Father Michael Da Costa (Bob Hoskins). The confrontation is watched from a distance by Billy Meehan, who tells his brother there is a witness to the killing.Fallon visits the church and confesses to the priest in a bid to ensure his silence; he also meets and finds himself becoming attracted to the priest's blind niece Anna (Sammi Davis), who lives at the church along with her uncle. Meehan, however, insists that Fallon must kill the priest too and tells Fallon he will not be paid until the loose end is tied up. Fallon now finds himself targeted by both the Meehans and the IRA, who see him as a security risk following his disappearance, and send Docherty and another member, Siobhan Donovan (Alison Doody), to London to persuade him to return to Ireland. Billy Meehan eventually decides to take matters in his own hands and goes to the church looking for Fallon, but Anna kills him in a struggle when he attacks her after finding her alone in the church house. Fallon meanwhile manages to outwit a group of Meehan's men who had been assigned to kill him after tricking him aboard a boat he was assured would be taking him to the US. Returning to the church, Fallon finds Jack Meehan with a bomb he intends to use to kill the priest and his niece but which will be blamed on Fallon and his IRA connections. After a struggle, Anna and Michael escape, but the bomb goes off killing Meehan and leaving Fallon fatally injured. In his dying moments, Fallon confesses his past to the priest, who grants him absolution. Fallon dies in peace.","language":"English","Reception":"A Prayer for the Dying has a mixed reaction. Some liked Rourke's performance. Others put fault in his Irish accent. Other critics thought Bob Hoskins was miscast in his portrayal of the priest.Both Mike Hodges and Mickey Rourke have disowned the film as it wasn't the finished film they intended to make.On Film 87, Hodges tried to take his name off as he felt Sam Goldwyn studio had drastically altered the film. According to film producer Peter Snell only 3 minutes had been cut out.","box_office":"$1,432,687","cinematography":"Michael Garfath","directed_by":"Mike Hodges","a_prayer_for_the_dying":"Theatrical release poster","release_dates":"11 September 1987","Production":"Originally Franc Roddam was going direct A Prayer for the Dying but left during pre-production due to creative differences.Mickey Rourke was paid £1 million to star in the film. This was part of the play or pay deal.Originally Inseminoid music composer John Scott had composed the film but was fired due to creative differences from the producers and they hired Bill Conti to finish the score.Tony Earnshaw recalls in his book \"Made in Yorkshire\" that another film version of the novel was planned in the 1970s to film in Leeds (the city where the original book was set) starring Lee Marvin and directed and written by Edward Dmytryk. Photos of the two men looking at Leeds locations for the film are shown in Earnshaw's book.As part of his research for his character Mickey Rourke met some IRA members.","produced_by":"Samuel Goldwyn Jr.","starring":"Mickey Rourke|Bob Hoskins|Alan Bates|","running_time":"107 min","Director's Cut":"There were rumours that there was going to be a director's cut of the film as Mike Hodges had a critical hit film Croupier. That release was going to be by MGM. Both region 1 and 2 have the original theatrical release.[citation needed]","music_by":"Bill Conti","External links":"Film 87 Mike Hodges express his dislike on the Studio cut. https://m.youtube.com/watch?v=1QVvecybFO4","edited_by":"Peter Boyle","written_by":"Jack Higgins Edmund Ward Martin Lynch","budget":"$6 million"}