{"deep_blue_sea":"Theatrical release poster","country":"United States Australia","distributed_by":"Warner Bros. Roadshow Entertainment Universal Studios Working Title (Australia & New Zealand)[2]","Plot":"At Aquatica, a remote former submarine refueling facility converted into a laboratory, a team of scientists searches for a cure for Alzheimer's disease. Fluids from the brain tissue of three Mako sharks are harvested. Unknown to the other scientists, Drs. Susan McAlester and Jim Whitlock have violated the code of ethics and has genetically engineered the sharks to increase their brain size; this has the side effect of making the sharks smarter and more dangerous.After one of the sharks escapes and attacks a boat full of teenagers, Aquatica's financial backers send corporate executive Russell Franklin to investigate the facility. To prove the research is working, the team removes fluid from the brain tissue of the largest shark. While examining it, Jim is attacked by the shark and his arm is bitten off. Brenda Kerns, the tower's operator, calls a helicopter to evacuate Jim, but as he is being lifted the cable jams and Jim falls into the shark pen. The shark grabs the gurney and pulls the chopper into the tower, killing Brenda and the pilots. As the others try to figure out what made the explosion, one of the sharks uses Jim's body as a battering ram to smash an underwater window, flooding the facility and freeing the other sharks. Susan confesses to the others that she and Jim genetically altered the sharks.Susan, Russell, Carter Blake, Janice Higgins and Tom Scoggins make their way to the top of the center. While delivering a dramatic speech emphasizing the need for group unity, Russell is dragged into the water by the largest shark and killed. While climbing up the industrial elevator, a ladder falls and gets wedged between the walls of the shaft, leaving them dangling over the water and the second shark. Janice loses her grip and falls; despite Carter's attempts to save her, the shark kills her. The cook, Sherman \"Preacher\" Dudley, is attacked by the first shark, but kills it by throwing a lighter into the kitchen's oven that had been turned on. He then encounters Carter, Tom and Susan.Traumatized by Janice and Russell's deaths, Tom goes with Carter to the flooded lab to activate controls to open a door to the surface. The largest shark attacks them, killing Tom. Susan heads into a room to collect her research material. The second shark follows, but she manages to electrocute it with a power cable, though her research is destroyed. Carter, Susan and Preacher go to the top of the research center through a decompression chamber and swim to the surface. Preacher is caught by the third shark and dragged through the water, but swims to safety after stabbing the shark in the eye with his crucifix, causing it to release him.Carter realizes that the third shark is trying to escape to the open sea, and that the sharks made them flood the facility so they could escape through the weaker mesh fences at the surface. In an effort to distract the final shark, Susan cuts herself and dives into the water. When she attempts to climb out, the ladder breaks and she is killed by the shark. Carter dives in to try to save her but is too late. Grabbing hold of the shark's fin, he is pulled through the water. Preacher grabs hold of the harpoon and shoots the shark through its dorsal fin, but the spear also goes through Carter's thigh. As the shark breaks through the fence, Carter is attached to the shark by the harpoon. He tells Preacher to connect the trailing wire to a car battery, sending an electric current through the wire and to an explosive charge in the harpoon, killing the shark. Carter managed to free himself in time, and he swims to the wreckage of the facility, joining Preacher in time to see the workers' boat en-route on the horizon.","language":"English","Reception":"The film received mixed reviews from critics. Rotten Tomatoes gave it a 56% rating with 51 positive reviews out of 91 reviews. Empire magazine gave the film three out of five stars, saying \"It was never going to crash any parties come Oscar night, or usurp previous nature-fights-back epics (Jurassic et al), but Deep Blue Sea remains defiant. It's about giant sharks eating people. And that's exactly what you get.\"[7] Roger Ebert went further, saying of the film \"In a genre where a lot of movies are retreads of the predictable, 'Deep Blue Sea' keeps you guessing.\"[8]Writing in People, horror novelist Stephen King described his recovery from a near-fatal accident: \"My first trip after being smacked by a van and almost killed was to the movies (Deep Blue Sea, as a matter of fact; I went in my wheelchair and loved every minute of it).\"[9]The film opened on July 28, 1999 and grossed $19,107,643 ($25,164,533 including Thursday screenings/previews) in its opening weekend and went on to earn $73,648,142 domestically and $164,648,142 worldwide.[10] The film was released on DVD October 26, 1999 and was ranked #1 release for the week ending October 31, 1999 and remained in the DVD rental top 10 for eight weeks.[11]","Potential sequel":"In 2008, it was stated that Warner Premiere was planning a sequel to Deep Blue Sea, according to a studio source. It was also announced that the film would be released direct-to-Video, hitting shelves in 2009. Renny Harlin confirmed no involvement. Since then, no news has been given on the sequel.[23]","box_office":"$164.6 million[3]","cinematography":"Stephen Windon","production_company":"Village Roadshow Pictures","directed_by":"Renny Harlin","Soundtrack":"A soundtrack was released on June 27, 1999 by Warner Bros. Records featuring rap and R&B music. The soundtrack made it to #55 on the Top R&B/Hip-Hop Albums. Composer Trevor Rabin scored the original music for the film. The released soundtrack contains 10 tracks.[12]","release_dates":"July 28, 1999 (1999-07-28)|||||","Production":"According to an interview in The Los Angeles Times, Deep Blue Sea was originally inspired by Australian screenwriter Duncan Kennedy's witnessing firsthand \"the horrific effects of a shark attack when a victim washed up on a beach near his home.\" This brought on a recurring nightmare of \"being in a passageway with sharks that could read his mind.\" The interview mentions that Kennedy \"purged those dreams by sitting down and writing a screenplay that eventually evolved into (the) Warner Bros. thriller, \"Deep Blue Sea.\"\" Kennedy acknowledged that \"whenever anyone mentions a shark movie, they naturally think of Steven Spielberg. The problem with approaching a shark movie is how do you do it without repeating Jaws?\"[4]Renny Harlin describes the production on the film's commentary.[5] The film was shot entirely in Mexico. The sets used for the interiors of the facility were built so that they could be submerged in a water-tank to create the illusion of the facility sinking practically. However, for windows, separate water-tanks with lights shining through them were used.The film made an extensive use of digital doubles for actors being eaten by sharks.[6] Depending on the scenes, the sharks were either animatronic (when interacting with actors) or computer generated (when in water). As an added homage to Jaws, the license plate pulled from the shark's teeth by Carter is the same plate found in the tiger shark carcass from the 1975 Steven Spielberg film.Samuel Jackson was initially offered the role eventually played by LL Cool J. Jackson's management didn't like the idea of him playing a chef, so Harlin created the role of Russell Franklin for him.[citation needed]Speaking with The Los Angeles Times, screenwriter Kennedy noted that in Jaws, the shark was 25 feet long, so Harlin had to do Spielberg one better. \"He increased [our shark] to 26 feet,\" Kennedy said.[4]","produced_by":"Akiva Goldsman Robert Kosberg Tony Ludwig Alan Riche Rebecca Spikings[1]","starring":"Saffron Burrows Thomas Jane LL Cool J Jacqueline McKenzie Michael Rapaport Stellan Skarsgård Aida Turturro Samuel L. Jackson","running_time":"105 minutes","music_by":"Trevor Rabin","edited_by":"Derek Brechin Dallas Puett Frank J. Urioste","written_by":"Duncan Kennedy Donna Powers Wayne Powers","budget":"$60 million[3]"}