{"country":"United States","distributed_by":"Buena Vista Pictures","screenplay_by":"Steve Bencich|Ron J. Friedman|Ron Anderson|","story_by":"Mark Dindal|Mark Kennedy|","Plot":"In the small town of Oakey Oaks, Chicken Little (Zach Braff) causes widespread panic and mayhem when he rings the alarm bell, claiming the sky is falling. He is humiliated in front of his father, Buck Cluck (Garry Marshall) and the entire town when, after telling everyone a piece of the sky 'shaped like a stop sign' had hit him on the head, he is unable to find it. All the residents assume an acorn must have fallen on him, and Chicken Little becomes a laughing stock.One year later, Little is still being ridiculed for the incident and is bullied at school by Foxy Loxy (Amy Sedaris) and her band of cronies. His friends Abby Mallard (Joan Cusack), Runt of the Litter (Steve Zahn) and Fish Out of Water (Dan Molina) advise him to talk about his feelings with his father, but Little is more concerned with restoring his reputation outright.Following a bust-up with Foxy, his father is called in, and Little overhears the school principal stating that Buck had been the school baseball star in his youth. Determined to rekindle his relationship with his father, Chicken Little signs onto the baseball team. In the final inning of the big Oakey Oaks pennant game, with all the other players injured, he is called up to bat, and manages to hit an inside-the-park home run. Despite some confusion, the umpire ultimately declares the game won; Little is hailed as a hero for winning the pennant.Later that evening, Chicken Little prepares to go to a victory party being thrown for him by Abby, Runt and Fish, but another 'piece of the sky' identical to the one he had been hit by the previous year falls through his bedroom window. Not wanting to bring the matter up with him again, Little hides the sky piece from his father and examines it more closely, discovering it to be a bizarre panel-like device designed to blend in with its surroundings. Realising that this is why he was unable to find it the first time, Little calls his friends over to help figure out what the device is.While playing around with the panel, Fish presses a button on its underside, and it carries him out of Little's bedroom and into the sky, where it appears to fit into a gap. Disturbed by this, Little, Abby and Runt give chase, and follow Fish to the ballfield, where a series of similar panels appear in the sky; revealed to be part of an invisible UFO's camouflage. The three sneak aboard the ship and retrieve Fish, but Runt locates a map of the solar system that seems to indicate Earth is being targeted for an alien invasion. Thinking that the UFO is being used to sneak aliens onto the planet undetected by disguising itself as the sky, the group flees to warn the town, inadvertently releasing a small orange creature from the ship in the process, which follows them.Two metallic aliens give chase, and Chicken Little rings the alarm bell once again to alert the townsfolk. The sound of the bell causes the aliens to flee, leaving the orange creature behind in their haste, and the citizens fail to reach the ballfield in time to see the UFO taking off. As such, no-one believes Little's claims that aliens are planning to invade, thinking it a repeat of the acorn incident, and he and his father are ridiculed once again. In space, the two aliens send out a distress signal.The following morning, Chicken Little's friends attempt to console him, but he wishes to be left alone in dismay. Soon after, the orange creature, having followed Little home, approaches them and identifies itself as Kirby, the child of the two aliens. The group look up to see the sky developing huge cracks and fissures, and a vast fleet of spaceships descends through the camouflage. Kirby tells them that his parents, usually peaceful people, think he has been kidnapped and plan to vaporise Earth in retaliation.Chicken Little, with the evidence he was telling the truth raging above them, tells Buck off for not believing him, and heads towards the chaos with Kirby in tow. Heartbroken, his father follows, and the two finally reconcile in the safety of a movie theatre. With his father's help, Little evades the rampaging aliens, who have already zapped Foxy and the mayor out of existence, and delivers Kirby to his parent's ship atop the town hall, urging them to stop the invasion.Kirby's parents beam the two aboard the ship and threaten to kill them for the 'kidnapping', but Kirby explains that they had helped him, and the aliens release them, restoring Oakey Oaks and its citizens to normal. The father, Melvin (Fred Willard) and the mother, Tina (Catherine O'Hara) apologise for the misunderstanding, explaining that they visit Earth once a year to pick acorns, renowned in Oakey Oaks as 'the best in the universe', and never planned to invade at all, simply wanting to keep hidden to avoid causing panic (the map Runt found was a chart showing that acorns could only be found on Earth, not an attack plan). Tina reveals that one of the panels on their ship's underside is loose; this is what had hit Chicken Little on both occasions. The townsfolk thus realise that Little was right all along as the aliens depart with Kirby.The film ends with all the characters watching a parodic Hollywood version of the events, in which Chicken Little is portrayed as a comically macho action hero named Ace (Adam West). Chicken Little, his reputation restored, celebrates with his father and friends.","language":"English","Reception":"In its opening weekend, Chicken Little debuted at #1, being the first Disney animated film to do so since Dinosaur, taking $40 million and tying with The Lion King as the largest opener for a Disney animated film.[31] It also managed to claim #1 again in its second week of release, earning $31.7 million, beating Sony's sci-fi family film, Zathura.[32] The film grossed $135,386,665 in North America, and $179,046,172 in other countries, for a worldwide total of $314,432,837.[1]This reversed the slump that the company had been facing since 2000, during which time it released several flops, most notably Treasure Planet and Home on the Range. However, these films received better critical reception.[33][34]Critical response aggregator Rotten Tomatoes reported that 36% of critics gave positive reviews based on 159 reviews with an average score of 5.5/10. The critical consensus states \"In its first non–Pixar CGI venture, Disney expends more effort in the technical presentation, than in crafting an original storyline.\"[35] Another review aggretator, Metacritic gave the film an average score of 48 based on 32 critics, indicating \"mixed or average reviews\".[36]James Berardinelli, writing his review for ReelViews, gave the film two-and-a-half stars out of four lambasting that \"It is bogged down by many of the problems that have plagued Disney's recent traditional animated features: anonymous voice work, poor plot structure, and the mistaken belief that the Disney brand will elevate anything to a \"must see\" level for viewers starved for family friendly fare.\"[37] On the syndicated television program Ebert & Roeper, critics Richard Roeper and Roger Ebert gave the film \"Two Thumbs Down\" with the former saying \"I don't care whether the film is 2-D, 3-D, CGI, or hand-drawn, it all goes back to the story.\"[38]In his print review featured in the Chicago Sun-Times, Roger Ebert also targeted the film's storytelling writing \"As a general rule, if a movie is not about baseball or space aliens, and you have to use them, anyway, you should have started with a better premise.\" Ebert concluded his review with \"The movie did make me smile. It didn't make me laugh, and it didn't involve my emotions, or the higher regions of my intellect, for that matter. It's a perfectly acceptable feature cartoon for kids up to a certain age, but it doesn't have the universal appeal of some of the best recent animation.\"[39]Writing in The New York Times, film critic A.O. Scott stated the film is \"a hectic, uninspired pastiche of catchphrases and clichés, with very little wit, inspiration or originality to bring its frantically moving images to genuine life.\"[40] Entertainment Weekly film reviewer Lisa Schwarzbaum, who graded the film a C, wrote that the \"banality of the acorns dropped in this particular endeavor, another in a new breed of mass-market comedy that substitutes self-reference for original wit and pop songs for emotional content.\"[41]However, Ty Burr of The Boston Globe gave the film a positive review saying the film was \"shiny and peppy, with some solid laughs and dandy vocal performances\".[42] The Hollywood Reporter film critic Michael Rechtshaffen opined that \"While some half-hatched plotting prevents it from approaching the sublime levels of a Toy Story or The Incredibles, the picture zips along quite agreeably with a zany energy and vividly rendered, terrifically voiced, madcap characters.[43]Angel Cohn of TV Guide gave the film 3 stars alluding the film that would \"delight younger children with its bright colors and constant chaos, while adults are likely to be charmed by the witty banter, subtle one liners, and a sweet father son relationship.\"[44] Peter Rainer, writing in The Christian Science Monitor, graded the film with a A- applauding that the \"visuals are irrepressibly witty and so is the script, which morphs from the classic fable into a spoof on War of the Worlds. I prefer this version to Spielberg's.\"[45]","box_office":"$314.4 million[1]","production_company":"Walt Disney Pictures Walt Disney Feature Animation","directed_by":"Mark Dindal","Video games":"Chicken Little spawned two video games. The first, Chicken Little, which is the same name as the film, is an action-adventure video game released for Xbox on October 18, 2005 by Buena Vista Games. Two days later it was released for PlayStation 2, Nintendo GameCube and Game Boy Advance (October 20, 2005), and later Microsoft Windows (November 2, 2005). Chicken Little for Game Boy Advance was developed by A2M, while BVG's recently acquired development studio, Avalanche Software, developed the game for the consoles.[47]The second video game, Disney's Chicken Little: Ace in Action, is a multi-platform video game, for the Wii, Nintendo DS, Xbox, Nintendo GameCube, and PlayStation 2 inspired by the \"superhero movie within the movie\" finale of the film. It features Ace, the superhero alter ego of Chicken Little, and the Hollywood versions of his misfit band of friends: Runt, Abby and Fish-Out-of-Water.Chicken Little also appears as a summon gem in the video game, Kingdom Hearts II.[48]","Soundtrack":"The soundtrack album contains original score composed and produced by John Debney, with a music by a wide range of artists, some musical veterans, such as Patti LaBelle and Diana Ross, as well as others.[46] Uniquely for a Disney animated film, several of the songs are covers of classic popular songs, such as Elton John and Kiki Dee's \"Don't Go Breaking My Heart\", Carole King's \"It's Too Late\", and the Spice Girls' signature hit \"Wannabe\". The soundtrack was released on November 1, 2005, by Walt Disney Records.[46]","release_dates":"October 3, 2005 (2005-10-03) (Los Angeles premiere)|November 4, 2005 (2005-11-04) (United States)||||","Production":"In September 2001, director Mark Dindal developed the idea for Chicken Little, with its title character envisioned as an overreacting, doom and gloomy female chicken, that went to summer camp to build confidence so she wouldn't overreact, as well as repair her relationship with her dad. At the summer camp, she would uncover a nefarious plot that her camp counselor, who was to be voiced by Penn Jillette, was planning against her hometown.[4] Dindal would later pitch his idea to Michael Eisner who suggested it would be better change Chicken Little into a male because as Dindal recalled, \"if you're a boy and you're short, you get picked on.\"[5]In January 2003, when David Stainton became Disney's new president of Walt Disney Feature Animation, he decided the story needed a different approach, and told the director the script had to be revised, and during the next three months, it was rewritten into a tale of a boy, trying to save his town from space aliens.[6]During the rewriting process, Dindal, along with three credited writers and nine others, threw out twenty-five scenes to improve the character development and add more emotional resonance with the parent-child relationship. Dindal admitted that \"It took us about 2½ years to pretty much get back to where we started... But in the course of that, the story got stronger, more emotional, and funnier, too.\"[6][7]When originally envisioned as a female character, Holly Hunter provided the voice for the title character for eight months, until it was decided for Chicken Little to be a male.[4] Against forty actors competing for the title role, Zach Braff auditioned where Dindal noted he \"pitched his voice slightly to sound like a junior high kid. Right there, that was really unique — and then he had such great energy.\"[8]In April 2002, Variety reported that Sean Hayes was to voice a character named the Ugly Duckling,[9] but the character was rewritten into a female.[10] Now conceived as Abby Mallard, Hunter, Jamie Lee Curtis, Sarah Jessica Parker, Jodie Foster, Geena Davis, and Madonna were considered, but Joan Cusack won the role for her naturally comedy.[11] In December 2003, it was announced Braff and Cusack were cast, along with other cast members including Steve Zahn, Amy Sedaris, Don Knotts, Katie Finneran, and Garry Marshall.[12]Marshall was asked to provide a voice for Kingdom of the Sun, which was re-conceived into The Emperor's New Groove and directed by Mark Dindal, but was removed from the project for being \"too New York\".[7] When he was approached to provide the voice for Buck Cluck, Marshall claimed \"I said I don't do voices. You want a chicken that talks like me, fine. So they hired me and they didn't fire me, and it was like a closure on animation.\"[13]To visualize this story, Disney selected 50 percent of its new CGI animation team from its 2D animation staff, and placed them through a rigorous eighteen-month training program, which included an introductory to Alias's Maya that would serve as the main 3D animation software used on the project. As some of the animators had worked on Dinosaur (2000), which used live-action backgrounds,[14] the animation team took inspiration for its staging, coloring, and theatrical lighting from Mary Blair's background designs featured in Peter Pan (1953), and Alice in Wonderland (1951).For the aesthetics in the background designs, the background layout artists sparingly use digital matte paintings to render out the naturalistic elements, including the trees and the baseball diamond, but they were retouched using Adobe Photoshop as background cards featured in the film.[15] The lighting department would utilize the \"Lumiere\" software to enhance virtual lighting for the shading form and depth and geometric rendering for the characters' shadows,[16] as well as use real lighting to create cucaloris.[15]For the characters' designs and animation style, Dindal sought to capture the \"roundness\" as seen in the Disney animated works from the 1940s to 1950s,[15] by which the characters' fluidity of motion was inspired from the Goofy cartoon How to Play Baseball (1942).[15] Under visual effects supervisor Steve Goldberg who spearheaded the department, the Maya software included the software program \"Shelf Control\" that provided an outline of characters that can be viewed on screen and provided a direct link to the controls for specific autonomy, as well as new electronic tablet screens were produced that allowed for the artists to draw digital sketches of the characters to rough out their movements, which was then transferred to the 3D characters.[16]All of the characters were constructed using geometric polygons.[15] For the title character, there was approximately fourteen to fifteen character designs before settling the design composed of an ovular egghead shape with oversized glasses. The final character was constructed of 5,600 polygons, 700 muscles, and more than 76,000 individual feathers, of which 55,000 are placed on his head.[13]Following the casting of Braff, supervising animator Jason Ryan adapted Braff's facial features during recording sessions to better combine the dorkiness and adorability the filmmakers desired. \"He's got this really appealing face and eye expressions,\" Ryan said, adding that he was amazed by Braff's natural vocal abilities.[8] Next, the animators would utilize the software program \"Chicken Wire\", where digital wire deformers were provided for the animators to manipulate the basic geometric shapes to get their desired facial features. Lastly, a software development team constructed XGen, a computer software program for texturing the hair, cloth, feathers, and leaves.[16]","Cancelled sequel":"DisneyToon Studios originally planned to make a sequel to Chicken Little, tentatively titled Chicken Little 2: The Ugly Duckling Story.[49] Soon after 2006, when John Lasseter became Walt Disney Animation Studios' new chief creative officer, he called all sequels and future sequels that DisneyToon had planned cancelled, along with a sequel to Meet the Robinsons (2007) and The Aristocats (1970).[49]","produced_by":"Randy Fullmer","starring":"Zach Braff|Garry Marshall|Joan Cusack|Steve Zahn|Dan Molina|Amy Sedaris|","running_time":"81 minutes","chicken_little":"Theatrical release poster","music_by":"John Debney","edited_by":"Dan Molina","Release":"The film was originally scheduled for release on July 1, 2005,[17] but on December 7, 2004, its release date was pushed back to November 4, 2005, the release date that was originally slated for Cars.[18][19] The release date change was the day before DreamWorks changed the release date of Shrek the Third, from November 2006 to May 2007.[20]At the time of the release of Chicken Little, the co-production deal between Disney and Pixar Animation Studios was set to expire with the release of Cars in 2006. The end result of the contentious negotiations between Disney and Pixar was viewed to depend heavily on how Chicken Little performed at the box office. If successful, the film would have given Disney leverage in its negotiations for a new contract to distribute Pixar's films. A failure would have allowed Pixar to argue that Disney could not produce CGI films.[21]On October 30, 2005, the film premiered at the El Capitan Theater, with the cast and filmmakers as attendees, which was followed with a ballroom bash at the Hollywood and Highland Center.[22][23] Along with its standard theatrical release, the film was the first Disney in-house release to be rendered in Disney Digital 3D, that was produced by Industrial Light & Magic, and exhibited via Dolby Digital Cinema servers at approximately 100 selected theaters in twenty five top markets.[24]Accompanied with the theatrical release, Disney Consumer Products released a series of plush items, toys, activity sets, keepsakes and apparel.[25]Chicken Little was first released on VHS and DVD on March 21, 2006 in only a single-disc edition.[26] The DVD contained the film accompanied with deleted scenes, three alternate openings, a making-of featurette, an interactive game, a karaoke sing along, two music videos, and animation test footage of the female Chicken Little.[27][28] The DVD sold over 2.7 million DVD units during its first week accumulating $48 million in consumer spending. Overall, consumer spending on its initial home video release grossed $142.6 million.[29] The film was released for the first time on Blu-ray on March 20, 2007, and contained new features not included on the DVD. A 3D Blu-ray version was released on November 8, 2011.[30]","budget":"$150 million[1]"}