{"country":"Canada","distributed_by":"Lions Gate Entertainment","Original screenplay":"The original screenplay written by Sean Hood, which was subsequently rewritten by producer Ernie Barbarash, had substantially different plot, theme and characterization, as well as a set of over 70 production illustrations, which visualized quite different traps, environments and four-dimensional concepts.[1]","The Cube":"The Cube seen in this film is actually the third and final Cube (the first Cube appears in the prequel, Cube Zero). Unlike the previous two Cubes, this is actually a tesseract. It does not have standard mechanical traps, instead, it can manipulate time, space, reality, and dimensions in order to kill or confuse the people inside it. Since it is a tesseract, it has an infinite number of rooms, and every room shifts instantaneously between the others. Unlike the door hatches in other Cubes, the door hatches open purely by placing a palm on one. The rooms are all purely white, black, and grey. One occupant, Jerry, described the Cube as a \"multi-dimensional quantum environment\" where \"parallel realities can exist simultaneously\".In theory, trap rooms don't exist. Any room can contain a trap, and some safe rooms can spawn a trap in order to keep the people inside moving between the rooms. The traps don't necessarily kill, but sometimes confuse in order to make the victims lose the grip of reality. For instance, one room created an alternate dimension in which, when the hatch was opened, the other room projected the person opening the hatch in an infinite void, creating an infinity mirror effect. Another room shifted gravity in reverse.Rooms with deadly traps included a room where a visible, blue transparent wall of matter, which appears to be some kind of liquid, which vaporized every material, organic or inorganic, upon touch. Another room had shooting crystal-like forms of matter that was also transparent, which could apparently slice in a near-perfect cut, even though the speed of the matter makes it impossible to perform such an act in reality. One room accelerated time and the couple that found themselves inside started to levitate and they rapidly aged until they died, with their bodies still levitating. One room contained a tangible, small tesseract, levitating in the middle of the room, which started to rapidly increase in size as it appeared to evolve and move across the room, shredding everybody within reach in pieces, until it grew into a room-sized tesseract that constantly kept the smaller versions inside it mobile, creating a deadly force that killed Jerry. Eventually, it shrunk to its original size.Like with the original film, the Cube's purpose and timeline are unknown, although it was mentioned that the Cube was \"built\" by the Izon Corporation, which is researching advanced weaponry. Film's opening scene contains the main characters wrapped in plastic, tied up on gurneys in a small storage room, but nothing more is revealed. The Cube is either set in the alternative dimension, or the Cube's occupants are placed in an advanced simulation. However, several dialogues in the film, especially with the blind hacker, who said that she \"fled into the only place they wouldn't follow\", support the former theory. Also, in a deleted scene, the Izon executives state that the Cube is an experiment for \"quantum teleportation\", heavily implying it is placed in an alternate dimension.The Cube also had a self-destruct system that Kate discovered, and it was imploding. It also had an exit, which showed an empty, black, infinite void that transported her back to the real void, where she awoke in a shallow pool, which also supported the theory of dimensions. The scene where Kate jumps into the void also shows the entire tesseract surrounded by a huge black void.","Plot":"The film starts with a young woman named Becky (Greer Kent), shown to be trapped in the Cube. She enters another room, but unknown to her, the room has reversed gravity, as she is pulled up, and it is implied that she is killed.Some time later, a woman named Kate (Kari Matchett), detective Simon (Geraint Wyn Davies), a blind girl named Sasha (Grace Lynn Kung), engineer Jerry (Neil Crone), game developer Max (Matthew Ferguson), lawyer Julia (Lindsey Connell), and an elderly woman named Mrs. Paley (Barbara Gordon) find themselves trapped in brightly lit cubes, each with a panel on each of the six sides, which are doors to other rooms. They come across Colonel Thomas Maguire (Bruce Gray), who says that they have to solve the code in order to leave the mysterious place. Just as he finishes, a wall begins to close in on the group. The group escapes while Thomas stays behind, while Kate and Simon watch in horror as Thomas is disintegrated by the wall. Later experiences around the cube reveal that gravity can operate in different directions in each room, while Mrs. Paley, who is revealed to be a retired theoretical mathematician, and Jerry, realize that they may be in a tesseract, or a hypercube. Kate notices the numbers \"60659\" everywhere they go.The group soon realizes they are connected to Izon, a defense contractor. While in conversation, Mrs. Paley opens a panel to reveal her being killed by Simon, who is decapitated soon after by crystal beams. Jerry thinks that it is a parallel universe, while Max and Julia think it is an optical illusion. Later, while the group is sleeping, Simon realizes that he is in the tesseract to look for Becky, a missing Izon worker and the first person revealed in the film. Meanwhile, Sasha hears a noise and awakens everyone, due to her acute hearing. The group finds a floating square in the middle of the room, which grows into shifting variations of a tesseract, before expanding into a lethal and rapidly spinning frame. The group flees into another room, but Jerry is injured by the tesseract. Trying to call Jerry, the rest of the group watches as Jerry is shredded by the tesseract, which grows rapidly. Kate remains to save Sasha, who is still trapped in the room, narrowly avoiding death as they group in one of the corners of the room where the tesseract can't reach, as the tesseract conforms back to a cube and disappears. Sasha and Kate are separated from the group, as a result.Simon starts to suspect that Mrs. Paley is an undercover spy, so he gags and ties her up, but crystal beams start protruding from the walls. Simon tries to save Mrs. Paley, but when he sees that there isn't enough time, as the clinging Mrs. Paley refuses to release him, he stabs her with his knife. Max and Julia, disturbed that Simon killed Mrs. Paley, leave and abandon him. Julia tells Max she must be dreaming, and then kisses him, because she says she would never kiss him in the real world. They begin to have sex, but unbeknownst to them, they are in a room that is zero-gravity and time dilated, and age prematurely and die, as Kate finds the corpses floating in the air later, still in mid-coitus. Simon, alone and hungry, goes insane. He encounters a parallel Jerry and the missing Becky, killing both of them.Meanwhile, Kate finds grisly alternate realities of her death in other rooms, and is horrified. Sasha tells Kate that time and space are distorted where they are, that the tesseract will implode and reality is collapsing. She reveals that she is Alex Trusk, a computer hacker who is responsible for the creation of the tesseract, who also reveals that when she discovered that Izon was putting people inside the tesseract, she tried to stop their operation, but was pursued so she \"fled into the only place they wouldn't follow;\" the tesseract. Kate, however, still believes that there is a way out. Kate then finds Simon and stabs him in the eye after he grabs her in another room, as Simon appears behind Alex, old and blind in one eye, proving Alex's space-time theory. Alex claims that they \"are all dead\", which causes Simon to snap her neck, believing that if they are all dead that it won't really matter if he kills her now.Kate finds that the tesseract is shrinking, and kills Simon with the knife. She looks at the numerous duplicates of Jerry's watch and realizes that \"60659\" is the time that the tesseract will implode; 6:06:59. and that she is there to take back Alex's necklace which was filled with confidential information on Izon. The hypercube starts to wear away, and Kate opens a panel in the bottom, revealing a black void. At 6:06:59, she jumps in just when the Hypercube implodes.Kate wakes up in the hands of Izon authorities in an unknown factory. She gives them the necklace, but because of their confidentialiy, she is shot in the head and killed by one of the Izon operatives. An Izon authority reports to an anonymous and unidentified source that \"Phase 2 is terminated\", as the operatives leave the facility, and the film ends.","language":"English","Reception":"As of 21 July 2014, Cube 2: Hypercube holds a rating of 45% \"rotten\" on Rotten Tomatoes. Reviews have been mixed, with Sci-Fi Movie Page and Film Threat giving positive ratings for the movie[2][3] while sites such as JoBlo.com, and DVD Verdict panned the film.[4][5] EfilmCritic.com wrote that \"while the acting isn’t quite top-shelf, the cast is still serviceable enough to carry the increasing claustrophobia and confusion that sets in, and they’re all quite likable in their own B movie way.\"[6]PopMatters and WorldsGreatestCritic.com journalist J.C. Maçek III wrote \"Still, many have criticized Hypercube as being practically the same movie as Cube. I suppose the question would be where one could go beyond Cube without revealing far too much or fragmenting the mythology created in the first movie. However, breaking the confinements of the first, Hypercube manages to be an expansive thriller that feels at once huge, claustrophobicc, mathematical and magical.\"[7]Bloody Disgusting also rated the film, writing \"With pacing that's snail-like slow at times mixed with the horrid FX and lack of unique kill scenes, the film falls way short of my expectations, especially after waiting six years! But if you are a big fan of the first Cube, and expect a little less, you will enjoy Cube 2: Hypercube.\"[8]","cinematography":"Andrzej Sekuła","directed_by":"Andrzej Sekuła","cube_2:_hypercube":"Theatrical release poster","release_dates":"August 29, 2002 (2002-08-29) (Czech Republic)|||||","produced_by":"Ernie Barbarash|Peter Block|Suzanne Colvin|","starring":"Kari Matchett|Geraint Wyn Davies|Grace Lynn Kung|Matthew Ferguson|Neil Crone|","running_time":"94 minutes","Alternate ending":"The longer alternate ending included in the special features on the DVD reveals the \"owners\" to be the government; in the shorter version it is unclear who they are, but it is assumed they are Izon. Kate is executed in both versions, but she is praised for being the first operative to make it out alive. In the alternate ending it is revealed to Kate that she was in the Hypercube for just six minutes and fifty-nine seconds. It was an experiment used for quantum teleportation.","music_by":"Norman Orenstein","edited_by":"Mark Sanders","written_by":"Sean Hood"}