{"country":"United Kingdom","distributed_by":"Pathé","Plot":"The plot begins with a couple camping in the Scottish Highlands. The woman gives the man a silver letter opener as a present; shortly afterwards they are killed in their tent by an unseen assailant. Meanwhile, Private Cooper is seen running through a forest in North Wales. He attacks his pursuers but is overwhelmed and wrestled to the ground. It turns out Cooper is trying to join a special forces unit but fails when he refuses to shoot a dog in cold blood. He is returned to his unit by Captain Richard Ryan.Four weeks later a squad of six regular British Army soldiers, including Cooper, is dropped into the Scottish Highlands, somewhat fed up about missing an England–Germany World Cup match. Expecting to carry out a training mission against a Special Air Service (SAS) unit, they only find their savaged remains. A badly-wounded survivor, Captain Ryan, makes cryptic references to what attacked them. Unseen predators attack the troops. While retreating, Bruce is impaled on a tree branch and Sergeant Wells is attacked. He is rescued by Cooper and carried to a rural roadside where the group encounters Megan, a zoologist who takes them to a lonely house, belonging to an unknown family. The soldiers who remain are Wells, Cooper, Spoon, Joe and Terry. As dark falls, the house is surrounded by the attackers: to the soldiers' incredulity, these are revealed to be werewolves.They go to get in the Land Rover but it has been destroyed by the werewolves. The soldiers maintain a desperate defence against the werewolves, believing that if they can make it to sunrise, the werewolves will revert to human form. Cooper and Megan then treat Wells' wounds. After Terry is abducted and ammunition runs short, they realise that they will not last and decide to try to escape. Spoon creates a diversion while Joe steals a Land Rover from the garage. When he gets in, he sees Terry in the garage being eaten alive by a werewolf, which rips off Terry's head and throws it at the windscreen. Joe drives up to the house door, then realizes that a werewolf was hiding in the back seat and goes down fighting.Ryan then reveals that the government had sent him on a mission to capture a live werewolf so that it can be studied and exploited as a weapon; Cooper's squad was the bait. After a fight, Ryan transforms into a werewolf due to his wounds and escapes, running off into the forest. It is then revealed that the unknown family of the house are the werewolves. The soldiers try blowing up the barn, where Megan tells them the werewolves must be hiding, with petrol, gas canisters, matches and the Land Rover. Once it had been destroyed, Megan reveals that not only were there no werewolves in the barn but she had persuaded them that to destroy their only means of transport; she is a werewolf as well and had been suppressing the metamorphosis but now gives in. She also reveals that she unlocked the back door to the house, allowing the werewolves inside. Before she fully transforms, Wells runs in to the room just in time and shoots her in the head. He and Cooper run upstairs and Spoon runs to the kitchen, blocking the door. The werewolf breaks in and Spoon runs out of ammo. He fights the werewolf and gains the upper hand but is killed by a second werewolf. Wells and Cooper shoot through the floor upstairs to escape the werewolves, dropping into the kitchen. Wells cuts a gas line and blows up the house, while Cooper hides below in the cellar. Before he can flee, Ryan, still a werewolf, confronts him. Cooper kills him with the silver letter opener and shoots him in the head. He and Megan's dog, Sam, walk off into the woods.As the credits roll a newspaper appears showing the football result (England 5 Germany 1), with a smaller headline showing a small picture of Cooper and the headline \"Werewolves ate my platoon.\"","language":"English","Reception":"On the film critic aggregate site Rotten Tomatoes, Dog Soldiers holds 78 percent based on 32 reviews with an average rating of 6.9 out of 10.[5]","dog_soldiers":"British quad poster for Dog Soldiers","box_office":"£3.2 million[2]","cinematography":"Sam McCurdy","directed_by":"Neil Marshall","Home media":"Dog Soldiers was released on DVD in the U.S. in November 2002 by Fox Home Video.[1]A Blu-ray edition (including a single-disc edition and a double-disc edition with a DVD copy) was released by First Look Studios on May 5, 2009,[7] available only in the U.S. and Canada.Due to the low quality of the original Blu-ray transfer, Shout! Factory worked hand in hand with director Neil Marshall[8][9] to create a brand-new Blu-ray transfer for Dog Soldiers in a release titled Dog Soldiers: Collector's Edition,[10] which was released on June 23, 2015. It was a two-disc set including a brand-new Blu-ray and a DVD copy with a new cover. This edition is only available in the U.S. (Region A).","Awards":"In 2002, the film won the Brussels International Festival of Fantasy Film's Golden Raven, the festival's top award, as well as the audience prize, the Pegasus.[6]","release_dates":"10 May 2002[citation needed]","Production":"Dog Soldiers was produced by the Kismet Entertainment Group, the Noel Gay Motion Picture Company, the Victor Film Company, and the Carousel Picture Company with the support of the Luxembourg Film Fund.[3] In addition to the credits in the infobox, the costume designer is Uli Simon, the casting directors are Jeremy Zimmerman and Andrea Clarke, the special makeup, animatronic and digital visual effects are by the company Image FX, and the physical-effects supervisor and stunt coordinator is Harry Wiessenhaan.[3]A British production, set in the highlands of Scotland, it was filmed almost entirely in Luxembourg.[citation needed] In the United States, it premiered as a Sci-Fi Pictures telefilm on the Sci-Fi Channel.[3]The film contains homages to H. G. Wells as well as the films The Evil Dead, Zulu, Aliens, The Matrix and Star Trek II: The Wrath of Khan.[4]","produced_by":"Brian Patrick O'Toole Christopher Figg Tom Reeve David E. Allen","starring":"Sean Pertwee Kevin McKidd Emma Cleasby Liam Cunningham","running_time":"105 minutes[1]","Sequel":"Producer David E. Allen said in January 2004 that a sequel, Dog Soldiers: Fresh Meat, would begin a 35-day shoot that April in either Luxembourg or Canada with a budget of $5.5 million. Andy Armstrong, a second-unit director on films including Hellbound: Hellraiser II and Nightbreed, would direct from an Eric Miller script, with Allen and Brian Patrick O’Toole returning as producers. No casting was announced. Allen said the plot would involve Cooper being \"picked up by an American team who, we find out, were the real opponents for the war games for Sgt. Wells' squad.\"[11] A year later, he elaborated that, \"In the first film, it was a family who were the werewolves. In this one, it's an actual team of werewolves who are true military men. So even though they are now werewolves, they act like a trained military unit.\"[12]In January 2005, Michael J. Bassett was in talks to direct,[12] but by July 2006, Rob Green, who previously directed the horror film The Bunker, was set to direct and said he and Miller had written a story in which \"Some of the characters actually love being a werewolf because they are so powerful – the ultimate killing machine … [I]t's a fun spin on the traditional angle that being a werewolf is a curse which damns the person no matter what. We also have a very savage she-wolf in the climax who faces against the leader of the pack of Dog Soldiers.\" Production was not set for autumn 2006.[13] By 21 December 2008, however, information about the film had been removed from various web resources including the website of production company Kismet status.[12]A \"Little Red Riding Hood\"-inspired web series, Dog Soldiers: Legacy, was announced in September 2011 by producer and Kismet vice-president, Allen, now going by D. Eric Allen. A teaser trailer for the series was filmed in northwest Arkansas over the last weekend of August 2011. Directed by Ryan Lightbourn, the trailer included members of Allen's family, including his grandmother Pat \"Nan\" Allen and his sister Emmy Allen, as Red. Allen also said the Dog Soldiers sequel was in early pre-production.[14]An early poster of Dog Soldiers: Fresh Meat was released with the tagline \"Coming 2014\" across the bottom on 23 March 2014.[15] D. Eric Allen announced that a prequel and another sequel are in the planning stages, and Fresh Meat would be released on 20 December 2014.[16] This date passed with no release and no additional updates on the film's status.","music_by":"Mark Thomas","edited_by":"Neil Marshall","written_by":"Neil Marshall"}