{"country":"United States","distributed_by":"Fine Line Features","screenplay_by":"Roger Hedden","language":"English","Reception":"Janet Maslin called the characters played by the four central actors \"quirky, magnetic\", saying they are set against the backdrop of a \"bland, artificial culture winning its war with nature\"; the film is \"much too studiedly hip to indulge in a happy ending, but in its wry, offbeat way it does inch forward. In this jaded context, a small step in the right direction is indeed a large step for mankind.\"[2] According to People, the film \"wants desperately to say something profound about the condition of twentysomethings. But it succeeds only in sounding like outtakes from an undergrad bull session. While Fonda and Cates manage to keep their footing, Roth elicits no emotion beyond irritation, and Stoltz acts as if he's had his nose in the latex too long.\"[3] Roger Ebert gave the film two stars out of four, saying it is \"one of those movies that not only comes accompanied by supporting materials, but seems fairly pointless unless you brief yourself\"; according to Ebert, if the viewer knows Newton's first law of motion and keeps in mind that \"'Generation X' is a media buzzword for the late-twentysomethings [who have been] so named, apparently, for their lack of an identity\", it is \"possible to watch Bodies, Rest and Motion, and find that it makes a statement about its generation. Without the cheat sheet, you'd more likely say the movie is about a bunch of aimless, boring, hopeless drips, who inspire neither sympathy nor interest. If I were a doctor, I'd suspect Lyme disease.\"[4] Rita Kempley of the Los Angeles Times","Home video":"The film received a laserdisc release from Criterion Collection.","cinematography":"Bernd Heinl","directed_by":"Michael Steinberg","bodies,_rest_&_motion":"DVD cover","release_dates":"April 9, 1993 (1993-04-09)|||||","produced_by":"Joel Kastelberg","starring":"Phoebe Cates Bridget Fonda Tim Roth Eric Stoltz","running_time":"95 minutes","Original stage version":"Hedden wrote the script based on his own play, which premiered off-Broadway on December 21, 1986, at the Mitzi E. Newhouse Theater, with William H. Macy as Nick, Christina Moore as Carol, Laurie Metcalf as Beth, and Andrew McCarthy as Sid.[5] According to Frank Rich, the play's \"meager plot—an arbitrary coupling or two, followed by equally whimsical leave-takings and reunions—leads to nothing more than a sentimental final-curtain reaffirmation of the transforming powers of true love.\"[6] The original run lasted 22 performances.[5]","music_by":"Michael Convertino","edited_by":"Jay Cassidy"}