{"based_on":"Angels in the Outfield  by Dorothy Kingsley George Wells","country":"United States","distributed_by":"Buena Vista Pictures","screenplay_by":"Holly Goldberg Sloan","angels_in_the_outfield":"Theatrical release poster","Plot":"Young foster child Roger (Joseph Gordon-Levitt) and his friend J.P. (Milton Davis, Jr.) love to sneak into baseball games of the hopelessly dreadful California Angels.Still in limited contact with his widower father, Roger asks when they will be a family again. His father replies sarcastically, \"I'd say when the Angels win the pennant.\" Taking his father's words literally, Roger prays for God to help the Angels win. After he prays, a star, unseen by Roger, twinkles in the sky.Then, in a game against the Toronto Blue Jays which Roger and J.P. attend, he sees a group of angels led by Al (Christopher Lloyd) helping the team. Although Roger can see them quite clearly, everyone else can only explain the seemingly impossible acts as freak occurrences.Roger's unique ability to see which players are receiving help from angels leads their skeptical manager, George Knox (Danny Glover) to keep him around as a good luck charm and consultant, including ending the use of profanity as a nod to the original film. Due to the much needed help, the Angels start to win games and make a surprising second-half surge to the top of their division. Meanwhile, Roger's father permanently gives up custody of his son, believing it's in Roger's best interest.As Roger laments his loss, J.P. accidentally reveals to antagonistic sports broadcaster Ranch Wilder (Jay O. Sanders) that Roger has the ability to see angels, and that George has been winning through the advice Roger's given him. Hoping to destroy George due to a longtime rivalry between the two, Ranch informs the press of this and their owner Hank Murphy (Ben Johnson) threatens to relieve George of his management responsibilities. Roger comes clean to his caretaker Maggie Nelson (Brenda Fricker) about his special ability and at a press conference they and the entire team defend George in front of the press. Moved by their faith, Murphy allows George to remain as manager of the Angels.During the championship game none of the angels show up to help the team. Later on, Al explains that championships must be played without help from the angels and that he was there just checking on pitcher Mel Clark (Tony Danza) who will be one of them soon as he has been a chain smoker. Mel starts struggling, and is getting tired after throwing 159 pitches. When George goes out to the mound, everyone thinks he's going in to take Mel out, but instead, George gives him some motivation, and with encouragement from Roger, the team, and finally, the entire stadium audience as well as owner Murphy and the broadcasters (with the exception of Ranch).The Angels ultimately win the final game of the regular season without the help of the angels and clinch the division pennant over the rival Chicago White Sox, thanks to Mel. Murphy fires Ranch due to his denigration of the team. The film ends with George adopting both Roger and J.P. as he wants to try be a father. J.P. sees Al at the window and says \"I knew it could happen.\" Al circles around the house and says \"We're always watching\" and flying off into the stars, which re-enact a baseball game.","language":"English","Reception":"The film earned mostly negative reviews from critics, maintaining a 35% rating on Rotten Tomatoes.Unlike the original film, which focused on the Pittsburgh Pirates as the team in heavenly need, the 1994 remake focuses on the California Angels, who did not exist when the original film was released in 1951. The Walt Disney Company, which distributed it, was a minority owner of the Angels at the time. The film did, however, premiere at the Pirates' home stadium at the time, Three Rivers Stadium in Pittsburgh.[1][2] The premiere would be the only reference to the Pirates, due to the two teams playing in separate leagues (Angels in the American League, Pirates in the National League) and the film being released three years before the start of interleague play. The two teams would finally meet head-to-head for the first time in 2002 in Anaheim.The film opened at #4 at the North American box office making $8,916,463 USD in its opening weekend. It went on to gross $50.2 million at the box office domestically.","box_office":"$50,236,831","cinematography":"Matthew F. Leonetti","production_company":"Walt Disney Pictures Caravan Pictures","directed_by":"William Dear","release_dates":"July 15, 1994 (1994-07-15)|||||","produced_by":"Irby Smith Joe Roth Roger Birnbaum","starring":"Danny Glover Tony Danza Brenda Fricker Ben Johnson Joseph Gordon-Levitt Jay O. Sanders Christopher Lloyd","running_time":"102 minutes","music_by":"Randy Edelman","edited_by":"Bruce Green","budget":"$24,000,000 (estimated)"}