{"based_on":"Assassin's Creed  by Ubisoft","country":"United States|France|","distributed_by":"20th Century Fox","screenplay_by":"Bill Collage|Adam Cooper|Scott Frank|Michael Lesslie|","language":"English","assassin's_creed":"Teaser poster","Premise":"Career criminal Callum Lynch is rescued from his own execution by Abstergo Industries, the modern-day incarnation of the Templar Order. He is forced to participate in the Animus Project and relive the memories of his ancestor Aguilar de Nerha, an Assassin during the Spanish Inquisition. As Lynch continues to experience Aguilar's memories, he begins to gain the knowledge and skills necessary to confront the Templars—age-old enemies of the Assassins—in the present day.[3]","cinematography":"Adam Arkapaw","production_company":"Regency Enterprises Ubisoft Motion Pictures RatPac-Dune Entertainment New Regency Pictures DMC Film The Kennedy/Marshall Company","directed_by":"Justin Kurzel","Potential sequels":"In March 2016, Daphne Yang, CEO of the film's Taiwanese co-financier CatchPlay, stated that New Regency was looking to turn the film into a franchise, since it is based on \"successful Ubisoft games and would make ideal sequels.\"[40] Two additional films are planned, with the first sequel entering development during the production of this film.[41]","release_dates":"December 21, 2016 (2016-12-21) (United States)|||||","Production":"\"You know, we absolutely want to respect the game. There's so much cool stuff in the game that we're actually spoiled for choice in terms of what we can use and what we can't, but we also want to bring new elements to it and perhaps our own version of things that already exist in the game. But we're definitely making a feature film, and we're approaching it as a feature film, as opposed to approaching it as a video game. But I love the world... When I met up with the guys from Ubisoft and they started to explain this whole world and the idea of DNA memory – you know, I think it's a very feasible scientific theory. I just thought, 'This is so rich,' and about the possibility of it being this cinematic experience. So I'm really excited about it, and we're working very hard to make sure that we've got the best and most exciting, original package.\"By October 2011, Sony Pictures was in final negotiations with Ubisoft Motion Pictures to make a film version of Assassin's Creed,[14] to be released in 3D.[15] In July 2012, Michael Fassbender was announced to star in the film, as well as co-produce the film through his DMC Film banner with Conor McCaughan.[4] Jean-Julien Baronnet, CEO Ubisoft Motion Pictures, said Fassbender was the studio's first choice to star in the film. As well, negotiations between Sony Pictures and Ubisoft Motion Pictures was put on hold, with Ubisoft executives planning to develop the film independently in order to maintain greater creative control. Sony could still distribute the film, but Ubisoft Motion Pictures would not resume talks until packaging the project with a writer and director.[16] In October, Ubisoft revealed the film would be co-produced with New Regency and distributed by 20th Century Fox. New Regency financed part of the film's production, in order for Ubisoft to not shoulder much financial risk, yet still be involved creatively;[17] RatPac Entertainment and Alpha Pictures also co-financing the film.[12] Baronnet also revealed Ubisoft hoped to release the film along with a new game launch for the series.[17]In January 2013, Michael Lesslie was hired to write the film.[18] In June 2013, Frank Marshall entered negotiations to produce the film, along with Fassbender and McCaughan for DMC Film and Eli Richbourg for Ubisoft.[19] In July, Scott Frank revealed he was rewriting the script.[20] In January 2014, a Linkedin profile for executive producer Fannie Pailloux stated filming was scheduled to begin in August 2014.[21] In April 2014, Adam Cooper and Bill Collage were hired to rewrite the script.[22] By the end of April, Justin Kurzel was in talks to direct.[23] In June, Olivia Munn expressed interest in appearing in the film.[24]On February 12, 2015, Ubisoft's CEO Yves Guillemot confirmed that New Regency had begun production on the film.[25] The following day, Marion Cotillard was revealed to have joined the cast, and that filming was expected to begin in late 2015.[5] In April 2015, Fassbender revealed that filming is scheduled to begin in September 2015.[26] In May 2015, Alicia Vikander was in talks to star in the film,[27] though in the following month, she took a role in the fifth Bourne film film instead,[28] leading Ariane Labed to be cast in her place.[12] Producers on the film include Baronnet, Patrick Crowley, Fassbender, Marshall, Conor McCaughan and Arnon Milchan.[12] In July 2015, Michael K. Williams was added to the cast.[10] In late August 2015, Fassbender's role was revealed as Callum Lynch in the present day and Aguilar in 15th Century Spain, as well as filming locations for the film.[3] Aymar Azaïzia, head of Assassin's Creed content at Ubisoft, stated that the film, which is \"a brand new story, [with] new characters set in our universe,\" had the possibility to feature \"some familiar faces\" and that the present day element would feature Abstergo.[29]Principal photography on the film began on August 31, 2015, with filming taking place in Malta, London and Spain.[3][30][31] Adam Arkapaw serves as cinematographer, while Andy Nicholson acts as production designer.[32] In October 2015, Jeremy Irons and Brendan Gleeson joined the cast.[6] In December 2015, shooting took place in Spain,[33] and Irons' role was revealed to be Alan Rikkin.[9] Filming ended on January 15, 2016.[34]","produced_by":"Jean-Julien Baronnet|Patrick Crowley|Michael Fassbender|Frank Marshall|Conor McCaughan|Arnon Milchan|","starring":"Michael Fassbender|Marion Cotillard|Jeremy Irons|Brendan Gleeson|Michael K. Williams|","Release":"Assassin's Creed is scheduled to be released on December 21, 2016.[35] The film was originally announced in May 2013 to be released on May 22, 2015,[36] which was later pushed back the following month to June 19, 2015.[37] In November 2013, the film was pushed back once again to a new release date of August 7, 2015.[38] In September 2014, the film was pushed to an unspecified 2016 release date,[39] which was revealed to be December 21, 2016 in January 2015.[35]","budget":"$150–200 million[1][2]"}