{"country":"India","distributed_by":"Seven Arts Release","Plot":"Kalliyur Gopinathan alias Gopi (Mohanlal) is a member of a happy family with carnatic music heritage and he himself is a good singer. Kalliyur Ramanathan (Nedumudi Venu) who is also an excellent singer, is Gopi's elder brother, guru and role model. Ramanathan is married to Ramani (Lakshmi) and has a son Appu. Gopi is in love with Devi (Urvashi) who is the sister of Ramani. Raman reigns in the family and in the society with his music. But he turns into alcoholic. Despite several attempts by family members to make him give up the habit and several failed assurances to his family members, he is unable to give up the habit. Movie depicts Raman reaching for a concert in an inebriated state and Gopi is forced to take over. He is an instant hit with the masses. This has been depicted quite symbolically during the song Sree Vinayagam. Gopi's music, which was hidden behind his brother's charisma now flows out in full strength. Taking this as an insult, Raman starts hating his brother and strives hard to recover from alcoholism. His morale is shattered when organizers of the Tyagaraja Aaradhana select his brother over him to perform. This makes Raman angry. So Gopi decides to stop singing. But on hearing this Raman understands his mistake and asks Gopi to sing at Tyagaraja Aaradhana. Ramanathan attends his brother's concert in a drunken state but is able to appreciate his brother's talent. With a longing to get rid of the alcoholism and perform a concert with his brother, he sets on a pilgrimage, but was never to return. Gopi, getting to know that Raman is killed in an accident, is forced to conceal this truth because of their vocally disabled sister's marriage. Gopi gets lot of moral support with Devi, who also knows about the truth. Gopi's trauma reaches penultimate when his family comes to know about Raman's death and that Gopi was concealing it. Everything ends fine when the family understands his intentions.","language":"Malayalam","Remake":"The film was remade in Tamil as Seenu with Karthick portraying Mohanlal's character, P. Vasu portraying Nedumudi Venu's Character and Malavika playing Urvasi's character. The film was directed by P. Vasu.","cinematography":"Anandakuttan","production_company":"Pranavam Arts","directed_by":"Sibi Malayil","Soundtrack":"The acclaimed soundtrack of this movie was composed by Music Maestro Raveendran Master for which the acclaimed lyrics were penned by Kaithapram. All the songs of this movie were instant hits.","bharatham":"DVD cover","release_dates":"29 March 1991 (1991-03-29)|||||","produced_by":"Mohanlal","starring":"Mohanlal Urvashi Nedumudi Venu Lakshmi Murali Biyon","running_time":"147 minutes","music_by":"Raveendran","edited_by":"L. Bhoominathan","written_by":"A. K. Lohithadas"}