{"directed_by":"Terence Davies","country":"United Kingdom","distant_voices,_still_lives":"Movie poster","release_dates":"29 September 1988","starring":"Freda Dowie|Peter Postlethwaite|Angela Walsh|Dean Williams|Lorraine Ashbourne|","running_time":"85 minutes","Alcohol":"Many of the film's most illuminating sequences were filmed in public houses. In one scene Tony orders a round of drinks from the bar and lists a number of drinks that would have been staple drinks for 1940s and 1950s Liverpool, but barely heard of now. These include 'Mackies', Black and Tan, a 'Pale Ale and Lime' and a 'Rum and Pep'.","language":"English","Autobiographical references":"In his British Film Institute Modern Classics book, Paul Farley describes the inspiration that Terence Davies used for the biographical backbone of the film:Davies was the youngest of ten children, the baby boomer, born into a working-class Catholic household in post-war Liverpool. His father died when he was six-and-a-half, though memories of him as a powerful, domineering, violent man are vivid and, together with the love and support of his mother, form a huge tension in Distant Voices, Still LivesIn fact, Terence Davies's real-life father can be seen in a photograph which hangs on the wall in one of the film's central sequences when the mother and her three children, Tony, Eileen and Maisie, each walk out of the frame to reveal a tired and bleached photograph of their father.","Songs":"Music is the central core of Distant Voices, Still Lives and is a device which binds the characters and helps to give them a voice beyond their otherwise repressed lives. In Paul Farley's BFI book, Terence Davies describes the process in which music came alive in the shooting of the film.Many of the songs were sung by the cast, including Debi Jones's light rendition of Buttons and Bows and Angela Walsh's heart-breaking rendition of Johnny Mercer's I Wanna Be Around. The film also features a juxtaposition of Ella Fitzgerald singing Taking a Chance on Love and a scene of brutal domestic violence.The melody Limelight is also used in the film's soundtrack, played beautifully on the harmonica; it is also the main theme from the Chaplin film of the same name, Limelight.","written_by":"Terence Davies","Location":"In Paul Farley's British Film Institute Modern Classics book on Distant Voices, Still Lives, Terence Davies describes how they chose the location for filming:Kensington Street, Liverpool, L7 8XD This small street of Victorian terraced houses to the north of Kensington was the childhood home to Terence Davies and his family. The Victorian houses in Kensington Street were demolished in 1961 and replaced at a later date by a low-rise Council estate and two industrial units. However, houses very similar to those in Kensington Street remain to the south of Kensington in streets such as Albany Road, L7 8RG and Saxony Road, L7 8RU.47 Whistler Street, London, N5 1NJ The central location for the filming of Distant Voices, Still Lives was chosen for its architectural similarity to Davies's childhood home in Kensington Street, Liverpool. 47 Whistler Street is a small terraced house in row of similar Victorian houses located in north London on the edge of Highbury Fields. The street can be accessed from the park via a small alleyway, or from Drayton Park, the main road behind the street. The houses on the west side of Whistler Street are bay-fronted and were chosen to depict the actual family home. The houses on the east side are flat-fronted and therefore rarely shown in the film sequences. However, a house on the eastern side of the street is used in the final scene where the group leave Tony's wedding celebration and walk into the darkness.The Futurist, Lime Street, Liverpool The Futurist was the location which inspired the film's (arguably) most artistic sequence in which the two sisters, Eileen and Maisie, attend a screening of Love is a Many Splendored Thing whilst unknown to them, their brother and Maisie's husband, George, have a serious accident. The Futurist was Liverpool's first purpose-built and longest-surviving cinema, opening in 1912. A very upmarket city centre cinema with a tiled Edwardian facade and 1,029 seats in the stalls and circle auditorium which was richly decorated with plasterwork in the French Renaissance style. The cinema lasted nearly 70 years and closed its doors for the final time in 1982.Jubilee Drive, Liverpool, L7 8SL A Victorian street in the Kensington Fields area of east Liverpool, this was the street where Monica (Micky) lived and begged Eileen to come and visit. \"So don't be a stranger – otherwise we'll not see you till next Preston Guild. We're only in Jubilee Drive.\"Formby Sands Monica, Jingles and Eileen pitch their tent at Formby sands – a scene which is used to remind Eileen of the free and happy life she lived before her marriage to Dave.Pwllheli Although more famous in later years for the Butlins holiday parks, in the 1940s this Welsh seaside town was an upmarket location with high-quality hotels. Teenagers from Liverpool and Manchester would work in these hotels in the summer season. In the film, Eileen, Monica and Jingles are seen working as waitresses in the breakfast hall of an (unnamed) large hotel."}