{"country":"United States","distributed_by":"Warner Bros. (Time Warner)","Plot":"Sue Ellen Crandell is a 17-year-old high school graduate who, due to a lack of funds, cannot go to Europe for the summer with her friends. She is about head to college in the fall. However, Sue Ellen remains optimistic about a summer of freedom with her siblings: slacker Kenny, tomboy Melissa, ladies man Zach, and TV fanatic Walter, while their mother travels to Australia with her boyfriend. Much to Sue Ellen's dismay, her mother hires a live-in babysitter, Mrs. Sturak, a seemingly sweet, humble old woman who assures Mrs. Crandell that she can take care of all five children. As soon as Mrs. Crandall leaves, Mrs. Sturak shows her true colors as a tyrant, quickly drawing the ire of the children. However, she later dies of a heart attack. When her body is discovered by Sue Ellen, the children agree to stuff the babysitter in a trunk and drop her off at a local funeral home and keep her car. They discover that the envelope given to Mrs. Sturak by their mother with their summer money is empty; she had it on her when they delivered her body to the funeral home.With no money to pay the family's bills, Sue Ellen finds work at a fast food restaurant called Clown Dog. Despite a budding relationship with her co-worker named Bryan, she quits because of the obnoxious manager. Sue Ellen then forges a résumé under the guise of a young fashion designer and applies at General Apparel West (GAW), hoping to secure a job as a receptionist. However, Rose Lindsey, a company executive, finds her résumé so impressive that she offers Sue Ellen a job as an administrative assistant, much to the chagrin of Carolyn, a receptionist on Rose's floor who was initially in line for the job. While having dinner at a restaurant that night, Mrs. Sturak's car is stolen by drag queens, forcing Sue Ellen to call in a favor from Bryan to bring them home. Sue Ellen then obtains the keys to her mother's Volvo, and begins stealing from petty cash at GAW to support the family, intending to return it when she receives her paycheck.At work, Sue Ellen has to balance the adult responsibilities thrust upon her while still trying to enjoy herself as a teenager. The double life strains her relationship with Bryan when she discovers that he and Carolyn are brother and sister. Sue Ellen then finds herself tested when she learns that GAW is in danger of going out of business. She takes it upon herself to create a new clothing line and Rose suggests holding a fashion show to exhibit their new designs. Sue Ellen offers to host the party, convincing her siblings to help clean up the house, beautify the yard, and act as caterers. Although she manages to pull off the party, it comes to an end when Mrs. Crandall comes home early and catches Sue Ellen in the act, forcing her to confess her lie in front of everyone. While apologizing to Rose after the party, Sue Ellen learns that her unique designs had saved GAW. Rose then offers the real Sue Ellen the job as her personal assistant, which she respectfully declines in favor of going to college first. Rose tells Sue Ellen that she can \"pull some strings\" to get her in to Vassar and they make plans to get together for dinner.In the end, Sue Ellen and Bryan make up, but are soon interrupted by Mrs. Crandall, who inquires about Mrs. Sturak's whereabouts. As the credits roll, the scene cuts away to the cemetery, where two morticians look over a gravestone that reads \"Nice Old Lady Inside, Died of Natural Causes.\"","language":"English","Reception":"Review aggregation website Rotten Tomatoes gives the film a score of 31% based on reviews from 26 critics, with an average score of 4/10.[2] The New York Post called Don't Tell Mom the Babysitter's Dead the best teen hit of 1991.[citation needed]","box_office":"$25,196,249[1]","Remake":"In June 2010, reports surfaced that a remake of the film, produced by The Mark Gordon Company, is currently in the works. As of April 2015, further details are unknown.[3]","cinematography":"Tim Suhrstedt","production_company":"HBO Pictures Outlaw Productions","directed_by":"Stephen Herek","release_dates":"June 7, 1991","Filming":"The house that was used in this movie is located in Canyon Country, California.","produced_by":"Robert F. Newmyer Brian Reilly Jeffery Silver Julia Phillips","starring":"Christina Applegate|Joanna Cassidy|Keith Coogan|John Getz|Josh Charles|","running_time":"102 minutes","don't_tell_mom_the_babysitter's_dead":"Theatrical release poster","music_by":"David Newman","edited_by":"Larry Bock","written_by":"Neil Landau Tara Ison","budget":"$10 million"}