{"country":"United States","distributed_by":"Lionsgate","Plot":"Monty James is a mechanic who has three daughters: China, Lauryn and Sierra, who dreams of owning his own shop. His children have been cared for by their maternal grandmother Kat Jackson for years, but she dies of lung cancer. His ex-wife, Jennifer, disrupts the service, demands her daughters live with her and sues for custody. Monty accepts help from Maya, an employment agency worker, who recommends he works as a driver for Julia Rossmore, an attorney in AtlantaJulia’s friends, Brenda and Cynthia, set Julia up on a blind date with Byron. She also ends up on a blind date with a guy who she thinks is perfect for her until his wife and kids expose him as an unfaithful married man. When Monty and Julia meet, she insists on having everything done on schedule. Meanwhile, Sierra accidentally starts a fire in his home, and Social Services were notified and the children were sent to live with their mother and her boyfriend, Joe. Julia goes to the hospital to demand Monty to take her home, but sees Social Services sending his children to live with Jennifer. Monty returns to his day job as a mechanic and finds the owner Willie has been injured in a robbery. Willie offers to sell the shop to Monty for a $10,000 deposit. Monty later goes to Julia for help, which she does during the court case.Julia finishes Monty’s case preparation and discovering it is her 32nd birthday, takes her to his favorite jazz club, where they dance. As they are traveling home, Julia kisses Monty and asks him to spend the night. Monty is willing but Julia is too drunk and vomits in the bathroom. Julia changes her mind and tells Monty to go home. Over the next few weeks, Julia begins to feel confused. She goes to Monty's apartment to meet his daughters during his visitation right. When they're at the aquarium, Julia sees one of her friends there and gets reminded that she has to be conscious of decisions which impact her career. Monty overhears Julia’s friend and is hurt.At the child custody hearing, Julia argues that it would be in the children's best interest for Monty to be awarded custody. Jennifer’s lawyer says that Monty is irresponsible due to an earlier conviction of statutory rape. Julia feels betrayed because she didn’t hear this information from Monty earlier; she leaves, telling Monty that custody will be awarded to Jennifer. At 3:00 am, Monty's daughters arrive at his house and inform him that Joe has abused them, proving it by revealing that China's back is bruised. Monty drives away and crashes into Jennifer and Joe's car, after which he physically assaults Joe and a crowd gathers. Joe's thugs arrive and begin to attack Monty, but the crowd defends Monty against them. Julia sees a report on the incident, in which Monty is identified as having been \"falsely convicted\" of rape.Jennifer and Joe are facing drug charges in court, because cocaine and marijuana was found in Joe's car and house, while Monty is to be charged with assault. Julia represents Monty, apologizing for not hearing his side of the story. The witnesses testify against Joe but refuse to testify against Monty, so Jennifer and Joe are jailed without bail while the case against Monty is dropped. Monty tells Julia that he loves her. His daughters greet him and Julia at the auto shop that now bears his name. Monty and Julia kiss, and the neighbors celebrate Monty's success.","language":"English","Reception":"The film opened at #5 on Valentine's Day 2007 behind Ghost Rider, Bridge to Terabithia, Norbit's second weekend, and Music and Lyrics,[2] and has grossed $31,609,243 worldwide, making it Tyler Perry's lowest-grossing film.The film received generally negative reviews from critics, earning a 26% rating on Rotten Tomatoes. The site's critical consensus reads: \"Daddy's Little Girls boasts fine performances and a poignant message, but is ultimately let down by amateurish filmmaking\".[3]","box_office":"$31,609,243[1]","cinematography":"Toyomichi Kurita","production_company":"Lionsgate Tyler Perry Studios Reuben Cannon Productions","directed_by":"Tyler Perry","daddy's_little_girls":"Theatrical release poster","Soundtrack":"Atlantic Records released Music inspired by the film: Tyler Perry's Daddy's Little Girls, in stores and online on January 16, 2007. Among the highlights of the album is \"Family First,\" the first-ever recording by the Houston Family -- Whitney Houston, Dionne Warwick, and Cissy Houston. The song \"Can't let You Go\" by Anthony Hamilton is not on the soundtrack. Also, the song \"Beautiful\" by Meshell Ndegeocello is featured in the movie.","release_dates":"February 14, 2007 (2007-02-14)|||||","produced_by":"Tyler Perry Reuben Cannon","starring":"Gabrielle Union Idris Elba Louis Gossett, Jr. Tracee Ellis Ross Terri J. Vaughn Malinda Williams","running_time":"95 minutes","music_by":"Brian McKnight","edited_by":"Maysie Hoy","written_by":"Tyler Perry"}