{"based_on":"Beaches  by Iris Rainer Dart","country":"United States","distributed_by":"Buena Vista Pictures","Plot":"The story of two friends from different backgrounds, whose friendship spans more than 30 years through childhood, love, and tragedy: Cecilia Carol \"C.C.\" Bloom (Bette Midler), a New York actress and singer, and Hillary Whitney (Barbara Hershey), a San Francisco heiress and lawyer. The film begins with middle-aged C.C. receiving a note during a rehearsal for her upcoming Los Angeles concert. She leaves the rehearsal in a panic and tries frantically to travel to her friend's side. Unable to get a flight to San Francisco because of fog, she rents a car and drives overnight, reflecting on her life with Hillary.It is 1958, a rich little girl Hillary (Marcie Leeds) meets child performer C.C. (Mayim Bialik) under the boardwalk on the beach in Atlantic City, New Jersey. Hillary is lost and C.C. is hiding from her overbearing stage mother (Lainie Kazan). They become fast friends, growing up and bonding through letters of support to each other. A grown-up Hillary goes on to become a human rights lawyer, while C.C.'s singing career is not exactly taking off. They write to each other regularly and give updates on their lives. Hillary shows up at the New York City dive bar where C.C. is performing, their first meeting since Atlantic City. She moves in with C.C. and gets a job with the ACLU. C.C. is now performing singing telegrams, leading to a job offer from John (John Heard), the artistic director of the Falcon Players, after she sings his birthday telegram.A love triangle ensues as Hillary and John are instantly attracted to one another, leaving C.C. in the cold and feeling resentment toward her best friend. Matters are made worse when Hillary and John sleep together on the opening-night of C.C.'s first lead in an off-Broadway production. When Hillary returns home to care for her ailing father, the two friends resolve their issues about John, as John does not have romantic feelings for C.C. After her father passes away, Hillary spends time at her family beach house with lawyer Michael Essex (James Read), eventually marrying him. C.C. and John spend a lot of time together, start dating and eventually marry. Hillary and Michael travel to New York to see C.C. perform on Broadway, where she has become a star. When C.C. finds out that Hillary has stopped working as a lawyer, she accuses Hillary of giving up on her dreams. Hillary responds that C.C. has become no more than a \"pretentious, social climber\" who is obsessed with her career. After the argument, Hillary ignores C.C.'s letters, throwing herself into being a dutiful, but unchallenged, wife.John tells C.C. that her self-centeredness and obsession with her career has him feeling left behind and he asks for a divorce. Despite the separation, John tells her, 'I love you, I'll always love you. I just want to let go of us before us gets bad.' Upset at the thought of her marriage failing, C.C. turns to her mother, who lives in Miami Beach. Her mother tells her that she has given up a lot for her daughter, and C.C. starts to understand when her mother tells her the effect that her selfishness has had on those closest to her. Meanwhile, Hillary returns home from a trip earlier than expected to find her husband having breakfast with another woman, both wearing pajamas. When Hillary learns that C.C. is performing in San Francisco, she makes contact for the first time in years. They learn of each other's divorces, then discover that they have been secretly jealous of each other for years: Hillary is upset that she has none of the talent or charisma that C.C. is noted for, while C.C. admits she has always been envious of Hillary's beauty and intelligence. The two then realize that their feud could have been avoided by honest communication.Hillary tells C.C. that she is pregnant and that she has already decided to keep the baby and raise the child as a single parent, a decision that wins her much admiration from the feisty and independent C.C., who promises she will stay and help her out. C.C. even starts talking of settling down and having a family of her own, having become engaged to Hillary's obstetrician. However, when C.C.'s agent calls with the perfect comeback gig for her, C.C. quickly abandons her fiancé and any notions of the domestic life and races back to New York City, discovering that the comeback gig is at her ex-husband John's theater, bringing her full circle to where she began her theatrical career. Hillary eventually gives birth to a daughter, whom she names Victoria Cecilia (Grace Johnston). When Victoria is a young girl, Hillary finds herself easily exhausted and breathless, a state she attributes to her busy schedule as a mother and a lawyer. When she collapses while at court she is diagnosed with viral cardiomyopathy, requiring a heart transplant if she is to live. Having a rare tissue type, she realizes she will most likely die before a heart is found.In the meantime C.C. has become a big star, having won a Tony award and completed her latest hit album. When she learns of Hilary's illness she agrees to accompany Hillary and Victoria to the beach house for the summer. Hillary becomes depressed due to her debilitated state and inadvertently takes her frustration out on C.C. who she sees having fun with and connecting with Victoria. Hillary eventually begins to accept her prognosis bravely, appreciating her time with Victoria and C.C. Hillary and Victoria return to San Francisco, while C.C. heads to Los Angeles for her concert. While Victoria is packing to travel to the concert, Hilary collapses, leading to the note C.C. receives at the start of the movie which prompted her overnight drive to San Francisco. C.C. takes Hillary and Victoria to the beach house. The two friends watch the sun setting over the beach, transitioning directly to a scene of C.C. and Victoria at a cemetery (all with C.C. singing \"Wind Beneath My Wings\" in the background). After the funeral, C.C. tells Victoria that her mother wanted her to live with her. C.C. admits that she is very selfish and has no idea what kind of a mother she will make, but also tells her: \"there's nothing in the world that I want more than to be with you\". She then takes Victoria into her arms and the two console each other in their grief. C.C. goes forward with her concert, and after the show, she leaves hand-in-hand with Victoria, and begins telling stories of when she first met her mother. C.C.'s and Victoria's voices fade as we hear the younger C.C. and Hillary from 1958: \"Be sure to keep in touch, C.C., OK?\" \"Well sure, we're friends aren't we?\" The film ends with a young C.C. and Hillary taking pictures together, in a photo booth, on the day they first met.","Accolades":"Included on the soundtrack was Midler's performance of \"Wind Beneath My Wings\", which became an immediate smash hit. The song went on to win Grammys for Record of the Year and Song of the Year in 1990.It was nominated for the Academy Award for Best Art Direction (Albert Brenner and Garrett Lewis).[3]","language":"English","Stage adaptation":"A musical stage adaptation has been written, based on the book by Iris Rainer Dart, with lyrics and book by Dart and Thom Thomas (book) and music by David Austin. The musical premiered at the Signature Theatre, Arlington, Virginia in February 2014. The musical was directed by Eric D. Schaeffer, with Alysha Umphress as Cee Cee Bloom and Mara Davi as Bertie White.[4][5]The musical next opened at the Drury Lane Theatre, Oakbrook, Illinois in June 2015 (previews). Again directed by Schaeffer, Shoshana Bean plays Cee Cee and Whitney Bashor plays Bertie.[6] The choreographer is Lorin Latarro, with scenic design by Derek McLane, lighting design by Howell Binkley, costume design by Alejo Vietti and sound design by Kai Harada.[7]","box_office":"$57 million","cinematography":"Dante Spinotti","production_company":"Touchstone Pictures Silver Screen Partners IV All Girl Productions","beaches":"Theatrical release poster","directed_by":"Garry Marshall","release_dates":"December 21, 1988 (1988-12-21)|||||","Box office":"The film took in $5,160,258 during its opening weekend beginning January 21, 1989. It grossed $57,041,866 domestically.[2]","produced_by":"Bonnie Bruckheimer Bette Midler Margaret South","starring":"Bette Midler|Barbara Hershey|Mayim Bialik|Marcie Leeds|","running_time":"123 minutes","music_by":"Georges Delerue","edited_by":"Richard Halsey","written_by":"Mary Agnes Donoghue","budget":"$20 million[1]"}