{"based_on":"characters created by David Seltzer","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Stanley Mann Mike Hodges","story_by":"Harvey Bernhard","DVD release":"The film was released as part of The Omen Quadrilogy set in the US and UK in 2000, and was not available separately until 2005. In 2006, to coincide with the DVD release of the remake of the original film, The Omen and its sequels were released individually and together in an ultimate Pentalogy boxset digitally remastered and with more bonus features. In 2008, it was released on Blu-ray with its predecessor and 1981 sequel, Omen III: The Final Conflict.","damien:_omen_ii":"Theatrical release poster","Plot":"A week after the burial of Robert and Katherine Thorn, archeologist Carl Bugenhagen (Leo McKern) learns of the survival of their adopted son Damien. Confiding to his friend Michael Morgan (Ian Hendry) that Damien is the Antichrist, Bugenhagen attempts to convince him to give Damien's guardian a box containing the means to kill Damien. As Morgan is unconvinced, Bugenhagen takes him to some local ruins to see the mural of Yigael's Wall, which was said to have been drawn by one who saw the Devil and had visions of the Antichrist as he would appear from birth to death. Though Morgan believes him upon seeing an ancient depiction of the Antichrist with Damien's face, both he and Bugenhagen are buried alive as the tunnel collapses on them.Seven years later, the 12-year old Damien (Jonathan Scott-Taylor) is living with his uncle, industrialist Richard Thorn (William Holden) and his wife, Ann (Lee Grant). Damien gets along well with his cousin Mark (Lucas Donat), Richard's son from his first marriage, with whom he is enrolled in a military academy. However, Damien is despised by Richard's aunt, Marion (Sylvia Sidney), who sees him as a bad influence on Mark. Though Marion threatens to cut Richard out of her will if he does not separate the two boys, she dies of a heart attack while visited by a raven in the dead of night. Soon after, through his friend and curator of the Thorn Museum, Dr. Charles Warren (Nicholas Pryor), Richard is introduced to journalist Joan Hart (Elizabeth Shephard). Hart was a colleague of Keith Jennings, the journalist decapitated seven years previously after befriending Robert Thorn to investigate the circumstances surrounding Damien's birth and adoption by the Thorns. Hart has pieced together the circumstances of Jennings' death after seeing Yigael's Wall. Though no one believes her, Joan believes she may have been mistaken about Damien until she sees his face at his school and drives off in a panic. On the road, after her car's engine mysteriously dies, Joan is attacked by the raven as it pecks out her eyes and then watches her get run over by a passing truck.At Thorn Industries, manager Paul Buher (Robert Foxworth) suggests expanding the company's operations into agriculture; however, the project is shelved by senior manager Bill Atherton (Lew Ayres), who calls Buher's intention of buying up land in the process immoral. At Mark's birthday, Buher introduces himself to Damien, invites him to see the plant, and also speaks of his approaching initiation. Buher seemingly makes up with Atherton, who drowns after falling through the ice at a hockey game on a frozen lake the following day. A shocked Richard leaves on vacation, leaving Buher to oversee the agriculture project in principle and returning to find that he initiated land purchases on his own.Meanwhile, at the academy, Damien's new commander, Sgt. Neff (Lance Henriksen), is revealed to be a secret Satanist like Buher as he takes the boy under his wing while advising him not to draw any attention to himself until the right moment. He also points him to the Biblical Revelation, chapter 13, telling Damien that, for him, the book is precisely that; a revelation. Damien reads the passage, discovering the 666 Mark of the Beast on his scalp. Learning his true nature he flees the Academy grounds in a terrified panic. Later, alerting Buher that he intends to tell Richard that some of the land they obtained was taken from people who were murdered after having refused to sell their land, Dr. David Pasarian (Allan Arbus) is killed when he and his assistant suffocate from toxic fumes during an industrial 'accident'. The incident injures Damien's class, who were visiting the plant at the time. When Damien alone is found to be unharmed by the fumes, a doctor (Meshach Taylor) suggests keeping him in the hospital as a precaution. The doctor discovers that Damien's marrow cells resemble that of a jackal; before he can investigate any further or report his findings, however, he is bifurcated by a falling elevator cable.Meanwhile, Bugenhagen's box has been found during an excavation of the ruins and delivered to the Thorn Museum. Dr. Warren opens it and finds the Seven Daggers of Megiddo, the only weapons able to kill Damien, along with a letter by Bugenhagen explaining that Damien is the Antichrist. Warren rushes to inform Richard, who angrily refuses to believe it as Warren leaves to see Yigael's Wall for himself. The next day, Richard confronts Ann with the letter, but she convinces him that it is preposterous. But matters worsen when Mark, who overheard Richard's altercation with Warren, confronts Damien. Reluctantly, and then proudly, admitting to being the Devil's son, Damien pleads with Mark to join him on his rise to power. But Mark's steadfast refusal forces Damien to kill Mark by causing an aneurysm in his cousin's brain. Shaken by his son's death, Richard goes to New York City to see a half-crazed Warren before being taken to the train station where Yigael's Wall is being stored in a cargo carrier. As a horrified Richard sees Damien's image, a switching locomotive impales Charles and crushes him against the carriage, destroying the wall and convincing Richard beyond doubt that Damien is the Antichrist. Upon his return, Richard has Damien picked up from his graduation at the academy while taking Ann to the museum. When they find the daggers in Warren's office in the Thorn Museum, Ann uses them to kill Richard, revealing herself to be a Satanist who \"always belonged to him\". Having heard the altercation from an outside corridor, Damien sets the room on fire, with Ann consumed in the flames. Damien then exits the burning museum and is picked up by the family driver, Murray, as the fire department arrives.","language":"English","Reception":"The film received mixed reviews. It has a 41% on Rotten Tomatoes.[5]","box_office":"$26,518,355[2]","cinematography":"Bill Butler Gilbert Taylor (Director of Photography: Israel Sequences)","directed_by":"Don Taylor","Soundtrack":"Unlike The Omen (and The Final Conflict), Jerry Goldsmith's score was recorded in the US, with the soundtrack album re-recorded in Britain for financial reasons. Lionel Newman conducted both the film and album versions; Varèse Sarabande later released an expanded CD including both, the liner notes of which explain the reasons behind the re-recording (a short lived union rule meant that musicians had to be paid the full amount for the film use AND album use if the soundtrack was released on LP, doubling their fee. It was cheaper, therefore, to re-record in the UK than pay the orchestra double in the US). The liner notes also explain that some of the soundtrack's pieces have been re-written slightly or even merged for the album re-recording. The audio quality of these UK recorded album tracks also sounds noticeably more dynamic. Some sections of the film's soundtrack - the tapes of which were thought lost for many years - were discovered to have warped in storage and have noticeable and uncorrectable flaws. (The film soundtrack is listed from track 11 onwards).","release_dates":"June 9, 1978","Production":"David Seltzer, who wrote the first film's screenplay, was asked by the producers to write the second. Seltzer refused as he had no interest in writing sequels. Years later, Seltzer commented that had he written the story for the second Omen, he would have set it the day after the first movie, with Damien a child living in The White House. With Seltzer turning down Omen II, producer Harvey Bernhard duly outlined the story himself, and Stanley Mann was hired to write the screenplay.After Bernhard had finished writing the story outline and was given the green light to start the production, the first person he contacted was Jerry Goldsmith because of the composer's busy schedule. Bernhard also felt that Goldsmith's music for The Omen was the highest point of that movie, and that without Goldsmith's music, the sequel would not be successful. Goldsmith's Omen II score uses similar motifs to his original Omen score, but for the most part, Goldsmith avoided re-using the same musical cues. In fact, the first movie's famous \"Ave Satani\" theme is used only partially, just before the closing credits begin. Goldsmith composed a largely different main title theme for Omen II, albeit one that utilises Latin phrases as \"Ave Satani\" had done. Goldsmith's Omen II score allows eerie choral effects and unusual electronic sound designs to take precedence over the piano and gothic chanting.Richard Donner, director of the first Omen movie, was not available to direct the second, as he was busy working on Superman. British film director Mike Hodges was hired to helm the movie. During production, the producers believed that Hodges' methods were too slow, and so they fired him and replaced him with Don Taylor, who had a reputation for finishing films on time and under budget. However, the few scenes Hodges directed (some of the footage at the factory and at the military academy, all of the early archaeology scenes, and the dinner where Aunt Marion shows her concern about Damien) remained in the completed film, for which Hodges retains a story credit. In recent interviews, Hodges has commented sanguinely on his experiences working on Omen II.Academy Award-winning veteran actor William Holden was considered to star as Robert Thorn in the first Omen, but turned it down as he did not want to star in a picture about the devil. Gregory Peck was selected as his replacement. The Omen went on to become a huge hit and Holden made sure he did not turn down the part of protagonist Richard Thorn in the sequel.[3] Lee Grant, another Oscar-winner, was a fan of the first Omen and accepted enthusiastically the role of Ann Thorn.Ray Berwick (1914–1990) trained and handled the crows used for several scenes in the film. Live birds and a crow-puppet were used for the attack on photojournalist Joan Hart. Berwick also trained the avian actors in Alfred Hitchcock's The Birds (1963).The movie was mainly set in Chicago and was largely filmed in downtown Chicago. The \"Thorn Industries\" building was actually Chicago's city hall. Another scene took place at Graceland Cemetery. Scenes set at a New York City freight area were also shot in Chicago, with the CBOT Tower and the Willis Tower visible in the background.Other locations included Lake Forest Academy's campus, which was used as the Thorn Mansion, the Northwestern Military and Naval Academy's Geneva Lake campus, which was used for the military academy, with real Geneva Lake students portraying most of the academy cadets, and the Murphy Estate on Catfish Lake in Eagle River, Wisconsin for the skating scene, with local children playing the skaters. The Thorn Museum aka Field Museum of Natural History was also used in several scenes throughout the film including some of the movie's final minutes.[4]","produced_by":"Harvey Bernhard","starring":"William Holden Lee Grant Jonathan Scott-Taylor","running_time":"107 minutes","music_by":"Jerry Goldsmith","edited_by":"Robert Brown","budget":"$6.8 million[1]"}