{"country":"United States","distributed_by":"Lionsgate Films","abduction":"Theatrical release poster","Plot":"Nathan Harper (Taylor Lautner) is an 18-year-old high school senior living in the suburbs of Pittsburgh, Pennsylvania with his parents Kevin (Jason Isaacs) and Mara (Maria Bello). He has been troubled by recurring nightmares and has been seeing psychiatrist Dr. Geraldine \"Geri\" Bennett (Sigourney Weaver) to diagnose them.Nathan is teamed with Karen Murphy (Lily Collins) for a school research project on missing children. Nathan discovers he looks very much like an age-progression photo of a missing child, Steven Price. He investigates further and finds other clues that suggest his parents are not his real mom and dad. When he approaches Mara about this, she reveals that she is not his real mother. She goes off crying to get his father to help her explain it all to him.Two men claiming to be from the Department of Juvenile Justice arrive at Nathan's home in the evening while Mara is on her way to get Kevin. Mara is suspicious and attacks the two, but is shot and killed by the intruders. Kevin is also killed, but not before subduing one agent, as well as yelling for Nathan to run. Nathan runs but returns for Karen, who is now captured by the remaining agent. Nathan overpowers the agent and rescues Karen, he attempts to find out who the man is, but is suddenly forced out of the house because a bomb planted there is about to detonate.The blast injures Karen, so Nathan takes her to the hospital and attempts to contact the police. His call is intercepted by CIA operative Frank Burton (Alfred Molina) who tells Nathan he is in danger and will send two men to collect him. Nathan is suspicious and while he is trying to make sense of it all, Dr. Bennett appears and helps him and Karen to escape. While driving away, Dr. Bennett explains that Nathan's biological father Martin (Dermot Mulroney) stole an encrypted list of 25 corrupt CIA operatives from the Serbian terrorist Nikola Kozlow (Michael Nyqvist): Kozlow now plans on abducting Nathan to coerce Martin to hand over the list. Nathan had been given to his adoptive parents to protect him. Kozlow used the website to claim Nathan as the missing child Steven Price in order to find him. Dr. Bennett gives Nathan the address of a safe house in Arlington, Virginia and tells him to trust only his biological father Martin and a man named Paul Rasmus. Kozlow's men follow them, but Bennett is able to help them escape. Meanwhile, Burton is warned by his superior to end the situation as soon as possible once he learns of the involvement of Bennett, who is revealed to be a former CIA operative.Arriving at the safehouse: the two obtain money, a gun, a photo of Nathan's biological mother Lorna Price (Elisabeth Röhm), and a cell phone. Karen tries to call her family, but her call is intercepted by Burton and the CIA forcing them to flee. Finding the address for his mother, the pair discover the address is a cemetery and that Lorna has died. Nathan and Karen visit her grave and find fresh flowers there, which according to the graveyard attendant, the sender is Paul Rasmus who lives in Nebraska. The two take an Amtrak passenger train to get there using fake IDs provided by their friend Gilly (Denzel Whitaker). En route they confess their feelings for each other and share a passionate kiss. They are unaware that they are followed by Kozlow's right-hand man who abducts Karen when she goes out for food. He leaves her bound and gagged with duct tape in a separate room, but she frees herself by using a piece of broken glass. Nathan fights the right-hand man and he throws him out the window. After the train stops the two make a run for it. Burton's team finds Kozlow's henchman and tracks them down.Burton explains the data that Martin had stolen and Nathan realizes that the phone from the safehouse contains that data and he surmises that Burton's name is on that list. As Burton tries to play that off, the agents are attacked by Kozlow's snipers. Nathan and Karen take off in a car before they can be caught. As they flee, the cell phone from Kozlow's man rings, the caller is Kozlow and he threatens to kill Karen's parents if Nathan does not hand over the data. Nathan gets Kozlow to agree to make the transaction at a Pittsburgh Pirates baseball game at their home stadium, the PNC Park.Nathan works with Gilly to obtain tickets and secures a gun to one of the seats with the intent to kill Kozlow. Martin calls Nathan and warns him off, but Nathan refuses to listen. When Kozlow arrives, Karen takes Kozlow's photo so Nathan can recognize him. The two meet and Kozlow tells Nathan how he killed his mother when Nathan was 3 after she refused to give up Martin's location. Kozlow grabs the gun from Nathan and demands the list, Nathan bolts and Kozlow gives chase, followed by CIA operatives who have seen them in the crowd. Nathan is able to escape and Kozlow is killed by Martin. Burton, his superior and his agents arrive. Burton asks for the cell phone, promising to give the decrypted results to his superior. However, Martin had warned his superior about Burton's corruption and takes the phone himself while Burton is taken into custody. Martin calls Nathan, apologizing for not being the father he should have been, Nathan asks him to show himself but Martin refuses. Bennett arrives with Karen and says she has arranged for Nathan to live with her until he decides what to pursue in his life. As the movie ends, Nathan and Karen go on a date in the empty PNC Park.","language":"English","Reception":"The review aggregator Rotten Tomatoes gave the film an approval rating of 4%, based on 102 reviews, with an average rating of 3.3/10. The site's critical consensus reads, \"A soulless and incompetent action/thriller that not even a veteran lead actor could save, let alone Taylor Lautner.\"[14] On Metacritic the film has a score of 25 out of 100, based on 20 critics, indicating \"generally unfavorable reviews\".[15]Kyle Smith of the New York Post said that \"actual abduction may be preferable to the movie of the same name, but only if your kidnappers don't torture you by forcing you to watch it\", adding that Lautner \"has the acting chops of Bert from Sesame Street.\"[16] R. Kurt Oselund of Slate Magazine was also critical of Lautner, saying that he \"can't carry a movie any more than Abigail Breslin can carry a refrigerator.\"[17] James Berardinelli gave the film one out of four stars, saying, \"For those who are indifferent to Lautner or who don't like him, the only way to survive Abduction is under the influence of a controlled substance, and even that may not be enough.\"[18] Catherine Brown of Filmink also gave the film a scathing review, saying that \"Singleton is poorly equipped to handle teenage angst, a fact made far worse by cringe-worthy dialogue and a wooden leading man who proves that he has not yet developed the skills required to carry a film.\"[19]A less critical review came from Owen Gleiberman of Entertainment Weekly, who gave the film a C, commenting that Lautner is \"not a terrible actor, but if he wants a career after the Twilight fades, he'll pick better films.\"[20] Likewise, Roger Moore of the Chicago Tribune gave the film two out of four stars, saying it \"falls in the same corner of the youth market as the Twilight movies. Some moments and many lines feel cribbed from that series.\"[21] Andrew Barker of Variety called the film \"a haggardly slapdash Bourne Identity knockoff, never rising above the level of basic competence.\"[22]Abduction opened in 3,118 theaters in The United States and grossed $10,925,253, with an average of $3,504 per theater and ranking #4 at the box office. The film ultimately earned $28,087,155 domestically and $54,000,000 internationally for a total of $82,087,155, above its $35 million budget.[23]Taylor Lautner was nominated for a Golden Raspberry Award for Worst Actor for his role in the film (also for The Twilight Saga: Breaking Dawn - Part 1), but lost to Adam Sandler for both Jack and Jill and Just Go with It.[24] The film received two nominations for the Teen Choice Awards for Choice Action Movie and Choice Action Actor for Taylor Lautner and subsequently won both.[25]","box_office":"$82.1 million[3]","cinematography":"Peter Menzies Jr.","production_company":"Vertigo Entertainment Quick Six Entertainment","directed_by":"John Singleton","Home media":"Abduction was released on North American DVD and Blu-ray on January 17, 2012.[26]","release_dates":"August 23, 2011 (2011-08-23) (Sydney premiere)|September 23, 2011 (2011-09-23) (United States)||||","Production":"Lionsgate Films bought screenwriter Shawn Christensen's spec script for Abduction in February 2010, with actor Taylor Lautner attached to the film.[6] The studio won a bidding war for the screenplay, acquiring it for $1 million.[7] Gotham Group and Vertigo Entertainment had developed the script, based on a story idea by Gotham's Jeremy Bell.[8]Lionsgate rushed to start principal photography in July, due to Lautner's schedule to begin work on the last two Twilight films for Summit Entertainment. Writer Jeffrey Nachmanoff was hired to work on the screenplay, and John Singleton signed on to direct in March.[6] Ellen Goldsmith-Vein, Lee Stollman, Roy Lee, and Doug Davison produced the film, and Jeremy Bell and Gabriel Mason executive produced.[8] Lautner's father, Dan Lautner, also produced, the first film from their Tailor Made Entertainment label.[9]On a budget of $35 million,[2] principal photography began on July 12, 2010 in the Pittsburgh, Pennsylvania area.[10] Lionsgate returned to the region due to tax benefits from Pennsylvania's tax credit program, after filming My Bloody Valentine 3D, Warrior, and The Next Three Days there in 2008 and 2009.[11] An open casting call for extras held at Carnegie Mellon University drew over 900 people in June, many of whom were teenage fans of the Twilight film series.[12]Many of the film's scenes were shot in suburban Mount Lebanon, and some others in Forward Township.[10] Scenes were shot at Hampton High School in Hampton Township, a suburb north of Pittsburgh. The school's name and mascot, the Talbot, appeared in the film, as did real students, cheerleaders, and the marching band. Production continued in Pittsburgh, Mount Lebanon, Greensburg and Hampton Township, and lasted into September 2010.[13]","produced_by":"Doug Davison Ellen Goldsmith-Vein Lee Stollman Roy Lee Dan Lautner Patrick Crowley","starring":"Taylor Lautner Lily Collins Alfred Molina Jason Isaacs Maria Bello Sigourney Weaver Michael Nyqvist Dermot Mulroney","running_time":"105 minutes[1]","music_by":"Edward Shearmur","edited_by":"Bruce Cannon","written_by":"Shawn Christensen","budget":"$35 million[2]"}