{"Cast":"Additional voices by Melanie Abramoff, Jessica DiCicco, Benjamin Diskin, Dawnn Lewis, Megan Lovegren, Mary Elizabeth McGlynn, Jamie Simone, Roger Craig Smith, and Kari Wahlgren.","country":"United States South Korea","DVD Release":"The film was released on DVD, Blu-ray and Blu-ray 3D in the United States on June 2, 2015 as Back to the Jurassic.[5]","distributed_by":"Alchemy Clarius Entertainment CJ Entertainment Distribution Company Koch Media Eagle Films Signature Entertainment Tanweer Films","screenplay_by":"James Greco Zachary Rosenblatt Adam Beechen Jae Woo Park","story_by":"Yoon-suk Choi John Kafka","Plot":"Ernie Fitzpatrick (Pamela Adlon) is a daredevil kid who lives in Terra Dino with his best friend Max Santiago (Yuri Lowenthal) and his trouble-making sister Julia (Tara Strong) who likes to bust him. Ernie and Julia live with their mother Sue (Jane Lynch), who has been chosen as the mother of the year, but she is overprotective of them and often makes them leave notes. Ernie is told to go to the store after school to keep an eye on it, but he disobeys orders and goes with Max to the Terra Dino Museum to sneak into a forbidden part of the area still under construction to see the bones of the ferocious Sarcosuchus. But Julia enters as well and uses a quarter from Ernie to set off the alarm. Julia is able to escape but Ernie and Max get caught by the guards, and Sue grounds Ernie for three weeks. When Ernie finds out Julia did it, he gets sick and tired of how he never gets his own way, but he decides to get his revenge by sneaking out again, but Julia discovers this and follows.Max's punishment is helping out in the garage for a month with his father Dr. Santiago (Fred Tatasciore), an inventor who works on a time machine, which has not been working for four years. While Ernie and Max admire it, Julia reveals herself and threatens to call Sue, but Ernie tries to stop her, which results in him spilling soda on the control panel of the time machine, activating it and sends the kids back in time 65 million years ago, to the time of the dinosaurs.When they emerge, they find a friendly Tyrannosaurus named Tyra (Melanie Griffith), who takes them in as her own. She also runs the orphanage for the dinosaurs without parents, and one of them is Dodger (Rob Schneider), who quickly befriends the kids, but the dinosaurs do not think that the kids can protect them from the evil Sarcosuchus Brothers, Sarco (William Baldwin) and Surly (Stephen Baldwin), who are in the Lower Valleys who plan to kill Tyra and take over the Upper Valley. Their three henchmen Morris (Nolan North), Borace (Tom Kenny) and Horace (John DiMaggio) find out about Tyra's \"newborn\" babies and report back to the brothers. However, because they mistake the time machine for a real egg, they have Morris and his gang go to steal it so they can lure Tyra to come into their lair, thinking she will be looking for it. Sue and Dr. Santiago discover their kids' disappearances and find out that Tyra's real egg switched places with the time machine.Ernie, wanting to explore the land before they can leave, hides the power key of the time machine and tells a lie that it's missing, so the kids sneak away from Tyra early in the morning to \"look\" for it, but they are accidentally sent into a river by the same dinosaur they befriended. He is able to help the kids dodge boulders during a surfing race, but the force of the water causes the power key to jump out of Ernie's pocket. The kids find out that the dinosaur can talk by repeating what they say, so Julia names the dinosaur Dodger because of how he dodged the boulders, and Tyra takes them back to the nest shortly after. Morris and his gang find the power key, and Horace swallows it. The kids and Dodger decide to have some fun while Ernie is still busy looking for the power key, and at the same time, Sue and Dr. Santiago start building their own time machine out of Sue's car.The next day, Tyra and the others find tracks from Morris and his gang, but they trick them by hiding behind a bush when Tyra starts following the tracks backwards, and they steal the time machine. When they get back, Ernie finds the power key and reveals he lied, angering Julia and Max when they find out the time machine is gone. But Ernie gets the idea to make a landmark that are actually instructions to powering the time machine. He'll write it on a place in Terra Dino so it'll be shown in the present time, and when their parents see it, they'll discover spilling soda on the controls powers the time machine. They decide to do it on Mystery Rock, the center of Terra Dino. But before Ernie and Dodger can do it, Julia is captured by Morris and his gang to lure Tyra to the Lower Valleys due to how the time machine did not lure her to their lair. Max hitches a ride by riding a Gallimimus to the Lower Valleys, and Ernie is able to get inside the caves by avoiding a fleet of Pterodactylus. Tyra confronts the Sarco Brothers and battles them by knocking them unconscious, and she, Max, and Julia try to escape before they wake up. Ernie ends up being chased by Morris and his gang and ends up running into a dead end. Before they can eat him, Dodger is able to scare them, and Morris and his gang fall into a tar pit.Meanwhile, the dinosaur egg from the past hatches in Dr. Santiago's house and it escapes and starts causing mayhem. Sue and Dr. Santiago chase it all over Terra Dino and lure it with hamburgers from the Burgersaurus restaurant. Their adventures make Sue realize how strict and overprotective she was of her kids and how she was wrong to not trust Ernie, but they still fail to activate the time machine. Sue figures out they have to spill soda on it after she sees the landmark and spilling it by accident. Ernie and the others reunite, but they end up getting lost and run into the Sarco Brothers again. Ernie throws his rocket-powered skateboard into Surly's mouth and activates it after Julia blinds him, with the ignition from the skateboard blowing Surly into the lava. Sarco goes for another attack but is stopped by Tyra, who is badly weakened. When Sue and Dr. Santiago arrive in the Lower Valleys, Tyra regains her strength and pushes Sarco in a tar pit. Sue thinks Tyra is an enemy, but Ernie and others tell her the truth. Before they leave, Dr. Santiago returns her real baby. They depart from the Upper Valleys.As they head back home, Ernie tells Sue that he did not write the landmark because he went to save Julia. Dodger is revealed to be the one who did it and he hitches a ride back to the present with his allies.","language":"English","cinematography":"Yoon-suk Choi John Kafka","production_company":"CJ Entertainment Myriad Pictures Toiion","directed_by":"Yoon-suk Choi John Kafka","release_dates":"November 30, 2012 (2012-11-30) (South Korea)|June 2, 2015 (2015-06-02) (United States)||||","dino_time":"Theatrical release poster","produced_by":"Robert Abramoff Joonbum Heo David Lovegren Jae Y. Moh Jae Woo Park Sharath Sury","starring":"Pamela Adlon Tara Strong Jane Lynch Yuri Lowenthal Fred Tatasciore Melanie Griffith Rob Schneider","running_time":"88 minutes","music_by":"Stephen Barton Loren Gold","edited_by":"David B. Baron Billy Jones","Release":"The film was released on 2012 in South Korea, Poland, Israel, Turkey and the USA, on 2013 in Russia, South Africa, Estonia, Kuwait, Bahrain, Lithuania, Italy, New Zealand and Mexico and on 2014 in Peru, Germany, Chile and Argentina. The film was slated to have a limited theatrical release beginning on December 7, 2012 in the United States, but it went unreleased. A trailer was released on October 30, 2012, paired with screenings of Hotel Transylvania.[1] This film was rated PG by the MPAA for \"some scary action and mild rude humor\".[2] It was released in Australia on August 3, 2013.[3] It finally saw an American release on June 2, 2015 under the title Back to the Jurassic only 10 days before the hugely successful Jurassic World film.[4]"}