{"based_on":"Yojimbo by Akira Kurosawa Ryuzo Kikushima (both uncredited)","Legal dispute":"The film was effectively an unofficial and unlicensed remake of Akira Kurosawa's 1961 film Yojimbo (written by Kurosawa and Ryuzo Kikushima), lifting traditional themes and character tropes usually typified within a Jidaigeki film. Kurosawa insisted that Leone had made \"a fine movie, but it was MY movie.\"[45] Leone ignored the resulting lawsuit, but eventually settled out of court, reportedly for 15% of the worldwide receipts of A Fistful of Dollars and over $100,000.[46][47]British critic Sir Christopher Frayling identifies three principal sources for A Fistful of Dollars: \"Partly derived from Kurosawa's samurai film Yojimbo, partly from Dashiell Hammett's novel Red Harvest (1929), but most of all from Carlo Goldoni's eighteenth-century play Servant of Two Masters.\"[48] Leone has cited these alternate sources in his defense. He claims a thematic debt, for both Fistful and Yojimbo, to Carlo Goldoni's Servant of Two Masters—the basic premise of the protagonist playing two camps against each other. Leone asserted that this rooted the origination of Fistful/Yojimbo in European, and specifically Italian, culture. The Servant of Two Masters plot can also be seen in Hammett's detective novel Red Harvest. The Continental Op hero of the novel is, significantly, a man without a name. Leone himself believed that Red Harvest had influenced Yojimbo: \"Kurosawa's Yojimbo was inspired by an American novel of the serie-noire so I was really taking the story back home again.\"[49]Leone also referenced numerous American Westerns in the film, most notably Shane[50] (1953) and My Darling Clementine (1946) which differs from Yojimbo.","country":"Italy|West Germany[4]|Spain[5]|","distributed_by":"Unidis (Italy) United Artists (US & UK)","story_by":"Adriano Bolzoni Víctor Andrés Catena Sergio Leone","Digital restoration":"In 2014, the film was digitally restored by Cineteca di Bologna and Unidis Jolly Film for its Blu-ray debut and 50th anniversary. Frame-by-frame digital restoration by Prasad Corporation removed dirt, tears, scratches and other defects.[51][52] The directorial credit for Leone, which replaced the \"Bob Robertson\" card years ago, has been retained, but otherwise, the original credits (with pseudonyms, including \"Dan Savio\" for Morricone) remain the same.","language":"Italian|English|","Release and reception":"A Fistful of Dollars was released in Italy in September 1964. Over the film's theatrical release, it grossed more than any other Italian film up to that point.[33] In January 1967 the film premièred in the United States grossing $4.5 million for the year.[33] It eventually grossed $14.5 million in its American release.[34] In 1969 it was re-released, earning $1.2 million in rentals.[35]When the film was released on the televised network ABC, a four and a half minute prologue was added to the film to contextualise the character and justify the violence. Written and directed by Monte Hellman, it featured an unidentified official (Harry Dean Stanton) offering the Man With No Name a chance at a pardon in exchange for cleaning up the mess in San Miguel. Close-ups of Eastwood's face from archival footage are inserted into the scene alongside Stanton's performance.[36][37] This prologue appeared on the Special Edition DVD and the more recent Blu-ray, along with an interview with Monte Hellman about its making.[38][39]Upon the film's American release in 1967, both Philip French and Bosley Crowther were unimpressed with the film itself. Critic Philip French of The Observer stated: \"The calculated sadism of the film would be offensive were it not for the neutralising laughter aroused by the ludicrousness of the whole exercise. If one didn't know the actual provenance of the film, one would guess that it was a private movie made by a group of rich European Western fans at a dude ranch... A Fistful of Dollars looks awful, has a flat dead soundtrack, and is totally devoid of human feeling.\"[40] Bosley Crowther of the The New York Times treated the film not as pastiche, but as camp-parody, stating that nearly every Western cliche could be found in this \"egregiously synthetic but engrossingly morbid, violent film\". He went on to patronise Eastwood's performance, stating: \"He is simply another fabrication of a personality, half cowboy and half gangster, going through the ritualistic postures and exercises of each... He is a morbid, amusing, campy fraud\".[41]However, in response to these immediate negative reviews, Howard Hughes, in his 2012 book 'Once upon a time in the Italian West', reflected by stating: \"American and British critics largely chose to ignore Fistful's release, few recognising its satirical humour or groundbreaking style, preferring to trash the shoddy production values...\".[42]The retrospective reception of A Fistful of Dollars has been much more positive, noting it as a hugely influential film in regards to the rejuvenation of the Western genre. The 67th Cannes Film Festival, held in 2014, celebrated the \"50th anniversary of the birth of the Spaghetti Western... by showing A Fistful of Dollars\".[43] Quentin Tarantino, prior to hosting the event, in a press-release described the film as \"the greatest achievement in the history of Cinema\".[43] A Fistful of Dollars has achieved a 98% freshness rating out of 43 critical reviews on Rotten Tomatoes, whilst being placed 8th on the site's 'Top 100 Westerns'.[44]","box_office":"$14.5 million","cinematography":"Massimo Dallamano Federico G. Larraya","production_company":"Jolly Film Constantin Film Ocean Films","directed_by":"Sergio Leone","a_fistful_of_dollars_(per_un_pugno_di_dollari)":"US film poster by Fred Otnes[1]","release_dates":"12 September 1964 (1964-09-12) (Italy)|||||","Development":"A Fistful of Dollars was at first intended by Leone to reinvent the western genre in Italy. In his opinion, the American westerns of the mid- to late-1950s had become stagnant, overly preachy and not believable. Despite the fact that even Hollywood began to gear down production of such films, Leone knew that there was still a significant market in Europe for westerns. He observed that Italian audiences laughed at the stock conventions of both American westerns and the pastiche work of Italian directors working behind pseudonyms. His approach was to take the grammar of Italian film and to transpose it into a western setting.Eastwood was not the first actor approached to play the main character. Originally, Sergio Leone intended Henry Fonda to play the \"Man with No Name.\"[10] However, the production company could not afford to employ a major Hollywood star. Next, Leone offered Charles Bronson the part. He, too, declined, arguing that the script was bad. Both Fonda and Bronson would later star in Leone's Once Upon a Time in the West (1968). Other actors who turned the role down were Henry Silva, Rory Calhoun, Tony Russel,[11] Steve Reeves, Ty Hardin, and James Coburn.[12][13][14][15] Leone then turned his attention to Richard Harrison, who had recently starred in the very first Italian western, Duello nel Texas. Harrison, however, had not been impressed with his experience on his previous film and refused. The producers later presented a list of available, lesser-known American actors and asked Harrison for advice. Harrison suggested Eastwood, who he knew could play a cowboy convincingly.[16] Harrison later stated, \"Maybe my greatest contribution to cinema was not doing A Fistful of Dollars and recommending Clint for the part.\"[17] Eastwood later spoke about transitioning from a television western to A Fistful of Dollars: \"In Rawhide, I did get awfully tired of playing the conventional white hat...the hero who kisses old ladies and dogs and was kind to everybody. I decided it was time to be an anti-hero.\"[18]A Fistful of Dollars was an Italian/German/Spanish co-production, so there was a significant language barrier on set. Leone did not speak English,[19] and Eastwood communicated with the Italian cast and crew mostly through stuntman Benito Stefanelli, who also acted as an unlicensed interpreter for the production and would later appear in Leone's other pictures. Similar to other Italian films shot at the time, all footage was filmed silent, and the dialogue and sound effects were dubbed over in post-production.[20] For the Italian version of the film, Eastwood was dubbed by stage and screen actor Enrico Maria Salerno, whose 'sinister' rendition of the Man With No Name's voice contrasted with Eastwood's cocksure and darkly humorous interpretation.[21]","running_time":"99 minutes","budget":"$200,000–$225,000[6]","screenplay_by":"Víctor Andrés Catena Jamie Comas Gil Fernando Di Leo Sergio Leone Duccio Tessari Tonino Valerii[2] English Version: Robert Lowell Clint Eastwood[3]","Plot":"A stranger arrives at the little Mexican border town of San Miguel. Silvanito, the town's innkeeper, tells the Stranger about a feud between two families vying to gain control of the town: on the one side, the Rojo brothers: Don Miguel, Esteban and Ramón; on the other, the family of the town sheriff, John Baxter. The Stranger decides to play each family against the other in order to make money, and proves his speed and accuracy with his gun to both sides by shooting the four men who teased him as he entered town with ease.The Stranger seizes his opportunity when he sees the Rojos massacre a detachment of Mexican soldiers who were escorting a shipment of gold. The Stranger takes two of the dead bodies to a nearby cemetery and sells information to both sides, saying that two Mexican soldiers survived the attack. Both sides race to the cemetery, the Baxters to get the \"survivors\" to testify against the Rojos, the Rojos to silence them. The factions engage in a gunfight, with Ramón managing to \"kill\" the \"survivors\" and Esteban capturing John Baxter's son, Antonio.While the Rojos and the Baxters are fighting, the Stranger searches the Rojo hacienda for the gold. While he is searching he accidentally knocks out a woman, Marisol. He takes her to the Baxters, who, in turn, arrange to return her to the Rojos in exchange for Antonio. During the exchange, Marisol's son runs to her, with her husband following. While the family embraces, Ramón orders one of his men, Rubio, to kill her husband as he has already told him to leave town. Silvanito attempts to protect the family with a shotgun, but is about to be killed himself when the Stranger backs him up, staring down Rubio. Neither Ramón nor any of his men attempt to challenge the Stranger, knowing that he is too fast on the draw.The Stranger then tells Marisol to go to Ramón and for her husband (Julián/Julio) to take their son (Jesús) home. Afterwards, the Stranger learns from Silvanito that Ramón had taken Marisol from her husband and forced her to live with him as his prisoner. That night, while the Rojos are celebrating, the Stranger rides out and frees Marisol, shooting the guards and wrecking the house in which she is being held in order to make it appear as though it were attacked by the Baxters. The Stranger gives Marisol, her husband, and their son some money and tells them to leave the town. When the Rojos discover that he freed Marisol, they capture the Stranger and torture him, but he escapes. Believing the Stranger to be protected by the Baxters, the Rojos set fire to the Baxter home and massacre the entire family as they run out of the burning building. Ramon kills John Baxter and Antonio after pretending to spare them. Consuelo, John Baxter's wife, appears and curses the Rojos for killing her husband and son, as they were unarmed. She is then shot and killed by Esteban.With help from Piripero, the local coffin-builder, the Stranger escapes town by hiding in a casket. The Stranger hides and convalesces in a nearby mine. When Piripero tells him Silvanito has been captured, the Stranger returns to town and faces the Rojos. With a steel chest-plate hidden beneath his poncho, he taunts Ramón to \"aim for the heart\" as Ramón's shots bounce off. Panicked, Ramón uses up all of the bullets in his Winchester. The Stranger shoots the rifle from Ramón's hand and kills the other Rojos standing nearby, including Don Miguel and Rubio. He then uses the last bullet in his gun to free Silvanito, who had been tied hanging from a post. The Stranger challenges Ramón to reload his rifle faster than he, the Stranger, can reload his pistol. The Stranger shoots and kills Ramón. Esteban Rojo aims at the Stranger from a nearby building, but is shot dead by Silvanito. The Stranger bids farewell and rides away from the town.","Visual style":"A Fistful of Dollars became the first film to exhibit Leone's famously distinctive style of visual direction. This was influenced by both John Ford's cinematic landscaping and the Japanese method of direction, perfected by Akira Kurosawa. Leone wanted an operatic feel to his western and so there are many examples of extreme close-ups on the faces of different characters that function like arias in a traditional opera. The rhythm, emotion and communication within scenes can be attributed to Leone’s meticulous framing of his close-ups.[22] This is quite different from Hollywood's use of close-ups which used them as reaction shots, usually to a line of dialogue that had just been spoken. Leone's close-ups are more akin to portraits, often lit with Renaissance-type lighting effects and are considered by some as pieces of design in their own right.[23]Eastwood was instrumental in creating the Man with No Name's distinctive visual style. He bought black jeans from a sport shop on Hollywood Boulevard, the hat came from a Santa Monica wardrobe firm, and the trademark cigars from a Beverly Hills store.[24] He also brought props from Rawhide including a Cobra-handled Colt, a gunbelt, and spurs.[25] The poncho was acquired in Spain.[26] It was Leone and costume designer Carlo Simi who decided on the Spanish poncho for the Man with No Name.[25] On the anniversary DVD for The Good, the Bad, and the Ugly, it was said that while Eastwood himself is a non-smoker, he felt that the foul taste of the cigar in his mouth put him in the right frame of mind for his character. Leone reportedly took to Eastwood's distinctive style quickly and commented that, \"More than an actor, I needed a mask, and Eastwood, at that time, only had two expressions: with hat and no hat.\"[27]Iginio Lardani created the film's title design.[28]","Soundtrack":"The film's music was written by Ennio Morricone, credited as Dan Savio.Leone requested Morricone to write a theme that would be similar to Dimitri Tiomkin’s El Degüello (used in Rio Bravo, 1959). Although the two themes are similar, Morricone states that he used a lullaby he had composed before and developed the theme from that. He adds that what makes the two themes similar is the execution, not the arrangement.[29]\"Some of the music was written before the film, which is unusual. Leone's films were made like that because he wanted the music to be an important part of it, and he often kept the scenes longer simply because he didn't want the music to end. That's why the films are so slow - because of the music.\"[30] Though not used in the completed film, Peter Tevis recorded lyrics to Morricone's theme for the film. As a movie tie-in to the American release, United Artists Records released a different set of lyrics to Morricone's theme called Restless One by Little Anthony and the Imperials.Tracks (2006 GDM version)[31]","produced_by":"Arrigo Colombo Giorgio Papi","starring":"Clint Eastwood Marianne Koch Gian Maria Volontè Wolfgang Lukschy Sieghardt Rupp Joseph Egger","music_by":"Ennio Morricone","edited_by":"Roberto Cinquini Alfonso Santacana"}