{"country":"South Korea","distributed_by":"Dong-a Exports Co. Ltd.","Background":"1988 was the year of the Seoul Olympics, and a time of great political and social change for South Korea. Massive street protests against the military government and on behalf of workers' rights had recently reached their peak. However the Korean society portrayed through cinema in those days little resembled the passions on display in the street. Government censors, wielding an iron grip over the film industry, ensured that the slightest hint of social criticism was clipped in the screenplay or in the editing room before reaching audiences.[3]Chilsu and Mansu seemingly depicts the hopes and aspiration of Korean youth in the late 1980s, when the country was gradually democratizing. However, as the film progresses, the film does not turn out to be what the audience intended and ends with a standoff between the protagonists and the establishment.[4]This movie was based on the short story \"Liang Ge Youqijiang\" written by Huang Chunming; it was uncredited because Huang's works were banned in South Korea at the time.[5]","revised_romanization":"Chilsuwa mansu","language":"Korean","hangul":"칠수와 만수","mccune–reischauer":"Ch‘ilsuwa mansu","cinematography":"You Young-gil","directed_by":"Park Kwang-su[1]","release_dates":"November 26, 1988 (1988-11-26)|||||","chilsu_and_mansu":"Poster for Chilsu and Mansu (1988)","produced_by":"Lee Woo-suk","starring":"Ahn Sung-ki Park Joong-hoon","running_time":"108 minutes","Summary":"The movie starts with an upbeat mood with the protagonist Chilsu falling in love with Jina. He appears very upbeat and excited about the changes going around him. Korea has begun to democratize and he has fallen in love with Jina. He is so elated that he decides to quit his job painting movie billboards to work with Mansu, telling his old boss that he has freedom of choice.In spite of this, things are not what they seem and the director gives out hints about this. First, the film begins with a civil defense drill, which is used by the government to condition citizens to deal with a North Korean attack and as a form of control to keep the populace on edge. Second, a newscast makes a vague reference to the working-class tale A Dwarf Launches a Little Ball in reporting about a man climbing down an apartment chimney to look for his wife. Finally, the biggest giveaway is that the characters are constantly in need of money while others are reaping the benefits of the economic and political changes at this time.Later in the movie, both characters are found to be downtrodden and have minjung (working class) connections. The optimistic Chilsu is from an area dependent on American soldiers for income. His worst problems stem from his sister being disowned for selling herself to American soldiers and his father is leeching off his new wife. Even worse is that Chilsu's sister has not spoken to his family and Jina leads him on the entire time, which means his dreams of emigrating and marrying Jina are a delusion. On the other hand, Mansu's problems stem from his father's affiliation with communists, which denies him an education and decent employment and is the root of his extreme pessimism.Their frustrations reach a climax when both characters confide their secrets to each other. As a result, they climb up to their just-completed billboard and vent their frustration at the \"rich bastards\" in downtown Seoul, which culminates with a tense standoff with authorities. Chilsu and Mansu's anger symbolizes the Korean working class's frustration of being marginalized from the Korean economic miracle and the standoff near the end represents society’s inability to understand their plight. As a whole, the film is engaging with its message of hope and the need to fight for change.[4]","music_by":"Kim Soo-chul","edited_by":"Kim Hyeon","Reception and Importance":"At the 42nd Locarno International Film Festival, it was the winner of the 2nd runner up prize for the Young Critic's Award. Also, it was presented during the 39th Berlin International Film Festival as well as the 3rd Singapore International Film Festival.[3]Contemporary audiences may look upon Chilsu and Mansu as a comparatively light-hitting political statement, but taken within the context of 1980s Korean cinema and society, it was a bold attempt to mix popular and political cinema. It was not a box-office hit, but in reflecting the frustrations of a generation growing up under social inequality and authoritarian rule, Chilsu and Mansu has become one of the best-remembered Korean films of its era.[3]This movie highlights the struggle of two men, Chilsu and Mansu, who are both painters without a stable job. The movie follows the daily pointless lives of these two men, joined by desperation and lack of employment. The film sends many messages to the viewer, of which the most poignant is the daily struggle of the common man in Korea in the 80's with no education. It reflects the hopelessness of the poor, as well as the outsider. This is shown by Chilsu's dream of immigrating to Miami as an escape from his world and a solution to his life, even though he has never been there. It is also shown by Mansu's inability to obtain stable work, due to his father's history of being a communist. This movie also express cultural imperialism by the West in Korea: Jina, who Chilsu loves works at Burger King; Mansu dresses up as a painter from France in order to impress the women; Chilsu wears a shirt resembling the American flag; and the billboard the 2 men paint is that of an advertisement for American whiskey.","written_by":"Choe In-seok Chi Sang-hak Lee Sang-woo"}