{"based_on":"The City of Ember  by Jeanne DuPrau","country":"United States","distributed_by":"20th Century Fox","Plot":"In the midst of an unspecified catastrophe, an underground city is constructed to shelter a large group of survivors, with secret instructions to future generations in a small box timed to open 200 years later. This box is entrusted to the mayor of the City of Ember. Each mayor, in turn, passes the box on to his or her successor. Over time, the significance of the box is forgotten, and the succession is broken when the seventh mayor dies before revealing the importance of the box. The box opens at the allotted time, but goes unnoticed. 41 years after the box opens, Ember's electric generator begins to fail, and the reserves of canned goods and light bulbs are depleted.At a rite of passage for all graduating students, Mayor Cole (Bill Murray) stands before the students as they choose their occupations by lottery. Protagonist Lina (Saoirse Ronan), who dreams of becoming a messenger, is assigned to be a \"Pipeworks Laborer\" under the technician Sul (Martin Landau), and her classmate Doon (Harry Treadaway), the son of Loris 'Barrow' Harrow (Tim Robbins), is assigned \"Messenger\"; whereupon the two secretly exchange assignments. At home, Lina finds the timed box, and enlists Doon's help to decipher its contents. Gradually, they learn that the document is a set of instructions toward an exit from the city; and later, discover that Mayor Cole has been hoarding canned food in a secret vault. When they report the theft, they are arrested and the mayor attempts to take the box from Lina; but a blackout allows Lina to escape. Now fugitives from the mayor's police, the pair obtain Poppy (Amy Quinn and Catherine Quinn), Lina's 4 year old sister, and escape with the help of Sul, along a subterranean river. Meanwhile, the Mayor turns against his accomplice Looper, and locks himself in his vault, only to be devoured by a gigantic mole. Lina, Doon, and Poppy reach the surface, where they witness the sunrise; and later tie a message of their discovery to a rock and drop it into the city, where it is found by Loris.","language":"English","Reception":"The film received mixed reviews from critics. Review aggregation website Rotten Tomatoes gives the film a score of 53% based on 124 reviews, with the site's consensus stating: \"City of Ember is visually arresting, and boasts a superb cast, but is sadly lacking in both action and adventure.\"[8] Metacritic gave the film a 58/100 rating indicating \"mixed or average reviews\", based on reviews from 27 critics.[9] Stephen Holden wrote in The New York Times that the \"talents of Saoirse Ronan, the brilliant young actress from Atonement\", were \"wasted in the science-fiction juvenilia of City of Ember\", though he added: \"Most of the time, however, it's a whiz-bang kid's film with neat gadgets and sound effects and an extended chase and escape sequence through underground rivers and tunnels. At only 95 minutes, the movie feels as though it had been shredded in the editing room... The best things about this are scenes of ominous grinding machinery of the kind found in railway yards, as well as several zany gadgets worthy of Rube Goldberg. The most witty is a primitive telephone-answering machine that resembles the do-it-yourself hi-fi kits assembled by audiophiles in the early days of stereo... Tim Robbins is also on hand as Doon's earnest, secretly rebellious father, who spends his days tinkering with exotic inventions... But not to worry: the boundless resourcefulness of two curious, clean-cut adolescents full of gee-whiz enthusiasm may lead humanity back into the fresh air and sunlight.\"[10] Justin Chang of Variety had similarly mixed feelings: \"A fabulously designed underground metropolis proves more involving than the teenagers running through its streets in City of Ember, a good-looking but no more than serviceable adaptation of Jeanne Duprau's 2003 novel. Director Gil Kenan's disappointing live-action follow-up to his enjoyable toon debut, Monster House, shows promising flickers of visual invention throughout, but the dramatic sparks fail to ignite in this simpleminded exercise in juvenile dystopia.\" Chang also observed that the characters represent \"English-speaking, predominantly Caucasian humanity.\"[11] Irv Slifkin for Video Business wrote, \"this lavishly designed adventure saga from director Gil Kenan... plays like Terry Gilliam's Brazil — for beginners\". He praised the \"secret escape plan hidden by Ember's founders\" and \"impressive technical work,\" concluding that there were \"drama and sometimes lethargic pacing, but there's enough here for middle- and high-school kids to think about and marvel over.\"[12] Cinema Blend's Editor in Chief, Katey Rich gave the film 2.5 of 5 stars and said, \"City of Ember belongs to one of the best and most enduring genres of children's films, in which smart kids stand up against the ignorant and aloof adult world and have a big adventure in the process. It also throws in a fantastical city, replete with whiz-bang inventions and secret societies. It's a mystery, then, that all the happy elements only add up to a big mush, a dull adventure and a contrived fantasy. Saiorsie [sic] Ronan is a fantastic heroine, but the story and the rest of the cast can't keep up with her lively pace.\" She added that \"director Gil Kenan seems hellbent on just driving the narrative forward. The movie clocks in at an acceptably short time for a kid's movie, but so much gets lost or glossed over along the way. Ember itself is fascinating, an intricately detailed set that, like Diagon Alley or the Star Wars cantina, you'd like to take a few hours to wander around in. But so many questions about the city are left unanswered... You get the feeling that Jeanne Duprau's book got into this stuff, while the movie never seems to have the time.\"[13] TV Guide was more forgiving with 3.5 out of 4 stars, pointing out, \"A fun and moving family film with a subtly dark feel rarely seen in kids' movies since the '80s, City of Ember succeeds despite its shortcomings, not only because of its fun and inspiring story, but because most of its flaws are things kids won't notice anyway... [T]he story spins into a classic fable; the ignorance that seemed so blissful shows it's just one half of a coin, where the other side holds apathy and hopelessness. The moral might well be lost on kids, but for adults, it's compelling -- all the more so because we like the good people of this dying city.\" This reviewer praised the \"series of exciting adventures\" and argued that \"Lina and Doon's vigilant sense of hope is, in the end, incredibly inspiring and extremely pertinent... It might be a staple theme in family films, but City of Ember is a useful reminder about the power of the human spirit to triumph where our own hopelessly broken systems have failed. It's a message that the filmmakers didn't take for granted -- and that hopefully viewers won't either.\"[14]On its opening weekend, the film opened poorly at #11 at the US box office with $3,129,473.[15] As of February 20, 2010, the film has grossed $17,929,684 worldwide, well below its $55 million budget.[1]Saoirse Ronan was nominated for a 2009 Irish Film and Television Award as \"Best Actress in a Lead Role in a Film\", and art director Jon Billington and production designer Martin Laing were nominated for Satellite Awards in 2008 for their design of the film, as was Ruth Myers for her costume design.[16]","box_office":"$17.9 million[1]","cinematography":"Xavier Pérez Grobet","production_company":"Walden Media Playtone","Marketing":"Walden Media hired Lucas Cruikshank to promote the movie in his internet series \"Fred\". The video was released Saturday, October 4, 2008 with an edited version of clips from the film, including \"Fred's\" face superimposed on the faces of characters from the trailer.","directed_by":"Gil Kenan","Home media":"The DVD was released on January 20, 2009 in a DVD-18 format with the widescreen version of the film on one side, and the full screen version on the other.It was released in 2009 on Blu-ray Disc in the United Kingdom, Australia, Germany, and France, all coded for Region B playback only, although the German release will also play on Region A players. No United States Blu-ray release has been announced, but a Region A Blu-ray was released in Hong Kong in 2010.","city_of_ember":"Theatrical release poster","Premiere":"At the AMC premiere of the film, its stars chatted about their feeling that the film was thematically appropriate for the times. As Mike Flaherty wrote:[6]At the after-party at meatpacking district eatery Vento,[7] the pic's baddie, Bill Murray, said, \"You can't help but feel that this film is speaking to you right now, when you really feel a little bit lost, a little abandoned.\" Added pic's Tim Robbins, who was joined by cast mates Martin Landau and Saoirse Ronan at the premiere: \"I just loved the script. It had such a good, optimistic spirit about it. It's fun to play against this bleak, dark world.\"","release_dates":"October 10, 2008 (2008-10-10)","Production":"In October 2004, Playtone partners Tom Hanks and Gary Goetzman paid in the mid-six figures[2] to purchase the film rights to Jeanne DuPrau's 2003 novel The City of Ember. They entered negotiations with Caroline Thompson to adapt the novel and Gil Kenan to direct the film. The deal includes an option on the sequel novel The People of Sparks.[3] Filming was scheduled to begin in early summer of 2007 and to wrap up in October of the same year,[4] a 16-week shooting process. A former paint hall in the shipyard of Harland and Wolff in Belfast's Titanic Quarter was converted into the post-apocalyptic city.[5]Few animals are shown; but the two nonhuman living creatures onscreen are related thematically to darkness and light: a giant moth (which seeks light) and a giant mole (subterranean and blind).","produced_by":"Seth Hanchett|Gary Goetzman|Tom Hanks|Steven Shareshian|","starring":"Saoirse Ronan|Harry Treadaway|Bill Murray|Martin Landau|Mary Kay Place|Toby Jones|Mackenzie Crook|Marianne Jean-Baptiste|Tim Robbins|","running_time":"90 minutes","music_by":"Andrew Lockington","edited_by":"Adam P. Scott Zach Staenberg","written_by":"Caroline Thompson","budget":"$55 million[1]"}