{"alexandra's_project":"Theatrical film poster","country":"Australia","distributed_by":"Palace Films 20th Century Fox Home Entertainment","Plot":"Upon returning home from work on his birthday, Steve—a middle class husband and father of two—finds the house dark and his family not home. He notices a chair, his television set, and a video tape obviously set out for his viewing. He turns the TV and VCR on, and begins to watch a tape made for him by his wife, Alexandra. The first clip shows his wife and children wishing him a happy birthday, but after the kids leave the room, Alexandra begins a striptease, and it appears to be nothing more than a birthday gift. As it progresses, however, it becomes clear that the tape is designed to humiliate and torture Steve for marital problems that Alexandra has been stewing about for years. As part of her show, Alexandra feigns breast cancer, has sex with their neighbor, and tells Steve that neither she nor their two children are ever coming home.[1]","language":"English","Reception":"Film review aggregator Rotten Tomatoes assessed the film at 50% on its tomatometer with an average 5.4/10 rating.[5] The Cultural Post gave it three out of five stars.[1]","box_office":"A$844,494 (Australia)","cinematography":"Ian Jones","production_company":"Vertigo Productions Pty. Ltd. The Australian Film Commission Fandango Australia Hendon Studios Palace Films The South Australian Film Corporation","directed_by":"Rolf de Heer","release_dates":"8 May 2003 (2003-05-08) (Australia)|||||","Production":"De Heer originally wanted to make the film so he could use a single location and use up various fragments of ideas he had accumulated.[2]","Box office":"Alexandra's Project took $844,494 at the box office in Australia[4] which is equivalent to $996,503 in 2009 dollars.","produced_by":"Rolf de Heer Domenico Procacci Julie Ryan","starring":"Gary Sweet Helen Buday","running_time":"103 minutes","music_by":"Graham Tardif","edited_by":"Tania Nehme","Release":"The film's World premiere was 14 February 2003 as part of the Berlin International Film Festival[3] and was released regularly as Cinema release on 8 May 2003 in Australia.","written_by":"Rolf de Heer"}