{"country":"United States","distributed_by":"Universal International","Background":"Julie Kirgo wrote that A Double Life is truly a picture of opposing forces, mirror images and deadly doubles: \"Anthony John is at war with Othello, the elegant world of the theater is opposed to the squalid existence of Shelley Winters' Pat Kroll, and illusion versus reality are all conveyed in opposing lights and darks of Krasner's luminous photography.\"[3]","Plot":"Celebrated stage actor Anthony John (Ronald Colman) has driven away his actress wife Brita (Signe Hasso) with his erratic temper. However, they star together in the play Othello. Gradually, his portrayal of a jealous murderer undermines his sanity, and he kills his mistress, Pat Kroll (Shelley Winters).","language":"English","Reception":"When the film was released, New York Times film critic Bosley Crowther lauded the film, writing, \"We have it on the very good authority of Ruth Gordon and Garson Kanin, who should know—they being not only actors and playwrights but wife and spouse—that what seems a fairly safe profession, acting, is as dangerous as they come and love between people of the theatre is an adventure fraught with infinite perils. Especially is it risky when an actor takes his work seriously and goes in for playing \"Othello.\" Then handkerchiefs and daggers rule his mind. At least, that is what is demonstrated in a rich, exciting, melodramatic way in the Kanin's own plushy production...George Cukor, in his direction, amply proves that he knows the theatre, its sights and sounds and brittle people.\"[4]Critic Jerry Renshaw wrote, \"A Double Life is an unusually intelligent, literate noir that is a classy departure from the pulpy \"B\" atmospherics often associated with the genre. Keep an eye out for Paddy Chayefsky and John Derek in minuscule bit parts.\"[5]Academy AwardsGolden Globes","a_double_life":"Theatrical release poster","box_office":"$1.7 million (US rentals)[1]","cinematography":"Milton R. Krasner","production_company":"Kanin Productions","directed_by":"George Cukor","release_dates":"December 25, 1947 (1947-12-25) (United States)|||||","produced_by":"Michael Kanin","starring":"Ronald Colman Signe Hasso Edmond O'Brien","running_time":"104 minutes","music_by":"Miklós Rózsa","edited_by":"Robert Parrish","written_by":"Ruth Gordon Garson Kanin"}