{"based_on":"A Dry White Season  by Andre Brink","country":"United States","distributed_by":"MGM/UA","screenplay_by":"Colin Welland Euzhan Palcy","Plot":"In 1976, in South Africa during apartheid, Ben Du Toit (Donald Sutherland) is a South African school teacher at a school for whites only. One day the son of his gardener, Gordon Ngubene (Winston Ntshona), gets beaten by the white police and gets caught by the police during a peacefully demonstration for a better education policy for blacks in South Africa. Gordon asks Ben for help. After Ben refuses to help because of his trust in the police, Gordon gets caught by the police as well and is tortured. Against the will of his family, Ben tries to find out more about the disappearance of his gardener by himself. Seeing the weakness and helplessness of the blacks, he decides to bring this incident up before a court with Ian McKenzie (Marlon Brando) as lawyer but loses. Afterwards, he continues to act by himself and supports a small group of blacks to interview others to find out what happened to Gordon.The white police notices their intentions and detains some responsible persons. They continue and (to increase their safety) hide the information at Ben's house. Ben lets his son in on his plans. His son and his daughter both get to know the hiding spots, and after the police searched through Ben's house earlier, there is an explosion next to the hiding spot because the daughter betrayed it to the police though the son saved the documents. Gordon's wife, Emily (Thoko Ntshinga) and children are captured as well. Ben's wife and daughter leave. The daughter offers her father to get the documents to a safer place.They meet at a restaurant and Ben gives her the fake documents, which she delivers to the police man. Instead of giving her the documents, Ben gave her a book about art. At the end, Ben is run over by the police man. The policeman is shot by a black assistant of Ben in revenge.","language":"English","Reception":"The film was released at a time when South Africa was undergoing great political upheaval and regular demonstrations.[5] The film itself was initially banned by South African censors, who said it could harm President F.W. de Klerk's attempts at apartheid reform. The ban was later lifted in September 1989 and the movie was screened at the Weekly Mail Film Festival in Johannesburg.[6]Brando's performance in the movie earned him an Academy Award nomination for Best Supporting Actor, and he received the Best Actor Award at the Tokyo Film Festival. For her outstanding cinematic achievement, Palcy received the \"Orson Welles Award\" in Los Angeles.A Dry White Season earned $3.8 million in the United States,[7][8] against a budget of $9 million.The film received mostly positive reviews from critics. Review aggregator Rotten Tomatoes reports that 81% of 31 critics have given the film a positive review, with a rating average of 6.9 out of 10.[9] Brando, in his first film since 1980,[5] was particularly praised for his small but key role as human rights attorney Ian Mackenzie.Chicago Sun-Times critic Roger Ebert called A Dry White Season \"an effective, emotional, angry, subtle movie.\"[5] The Washington Post's Rita Kempley wrote that \"A Dry White Season is political cinema so deeply felt it attains a moral grace. A bitter medicine, a painful reminder, it grieves for South Africa as it recounts the atrocities of apartheid. Yes, it is a story already told on a grander scale, but never with such fervor.\"[10] And Rolling Stone's Peter Travers wrote that director Palcy, \"a remarkable talent, has kept her undeniably powerful film ablaze with ferocity and feeling.\"[11]","box_office":"$3,766,879","cinematography":"Pierre-William Glenn Kelvin Pike","production_company":"Davros Films Sundance Productions","directed_by":"Euzhan Palcy","release_dates":"September 22, 1989","Production":"Before production, Warner Brothers passed on the project and it went to MGM.Director Euzhan Palcy was so passionate about creating an accurate portrayal on film that she traveled to Soweto undercover, posing as a recording artist, to research the riots.[2] Actor Brando was so moved by Palcy's commitment to social change that he came out of a self-imposed retirement to play the role of the human rights lawyer; he also agreed to work for union scale ($4,000), far below his usual fee. The salaries of Sutherland and Sarandon were also reduced and the film was budgeted at only $9 million.[3]The film was shot at Pinewood Studios, Buckinghamshire, England and on location in Zimbabwe.Dave Grusin composed the score that is mostly on the subtle side for the movie. There is no major theme here other than South African trumpeter Hugh Masekela’s mournful flugelhorn passages during the film’s saddest scenes. Kritzerland[4] released the soundtrack on CD, featuring 15 songs from the film’s soundtrack and four added \"bonus tracks\" (two alternate takes and two source cues). The CD of the soundtrack fails to mention contributing musicians, including Hugh Masekela, nor includes any of the three Ladysmith Black Mambazo songs (written by Joseph Tshabalala) used so prominently in the film.","a_dry_white_season":"Theatrical release poster","produced_by":"Paula Weinstein Tim Hampton Mary Selway","starring":"Donald Sutherland|Janet Suzman|Jürgen Prochnow|Zakes Mokae|Susan Sarandon|Marlon Brando|","running_time":"97 minutes","music_by":"Dave Grusin","edited_by":"Glenn Cunningham Sam O'Steen","budget":"$9 million"}