{"country":"France|Germany|","Awards and nominations":"The film was a critical and box office success, gaining wide play internationally as well. It was nominated for five Academy Awards:[15]In 2001, it won several awards at the European Film Awards, including the Best Film award. It also won the People's Choice Award at the Toronto International Film Festival and the Crystal Globe Award at the Karlovy Vary International Film Festival. In 2002, in France, it won the César Award for Best Film, Best Director, Best Music and Best Production Design. It was also awarded the French Syndicate of Cinema Critics's Prix Mélies (Best French Film) in the same year.The film was selected by The New York Times as one of \"The Best 1,000 Movies Ever Made\".[16] The film placed No. 2 in Empire magazine's \"The 100 Best Films of World Cinema\". Paste magazine ranked it second on its list of the 50 Best Movies of the Decade (2000–2009).[17]Entertainment Weekly named the film poster one of the best on its list of the top 25 film posters in the past 25 years.[18] It also named Amélie setting up a wild goose chase for her beloved Nino all through Paris as No. 9 on its list of top 25 Romantic Gestures.[19] In 2010, an online public poll by the American Cinematographer – the house journal of the American Society of Cinematographers – named Amélie the best shot film of the decade.[20]","distributed_by":"UGC-Fox Distribution","story_by":"Guillaume Laurant|Jean-Pierre Jeunet|","Legacy":"For the 2007 television show Pushing Daisies, a \"quirky fairy tale\", American Broadcasting Company (ABC) sought an Amélie feel, with the same chords of \"whimsy and spirit and magic\". Pushing Daisies creator Bryan Fuller said Amélie is his favorite film. \"All the things I love are represented in that movie\", he said. \"It's a movie that will make me cry based on kindness as opposed to sadness\". The New York Times' review of Pushing Daisies reported \"the Amélie influence on Pushing Daisies is everywhere\".[28]A species of frog was named Cochranella amelie. The scientist who named it said: \"[T]his new species of glass frog is for Amélie, protagonist of the extraordinary movie Le Fabuleux Destin d'Amélie Poulain; a film where little details play an important role in the achievement of joie de vivre; like the important role that glass frogs and all amphibians and reptiles play in the health of our planet\".[29] The species was described in the scientific journal Zootaxa[30] in an article entitled \"An enigmatic new species of Glassfrog (Amphibia: Anura: Centrolenidae) from the Amazonian Andean slopes of Ecuador\".[31]","language":"French","box_office":"$173.9 million[2]","cinematography":"Bruno Delbonnel","directed_by":"Jean-Pierre Jeunet","Home media":"The film has no overall worldwide distributor, but Blu-ray Discs have been released in Canada and Australia. The first release occurred in Canada in September 2008 by TVA Films. This version did not contain any English subtitles and received criticisms regarding picture quality.[26] In November 2009, an Australian release occurred. This time the version contained English subtitles and features no region coding.[27] Momentum Pictures released a Blu-ray in the UK on 17 October 2011. The film is also available in HD on iTunes and other digital download services.","narrated_by":"André Dussollier","Musical adaptation":"On 23 August 2013, composer Dan Messe, one of the founders and members of the band Hem, confirmed speculation that he would be writing the score for a musical adaptation of Amelie, collaborating with Craig Lucas and Nathan Tysen.[21][22] Messe also confirmed he would be composing all original music for the show and not using the Yann Tiersen score.[4] The musical adaptation premiered at the Berkeley Repertory Theater in August 2015.[23] It is scheduled to open on Broadway in 2017.[24]Jeunet distanced himself from the musical, saying he only sold the rights to raise funds for children's charity \"Mécénat Chirurgie Cardiaque (fr)\" (Cardiac Surgery Patronage).[25]","release_dates":"25 April 2001 (2001-04-25) (France)|16 August 2001 (2001-08-16) (Germany)||||","Production":"In his DVD commentary, Jeunet explains that he originally wrote the role of Amélie for the English actress Emily Watson; in the original draft, Amélie's father was an Englishman living in London. However, Watson's French was not strong, and when she became unavailable to shoot the film, owing to a conflict with the filming of Gosford Park, Jeunet rewrote the screenplay for a French actress. Audrey Tautou was the first actress he auditioned having seen her on the poster for Venus Beauty Institute.The movie was filmed mainly in Paris. The Café des 2 Moulins (15 Rue Lepic, Montmartre, Paris) where Amélie works is a real place.[5]The filmmakers made use of computer-generated imagery and a digital intermediate.[6] The studio scenes were filmed in the Coloneum Studio in Cologne (Germany). The film shares many of the themes in the plot with second half of the 1994 film Chungking Express.[7][8]","running_time":"123 minutes[1]","amélie":"French theatrical poster","Release":"The film was released in France, Belgium, and French-speaking western Switzerland in April 2001, with subsequent screenings at various film festivals followed by releases around the world. It received limited releases in North America, the United Kingdom, and Australasia later in 2001.Cannes Film Festival selector Gilles Jacob described Amélie as \"uninteresting\", and therefore it was not screened at the festival, although the version he viewed was an early cut without music. The absence of Amélie at the festival caused something of a controversy because of the warm welcome by the French media and audience in contrast with the reaction of the selector.[9]On Rotten Tomatoes, the film has an 89% \"Certified Fresh\" rating, based on 177 reviews, with an average rating of 8.1/10. The site's critical consensus reads, \"The feel-good Amélie is a lively, fanciful charmer, showcasing Audrey Tautou as its delightful heroine\".[10] On Metacritic, the film has a score of 69 out of 100, based on 31 critics, indicating \"generally favorable reviews\".[11]Alan Morrison from Empire Online gave Amélie five stars and called it \"one of the year’s best, with crossover potential along the lines of Cyrano De Bergerac and Il Postino. Given its quirky heart, it might well surpass them all.\"[12]Paul Tatara of CNN praised Amélie's playful nature. In his review, he wrote, \"Its whimsical, free-ranging nature is often enchanting; the first hour, in particular, is brimming with amiable, sardonic laughs.\"[13]The film was attacked by critic Serge Kaganski of Les Inrockuptibles for an unrealistic and picturesque vision of a bygone French society with few ethnic minorities.[14] Jeunet dismissed the criticism by pointing out that the photo collection contains pictures of people from numerous ethnic backgrounds, and that Jamel Debbouze, who plays Lucien, is of Moroccan descent.","budget":"$10 million[2]","screenplay_by":"Guillaume Laurant","Plot":"Amélie Poulain was raised by eccentric parents who – erroneously believing that she had a heart defect – decided to home school her. To cope with her loneliness, Amélie developed an active imagination and a mischievous personality. After her mother is killed when a suicidal Québecoise tourist jumped from a church roof and landed on her, her father's withdrawal from society worsens. Amélie eventually decides to leave home and becomes a waitress at the Café des 2 Moulins in Montmartre, which is staffed and frequented by a collection of eccentrics. Spurning romantic relationships after a few disappointing efforts, she finds contentment in simple pleasures and lets her imagination roam free.On 31 August 1997, startled by the news of the death of Princess Diana, Amélie drops a plastic perfume-stopper and accidentally discovers an old metal box of childhood memorabilia hidden by a boy who lived in her apartment decades earlier. Amélie resolves to track down the boy and return the box to him. She promises herself that if it makes him happy, she will devote her life to bringing happiness to others.After inquiring the apartment's concierge and several old tenants about the boy's identity, Amélie meets her reclusive neighbour, Raymond Dufayel, an artist with brittle bone disease who repaints Luncheon of the Boating Party by Pierre-Auguste Renoir every year. He correctly recalls the name as \"Bretodeau\". Amélie quickly finds the man and surreptitiously passes him the box. Moved to tears by the discovery and the memories it holds, Bretodeau resolves to reconcile with his estranged daughter and the grandson he has never met. Amélie happily embarks on her new mission.Amélie secretly executes complex schemes that affect the lives of those around her. She escorts a blind man to the Métro station, giving him a rich description of the street scenes he passes. She persuades her father to follow his dream of touring the world by stealing his garden gnome and having a flight attendant friend airmail pictures of it posing with landmarks from all over the world. She starts a romance between a middle-aged co-worker and one of the customers in the bar. She convinces Mrs. Wells that the husband who abandoned her had sent her a final conciliatory love letter just before his accidental death years before. She uses gaslighting tactics on Collignon, the nasty greengrocer. Mentally exhausted, Collignon no longer abuses his meek but good-natured assistant Lucien. A delighted Lucien takes charge at the grocery stand.Mr. Dufayel, having observed Amélie, begins a conversation with her about his painting, a copy of Luncheon of the Boating Party. Although he has copied the same painting 20 times, he has never quite captured the look of the girl drinking a glass of water. They discuss the meaning of this character, and over several conversations Amélie begins projecting her loneliness on to the image. Dufayel recognizes this, and uses the girl in the painting to push Amélie to examine her attraction to a quirky young man who collects the discarded photographs of strangers from passport photo booths. When Amélie bumps into the young man a second time, she realizes she is falling in love with him. He accidentally drops a photo album in the street. Amélie retrieves it.She discovers his name is Nino Quincampoix, and plays a cat-and-mouse game with him around Paris before returning his treasured album anonymously. After arranging a meeting at the 2 Moulins, Amélie panics and tries to deny her identity. Her co-worker, concerned for Amélie's well-being, screens Nino for her; a café patron's comment about this misleads Amélie to believe she has lost Nino to the co-worker. It takes Dufayel's insight to give her the courage to pursue Nino, resulting in a romantic night together and the beginning of a relationship, and Amélie finally finds happiness for herself.","Soundtrack":"The soundtrack to Amélie was composed by Yann Tiersen.","production_companies":"Canal+ France 3 Cinéma UGC UGC Fox Distribution","produced_by":"Jean-Marc Deschamps|Claudie Ossard|","starring":"Audrey Tautou|Mathieu Kassovitz|","music_by":"Yann Tiersen","edited_by":"Hervé Schneid"}