{"country":"United States","9_to_5":"Theatrical release poster","distributed_by":"20th Century Fox","Possible sequel":"In the 1980s Universal developed a sequel with Colin Higgins. Tom Mankiewicz worked on it for a while and says while Dolly Parton was enthusiastic, Jane Fonda was not and Higgins' heart was not in it.[15]In a TV interview broadcast on BBC1 in the UK in 2005, the movie's stars Fonda, Tomlin and Dolly Parton all expressed interest in starring in a sequel. Fonda said if the right script was written she would definitely do it, suggesting a suitable name for a 21st-century sequel would be 24/7. Parton suggested they had better hurry up before they reach retirement age. In the DVD commentary, the three reiterate their enthusiasm; Fonda suggests a sequel should cover outsourcing and they agree Frank Hart would have to return as their nemesis.","Plot":"Judy Bernly (Jane Fonda) is forced to find work after her husband, Dick (Lawrence Pressman), runs off with his secretary. Judy finds employment as a secretary at Consolidated Companies. The senior office supervisor, Violet Newstead (Lily Tomlin), introduces Judy to the company and staff, including mail room clerk Eddie, alcoholic Margaret Foster, the sleazy boss Franklin Hart, Jr. (Dabney Coleman), and Roz Keith (Elizabeth Wilson), Hart's executive assistant. Violet reveals to Judy that Hart is supposedly involved with his buxom secretary, Doralee Rhodes (Dolly Parton). Hart exploits and mistreats his female subordinates, with backstabbing and sexist remarks. He takes credit for Violet's ideas, cruelly yells at and threatens Judy on her first day after an equipment malfunction and sexually harasses Doralee, spreading rumors about an affair that never happened.When Violet discovers that a promotion she was hoping to receive was instead given to a man because of sexist hiring practices, she confronts Hart about it, as well as the rumors about Doralee (who enters Hart's office just in time to hear, and now realizes why she has become unpopular with the other secretaries). Violet storms off, stating that she needs a drink. Doralee takes Hart to task over his transgressions, informing him that she keeps a gun in her purse and will \"turn him from a rooster to a hen with one shot\" if his sexist behavior continues. She then also leaves, stating that she needs a drink.Judy, upset over the firing of Maria, a dedicated employee (due to an infraction overheard by Roz, who had been eavesdropping in the ladies' room), joins Violet and Doralee in storming out of the office, and the three women drown their sorrows at the local bar before retiring to Doralee's house to smoke a joint given to Violet by her teenage son. While there, the beginning of their friendship forms, and they share fantasies of getting revenge on Mr. Hart: Judy wants to hunt him down like an animal in a classic mobster scenario, Doralee wants to rope him like a steer in a Western scenario, and Violet wants to poison him in a twisted Snow White-style scenario.The following day, a mix-up leads Violet to accidentally spike Hart's coffee with rat poison. However, before he can drink the tainted coffee, Hart falls out of his desk chair and hits his head on the credenza desk, which knocks him out cold. On hearing he has been rushed to the hospital, Violet, thinking he is sick from the accidental poisoning, rushes to the hospital with Judy and Doralee in tow. At the hospital, Hart, who has regained consciousness, leaves on his own without being seen, and the three mistake a dead police witness for their boss, steal the dead body (to prevent an autopsy), stash it in the trunk, and drive off. Soon they discover they've stolen the wrong body, so they smuggle it back into the hospital.Hart turns up alive the next morning, much to the shock of Violet, Doralee, and Judy. During a break in the ladies' room, the three speculate on what could have happened, but ultimately decide to consider themselves lucky and simply forget the whole matter. However, Roz, hiding in one of the stalls, overhears them and relates the conversation to Hart. He confronts Doralee about the hospital incident and demands that she spend the night at his house, or he'll have all three of them prosecuted for attempted murder.The three kidnap him and bring him to his Tudor-style mansion, keeping him prisoner in his bedroom while they find a way to blackmail him. The three women discover an embezzlement scheme, and must keep Hart tied up at home while they collect evidence on it.The women use Hart's absence to effect numerous changes around the office, in his name: flexible hours, equal pay, a job-sharing program, and a daycare center. Hart is so hated around the office that nobody questions his absence, with the exception of Roz, whom Violet sends away for a multi-week training.Meanwhile, as Judy is guarding Mr. Hart, her husband Dick comes to ask her to come back to him. She refuses, forcefully throwing him out. Hart's adoring wife Missy (Marian Mercer) returns from vacation early, putting the women's plan in jeopardy. Hart manages to break free and return the stolen items back to the warehouse. Then he escorts the women to the office at gunpoint. Hart is appalled by the changes which have been made in his absence, but receives an unexpected visit from Russell Tinsworthy (Sterling Hayden), the Chairman of the Board, who has come to congratulate Hart for increases in productivity - but he wants the equal pay eliminated. Margaret Foster is no longer an alcoholic thanks to the company's alcohol rehab program and Maria is now back with the company on a part-time basis and sharing her workload with another employee. Tinsworthy is so impressed that he recruits Hart to work at Consolidated's Brazilian operation for the next few years. Roz returns from her training and is stunned to discover Violet, Judy, and Doralee celebrating in Hart's office.In the epilogue, it is revealed that Violet gets promoted to Hart's job, in which Roz must now answer to her; Judy falls in love and marries a Xerox representative; Doralee quits Consolidated and becomes a Country and Western singer; and Hart is abducted by Amazons in the Brazilian jungle and is never heard from again.","language":"English","Television series":"The movie inspired a sitcom version which aired from 1982 to 1983 and from 1986 to 1988. The show, which aired on ABC (1982–83) and in first run syndication (1986–88), featured Parton's younger sister, Rachel Dennison, in Parton's role, and Rita Moreno and Valerie Curtin took over Tomlin and Fonda's roles, respectively. In the second version of the show, Sally Struthers replaced Moreno. A total of 85 episodes were filmed.","box_office":"$103,290,500 (USA)[2]","2009 Broadway musical":"In an interview aired September 30, 2005 on Larry King Live, Parton revealed that she was writing the songs for a musical stage adaptation of the film.[11] A private reading of the musical took place on January 19, 2007[12] Further private presentations were held in New York City in summer 2007.In early March 2008, Center Theatre Group artistic director Michael Ritchie announced that 9 to 5 would have its pre-Broadway run at the Center's Ahmanson Theatre in Los Angeles beginning September 21, 2008, with Allison Janney starring as Violet, joined by Stephanie J. Block as Judy, Megan Hilty as Doralee, and Marc Kudisch as Franklin Hart, Jr. The book for 9 to 5: The Musical was written by Patricia Resnick, who co-authored the film. Andy Blankenbuehler choreographed the show, and Joe Mantello directed.[13]According to playbill.com, the musical opened on Broadway at the Marquis Theatre in previews on April 7, 2009, and officially on April 30, 2009.[14] However, due to low ticket sales and gross, the production closed on September 6, 2009. A National Tour began in September 2010. A UK tour has been arranged for 2012.","cinematography":"Reynaldo Villalobos","directed_by":"Colin Higgins","Filming locations":"The home of Franklin Hart is located at 10431 Bellagio Road in Bel-Air, Los Angeles. The Consolidated offices were presumably in the Pacific Financial Center located at 800 W 6th Street, at South Flower Street, Los Angeles, California 90017. Although the story appears to be set in Los Angeles, the opening credit montage, set to the title song, is mostly composed of shots from downtown San Francisco. These shots include an electric MUNI bus, the Market Street clock and a brief glimpse of the San Francisco twins, Marian and Vivian Brown.","release_dates":"December 19, 1980 (1980-12-19)","Production":"The movie was based on an idea of Jane Fonda, who had recently formed her own production company, IPC. Fonda:My ideas for films always come from things that I hear and perceive in my daily life... A very old friend of mine had started an organisation in Boston called 'Nine To Five', which was an association of women office workers. I heard them talking about their work and they had some great stories. And I've always been attracted to those 1940s films with three female stars.[6]Fonda says the film was at first going to be a drama, but \"any way we did it, it seemed too preachy, too much of a feminist line. I'd wanted to work with Lily [Tomlin] for some time, and it suddenly occurred to [her producing partner] Bruce and me that we should make it a comedy.\"[6] Patricia Resnick wrote the first draft drama, and Fonda cast herself, Lily Tomlin and Dolly Parton in the leads, the latter in her first film role.[7] Then Colin Higgins came on board to direct and rewrite the script. Part of his job was to make room for all three in the script. Higgins says Jane Fonda was a very encouraging producer, who allowed him to push back production while the script was being rewritten.[8][9]\"He's a very nice, quiet, low-key guy\", said Dolly of Higgins. \"I don't know what I would have done if I'd had one of those mean directors on my first film.\"[7]Higgins admitted \"he expected some tension\", from working with three stars, \"but they were totally professional, great fun and a joy to work with. I just wish everything would be as easy.\"[10]\"It remains a 'labour film', but I hope of a new kind, different from the Grapes of Wrath or Salt of the Earth\", says Fonda. \"We took out a lot of stuff that was filmed, even stuff the director, Colin Higgins, thought worked but which I asked to have taken out. I'm just super-sensitive to anything that smacks of the soapbox or lecturing the audience\".\"[6]Fonda says she did a deal of research for the movie, focusing on women who had begun work late in life due to divorce or being widowed.What I found was that secretaries know the work they do is important, is skilled, but they also know they're not treated with respect. They call themselves 'office wives'. They have to put gas in the boss's car, get his coffee, buy the presents for his wife and mistress. So when we came to do the film, we said to Colin (Higgins), ok, what you have to do is write a screenplay which shows you can run an office without a boss, but you can't run an office without the secretaries![6]","produced_by":"Bruce Gilbert","starring":"Jane Fonda Lily Tomlin Dolly Parton Dabney Coleman Marian Mercer Peggy Pope Elizabeth Wilson","running_time":"110 minutes","Theme song":"The movie's theme song, \"9 to 5\", written and recorded by Parton, became one of her biggest hits of the decade. While filming the movie, Dolly found she could use her long acrylic fingernails to simulate the sound of a typewriter. She wrote the song on set by clicking her nails together and forming the beat. The song went to number one for two weeks on the Billboard Hot 100, as well as the U.S. country singles charts, and was nominated for several awards, including the Academy Award for Best Song. It won the 1981 People's Choice Award for \"Favorite Motion Picture Song\", and two 1982 Grammy Awards: for \"Country Song of the Year\" and \"Female Country Vocal of the Year\" (it was nominated for four Grammys). Additionally, it was certified platinum by the RIAA.At the same time, newcomer Sheena Easton was enjoying her first major hit in the UK with a song also titled \"9 to 5\". With the success of Parton's song, and to avoid confusion, Easton's record company renamed her recording \"Morning Train (9 to 5)\" for its North American release.","music_by":"Charles Fox","edited_by":"Pembroke J. Herring","written_by":"Patricia Resnick Colin Higgins","budget":"$10 million[1]"}