{"based_on":"All You Need Is Kill  by Hiroshi Sakurazaka","country":"United States[2]","distributed_by":"Warner Bros. Pictures","screenplay_by":"Christopher McQuarrie|Jez Butterworth|John-Henry Butterworth|","Plot":"An extraterrestrial race called Mimics have taken over continental Europe. NATO allies form the United Defense Force to combat the invasion, but have only won one victory at Verdun. However, humanity has managed to hold the Mimics at the English Channel. In England, General Brigham, head of the UDF, orders Major William Cage, a public affairs officer with no combat experience, to cover Operation Downfall, the next day's massive amphibious assault on France. Cage objects to the dangerous assignment and threatens to put the blame on Brigham if the landing fails. Brigham, however, has Cage arrested and tasered when he escapes. He wakes handcuffed at a forward operating base at Heathrow Airport; he has been demoted to private, charged with desertion, and assigned to J Squad, under command of Master Sergeant Farell.The invasion proves to be disastrous to the humans, with many being killed instantly. Cage, despite his inexperience and incompetence, kills an unusually large Mimic, but dies covered with its blood. He wakes up and finds himself back at Heathrow the previous morning; none believe his story that he knows the invasion will fail. Cage repeats the loop of dying on the beach and waking at Heathrow over and over again. Finally, he encounters the famous Sergeant Rita Vrataski during the invasion. He tells her his abilities, and she tells him to locate her the next time he \"wakes up\"; they both perish in an explosion.Finding her again, Vrataski introduces Cage to Dr. Carter, a former government scientist and expert in Mimic biology. Carter explains that the Mimics are a hive mind; if an \"Alpha\" is killed, this causes time to be turned back a day by the Mimic hive queen, the \"Omega\", giving the Mimics a seemingly unbeatable advantage; Cage acquired this ability after being doused in its blood. Vrataski had herself gained this ability and became an effective killer of Mimics, but lost it after receiving a blood transfusion after being wounded. She tells Cage that they must hunt the \"Omega\", and destroy it.Over many time loops, Vrataski trains Cage to make him a more formidable soldier. Frustrated by his continued failures, he retreats to London, but discovers the Mimics will attack there after defeating the invasion force. After having a vision of the Omega in a dam in Switzerland, Cage and Vrataski spend many loops training to get to the mainland to the dam. Over the iterations, Cage comes to know Vrataski, who is humorless and only interested in killing Mimics. After they reach a point where she dies regardless, Cage decides to hunt the Omega alone. When he finally reaches the dam, he discovers that the Omega is not there. Realizing that the vision was a trap, Cage kills himself before an Alpha can bleed him out and prevent him from resetting the day.After commencing an alternative, Cage and Vrataski infiltrate the Ministry of Defense to obtain a prototype built by Carter that will allow Cage to see the Omega's true location. Cage finally persuades General Brigham to give him the device, though his men then try to capture them. During the pursuit they discover that the Omega is under the Louvre Pyramid in Paris, but are both injured. Cage is given a blood transfusion, which destroys his ability to reset time.After Vrataski frees Cage, they go to Heathrow and recruit J Squad to help destroy the Omega before the invasion begins. They fly to Paris, where the other soldiers sacrifice themselves to enable Cage and Vrataski to get beneath the Louvre. Just before Vrataski lures away an Alpha standing between them and the submerged Omega, she kisses Cage. The Alpha kills Vrataski and mortally wounds Cage, but he manages to throw down a belt of grenades, destroying the Omega and neutralizing all Mimics.The dying Cage floats down through the water into the Omega's blood. He awakens en route to his first meeting with Brigham. Brigham announces on TV that Mimic activity has ceased following a mysterious energy surge in Paris. Cage travels to Heathrow on his own, where others treat him with respect due to him being an officer. He finds Vrataski, who is as curt to him as in previous loops, to which he laughs.","language":"English","Reception":"Edge of Tomorrow received largely positive reviews from critics.[88] Critics praised the humor, the aliens' design, the performances of Cruise and Blunt, and the time-loop premise's ability to remain fresh. However, some critics had issues with the film's conclusion.[89] Based on 279 reviews, review aggregation website Rotten Tomatoes reports that 90% of critics gave the film a positive review, with a rating average of 7.5 out of 10. The website's critical consensus reads: \"Gripping, well-acted, funny, and clever, Edge of Tomorrow offers entertaining proof that Tom Cruise is still more than capable of shouldering the weight of a blockbuster action thriller.\"[90] Another aggregator Metacritic surveyed 43 critics and assessed 35 reviews as positive and eight as mixed, with none negative. Based on the reviews, it gave the film a score of 71 out of 100, which it said indicated \"generally favorable reviews\".[91]Justin Chang of Variety called Edge of Tomorrow \"a cleverly crafted and propulsively executed sci-fi thriller\", saying that the film was director Doug Liman's best since The Bourne Identity (2002). Chang said that the screenwriters, with the assistance of the editors, \"tell their story in a breezy narrative shorthand (and at times, sleight-of-hand), transforming what must surely be an unbelievably tedious gauntlet for our hero into a deft, playful and continually involving viewing experience\". Regarding the relationship between Cruise and Blunt's characters, Chang said \"Liman handles it with a pleasing lightness of touch that extends to the proceedings as a whole.\" He also commended the visual effects of the \"expertly designed Mimics\" as well as Dion Beebe's cinematography.[92]Todd McCarthy, writing for The Hollywood Reporter, said the film was \"a narratively ambitious sci-fi actioner\" that \"takes a relatively playful attitude toward the familiar battle tropes\". McCarthy said that, despite the humor, he found the time loop premise \"tedious\" and that \"the final stretch becomes dramatically unconvincing and visually murky\". However, he also called the effects \"exciting, convincing and gritty\" and applauded Gleeson and Paxton in their supporting roles.[93] Kenneth Turan of the Los Angeles Times gave the film a positive review, considering the film \"a star-driven mass-market entertainment that's smart, exciting and unexpected while not stinting on genre satisfactions\" that broke a string of \"cookie-cutter, been-there blockbusters\".[94]Edge of Tomorrow was listed on 23 critics' top ten lists (out of 201 evaluated).[95]The theatrical trailer for Edge of Tomorrow was nominated at the 15th Annual Golden Trailer Awards for Best Action and for Best Summer 2014 Blockbuster Trailer, but lost to The Hunger Games: Catching Fire and Godzilla, respectively.[96] The film also received nominations at the 2014 Teen Choice Awards for Best Action Film, Best Action Actor (Tom Cruise), and Best Action Actress (Emily Blunt), but lost to Divergent.[97] The Japanese government gave director Doug Liman the Annual Japan Cool Content Contribution Award, an accolade that recognizes creatives who popularize Japanese media for worldwide audiences.[98]Edge of Tomorrow was nominated for Critics' Choice Movie Awards in the following categories: Best Visual Effects, Best Action Movie, Best Actor in an Action Movie, and Best Actress in an Action Movie, with Blunt winning the latter.[99][100]","box_office":"$370.5 million[3]","cinematography":"Dion Beebe","edge_of_tomorrow":"Theatrical release poster","directed_by":"Doug Liman","production_companies":"Village Roadshow Pictures RatPac-Dune Entertainment 3 Arts Entertainment Viz Productions","Social commentary":"Emily Blunt plays Sergeant Rita Vrataski, a veteran who guides and trains Tom Cruise's character, Major William Cage. Blunt said of her role, \"In these male-fueled genres, it's usually the woman who's holding the hand of the guy and he's running through explosions leading her, and I wanted to be doing the leading.\"[103] Chris Nashawaty, reviewing the film for Entertainment Weekly, called it \"the most feminist summer action flick in years\".[104] Bustle's Alicia Lutes described Rita as \"ruthless and exacting in her takedown ... of a bunch of aliens\" and said: \"This is very much counter to the age-old ideals about ladies being the constant, delicate flowers of emotional heartstring-pulling.\" Lutes noted how Cage's strength depended on Rita's guidance, as \"she trains him, aids him, and protects him (and in turn the fate of humanity) time and time again.\"[105] Tasha Robinson, writing a piece in The Dissolve about \"strong female characters\" that lack real purpose in films, said that Rita in Edge of Tomorrow was an exception. Robinson acknowledged that Rita existed to support Cage in his trials, but believed that \"the story doesn't degrade, devalue, weaken, or dismiss her\".[106]In contrast, The Wire's Esther Zuckerman criticized the inclusion of a romantic relationship in the film, and said of the two characters' kiss: \"There's a case to be made that the kiss is simply an acceptance of their fate, but everything we know about Rita up until this point implies that she's a dedicated soldier, and making her a sudden romantic betrays her character.\" Zuckerman added: \"That's not to say she can't soften up a bit as humans do, but the moment reads less like she's accepting her humanity and more like the filmmakers had to acknowledge two attractive leads ... who should lock lips because that's what men and women do in movies.\"[107] Writing in The Week, Monika Bartyzel also criticized the romance in the film, stating that Rita is the one who kisses Cage, despite knowing him for only a day where he had known her for multiple days via time loop. Bartyzel said that Rita's portrayal was part of a commonly seen motif in which a female character helps a male \"Chosen One\" character, and that this was \"the new normal because it allows Hollywood to appeal to feminist concerns while continuing to feed male wish fulfillment\". Bartyzel said that Rita \"at her most powerful\" ultimately serves \"to make the male hero into a fighter like herself\".[108]Liman said that the film's repeated scenes intentionally paralleled the respawning feature in video games, where players have to start over on a level when their character dies.[46] In the afterword of All You Need Is Kill, author Hiroshi Sakurazaka notes his experience playing video games as a source of inspiration while writing the novel.[109] Salon's Ryan Leas said analyses of the film noted that it \"steals from the video game genre\". Leas called Edge of Tomorrow's looped action \"a meta-commentary on the blockbuster genre\", saying: \"It's a blockbuster interested in the question of how mind-numbing its genre has become to its viewers.\"[110] Comparing Edge of Tomorrow to film adaptations of video games, Wired's Angela Watercutter said Liman's film was more successful for basing itself around the medium's narrative structure, and for its \"ability to continue after 'Game Over' and discover something new\".[111]","release_dates":"May 28, 2014 (2014-05-28) (London IMAX)|June 6, 2014 (2014-06-06) (United States)||||","Production":"Edge of Tomorrow was co-produced by Warner Bros. and Village Roadshow Pictures, with the involvement of production companies 3 Arts Entertainment and Viz Productions, on a budget of $178 million.[6] The screenplay is adapted from the 2004 Japanese light novel All You Need Is Kill by Hiroshi Sakurazaka.[7]Viz Media published the novel in North America in 2009. After drawing the interest of producer Erwin Stoff,[8] his company 3 Arts Entertainment optioned the novel that same year. 3 Arts collaborated with the publisher's filmmaking subsidiary Viz Productions, headed by Jason Hoffs. Viz Media president Hidemi Fukuhara served as executive producer.[9][10] Instead of making a pitch to a major studio to purchase the property and proceed with writing and producing a film adaptation, the company developed a spec script to show the studios.[9] Stoff approached writer Dante Harper and sent him a copy of the novel. Harper found the book \"too complex\" to properly adapt, but, despite the prospect of not getting paid, he chose to \"risk it\" and accepted the job, taking eight months to write the script.[11] Upon completion, Warner Bros. purchased it in a $3 million deal in April 2010.[9] The studio hired Doug Liman to direct the film the following August.[7] Harper's screenplay was listed in the 2010 edition of The Black List, a survey of most-liked unproduced screenplays.[12]In June 2011, Joby Harold was hired to rework the screenplay.[13] By September, Warner approached Brad Pitt to star;[14] after he declined, the studio then approached Tom Cruise.[15] Once Cruise accepted, the script changed the age of the leading role to fit the actor's. In December 2011, Cruise officially joined the film.[16] Emily Blunt entered negotiations to star opposite Cruise in April 2012.[17] Screenwriting duo Roberto Orci and Alex Kurtzman also delivered a draft of their own.[18]Six months before filming started, Liman discarded two-thirds of Harper's original script. Jez Butterworth and John-Henry Butterworth were hired to rewrite the script. Screenwriter Simon Kinberg took over from the Butterworths, and eight weeks before the start of filming, he was replaced by Christopher McQuarrie.[19] McQuarrie was introduced to the project while directing Cruise in Jack Reacher. While reading the earlier script McQuarrie \"understood very clearly what the premise of the story was and what they were looking for in terms of characters\".[20] Even if the previous scripts were darker, Cruise stressed the importance of the story's humor to McQuarrie.[21] The actor compared Cage's violent demises to Wile E. Coyote and The Road Runner, declaring, \"It's fun coming up with new ways to kill yourself.\"[19]The screenplay did not yet have a satisfactory ending, and, despite the producers and studio executives worried about starting filming without a set conclusion, Liman opted to finish the script during principal photography.[19] McQuarrie at one point suggested adding a twist involving the Mimics figuring out Cage's attack on Paris and resetting time during his strike, but discarded it as \"you were so exhausted by the time you got to that point.\"[21] Eventually, McQuarrie considered that focusing on the comedic aspects meant \"it needed to end in a way that wasn't harsh\", and thus opted to end the plot where it started, on the helicopter bringing Cage to London, fulfilling the notion that \"comedies generally have to go back to the way things were\".[21]Production began at Leavesden Studios near London. Warner Bros. purchased Leavesden as a permanent studio site after previously renting space there for its production of the Harry Potter films.[22] Though Liman intended to film the beach battle on location, the studio instead had a beach set built at the studio site.[19] The set was surrounded by chroma key green screens, which the visual effects artists later used to extend the beach with plates shot at Saunton Sands in North Devon.[23] It was intended for the battle scenes to be reminiscent of coastal battles during World War II such as the Invasion of Normandy and the Battle of Dunkirk.[24]Principal photography began at Leavesden on October 1, 2012.[25] The Los Angeles Times said on the second day, Liman \"demanded a total reshoot of everything filmed on Day 1\", which concerned producers.[19] Filming on the beach set was scheduled to last two weeks, but extended to nearly three months due to what the Los Angeles Times called \"the director's self-described 'workshop-y' filming style\".[19] Filming also took place in Trafalgar Square in London on November 24, 2012. The square was closed to the public, and tanks were brought in to film the action scenes.[26] A former army base in the village of Barton Stacey in Hampshire, was also used as a filming location for two weeks.[27]Liman said filming took place seven days a week using two crews to film 20 days in addition to what had originally been scheduled. The crew struggled with changeable British weather since the film was supposed to be set in one day and had to maintain the same weather.[28] The indoor beach set also became muddy, requiring the effects artists to enhance the environment with digital sand and surf.[23][29] Though filming concluded by August 2013, actor Jeremy Piven was added to the cast and extra scenes including him were filmed;[30] ultimately, however, Piven did not appear in the finished film.[31] Cinematographer Dion Beebe made his first feature film with Liman, with whom he had worked previously on commercials. Beebe's approach was to develop \"a world under siege, but not a bleak, dark, post-apocalyptic landscape\";[32] Beebe preferred to avoid the saturated bleach bypass look. 35mm film was used instead of digital cameras to evoke the World War II footage that provided inspiration for the battle scenes.[32]Production designer Oliver Scholl and his team worked with lead builder Pierre Bohanna to develop concept art for several battle suit options based on contemporary, real-world powered exoskeleton initiatives, such as those supported by DARPA. When director Doug Liman chose a design, the team built an aluminum prototype frame that had pivot points and hinges. Costume designer Kate Hawley contributed a gritty aesthetic design for the color palettes and surface treatments. While the design was meant to be utilitarian, it was also created so the actors could be seen in the suits and also run in them. The team created a foam mock-up of Tom Cruise so the frame could be tailored for him. The team handcrafted 70 hard material and 50 soft material battle suits in the course of almost five months. There were three versions of the battle suits: \"grunts, dogs, and tanks\". The battle suit for Blunt's character had red slash marks sprayed on to reflect a Joan of Arc quality.[33]Cruise, known for performing his own film stunts, also did so in Edge of Tomorrow. Both he and Blunt wore the heavy metal suits.[34] The battle suits weighed 85 pounds (39 kg) on average. One of the heavier versions was around 130 pounds (59 kg) due to it being equipped with a mock sniper rifle and rocket launcher.[35] Blunt trained three months for her role, \"focusing on everything from weights to sprints to yoga, aerial wire work and gymnastics\", and studying the Israeli combat system Krav Maga.[35]Each actor needed four people to help put on the battle suit. Initially, Cruise needed 30 minutes to put on the suit and another 30 minutes to remove it. Ultimately, the time was reduced to 30 seconds.[33] Between takes, the actors would be suspended by chains from iron frames to take the weight of the suits off their shoulders.[36]Nine companies handled the visual effects for Edge of Tomorrow under VFX supervisor Nick Davis.[37] Davis worked with the crew of The Third Floor on the film's previsualization process. Sony Pictures Imageworks (SPI) worked on the first two acts of the film and created over 400 shots, including photorealistic environments, battle scenes, and computer-generated creatures and characters. One major shot involved covering London Heathrow Airport with military troops, vehicles, and aircraft; SPI split some of the work with RodeoFX. Cinesite joined late in the production and developed 221 shots for ten key sequences, with 189 appearing in the final cut.[29]Designers created the alien Mimics to look different from any terrestrial animal. Davis and Liman favored an early model composed primarily of tentacles. SPI's Dan Kramer described its appearance as \"heavy black spaghetti\" and noted that the modelers faced a challenge creating the tentacled creatures.[29] A technical animator created an Autodesk Maya plugin that made the movement of each tentacle independent.[38] Since Liman did not want the Mimics to look \"too organic or terrestrial\", Imageworks' artists devised the idea of making the aliens out of an obsidian-like material, \"basically a glass that could cut\".[39] Various debris was incorporated within the tentacles to give the creature a sense of weight and fast movement. The Alphas were given a definable head area to show their status as more sentient, while receiving a different color and a bigger size compared to the Mimic grunts.[39] Cinesite created the mechanical Mimics used in the training areas,[40] while MPC created the Omega in a digital environment into which the effects artists composited underwater footage filmed at Leavesden's water tank.[41]Animators created digital versions of the battle suits, at times with the soldiers inside them. On the set a 3D scanner booth digitized the actors, while hand scanners captured the textures of the practical suits. Imageworks received pieces of the suits for reference. The company's library of reflection data on various materials helped enhance the armor's shading.[39] SPI's crew created the base at Heathrow by merging the set at Leavesden with digitally altered footage from the airport; the film's drop ships, barracks and mess halls, replaced the existing aircraft.[29] Framestore created the digital Paris and recreated it with photomodeling from three days of visits. Given that the city is a no-fly zone, Framestore's artists obtained their aerial images by climbing an 80-meter crane parked in the Louvre courtyard.[39] The quadcopter dropships were based on the Bell Boeing V-22 Osprey that can tilt its rotors to fly as either planes or helicopters, while having a design closer to the Quad TiltRotor.[42] Aside from the crashed ship on the beachhead and a gimbal set to depict the plane used by Cage's squad, the film used digital models for most ships. The computer-generated dropships had some of Imageworks' heaviest detail given the proximity of the actors to the aircraft in the camp scenes; the effects artists wanted to make sure the ships broke apart in a realistic way during the crashes.[39]Prime Focus World converted the film into 3D in post-production using the same tools for the stereoscopy in World War Z and Gravity. The company made use of scans of the cast's faces from film production while vendor Nvizible helped the company convert the hologram table used by Dr. Carter.[39]Composer Christophe Beck was a late addition to the film, taking over from Ramin Djawadi, who was Liman's first choice to replace his frequent collaborator John Powell, as Powell was on sabbatical.[43] Edge of Tomorrow marked Beck's first science fiction film score.[44] To prepare, Beck watched the film with temp tracks, including one from the 2012 film Battleship. He experimented with repeating the music with the scenes, but because this approach did not frequently fit the events on the screen, Beck used minimal repetition in the film. \"The day is reset dozens of times in the film and it would get very repetitive to approach that musically the same way every time\", Beck recalled.[45] He initially tried for \"traditional heroic themes\" that involved horns and trumpets, but he said Liman \"preferred a non-traditional approach, driven by percussion and distorted orchestra\". To that end, Beck used the pizzicato playing technique, \"not in the traditional, plinky-plinky-isn't-this-funny way, but a little darker, and always accompanied by some higher concept synth colors\".[44] The distorted orchestral samples enhanced the comedic tone of the extended sequences where Cage recurrently dies in battle, as the director felt it was important for the audience to find humor in this sequence.[43] With Liman's approach, the composer said there were \"only a couple of traditional themes\" in the film, including one for Emily Blunt's character Rita.[45]","produced_by":"Erwin Stoff|Tom Lassally|Jeffrey Silver|Gregory Jacobs|Jason Hoffs|","starring":"Tom Cruise|Emily Blunt|Bill Paxton|Brendan Gleeson|","running_time":"113 minutes[1]","Sequel":"McQuarrie told Collider that Cruise had an idea for a sequel, and that the concept is \"locked and loaded\".[112] In April 2016 Doug Liman had signed on to direct the sequel, while screenwriters of Race, Joe Shrapnel and Anna Waterhouse will write the script for the film.[113]","music_by":"Christophe Beck","edited_by":"James Herbert|Laura Jennings|","Release":"\"I think the word 'kill' in a title is very tricky in today's world. I don't know that people want to be bombarded with that word. I don't know that people want to be opening the newspaper and seeing that word. We see it enough in kind of real newspaper headlines, and I don't think we need to see it when we're looking at a movie.\"Warner Bros. invested over $100 million in a marketing campaign for Edge of Tomorrow.[47] The film was initially titled All You Need Is Kill after the light novel. In July 2013, Warner Bros. changed the title to Edge of Tomorrow;[48] Warner Bros. president Sue Kroll said the title was changed partly due to \"negative chatter\" about the word \"kill\" in the title.[49] The film was promoted at Comic-Con in San Diego, California in July 2013,[48] and at WonderCon in Anaheim, California in April 2014.[36] Turner Broadcasting, a subsidiary of Time Warner like the studio Warner Bros., promoted the film across its TV properties, including CNN, TNT, TBS, Adult Swim, TruTV, and Funny or Die. Variety said the move \"put forth the notion that buying bigger packages of advertisements across a TV company's holdings is a viable option in an increasingly fragmented TV-viewing landscape\". Turner also launched a website which would unlock film-related content like \"a 3D game, back stories and artwork\" if its promotional hashtag was circulated enough through the social media website Twitter.[50]Viz Media released a new edition of the light novel on April 29, 2014, retitled Edge of Tomorrow.[51] It also published a graphic novel adaptation of the light novel on May 5, 2014.[52]For the film's release on home media, Warner Bros. formed two teams for a September 28, 2014, Tough Mudder endurance event series in Black Diamond, Washington.[53] The teams included YouTube personalities and participants from the TV series American Ninja Warrior. Warner Bros. based the teams on the soldiers from \"J Squad\" in the film. To promote teamwork, the two teams competed in a Tough Mudder obstacle course.[54]Weeks before the film's release, reports in early May 2014 predicted an underwhelming performance in the North American (United States and Canada) box office for Edge of Tomorrow.[6] Variety noted a \"worrisome lack of buzz\" leading up to the film's release.[49] Initial box office tracking at the start of the month for the film estimated a gross between $25 million and $30 million on its opening weekend.[55] Several weeks later, the estimate decreased by $5 million.[49] The film planned to compete with The Fault in Our Stars in the same opening weekend with an equivalent estimated gross around $25 million. The Wrap predicted that this competition could potentially impact the opening weekend gross of Edge of Tomorrow.[55] In contrast, Variety said Edge of Tomorrow could serve as counterprogramming to The Fault in Our Stars since that film's demographic is women under 25 years old.[49]With its budget of over $175 million, The Hollywood Reporter called Edge of Tomorrow, one of the \"biggest box-office risks\" in North America for mid-2014. The trade paper said the film was similar to Oblivion, a 2013 science fiction film that also starred Tom Cruise, and that like Oblivion, it would likely perform better outside North America.[56] Box Office Mojo reported that four of Cruise's films with original material—Valkyrie (2008), Knight and Day (2010), Jack Reacher (2012), and Oblivion (2013)—failed to gross more than $100 million in North America. The website forecast that Edge of Tomorrow would gross $90 million in North America and $220 million in other territories.[57] TheWrap said that the studio focused on theatrical releases in other territories where Cruise \"remains a major force\" in drawing audiences.[55] Variety, writing from the US perspective, said, \"Media reports have been quick to speculate that Edge of Tomorrow may be one of the summer's first big bombs based on the lack of enthusiasm by U.S. audiences. That may come to pass, but these reports downplay the centrality of foreign markets in today's globalized movie industry.\"[6]In the week prior to the release of Edge of Tomorrow in North America, its estimated opening-weekend gross increased from the mid-$20 million range to $27 million.[58]Edge of Tomorrow initiated its theatrical run in several territories on May 28, 2014, and rolled out to a total of 28 territories for its opening weekend of May 30–June 1, 2014.[6][59] It grossed $20.1 million on its opening weekend.[60] For the second weekend of June 6–8, 2014, it was released in 36 additional territories.[61] Edge of Tomorrow grossed $100.2 million in North America and $270.3 million in other territories for a worldwide total of $370.5 million.[3] After the film's theatrical run, Entertainment Weekly said it had a \"lukewarm box-office reception\" despite praise from critics.[62]The film had premiere screenings in London, Paris, and New York City on May 28, 2014. The cast and the crew mimicked the film's time loop premise by attending the premieres in a single day, traveling westward to attend them on a staggered schedule.[64] The film was screened in New York City at 11:59 pm, the time chosen to refer to the film title.[65] The film was released in theaters in 28 territories—including the United Kingdom, Brazil, Germany, Spain, and Indonesia—on the weekend of May 30, 2014.[6] Certain territories with strong association football followings were chosen so the film could screen to audiences before the month-long 2014 FIFA World Cup began on June 12, 2014. Edge of Tomorrow competed against Maleficent starring Angelina Jolie, which opened the same weekend in 46 territories.[6]On its opening weekend in 5,018 screens across 28 territories, Edge of Tomorrow grossed $20.1 million.[60] The Hollywood Reporter called the film's debut a \"soft\" opening. In many territories, Edge of Tomorrow ranked third behind fellow new release Maleficent and holdover X-Men: Days of Future Past. These included the United Kingdom, where the film ranked third and grossed $3.1 million, where Cruise's 2013 film Oblivion had opened with $7.6 million, and Germany, with an income of $2.1 million compared to Oblivion's $2.6 million. Edge of Tomorrow ranked first in Indonesia and Taiwan, grossing $2 million and $1.9 million, respectively.[66] Its opening weekend in 286 screens in Indonesia was Tom Cruise's biggest opening to date in the country.[60] The film also grossed $1.5 million in Italy and $1.5 million in Spain.[61] Deadline.com said the film had good word of mouth, citing significant increases in Saturday grosses compared to the Friday grosses in the United Kingdom, Germany, and Spain.[60] Bloomberg Businessweek reported that $110 million was grossed in the first week of release and summarized its debut, \"While it did solid business in Asia, its reception in Germany, France, and the U.K. has been tepid.\"[67]In the first week of June 2014, Edge of Tomorrow opened in 36 additional markets, including North America, China, Russia, South Korea and France. The film was now showing in 63 countries and 19,000 screens.[68] The film led the global weekend box office with $28.8 million in North America and $82 million elsewhere.[68] The debut in China occurred on Monday, June 2, to take advantage of the Dragon Boat Festival holiday.[69] Edge of Tomorrow topped the Chinese box office with $26.7 million,[70] encompassing 4.06 million admissions in 99,768 screenings.[71] Edge of Tomorrow's debut in both Russia ($8.6 million) and South Korea ($3.8 million, taking advantage of a five-day holiday) marked Tom Cruise's highest opening weekend in both countries.[72][73]Edge of Tomorrow was released in 3,490 theaters in North America on June 6, 2014.[74] The ticket service Fandango reported advance tickets surpassed Tom Cruise's previous film Oblivion, but were being overcome by the competing film The Fault in Our Stars.[75] Edge of Tomorrow grossed $28.8 million on the opening weekend, ranking it third below The Fault in Our Stars ($48 million) and Maleficent ($34.3 million).[76] Polling firm CinemaScore said 61% of the opening weekend audiences were male.[77] It reported that audiences overall gave Edge of Tomorrow a \"B+\" grade, where younger filmgoers gave \"A\" and \"A–\" grades.[78] The Los Angeles Times said the disappointing box office performances of non-franchise films Edge of Tomorrow and Blended, both produced and distributed by Warner Bros. Pictures, indicated risky investments by the studio, which had better success earlier in the year with franchise films The Lego Movie and Godzilla (2014).[79]In its second weekend of release in North America (June 13–15, 2014), Edge of Tomorrow had a \"light\" second-weekend drop of 43% due to word of mouth and grossed $16.5 million on the second weekend.[80] In the same weekend in territories outside North America, the film was on 14,725 screens. With approximately 5.1 million admissions, it grossed $37.3 million. China, Russia, and South Korea respectively had the film's largest weekend grosses among the territories.[81] In South Korea, the film ranked first at the box office for two consecutive weekends, grossing a total of $25.65 million by June 17, 2014.[82]In Japan, Edge of Tomorrow was released on July 4, 2014, under the light novel's title All You Need Is Kill.[83] The film opened second in the weekend rankings behind Maleficent, with an intake of $4.5 million.[84] As of November 30, 2014[update], with $15.3 million, Edge of Tomorrow is the sixth highest-grossing foreign movie of the year in Japan, and the 21st overall.[85]Edge of Tomorrow was released on DVD, Blu-ray Disc, and video on demand in the United States on October 7, 2014. The Blu-ray disc includes over 90 minutes of bonus features.[54] The home release's packaging downplays the original Edge of Tomorrow title in favor of placing more prominence on the film's original tagline, \"Live. Die. Repeat.\" Media critics believed that the re-branding was an attempt by Warner Bros. to re-launch the film's marketing following its lackluster U.S. box office performance. Posters for the film's theatrical release had similarly placed a larger emphasis on the \"Live. Die. Repeat.\" tagline than the actual title of the film.[5][86] Similarly, some digital retailers listed the film under the title Live Die Repeat: Edge of Tomorrow.[5] The film ranked first in home media sales for the week beginning October 7, with 62% of sales coming from the Blu-ray version.[87]","budget":"$178 million[3]"}