{"country":"United Kingdom","distributed_by":"Metro-Goldwyn-Mayer","captain_nemo_and_the_underwater_city":"Theatrical release poster","Plot":"Captain Nemo's submarine Nautilus rescues drowning passengers and takes them to an underwater city, Templemer (pronounced Temple-Meer) where they are told they will remain forever. The survivors include brothers Barnaby (Bill Fraser) and Swallow Bath (Kenneth Connor), Lomax (Allan Cuthbertson), Helena Beckett (Nanette Newman) and her son, and Senator Robert Fraser (Chuck Connors).Nemo takes them on a city scuba tour, but Lomax attempts to steal diving gear and escape but is caught. Fraser seems taken with a musical performance given by the city's swimming teacher Mala (Luciana Paluzzi), this noted by Joab, Nemo’s second in command (John Turner).Joab shows the Bath brothers how the city makes oxygen and fresh water and as a by-product gold, which is even thrown away. Joab advises them that no-one has ever escaped Templemer. Lomax sees the oxygen machine as a means to escape by rupturing the city's dome. Lomax attempts this but only manages to flood the machine’s control room killing Lomax in the process. During this episode, the Bath brothers sneak into the Forbidden Area where they discover a second submarine, the Nautilus II, and see it as a means of escape.Enlisting Fraser to aid them, Fraser learns how to operate the submarine. During training they ram and kill a vast Manta Ray-like creature accidentally created during the building of the city. Fraser tells Nemo he should leave as he is attempting to cut off the supply of weapons to the American Civil War. Nemo refuses but offers Fraser a position at Templemer. This alienates Joab, who helps Fraser and the Baths steal Nautilus II, on condition they leave without bloodshed, and allow the crew to return with the submarine intact.They manage to take the submarine and are followed by Nemo in his submarine. Nemo explains there is fault with the Nautilus II's engines that means the sub could explode. The chase is brief. Unable to match the speed of the escaping submarine, Nemo has Nautilus I sheer away, to try 'going under the reef.' Confused by their pursuers apparently giving up, Fraser asks the Nautilus II's first mate if there is 'a shorter way,' to be told that 'yes, there is,' but that 'this ship is too large!'A now desperate Fraser gives orders for 'crash speed.' As the submarine increases to flank an explosion causes the engines to fail, and out of control the ship strikes a reef before coming to a stop whilst still submerged. The crew with Fraser and the Baths put on diving gear and attempt to escape from the now flooding submarine, but Barnaby panics and drowns in the attempt.Nautilus I approaches the wreck just in time to be buffeted violently as the bigger ship explodes; Joab is electrocuted as he is thrown against a control panel. Mortally wounded he confesses to Nemo that he helped Fraser to escape. Helena Beckett admits that she knew of the attempt, and that she and her son chose to stay. Mala reads Nemo a letter that Fraser left behind, in which he thanks Nemo for offering him a place in the city's future, but that he cannot accept, as he believes in his mission, and the 'slower, more painful process' towards peace.The film closes as Nautilus turns towards Templemer. On the surface, a small schooner is seen picking up two men in mid-ocean, far from either land or any sign of wreckage. Fraser and Swallow Bath, huddled in blankets, are made welcome aboard, and as the schooner prepares to set sail, Fraser finds his companion has concealed a gold ladle under his coat. The two exchange rueful smiles, and Fraser tosses it lightly into the sea.","language":"English","cinematography":"Alan Hume","directed_by":"James Hill","release_dates":"19 December 1969 (1969-12-19) (Germany)|7 October 1970 (1970-10-07) (U.S.)||||","Production":"The film was produced on a budget of 1.5 million US dollars. It had stemmed from an idea that led to Roger Corman’s failed Captain Nemo and the Floating City, itself based on a combination of two of Jules Verne’s stories. Though that movie never passed the planning stage, MGM producer Steven Pallos managed to re-create the project having read a series of inspirational articles about Jacques Cousteau’s experiments with deep sea habitats, and the 'floating' was changed to 'underwater'.The film drew heavily on the supposed charm of the Victorian era, following agreement between director and scriptwriters to produce a popular escapist atmosphere, more the essence of Michael Todd’s Around the World in Eighty Days than of Disney‘s 20,000 Leagues Under the Sea. Changing fashions had rendered the film an anachronism by the time it was released in 1969, almost as though it had been intended for distribution ten years earlier, before the downbeat and socially conscious realism of the Sixties had set the new trend.","produced_by":"Steven Pallos Bertram Ostrer","starring":"Robert Ryan Chuck Connors Nanette Newman Bill Fraser Kenneth Connor","running_time":"105 minutes","music_by":"Angela Morley[1]","edited_by":"Bill Lewthwaite","written_by":"Pip and Jane Baker R. Wright Campbell"}