{"country":"United States","distributed_by":"Seymour Borde & Associates","screenplay_by":"Garth Eliassen","story_by":"Garth Eliassen","Plot":"As something kills a hysterical woman, and a bird watcher, four friends (Peter, Joanne, Ingrid and Craig) trek through the wilderness. A tourist is thrown over a waterfall (landing near some oblivious frolickers) and his mother is wounded, and dragged away. The four backpackers set up camp for the night, and elsewhere a pair of honeymooners are attacked in their van and murdered. The next day, the two couples continue their hike, while an artist is stabbed to death, and her young daughter is taken.Two more campers are butchered, and while off on his own, Peter witnesses a fisherman also murdered by the killer, who turns out to be a spear-wielding wild man adorned in furs and rags. Peter rushes off to warn his friends, but the maniac gets to them first, spearing Craig and sending Joanne fleeing into the woods. Peter finds Ingrid and after the two stumble upon the wild man's cabin, they accidentally attack another hiker, thinking he is the savage. The killer finishes off the hiker and wounds Ingrid, but she and Peter escape and eventually reach civilization where they alert the authorities.Irrational due to guilt over leaving Joanne behind, Peter escapes from the hospital he and Ingrid are brought to and returns to the woods. Joanne finds a campsite containing a dead body, then a cabin where the killer hacks her to death with a machete. A posse (which includes Ingrid) is formed to hunt the maniac and look for Peter and Joanne. The sheriff finds the cabin, where he uncovers Joanne's body, leaving Peter even more distraught.By nightfall the wild man claims another victim (a man in a wheelchair who is decapitated). Ingrid steals a machete and goes off to look for Peter who she finds by morning, along with the savage who they stab to death in a frenzy, only stopping when the search party arrives. As everyone clears out of the forest, the baby that was taken from the artist is shown alone in the wilderness playing with a hatchet.","language":"English","Critical reception":"Don't Go in the Woods has been universally panned by critics.Paul Mavis, writing for DVD Talk, gave the film one-and-a-half stars out of five, calling it \"a crappy little horror film made on a shoestring budget with people who really showed some grit in getting it done. That's fine, and more power to those people. But that doesn't make it good\".[6] Similarly, Dread Central, which awarded it a 2/5, called it \"a bad film\", but also \"an unpretentious bit of campy horror that's really just trying to have a good time\".[7] AllMovie wrote \"This splatter hack-job was forged during the slasher gold rush of the early '80s, and though it's inept enough to inspire guffaws for those who find ineptness amusing, there's nothing to recommend for connoisseurs of horror\".[8] Don't Go in the Woods was also lambasted by DVD Verdict, which stated \"Aside from one nasty bit with a bear trap and a sequence toward the end that faintly—and accidentally, believe me—recalls The Texas Chain Saw Massacre in its slow, dread-saturated buildup, director James Bryan's splatter film is an incoherent mess. An endless parade of victims keeps the fake blood squirting, but the murder sequences are so poorly staged that it's usually impossible to tell precisely what's happening. The most frightening thing about this alleged horror film, aside from its bad synthesizer soundtrack, is its pacing. Murder sequences are clumped together throughout the film, leaving a lot of flab in between\".[1]","cinematography":"Hank Zinman","production_company":"JBF","directed_by":"James Bryan","release_dates":"September 1981 (1981-09) (United States)|||||","Production":"After the release of his earlier film Boogie Vision, director James Bryan decided on making a horror film set in the Rocky Mountains as his next project. The film was supposedly based on local rumors about a number of hitchhikers who had reportedly fallen victim to a suspected serial killer.The film was shot on a budget of $20,000 in the summer of 1980 during the director's seven-year sojourn.[1] It was shot in outdoor locations, partly in order to save money on the film's lighting.[2]","produced_by":"James Bryan Suzette Gomez Roberto Gomez","starring":"Mary Gail Artz Jack McClelland James P. Hayden","running_time":"82 minutes","music_by":"H. Kingsley Thurber","don't_go_in_the_woods":"Theatrical poster","Release":"Don't Go in the Woods was released in September 1981.[3]In the 1980s the film was deemed a video nasty in the United Kingdom, and subsequently banned by issuance of the Video Recordings Act. Aside from an early rare video release, it was not available for rent or sale in the UK until 2007, when it was released uncut on DVD with a 15 certificate. It was classified as R18 in New Zealand for its violence. On 8 February 2015, Vinegar Syndrome re-released the film in a limited screening in the Alamo Drafthouse Cinema in Yonkers, New York[4] and on March 10, 2015 they released the film for the first time on Blu Ray.[5]","budget":"$20,000"}