{"Cast":"CommuneJailCaféHouse of Blue LightsPickup Truck","country":"United States","distributed_by":"Columbia Pictures","easy_rider":"Original poster","language":"English","box_office":"$60 million[1]","cinematography":"László Kovács","production_company":"Raybert Productions Pando Company Inc.","directed_by":"Dennis Hopper","Home media":"The film was released by The Criterion Collection in November 2010 as part of the box set America Lost and Found: The BBS Story. It included two audio commentaries, one featuring actor-director-writer Dennis Hopper, the other with Hopper, actor-writer Peter Fonda, and production manager Paul Lewis; two documentaries about the making and history of the film, Born to Be Wild (1995) and Easy Rider: Shaking the Cage (1999); television excerpts showing Hopper and Fonda at the Cannes Film Festival; and a new video interview with BBS co-founder Stephen Blauner.[29]","release_dates":"July 14, 1969 (1969-07-14)|||||","Production":"Hopper and Fonda's first collaboration was in The Trip (1967), written by Jack Nicholson, which had similar themes and characters as Easy Rider.[5] Peter Fonda had become \"an icon of the counterculture\" in The Wild Angels (1966), where he established \"a persona he would develop further in The Trip and Easy Rider.\"[6] The Trip also popularized LSD, while Easy Rider went on to \"celebrate 60s counterculture\" but does so \"stripped of its innocence.\"[7] Author Katie Mills wrote that The Trip is a way point along the \"metamorphosis of the rebel road story from a Beat relic into its hippie reincarnation as Easy Rider\", and connected Peter Fonda's characters in those two films, along with his character in The Wild Angels, deviating from the \"formulaic biker\" persona and critiquing \"commodity-oriented filmmakers appropriating avant-garde film techniques.\"[5] It was also a step in the transition from independent film into Hollywood's mainstream, and while The Trip was criticized as a faux, popularized underground film made by Hollywood insiders, Easy Rider \"interrogates\" the attitude that underground film must \"remain strictly segregated from Hollywood.\"[5] Mills also wrote that the famous acid trip scene in Easy Rider \"clearly derives from their first tentative explorations as filmmakers in The Trip.\"[5]When seeing a still of himself and Bruce Dern in The Wild Angels, Peter Fonda had the idea of a modern Western, involving two bikers travelling around the country and eventually getting shot by hillbillies. He called Dennis Hopper, and the two decided to turn that into a movie, The Loners, with Hopper directing, Fonda producing, and both starring and writing. They brought in screenwriter Terry Southern, who came up with the title Easy Rider. The film was mostly shot without a screenplay, with ad-libbed lines, and production started with only the outline and the names of the protagonists. Keeping the Western theme, Wyatt was named after Wyatt Earp and Billy after Billy the Kid.[8] However, Southern disputes that Hopper wrote much of the script. In a 2016 interview he said \"You know if Den Hopper improvises a dozen lines and six of them survive the cutting room floor he'll put in for screenplay credit. Now it would be almost impossible to exaggerate his contribution to the film—but, by George, he manages to do it every time.\"[9] According to Southern, Fonda was under contract to produce a motorcycle film with A.I.P., which Fonda had agreed to allow Hopper to direct. According to Southern, Fonda and Hopper didn't seek screenplay credit until after the first screenings of the film, which required Southern's agreement due to writers guild policies. Southern says he agreed out of a sense of camaraderie, and that Hopper later took credit for the entire script.[9]Hopper was also said to be difficult on set. During test shooting on location in New Orleans, Hopper fought with the production's ad hoc crew for control. At one point he entered into a physical confrontation with photographer Barry Feinstein, who was one of the camera operators for the shoot. After this turmoil, Hopper and Fonda decided to assemble a proper crew for the rest of the film.[4]Allegedly, the characters of Wyatt and Billy were respectively based on Roger McGuinn and David Crosby of The Byrds.[10] According to Terry Southern's biographer, Lee Hill, the part of George Hanson had been written for Southern's friend, actor Rip Torn. When Torn met with Hopper and Fonda at a New York restaurant in early 1968 to discuss the role, Hopper began ranting about the \"rednecks\" he had encountered on his scouting trip to the South. Torn, a Texan, took exception to some of Hopper's remarks, and the two almost came to blows, as a result of which Torn withdrew from the project. Torn was replaced by Jack Nicholson, whom Hopper had recently appeared with in Head (along with another Easy Rider co-star, Toni Basil).[11] In 1994, Jay Leno interviewed Hopper about Easy Rider on The Tonight Show, and during the interview, Hopper alleged that Torn had pulled a knife on him during the altercation, prompting Torn to sue Hopper successfully for defamation.[8]The hippie commune was recreated from pictures and shot at a site overlooking Malibu Canyon, since the New Buffalo commune in Arroyo Hondo near Taos, New Mexico, did not permit shooting there.[12]A short clip near the beginning of the film shows Wyatt and Billy on Route 66 in Flagstaff, Arizona, passing a large figure of a lumberjack. That lumberjack statue—once situated in front of the Lumberjack Cafe—remains in Flagstaff, but now stands inside the J. Lawrence Walkup Skydome on the campus of Northern Arizona University.[13] A second, very similar statue was also moved from the Lumberjack Cafe to the exterior of the Skydome.[14]Most of the film is shot outside with natural lighting. Hopper said all the outdoor shooting was an intentional choice on his part, because \"God is a great gaffer.\" The production used two five-ton trucks, one for the equipment and one for the motorcycles, with the cast and crew in a motor home.[12] One of the locations was Monument Valley.[12]The restaurant scenes with Fonda, Hopper, and Nicholson were shot in Morganza, Louisiana.[12] The men and girls in that scene were all Morganza locals.[12] In order to inspire more vitriolic commentary from the local men, Hopper told them the characters of Billy, Wyatt, and George had raped and killed a girl outside of town.[4] The scene in which Billy and Wyatt were shot was filmed on Louisiana Highway 105 North, just outside Krotz Springs, and the two other men in the scene—Johnny David and D.C. Billodeau—were Krotz Springs locals.While shooting the cemetery scene, Hopper tried to convince Fonda to talk to the statue of the Madonna as though it were Fonda's mother (who had committed suicide when he was 10 years old) and ask her why she left him. Although Fonda was reluctant, he eventually complied. Later, Fonda used the inclusion of this scene as leverage to persuade Roger McGuinn to allow the use of his cover of Bob Dylan's \"It's Alright, Ma (I'm Only Bleeding)\".[4]Despite being filmed in the first half of 1968, roughly between Mardi Gras and the assassination of Robert F. Kennedy, with production starting on February 22[15] the film did not have a U.S. premiere until July 1969, after having won an award at the Cannes film festival in May. The delay was partially due to a protracted editing process. Inspired by 2001: A Space Odyssey', one of Hopper's proposed cuts was 220 minutes long, including extensive use of the \"flash-forward\" narrative device, wherein scenes from later in the movie are inserted into the current scene. But only one flash-forward survives in the final edit: when Wyatt in the New Orleans brothel has a premonition of the final scene. At the request of Bob Rafelson and Bert Schneider, Henry Jaglom was brought in to edit the film into its current form, while Schneider purchased Hopper a trip to Taos so he would not interfere with the recut. Upon seeing the final cut, Hopper was originally displeased, saying that his movie was \"turned into a TV show\", but he eventually accepted, claiming that Jaglom had crafted the film the way Hopper had originally intended. Despite the large part he played in shaping the film, Jaglom only received credit as an \"Editorial Consultant\".[8]There are various reports about the exact running time of original rough cut of the movie; four hours, four and a half hours, or five hours. All deleted footage is believed to be lost. Some of the scenes which were in the original cut but got deleted are:[16] the original opening showing Wyatt and Billy performing in a Los Angeles stunt show (their real jobs), the two of them being ripped off by the promoter, getting in a biker fight, picking up women at a drive-in, cruising to and escaping from Mexico to score the cocaine they sell, an elaborate police and helicopter chase that took place at the beginning after the dope deal with police chasing Wyatt and Billy over mountains and across the Mexican border, the road trip out of L.A. edited to the full length of Steppenwolf's Born to Be Wild with billboards along the way offering wry commentary, Wyatt and Billy being pulled over by a cop while driving their motorcycles across a highway, the two of them encountering the black motorcycle gang, ten additional minutes for the volatile café scene in Louisiana where George deftly keeps the peace, Wyatt and Billy checking into a hotel before going over to Madam Tinkertoy's, an extended and much longer Madam Tinkertoy sequence, and extended versions of all the campfire scenes including the enigmatic finale in which Wyatt says \"We blew it, Billy\".Easy Rider's style — the jump cuts, time shifts, flash forwards, flashbacks, jerky hand-held cameras, fractured narrative and improvised acting — can be seen as a cinematic translation of the psychedelic experience. Peter Biskind, author of Easy Riders, Raging Bulls wrote: \"LSD did create a frame of mind that fractured experience and that LSD experience had an effect on films like Easy Rider\".[17]","running_time":"95 minutes","Sequel":"In 2012, a sequel to the movie was released titled Easy Rider: The Ride Back, directed by Dustin Rikert.[30] The film is about the family of Wyatt \"Captain America\" Williams from the 1940s to the present day.","budget":"$360,000","Plot":"The protagonists are two freewheeling guys: Wyatt (Fonda), nicknamed \"Captain America\", and Billy (Hopper). Fonda and Hopper have said that these characters' names refer to Wyatt Earp and Billy the Kid.[4] Wyatt dresses in American flag-adorned leather (with an Office of the Secretary of Defense Identification Badge affixed to it), while Billy dresses in Native American-style buckskin pants and shirts and a bushman hat. The former is quite open to people they meet on their journey and accepting of help while the latter is more hostile and suspicious.After smuggling cocaine from Mexico to Los Angeles, Wyatt and Billy sell their haul to \"Connection\", a man (played by Phil Spector) in a Rolls-Royce, and receive a large sum in return. With the money stuffed into a plastic tube hidden inside the Stars & Stripes-painted fuel tank of Wyatt's California-style chopper, they ride eastward aiming to reach New Orleans, Louisiana, in time for the Mardi Gras festival.During their trip Wyatt and Billy stop to repair one of the bikes at a farmstead and have a meal with the farmer and his family. Wyatt seems to appreciate the simple, traditional lifestyle presented here. Later Wyatt stops to pick up a hippyish hitch-hiker (Luke Askew) and he invites them to visit his commune, where they stay for the rest of the day. Life in the commune appears to be hard, with young hippies from the city struggling to grow their own crops in a dry climate with poor soil and little rainfall. (One of the children seen in the commune is played by Fonda's four-year-old daughter Bridget.) At one point, the bikers witness a prayer for blessing of the new crop, as put by a commune-member: A chance \"to make a stand\", and to plant \"simple food, for our simple taste\". The commune is also hosting a traveling theater group that \"sings for its supper\" (performs for food). The notion of \"free love\" appears to be practiced, with two of the women, Lisa (Luana Anders) and Sarah (Sabrina Scharf), seemingly sharing the affections of the hitch-hiking commune-member before turning their attention to Wyatt and Billy. The hitch-hiker asks the two bikers to stay at the commune, saying, \"the time is now\", to which Wyatt replies \"I'm hip about time...but I just gotta go.\" As the bikers leave, the hitch-hiker (known only as \"Stranger on highway\" in the credits) gives Wyatt some LSD for him to share with \"the right people\".Later, while naughtily riding along with a parade in a small town, the pair are arrested by the local authorities for \"parading without a permit\" and thrown in jail. There, they befriend American Civil Liberties Union lawyer and local drunk George Hanson (Jack Nicholson) who has spent the night in jail after overindulging in alcohol. George helps them get out of jail and decides to travel with Wyatt and Billy to New Orleans. As they camp that night, Wyatt and Billy introduce George to marijuana. As an alcoholic and a \"square\", George is reluctant to try the marijuana (\"It leads to harder stuff\", and \"I don't want to get hooked\"), but he quickly relents.Stopping to eat at a smalltown Louisiana diner, the trio's appearance attracts the attention of the locals. The girls in the restaurant think they're exciting but the local men and a police officer begin making loud and denigrating comments and taunts. One of the men menacingly states, \"I don't believe they'll make the parish line.\" The waitress does not take their order and Wyatt, Billy and George, feeling the hostility, decide to leave without any fuss. They make camp outside town. The events of the day cause George to comment: \"This used to be a hell of a good country. I can't understand what's gone wrong with it.\" He observes that Americans talk a lot about the value of freedom but are actually afraid of anyone who truly exhibits it.In the middle of the night a group of locals attack the sleeping trio, beating them with clubs. Billy screams and brandishes a knife and the attackers leave. Wyatt and Billy suffer minor injuries but George has been fatally beaten. Wyatt and Billy wrap George's body up in his sleeping bag, gather his belongings, and vow to return the items to his parents.They continue to New Orleans and find a brothel George had told them about. Taking prostitutes Karen (Karen Black) and Mary (Toni Basil) with them, Wyatt and Billy decide to go outside and wander the parade-filled street of the Mardi Gras celebration. They end up in a cemetery, where all four ingest the LSD which the hitch-hiker had given to Wyatt. They experience a bad trip, cinematically presented by the use of quick cuts, fish-eye lenses, sound collages (including snippets of prayer) and over-exposed film.Making camp afterward, Billy declares that their trek has been a success. Wyatt disagrees, declaring, \"We blew it.\" The next morning, the two are continuing their trip eastward to Florida (where they hope to retire wealthy) when two rednecks in a pickup truck spot them and decide to \"scare the hell out of them\" with their shotgun. As they pull alongside Billy, one of the men lazily aims the shotgun at him and threatens and insults him by saying, \"Want me to blow your brains out?\" and \"Why don't you get a haircut?\" When Billy flips his middle finger up at them, the hillbilly fires the shotgun and Billy slews the bike into the roadside, seriously wounded in the side. As the truck then takes off past Wyatt down the road, Wyatt turns around and races back to put his jacket over his critically injured friend, who is already drenched in blood, before riding off for help. By this time, the pickup truck has turned around and closes on Wyatt. The hillbilly fires at Wyatt as he speeds by the pickup, hitting the bike's gas tank and causing it to erupt into a fiery explosion. Wyatt is killed and the bike soars into the air and crashes down further along the road. As the murderous rednecks drive away, the film ends with a shot of the flaming bike in the middle of the deserted road, as the camera ascends to the sky.","Reception":"The film holds an 86% \"Certified Fresh\" rating on the review aggregate website Rotten Tomatoes, based on 44 reviews, with an average rating of 7.8/10.Hopper received the First Film Award (Prix de la première œuvre) at the 1969 Cannes Film Festival.[22] At the 42nd Academy Awards, Jack Nicholson was nominated for Best Actor in a Supporting Role, and the film was also nominated for Best Original Screenplay.The film appears at number 88 on the American Film Institute's list of 100 Years, 100 Movies. In 1998, Easy Rider was added to the United States National Film Registry, having been deemed \"culturally, historically, or aesthetically significant.\"A box office smash with a $60-million intake,[1] of which $41.7 million was domestic gross,[23] it became the third highest grossing film of 1969. Along with Bonnie and Clyde and The Graduate, Easy Rider helped kick-start the New Hollywood phase during the late 1960s and early 1970s.[24] The major studios realized that money could be made from low-budget films made by avant-garde directors. Heavily influenced by the French New Wave, the films of the so-called \"post-classical Hollywood\" came to represent a counterculture generation increasingly disillusioned with its government as well as the government's effects on the world at large, and the Establishment in general.[24] Although Jack Nicholson appears only as a supporting actor and in the last half of the film, the standout performance signaled his arrival as a movie star,[24] along with his subsequent film Five Easy Pieces in which he had the lead role. Vice President Spiro Agnew criticized Easy Rider, along with the band Jefferson Airplane, as examples of the permissiveness of the 1960s counterculture.[25]The film's success, and the new era of Hollywood that it helped usher in, gave Hopper the chance to direct again with complete artistic control. The result was 1971's The Last Movie, which was a notable box office and critical failure, effectively ending Hopper's career as a director for well over a decade.Roger Ebert added Easy Rider to his \"Great Movies\" list in 2004.[26]","Motorcycles":"The motorcycles for the film, based on hardtail frames and panhead engines, were designed and built by two African-American[19][20] chopper builders — Cliff Vaughs and Ben Hardy — following ideas of Peter Fonda, and handled by Tex Hall and Dan Haggerty during shooting.[21]In total, four former police bikes were used in the film. The 1949, 1950 and 1952 Harley-Davidson Hydra-Glide bikes were purchased at an auction for $500, equivalent to about $3400 in 2016.[21] Each bike had a backup to make sure that shooting could continue in case one of the old machines failed or got wrecked accidentally. One \"Captain America\" was demolished in the final scene, while the other three were stolen and probably taken apart before their significance as movie props became known.[21] The demolished bike was rebuilt by Dan Haggerty and shown in a museum. He sold it at an auction in 2001. It now resides at the National Motorcycle Museum in Anamosa, Iowa. Many replicas have been built since the film's release.[21]Hopper and Fonda hosted a wrap party for the movie and then realized they had not yet shot the final campfire scene. Thus, it was shot after the bikes had already been stolen, which is why they are not visible in the background as in the other campfire scenes.[8][21]","Music":"The movie's \"groundbreaking\"[27] soundtrack featured The Band, The Byrds, The Jimi Hendrix Experience and Steppenwolf.[27] Editor Donn Cambern used various music from his own record collection to make watching hours of bike footage more interesting during editing.[12] Most of Cambern's music was used, with licensing costs of $1 million, more than the film's budget.[12] The extensive use of pop and rock music for a film's soundtrack was unusual at the time, especially since the film lacks a classical score. When the band Crosby, Stills, Nash, & Young viewed a rough cut of the film, they assured Hopper that they could not do any better than he already had.[citation needed]Bob Dylan was asked to contribute music, but was reluctant to use his own recording of \"It's Alright, Ma (I'm Only Bleeding)\", so a version performed by Byrds frontman Roger McGuinn was used instead. Also, instead of writing an entirely new song for the film, Dylan simply wrote out the first verse of \"Ballad of Easy Rider\" and told the filmmakers, \"Give this to McGuinn, he’ll know what to do with it.\"[28] McGuinn completed the song and performed it in the film.","produced_by":"Peter Fonda","starring":"Peter Fonda Dennis Hopper Jack Nicholson","music_by":"The Band The Byrds The Jimi Hendrix Experience Roger McGuinn Steppenwolf","External links":"","edited_by":"Donn Cambern","written_by":"Peter Fonda Dennis Hopper Terry Southern"}