{"based_on":"characters  by Adam Herz","country":"Canada United States","distributed_by":"Universal Pictures","Plot":"Erik Stifler and Mike \"Cooze\" Coozeman arrive at the University of Michigan as freshmen. Upon arriving at his dorm, Erik meets a girl named Ashley while she is taking a shower in the coed bathrooms. He then meets his new roommate Bobby and his girlfriend Margie while they are having sex. Erik eventually reunites with his cousin, Dwight Stifler, the leader of the Beta House fraternity, who invites Erik, Cooze, and Bobby to a Beta House party. They learn how they can gain eligibility to pledge for the Beta House and meet Wesley, the rush chair of the Beta House who experiences blackouts after drinking alcohol. Erik and Ashley begin dating, but on their first date at a restaurant, Erik accidentally spills hot soup on his legs, so Ashley brings him to her room to clean up. As Ashley rubs lotion on Erik's thigh, he develops an erection and accidentally ejaculates over her possessions. Erik apologizes and explains to Ashley that his girlfriend Tracy broke up with him, and he has not had sex in four months.Meanwhile, Cooze falls in love with Ashley's roommate Denise; however, she is nervous to show him her genitalia and have sex with him, so she instead gives Cooze a handjob. After talking with Erik, Bobby, and Dwight about Denise, Cooze develops suspicions that Denise might have a penis, so Dwight encourages Cooze to find out. Alongside two other pledges, Erik, Cooze, and Bobby complete fifty tasks to pledge the Beta House, including: getting their posteriors signed by a stripper; having sex with a professor; marrying a male friend in Canada; and placing a live ostrich in the Geek House. After they complete their final task, Edgar, the president of the Geek House, challenges the Beta House to the Greek Olympiad. Beta House alumnus Noah Levenstein returns to campus to officiate the competition. The first competition is won by Beta House as Dwight and Edgar compete in removing girls' brassieres. Geek House win the next three competitions: a lightsaber duel, catching a greased pig and a two-person \"69\" race.Beta House win the fifth and sixth competitions: a Russian roulette challenge between Dwight and Edgar with aged horse semen; and a drinking competition won by Wesley. Dwight learns from Rock that Edgar previously had sex with a sheep, so Beta House uses his wool fetish against him in the final striptease challenge with Margie wearing a sheep costume, resulting in the Geek House losing the Greek Olympiad. The Beta House hosts a toga party, while Erik comes up with the idea of a new pledge task for the Beta House: having sex in a movie theater, and he does so with Ashley. Meanwhile, Cooze and Denise finally sleep together, and Cooze discovers that Denise was actually hiding the fact the she ejaculates during sex, much to his excitement. The following morning, Wesley wakes up after a blackout and discovers that he had sex with the Geek House bodybuilder. In a post-credits scene, Edgar instructs a stripper at Silver Dollar to dance with the headpiece of the sheep costume.","language":"English","box_office":"$18,610,260[2]","cinematography":"Gerald Packer","production_company":"Neo Art & Logic Rogue Pictures Universal Pictures","directed_by":"Andrew Waller","american_pie_presents:_beta_house":"Home media release cover","release_dates":"000000002007-12-26-0000December 26, 2007","Production":"American Pie Presents: The Naked Mile, the second spin-off to the American Pie film series, was a commercial success, and Universal Pictures prepared for a sequel. The Naked Mile's writer, Erik Lindsay, pitched the film by saying \"Look, we're not going to top Animal House of course, but it's been 25 years. I was in a fraternity for six years. Let's just make a straight pledging movie.\"[3] Universal gave Lindsay the green light to write Beta House, and also hired Andrew Waller and The Naked Mile's producer, W. K. Border, as the film's director and producer, respectively.[4] The film's screenplay was based on characters by Adam Herz and on aspects of Lindsay's own life.[5][6] Lindsay felt that Universal being unworried to make the film similar to Animal House provided \"more opportunities to keep the story organic,\" which he found the challenge of writing a sequel.[3]The film features the same principal cast as The Naked Mile minus Jessy Schram;[7] John White, Steve Talley, Christopher McDonald and Eugene Levy reprised their roles from the preceding film, with Levy returning to play Noah Levenstein for the sixth time in the series.[8] Craig Kornblau, the president of Universal Studios Home Entertainment, said \"we think he [Levy] is crucial to this franchise because his character represents the heart of the movie.\"[1] Jake Siegel, Jaclyn A. Smith, Dan Petronijevic, and Jordan Prentice also reprised their roles from The Naked Mile.[8]Principal photography began on June 4, 2007 and lasted about \"seven [to] eight weeks.\"[9][10] Filming took place at the University of Toronto, Pinewood Toronto Studios and at the Brass Rail strip club in Toronto.[5][11][12] Neo Art & Logic, Rogue Pictures and Universal Pictures produced the film on a budget of less than $10 million.[1] The film was intended to be the center of a trilogy beginning with The Naked Mile and although talks for a concluding sequel were made, no such film has yet materalised.[5][7]","produced_by":"W. K. Border","starring":"John White Steve Talley Christopher McDonald Eugene Levy","running_time":"85 minutes","music_by":"Jeff Cardoni","edited_by":"Rod Dean Andrew Somers","Release":"American Pie Presents: Beta House was released direct-to-DVD internationally on December 10, 2007 and in the United States on December 26, 2007. It was marketed with the tagline \"the most outrageous slice of pie!\"[8] The film was released in two single-disc DVD editions. The R-rated edition included no special features, while the unrated edition included a commentary track, behind-the-scenes clips, deleted scenes and storylines, a fake service announcement, featurettes, outtakes, a mock in-character interview with Noah Levenstein, music videos by God Made Me Funky, and a 30 Rock episode.[13] Through its first four weeks the DVD sold over 534,000 copies in the United States, generating $12.25 million in sales.[2] Universal Pictures expected to sell more than a million units;[1] sales have since totaled over 898,000 units in the United States, with $18.55 million in revenue.[2]The film received generally negative reviews from film critics. LaRue Cook of Entertainment Weekly graded the film with a \"D\" and wrote, \"what was once a fresh slice of teen comedy has become a slab of stale crudeness.\"[14] Scott Weinberg of Moviefone, in his negative review, found the film \"slightly more amusing to sit through than the two previous entries\", in particular praising the Star Trek sexual roleplay scene as \"extremely effective.\"[15] DVD Talk's Jeffrey Robinson writes that \"if anything, it will bore you and leave you wondering why you wasted an hour and a half of your life.\"[13] Writing in JoBlo.com, Adam Quigley poked fun at the film's themes, declaring that \"if there's a lesson to be taken from these films, it's that women are objects, and should always be treated as such\".[16] IGN's Hock Teh gave the film 5/10, writing that it \"stays very close to the American Pie formula,\" while criticizing the story as \"devoid of anything remotely semi-compelling or even noteworthy.\"[17] Peter Hammond of Maxim describes American Pie Presents: Beta House as \"loaded with sex, laughs and raunchy fun,\" writing that it \"may be the most outrageous slice of pie yet!\"[11]","written_by":"Erik Lindsay","budget":"less than $10 million[1]"}