{"country":"State of Palestine Israel France","distributed_by":"Kino Lorber","language":"Arabic|Hebrew|","Reception":"5 Broken Cameras has received positive reviews from numerous critics. It has a fresh rating of 95%, based on 39 reviews at Rottentomatoes.com.[10] A.O. Scott of The New York Times while stating that the film was “unlikely to persuade anyone with a hardened view of the issue to think again” and was a “hardly neutral...piece of advocacy journalism,” also said that it was a \"visual essay in autobiography and, as such, a modest, rigorous and moving work of art\" that deserved \"to be appreciated for the lyrical delicacy of [Burnat's] voice and the precision of his eye.\"[11] Artinfo magazine's J. Hoberman noted that the documentary was \"gripping from the get go\" and that seeing it is to \"wonder what it would have been like to have a black Alabaman’s 8mm documentation of the civil rights struggle.\"[12] Joshua Rothkopf of Time Out New York gave the film four stars, describing it as a \"proudly defiant work, devoted to a community and created by its members\" that shows the \"largely unreported details\" of normal life in the West Bank.[13] An NPR review of the film noted that it “is unabashedly pro-Palestinian, an indictment of Israel's settlement policy that never examines either the settlers' claims or the security forces' point of view” and quoted Anav Silverman of the Tazpit News Agency as saying that “the conflict in Judea and Samaria [the West Bank] has become a camera war.”[14]The film was released in Israel in July 2012 and immediately won the Best Documentary Award at the Jerusalem Film Festival, where it competed against another Oscar-nominated film, \"The Gatekeepers.\" The film also received an award named after the slain Palestinian-Israeli filmmaker Juliano Mer Khamis, at the Cinema South Film Festival in Sderot. In Israel, 5 Broken Cameras received overwhelming positive reviews, with Timeout Israel calling it “a masterpiece” and Israeli film critic Shmulik Duvdevani naming it \"the most important cinematic event of the year.\" Even Israel’s most popular right-wing newspaper, Israel Hayom, called the film \"the best documentary of the year\" (2012). Both directors, Guy Davidi and Emat Burnat, also appeared on the cover of the cultural weekend section of Israel’s leading newspaper, Yediot Achronot. In 2013 the film was nominated for the Israeli Film Academy's award (Ophir Award) for Best Documentary.There was also considerable negative response to the film in Israel, however. Davidi said that when he first screened the film for Israeli high school students, “they got angry at me, accused me of lying and being a traitor. But the anger is really against the whole system that lied to them....So I tell the kids, ‘Go ahead and get mad at me. Take it all out on me. Soon you will realize that your anger is not against me, but against the whole system that lied to you.’”[8] According to the AP, the film “has infuriated people on both sides of the Israeli-Palestinian divide,” with some Israelis “asking why the government helped fund a film so scathing in its criticism of its own policies, while Palestinians are shocked that the film is winning accolades for being 'Israeli.'”[15] The Israeli nonprofit Consensus petitioned the Israeli Attorney General claiming that Davidi and Burnat “should be charged with slander and prosecuted for 'incitement.'”[16]When the film was nominated for an Oscar, the Israeli media referred to it as an Israeli film that would be representing Israel at the Academy Awards, even though the Academy of Motion Picture Arts and Sciences does not consider films nominated in the documentary category as representing their countries of origin. In addition, the fact that the film was also a Palestinian work often went unmentioned. Davidi sparked controversy and was criticized by Israeli officials when he stated in an interview that “he does not represent Israel, only himself.”There was considerable controversy over whether the film should be identified as an Israeli or Palestinian production. Burnat described it as a “Palestinian film” while Davidi said it was “first and foremost...a Palestinian film,”although technically it was a “Palestinian-Israeli-French production since there is finance from these countries,” although he added: “I don’t think films should have citizenships.”[17]Barnat was widely criticized in Ramallah for working with Israelis, and Davidi was made to feel that “I had not sufficiently proved myself. I thought to myself that maybe we needed an Israeli activist to die in order to win credibility. Perhaps not enough Israeli blood has been spilled.”[8]Norman Finkelstein attacked the boycott, divestment and sanctions movement for “flagrant hypocrisy” for not calling for a boycott of 5 Broken Cameras.[17]","box_office":"$108,541 (USA) (15 February 2013))[1]","Synopsis":"There are five cameras — each with its own story. When his fourth son, Gibreel, is born in 2005, self-taught cameraman Emad Burnat, a Palestinian villager, gets his first camera. At the same time in his village of Bil’in, the Israelis begin bulldozing village olive groves to build a barrier to separate Bil'in from the Jewish Settlement Modi'in Illit. The barrier's route cuts off 60% of Bil'in farmland and the villagers resist this seizure of more of their land by the settlers.During the next year, Burnat films this struggle, which is led by two of his best friends including his brother Iyad, while at the same time recording the growth of his son. Very soon, these events begin to affect his family and his own life. Emad films the Army and Police beating and arresting villagers and activists who come to support them. Settlers destroy Palestinian olive trees and attack Burnat when he tries to film them. The Army raids the village in the middle of the night to arrest children. He, his friends, and brothers are arrested or shot; some are killed. Each camera used to document these events is shot or smashed.Eventually, in 2009, Burnat approaches Guy Davidi[5] – an Israeli filmmaker and together, from these five broken cameras and the stories that they represent, these two filmmakers create the film.","cinematography":"Emad Burnat","directed_by":"Emad Burnat|Guy Davidi|","Awards":"5 Broken Cameras won the World Cinema Directing Award at the 2012 Sundance Film Festival.[18] it won the 2013 International Emmy Award.[3][4] The film also received the Special Broadcaster IDFA Audience Award and the Special Jury Award at the International Documentary Film Festival Amsterdam in 2011.[19] In addition, the film won the Golden Apricot at the 2012 Yerevan International Film Festival, for Best Documentary Film, the Van Leer Group Foundation Award for Best Israeli Documentary at the Jerusalem Film Festival in 2012, and the Busan Cinephile Award at the 17th Busan International Film Festival in 2012.[20]5 Broken Cameras was nominated for Best Documentary Feature at the 85th Academy Awards Nominated for Best Documentary Feature in the 85th Academy Awards,[21] and for the Asia Pacific Screen Award for Best Documentary of 2012.[20]","release_dates":"23 November 2011 (2011-11-23) (IDFA)|||||","Production":"Israel began construction of an Israeli West Bank barrier in the West Bank village of Bil’in, Palestine in 2005.[6] Discovering that the wall would cut through their agricultural land, confiscating half of it, the villagers initiated popular protests and were joined by Israeli and international activists.[citation needed] At that point Burnat received a camera to document the movement.In 2007 the Israeli Supreme Court ordered the barrier rerouted,[6] and four years later, after village access to some of the land was restored, the demonstrations were called off.[7] A case against Canada, for failing to prevent Canadian corporations from being complicit in the building of the settlements, is currently pending before the UN Human Rights Committee.The first year, Burnat filmed mainly to serve the purposes of activists. His footage was introduced as evidence in Israeli court and posted on YouTube to spread awareness of the growing movement.As media interest in Bil’in grew, Burnat's footage gained international recognition and was used by local and international news agencies. He started working as a freelance photographer for Reuters and provided footage documenting the villagers' fight to professional filmmakers. This footage was used in such notable films as Shai Carmeli Pollac’s Bil’in, My Love and Guy Davidi’s and Alesandre Goetschmann Interrupted Streams.[2]Burnat was approached in 2009 by Greenhouse, a Mediterranean film development project, to develop a documentary. The project focused on the non-violent movement and especially on Bassem Abu-Rahme, who was killed earlier that year at a demonstration in Bil’in. After some difficulties, Burnat approached Israeli filmmaker, Guy Davidi who had just finished editing “Interrupted Streams”, Davidi’s first feature documentary which was released in 2010 at the Jerusalem International Film Festival.Earlier, Davidi had been involved in the left-wing organizations Indymedia and Anarchists Against the Wall.[8] “Until my twenties,” Davidi has said in an interview, “it was very hard for me to work in Israel. I felt it was a very destructive environment, a very violent environment.... There is a lot of aggression expressed towards the arts in Israel. I connect it completely with the political situation....So I left for Paris and I found time to reflect on my life.... I kind of found a freedom in Paris and I wanted to express it as well in Israel. And ever since my life was connected with the West Bank.”[9]Davidi provided Burnat's film with a new concept: Burnat himself, the cameraman, would be the protagonist, and the story would be told from his point of view. Davidi also proposed that the film be structured around the history of the destruction of Burnat's cameras. Footage that Burnat shot of his family was also incorporated into the film, thus enhancing the personal element.Beginning in 2009, Burnat, adhering to the new concept for the film, focused more extensively on his family's reactions to events. A few important scenes shot by other cameramen (including Guy Davidi) were used to supplement the narrative, and to introduce Burnat as a character.[2]Starting in 2009, Davidi worked on the voice-overs and structuring the film. In 2011 French editor Véronique Lagoarde–Ségot joined the project to edit the final cut of the 90-minute film and to create the 52-minute television version. The film takes the form of a diary, and is divided into 5 sections, each of which recounts the story of one of the five cameras that Burnat used over the years.In a prologue, Burnat is shown with his 5 broken cameras laid out on a table. This scene is returned to at the end of the film. Title cards identifying the time periods during which each camera was used are shown at the start of each episode as well as the epilogue. The story shifts frequently between the dramatic public events in the village and the highly intimate scenes involving Burnat's family.The most prominent narrative is of Burnat's fourth son Gibreel, whose growth throughout almost 6 years is documented in the film. The birth of Gibreel occurs at the same time as the birth of the non-violent movement in the village; later in the film, Gibreel’s first words are “wall” and “cartridge,” uttered when he crosses the barrier with his brothers and finally writes his name on the second concrete wall at the end of the film.Beginning with the episode involving the third camera, the personal and village movement narratives grow more integrated. Burnat becomes more conspicuous as a protagonist. First he is placed under house arrest and films himself, then he is filmed at the moment a bullet directly hits his third camera.[2]The film was initially developed by the Greenhouse Development Project, a Mediterranean development project initiated by an Israeli foundation and sponsored by the European Union. Later it received funding from international and Israeli sources such as the New Israeli Cinema Fund (Israel), the Jan Vrijman Fund (Netherland), ITVS (USA). Still later, funding was provided by Israel's Channel 8, Dutch Television IKON, and sources in Canada, South Korea, and the UK. Ultimately French television and the CNC French Cinema Fund provided help.","produced_by":"Christine Camdessus|Serge Gordey|Emad Burnat|Guy Davidi|","running_time":"90 minutes","music_by":"Le Trio Joubran","edited_by":"Véronique Lagoarde–Ségot|Guy Davidi|","written_by":"Guy Davidi|"}