{"mandarin":"Ā Láng De Gù Shì","country":"Hong Kong","Awards and nominations":"The movie was nominated for 9 Hong Kong Film Awards, but the film only managed to win the Best Actor award, for Chow Yun-fat, who was also nominated in the same category for God of Gamblers.[1] [2]","distributed_by":"Cinema City & Films Co.","screenplay_by":"Philip Cheng Ng Man-fai","story_by":"Sylvia Chang Chow Yun-fat","language":"Cantonese","Reception":"All About Ah-Long was a critical and box office hit in Hong Kong, due to Chow Yun-fat's rise to popularity as an actor at the time. Chow won his third Hong Kong Film Award for Best Actor for his role in the film. The drama-based film is generally hailed as one of Johnnie To's masterpieces due to its strong storyline and the excellent portrayal of the characters. To was known as a comedy/action film maker at the time and All About Ah-Long was a showcase of his versatility.Wong Kwan-yuen, who played Porky in the film, was really ten years old. Wong was born in 1978 and the film was launched in 1988. The film is also frequently cited as one of the milestones in Sylvia Chang's career.","all_about_ah-long":"Hong Kong DVD cover","cantonese":"A3 Long4 Dik1 Gu3 Si6","box_office":"HK$30,913,083","Synopsis":"Chow Yun-fat plays Ah-Long, a single father trying to raise his son, Porky (Wong Kwan-yuen), on a low-income lifestyle. Ah-Long works as a truckdriver at a construction site. The son's real mother, Por-por, who is Ah-Long's ex-girlfriend (played by Sylvia Chang) left him ten years ago for the United States after a lovers' spat.Ten years ago, Por-por had become Ah-Long's lover despite her mother's objections. As Por-por was giving birth in the hospital, Ah-Long was involved in illegal racing. Ah-Long was put behind bars. Por-por's mother lied to her and told her that her baby did not survive. Por-por was devastated and left for the United States to become a director.It is now ten years on. Por-por returns from the United States with a boyfriend to shoot a video commercial. Life is hard for both Ah-Long and Porky but Porky manages to do well in school. An audition is held for a video commercial and the advertising company wants to engage Porky. Ah-Long visits the advertising company's office and finds out that Por-por is in charge. He is dismayed to discover that Por-por has a boyfriend. Por-por is all business-like because she does not realise at that stage that Porky is in fact her own son. However Por-por instantly feels an affinity to Porky.Por-por eventually finds out that Porky is her son. Por-por begins to bond with her son that she never knew. Por-por wants to reunite with her son. During an argument Porky tells Ah-Long that he is dismayed at his life. Porky says that he wants to go live with his mother. Ah-Long sends Porky to stay with Por-por for a while.As Ah-Long and Por-por slowly get reacquainted, Ah-Long is happy and thinks that Por-por wants to rekindle the relationship. Ah-Long returns a bracelet to Por-por to imply that he is interested in restarting the relationship. Por-por reveals that she wants to bring Porky back to the United States, shattering Ah-Long's dreams of reconciliation.Ah-Long decides to try his luck at the motorbike racing accident. Ah-Long is determined to win the motorbike race to give his son a better future. Por-por's boyfriend purchases an air ticket for Por-por to return to the United States immediately. The next morning, as the motorbike race is about to begin, Ah-Long steels himself at the starting line. Por-por appears at the race track and Ah-Long manages to see Por-por as the race begins. She is wearing the bracelet and Ah-Long knows that he has been forgiven. Ah-Long and Por-por both smile at each other.The motorbikes go around the race track without a conclusive leader. During the sixth lap Ah-Long takes the leading position. Ah-Long loses control of his motorbike and crashes, causing the other riders to slow down or to crash as well. As he is struggling to get up, Ah-Long is hit by another motorbike. His head is bleeding but he is determined to complete the race. As the other motorbikes whiz by, Ah-Long picks himself up again and re-enters the race. Ah-Long is bleeding and his eyesight is starting to blur. Ah-Long manages to get to the first place. Ah-Long manages to see Porky and Por-por cheer for him as he passes them by. A moment later Ah-Long loses consciousness and plows into the side of the race track, and crashes. His motorbike catches fire. Ah-Long lies pinned under the motorbike and unable to move. Porky and Por-por run across the race track. Ah-Long reaches out to them. The motorbike explodes and Ah-Long dies.","cinematography":"Wong Wing-hang","production_company":"Cinema City & Films Co.","directed_by":"Johnnie To","traditional":"阿郎的故事","simplified":"阿郎的故事","release_dates":"16 March 1989 (1989-03-16)","produced_by":"Raymond Wong","starring":"Chow Yun-fat Sylvia Chang","running_time":"95 minutes","music_by":"Lo Ta-yu","edited_by":"Wong Wing-ming"}