{"country":"United States Japan","distributed_by":"20th Century Fox","digimon:_the_movie":"Theatrical release poster","Plot":"A four-minute short film featuring characters from the Angela Anaconda series appeared before the film in the theatrical and home media releases. In this segment, Angela and her friends line up to watch Digimon: The Movie, but Nannette and her friends cut in line since they have passes. As Angela makes a mad dash to save seats for her friends, Mrs. Brinks (with help from Nannette) sits in front of her, blocking her view. Angela scornfully imagines herself Digivolving into Angelamon to defeat Mrs. Brinks and Nannette, removing all obstacles in enjoying her movie. However, everyone in the audience realizes they are in the wrong movie, so they quickly leave to go to the correct theater, leaving Mrs. Brinks and Nannette behind with the latter covered in food.In Highton View Terrace, before their adventure in the Digital World, siblings Tai and Kari Kamiya witness a Digi-Egg emerging from their computer. The egg soon hatches, revealing a Botamon. The Digimon rapidly digivolves into Koromon and then a very large Agumon, who unintentionally destroys a good part of the neighborhood, Kari states that this isn't the same Agumon they become friends later with. A second Digi-Egg appears in the sky to reveal a Parrotmon. Agumon digivolves to Greymon, but brutally loses the battle. Tai wakes Greymon with Kari's whistle, who defeats Parrotmon and disappears with him.About six months after the DigiDestined departed from the Digital World, Izzy discovers a Digi-Egg on the internet that has been infected by a virus. He rushes over to Tai's apartment to inform him about the newly hatched Digimon, Kuramon. Tai and Izzy monitor it and are astonished as Kuramon consumes large amounts of computer data to rapidly digivolve to Keramon. Gennai appears in a transmission from the Digital World, warning them about the dangers of his growth. He dispatches Agumon and Tentomon to stop the Digimon. Keramon digivolves into Infermon and easily defeats the Champion and Ultimate forms of Tentomon and Agumon. Izzy realizes that Keramon completely skipped over his Champion form and digivolved straight to his Ultimate level. Tai tries to alert the rest of the DigiDestined, but only succeeds in enlisting the help of Matt, T.K., Gabumon and Patamon. Agumon and Gabumon Warp Digivolve to WarGreymon and MetalGarurumon, prompting Infermon to Digivolve into Diaboromon. A massive amount of emails are sent to Tai and Izzy from people around the world who are watching the battle from their computers. This causes WarGreymon and MetalGarurumon to slow down and they are severely injured in the fight. Diaboromon begins to duplicate himself at an exponential rate and infects computers at the Pentagon, launching two nuclear intercontinental ballistic missiles: one headed for Colorado, the other for Tai and Izzy's neighborhood in Odaiba, Tokyo. Refusing to lose hope, Tai and Matt's bond with their Digimon allow them to become digital and enter the internet to comfort WarGreymon and MetalGarurumon. Tai and Matt remind them about all the people around the world watching them and sending emails with encouraging words. WarGreymon and MetalGarurumon are revived by the collective power of the millions of children around the world and DNA Digivolve to Omnimon (Omegamon in the Japanese version). Omnimon easily defeats all of the Diaboromon copies, leaving only the original. With one minute left until the missile impact, Diaboromon is still too fast for them to hit. With seconds left on the clock, Izzy redirects the incoming emails to Diaboromon to slow him down. Omnimon destroys Diaboromon through the head just in time and the nukes are disabled just before detonation. However, the same virus that created Diaboromon tracks down Willis and corrupts Kokomon.While visiting Mimi in New York, T.K. and Kari witness a battle between Willis, Terriermon, and Kokomon's corrupted Champion form Wendigomon (still referred to as Kokomon). Wendigomon cryptically insists for Willis to \"go back\", to which he interprets as returning to Colorado. Thinking that he is to be in danger, Kari e-mails Davis Motomiya, Yolei Inoue, and Cody Hida for help in hopes of assembling in Colorado. However, T.K. and Kari's train becomes derailed by Wendigomon on the way and they are unable to meet with the others. Meanwhile, after taking planes and taxis, Davis, Yolei, and Cody meet Willis in a truck. When Willis tries to get their group transportation to his house for some pizza, the ride leaves without him and Davis; however, Davis devises a plan to get themselves to Colorado faster with the help of Raidramon. At the rendez-vous point, Davis, Yolei, and Cody began to question Willis' knowledge about Wendigomon. Hesitantly, Willis reveals that he, as a child, tried to create a digi-egg after experiencing the joys of having his twin Digimon (Terriermon and Kokomon). However, this only resulted in Diaboromon's creation. Willis assumes full responsibility for the situation. However, Davis and Terriermon convince him to let them help, as they are friends and are on the same team. At Willis's home the next morning, Wendigomon expectedly reappears, but Digivolves to Antylamon and easily defeats the DigiDestined. Once digivolved into Cherubimon, he proceeds to eat their Digimon, but T.K. and Kari arrive at the nick of time to provide back-up with Angemon and Angewomon. Angry, Cherubimon de-Digivolves the Digimon then de-ages the Digidestined, revealing that he wanted Willis to \"go back\" in time to when the \"strange\" spirit first attacked him. To combat him, Angewomon and Angemon Digivolve to their Mega forms, Magnadramon and Seraphimon, to release two Golden Digi-Eggs for Willis and Davis. Veemon and Terriermon Golden Armor Digivolve to Magnamon and Rapidmon and allow themselves to be swallowed by Cherubimon. Inside, they see a manifestation of Wendigomon's true self, who begs them to destroy the virus. After doing so, Cherubimon succumbs to his injuries and dies. After saying goodbye to his new friends, Willis and Terriermon walk back home to find Kokomon's Digi-egg on the beach.","language":"English","Reception":"Digimon: The Movie opened at #5 in the box office and earned $4,233,304 on the opening weekend.[1] The movie's run ended on December 3, 2000 at #56 drawing in a weekend gross of $19,665 grossing a total of $9,631,153 domestically. The movie also drew in $1,567,641 in the UK after its release on February 16, 2001 and $2,200,656 in Germany the same year. It earned a total of $16,643,191, making it a minor box office success compared to its budget of $5 million.The film received generally negative reviews. On the review website Rotten Tomatoes, the film received an average \"rotten\" rating, as only 25% of critics gave the movie positive reviews based on 39 reviews. Critics claimed that the film is an improvement over Pokémon: The First Movie, however in itself was \"predictable\", suffered from \"mediocre animation\".[6] Metacritic gave the movie a \"generally unfavorable\" score of 20/100.[7] Lawrence van Gelder of The New York Times describes the film as \"noisy and ill-conceived\", as it focused too much on \"morphing monsters\" and too little on \"storytelling talent\" and animation.[8] Liam Lacey of The Globe and Mail gave the film two stars, noting that the \"scenes alternate between kitschy cuteness and spectacular violence, with only a nod toward plot, character development, and motivation\".[3] At the 2000 Stinkers Bad Movie Awards, the film won the award for \"Worst Achievement in Animation\".[9] However; the magazine Animage conducted a list of the \"Top 100\" anime productions in January 2001, and Digimon: The Movie placed 88th on list, giving a well review.[10]","box_office":"$16.6 million","cinematography":"Shigeru Ando","production_company":"Fox Kids Toei Animation Saban Entertainment","directed_by":"Mamoru Hosoda Shigeyasu Yamauchi","Soundtrack":"Music from the Motion Picture Digimon: The Movie is the original motion picture soundtrack for the film, Digimon: The Movie, released September 19, 2000 on Maverick Records on Audio CD and Compact Cassette. The film score was composed by Shuki Levy, Udi Harpaz and Amotz Plessner, and was performed by the Tel Aviv Symphony Orchestra[11] and was also used throughout the second and third series. No official version of the orchestral score exists, although there are clips from the soundtrack on Udi Harpaz's website.[12]","narrated_by":"Lara Jill Miller","release_dates":"October 6, 2000 (2000-10-06) (United States)|||||","Development":"After the first two Pokémon films (which are now licensed by Viz Media on February 9, 2016 in the United States), Fox wanted to replicate its success by having a theatrical feature for Digimon as well. However, Toei Animation had no feature-length films for Digimon, but instead had animation fairs every spring and summer with featurettes showcasing their current animated titles. The only films produced for Digimon at that time were Digimon Adventure (1999), Our War Game! (2000), and Digimon Hurricane Touchdown! / Supreme Evolution! The Golden Digimentals (2000), the first two directed by Mamoru Hosoda and the final by Shigeyasu Yamauchi.[2] As the three films were respectively 20, 40, and 60 minutes long, footage was condensed to fit 85 minutes. The last film included in the compilation, Digimon Hurricane Touchdown! / Supreme Evolution! The Golden Digimentals was heavily cut because Saban Entertainment lacked funding to produce a full two-hour movie. Alongside of that, \"culturally awkward\" Japanese elements are removed, and many North American jokes were written into the script.[3] Writer Jeff Nimoy noted that the first edit of the film consisted of just the first two films and had plans to release the third film separately as a television movie or direct-to-video, but the idea was overruled. In order to connect the stories of the different movies together, the adapting screenwriters rewrote Digimon Hurricane Touchdown!! / Supreme Evolution!! The Golden Digimentals to include Willis being involved in Diaboromon's creation. In addition to this, the subplot of the older DigiDestined being captured by Wendigomon was cut out altogether. Originally, Nimoy had Tai narrate the movie, but as Tai did not make an appearance in the third part of the movie, he changed it to Kari instead.[4] The budget of the film production was estimated to be at $5 million.[1]Taco Bell heavily promoted Digimon: The Movie the summer before the film's release via a summer partnership with the franchise from July 13, 2000 to September 9, 2000. Participating restaurants offered toys and other collectibles with purchase of their kids' meals.[5] When the film debuted in local theaters, a limited edition \"Digi Battle\" trading card was given out with every admission. There were a total of 12 cards obtainable.","produced_by":"Terri-Lei O'Malley","starring":"See Cast","running_time":"97 minutes","music_by":"Udi Harpaz Amotz Plessner","edited_by":"Gary Friedman Douglas Purgason","written_by":"Bob Buchholz Jeff Nimoy","budget":"$5 million[1]"}