{"based_on":"La jetée  by Chris Marker","country":"United States|","distributed_by":"Universal Pictures","screenplay_by":"David Peoples|Janet Peoples|","Plot":"A deadly virus wipes out almost all of humanity in 1996, forcing remaining survivors to live underground. A mysterious group known as the Army of the Twelve Monkeys is believed to be behind the virus. In 2035, James Cole (Willis) is a prisoner living in a subterranean shelter beneath the ruins of Philadelphia. Cole is selected for a mission, where he is trained and sent back in time to collect information on the virus in order to help scientists develop a cure.[3] Meanwhile, Cole is troubled by recurring dreams involving a foot chase and an airport shooting.Cole arrives in Baltimore in 1990, not 1996 as planned. He is arrested, then hospitalized in a mental institution on the diagnosis of Dr. Kathryn Railly (Stowe). There he encounters Jeffrey Goines (Pitt), a fellow mental patient with fanatical views. After an escape attempt, Cole is locked in a cell, but soon disappears, returning to the future. Back in his own time, Cole is interviewed by the scientists, who play a distorted voicemail message which discloses the location of the Army of the Twelve Monkeys and asserts their association with the virus. He is also shown photos of numerous people suspected of being involved, including Goines. He is given a second chance to go back in time, but another error results in him arriving at a battlefield of World War I. He is wounded in the leg and then suddenly sent to 1996.In 1996, Railly gives a lecture about the Cassandra complex to a group of scientists. At the post-lecture book signing, Dr. Peters (Morse) questions her about mankind's sustainability on earth and points out that humanity's gradual destruction of the environment may be the real lunacy. Cole arrives at the venue after seeing flyers publicizing it, and when Railly departs, he kidnaps her and forces her to take him to Philadelphia. They learn that Goines is the founder of the Army of the Twelve Monkeys, and set out in search of him. When they confront him, however, Goines denies any involvement with the virus and says that wiping out humanity was Cole's idea at the asylum in 1990.Cole convinces himself that he is insane, but Railly confronts him with evidence of his time travel. They decide to spend their remaining time together in the Florida Keys before the onset of the plague. On their way to the airport, they learn that the Army of the Twelve Monkeys was not the source of the epidemic; the group's major act of protest is releasing animals from a zoo and placing Goines' Nobel Prize winning virologist father (Plummer) in an animal cage.At the airport, Cole leaves a last message telling the scientists that in following the Army of the Twelve Monkeys they are on the wrong track, and that he will not return. He is soon confronted by Jose (Seda), an acquaintance from his own time, who gives Cole a handgun and ambiguously instructs him to follow orders. At the same time, Railly spots Dr. Peters, and recognizes him from a newspaper photograph as an assistant at Goines' father's virology lab. Peters is about to embark on a tour of several cities that match the locations and sequence of the viral outbreaks.Cole forces his way through a security checkpoint in pursuit of Peters. After drawing the gun he was given, Cole is fatally shot by police. As Cole lies dying in Railly's arms, she makes eye contact with a small boy—the young James Cole witnessing the scene of his own death, which will replay in his dreams for years to come. Peters, aboard the plane with the virus, sits down next to Jones (Florence), one of the scientists from the future.","language":"English","Themes":"12 Monkeys studies the subjective nature of memories and their effect upon perceptions of reality. Examples of false memories include Cole's recollection of the airport shooting, altered each time he has the dream, and a \"mentally divergent\" man at the asylum who has false memories.[14]References to time, time travel, and monkeys are scattered throughout the film, including the Woody Woodpecker cartoon \"Time Tunnel\" playing on the TV in a hotel room, the Marx Brothers film Monkey Business (1931) on TV in the asylum and the subplots of monkeys (drug testing, news stories and animal rights). The film is also a study of modern civilization's declining efforts to communicate with each other due to the interference of technology.[8]12 Monkeys is inspired by the French short film La Jetée (1962); as in La Jetée, characters are haunted by the image of their own death.[11] Like La Jetée, 12 Monkeys contains references to Alfred Hitchcock's Vertigo (1958). Toward the end of the film, Cole and Railly hide in a theater showing a 24-hour Hitchcock marathon and watch a scene from Vertigo. Railly then transforms herself with a blonde wig, as Judy (Kim Novak) transformed herself into blonde Madeleine in Vertigo; Cole sees her emerge within a red light, as Scottie (James Stewart) saw Judy emerge within a green light.[11] Brief notes of Bernard Herrmann's film score can also be heard. Railly also wears the same coat Novak wore in the first part of Vertigo. The scene at Muir Woods National Monument, where Judy (as Madeleine) looks at the growth rings of a felled redwood and traces back events in her past life, resonates with larger themes in 12 Monkeys. Cole and Railly later have a similar conversation while the same music from Vertigo is repeated.[11] The Muir Woods scene in Vertigo is also re-enacted in La Jetée. In a previous scene in the film, Cole wakes up in a hospital bed with scientists of the future talking to him in chorus. This is a direct homage to the \"Dry Bones\" scene in Dennis Potter's The Singing Detective.[15] Posters for the recently renamed English rock band Muse cover the buildings in 1996 Philadelphia with a modified version of their 1998 EP. The then-obscure band would later win the Grammy Award for Best Rock Album in 2011 and 2016.","box_office":"$168.8 million[2]","12_monkeys":"Theatrical release poster","cinematography":"Roger Pratt","production_company":"Atlas Entertainment Classico","directed_by":"Terry Gilliam","release_dates":"December 29, 1995 (1995-12-29)|||||","Production":"The genesis of 12 Monkeys came from executive producer Robert Kosberg, who had been a fan of the French short film La Jetée (1962). Kosberg persuaded the film's director, Chris Marker, to let him pitch the project to Universal Pictures, seeing it as a perfect basis for a full-length science fiction film. Universal reluctantly agreed to purchase the remake rights and hired David and Janet Peoples to write the screenplay.[4] Producer Charles Roven chose Terry Gilliam to direct, because he believed the filmmaker's style was perfect for 12 Monkeys' nonlinear storyline and time travel subplot.[5] Gilliam had just abandoned a film adaptation of A Tale of Two Cities when he signed to direct 12 Monkeys.[6] The film also represents the second film for which Gilliam did not write or co-write the screenplay. Although he prefers to direct his own scripts, he was captivated by Peoples' \"intriguing and intelligent script. The story is disconcerting. It deals with time, madness and a perception of what the world is or isn't. It is a study of madness and dreams, of death and re-birth, set in a world coming apart.\"[5]Universal took longer than expected to approve 12 Monkeys, although Gilliam had two stars (Willis and Pitt) and a firm budget of $29.5 million (low for a Hollywood science fiction film). Universal's production of Waterworld (1995) had resulted in various cost overruns. To get 12 Monkeys approved for production, Gilliam persuaded Willis to lower his normal asking price.[7] Because of Universal's strict production incentives and his history with the studio on Brazil, Gilliam received final cut privilege. The Writers Guild of America was skeptical of the \"inspired by\" credit for La Jetée and Chris Marker.[8]Gilliam's initial casting choices were Nick Nolte as James Cole and Jeff Bridges as Jeffrey Goines, but Universal objected.[6] Gilliam, who first met Bruce Willis while casting Jeff Bridges' role in The Fisher King (1991), believed Willis evoked Cole's characterization as being \"somebody who is strong and dangerous but also vulnerable.\"[5] The actor had a trio of tattoos drawn onto his scalp and neck each day when filming: one that indicated his prisoner number, and a pair of barcodes on each side of his neck.Gilliam cast Madeleine Stowe as Dr. Kathryn Railly because he was impressed by her performance in Blink (1994).[5] The director first met Stowe when he was casting his abandoned film adaptation of A Tale of Two Cities.[6] \"She has this incredible ethereal beauty and she's incredibly intelligent\", Gilliam said of Stowe. \"Those two things rest very easily with her, and the film needed those elements because it has to be romantic.\"[5]Gilliam originally believed that Pitt was not right for the role of Jeffrey Goines, but the casting director convinced him otherwise.[6] Pitt was cast for a comparatively small salary, as he was still relatively unknown at the time. By the time of 12 Monkeys' release, however, Interview with the Vampire: The Vampire Chronicles (1994), Legends of the Fall (1994), and Se7en (1995) had been released, making Pitt an A-list actor, which drew greater attention to the film and boosted its box-office standing. In Philadelphia, months before filming, Pitt spent weeks at Temple University's hospital, visiting and studying the psychiatric ward to prepare for his role.[5]Principal photography lasted from February 8 to May 6, 1995. Shooting on location in Philadelphia and Baltimore (including the Senator Theatre)[9][10] in winter was fraught with weather problems. There were also technical glitches with the futuristic mechanical props. Because the film has a nonlinear storyline, continuity errors occurred, and some scenes had to be reshot. Gilliam also injured himself when he went horseback riding. Despite setbacks, however, the director managed to stay within the budget and was only a week behind his shooting schedule. \"It was a tough shoot\", acknowledged Jeffrey Beecroft (Mr. Brooks, Dances with Wolves), the production designer. \"There wasn't a lot of money or enough time. Terry is a perfectionist, but he was really adamant about not going over budget. He got crucified for Munchausen, and that still haunts him.\"[9]The filmmakers were not allowed the luxury of sound stages; thus, they had to find abandoned buildings or landmarks to use.[8] The exteriors of the climactic airport scene were shot at the Baltimore-Washington International Airport, while the interior scenes were shot at the Pennsylvania Convention Center (formerly, Reading Terminal). Filming at the psychiatric hospital was done at the Eastern State Penitentiary.[11]Gilliam used the same filmmaking style as he had in Brazil (1985), including the art direction and cinematography (specifically using fresnel lenses).[7] The appearance of the interrogation room where Cole is being interviewed by the scientists was based on the work of Lebbeus Woods; these scenes were shot at three different power stations (two in Philadelphia and one in Baltimore). Gilliam intended to show Cole being interviewed through a multi-screen interrogation TV set because he felt the machinery evoked a \"nightmarish intervention of technology. You try to see the faces on the screens in front of you, but the real faces and voices are down there and you have these tiny voices in your ear. To me that's the world we live in, the way we communicate these days, through technical devices that pretend to be about communication but may not be.\"[12]The art department made sure that the 2035 underground world would only use pre-1996 technology as a means to depict the bleakness of the future. Gilliam, Beecroft, and Crispian Sallis (set decorator) went to several flea markets and salvage warehouses looking for materials to decorate the sets.[5] The majority of visual effects sequences were created by Peerless Camera, the London-based effects studio that Gilliam founded in the late 1970s with visual effects supervisor Kent Houston (The Golden Compass, Casino Royale). Additional digital compositing was done by The Mill, while Cinesite provided film scanning services.[5]The film's score was composed, arranged, and conducted by English musician Paul Buckmaster. The main theme is based on Argentine tango musician/composer Ástor Piazzolla's Suite Punta del Este.[13]","produced_by":"Charles Roven","starring":"Bruce Willis|Madeleine Stowe|Brad Pitt|Christopher Plummer|","running_time":"129 minutes[1]","Post-release":"In the beginning of the film, Cole is brought into the interrogation room and told to sit in a chair attached to a vertical rail on the wall. A sphere supported by a metal armature is suspended directly in front of him, probing for weaknesses as the inquisitors interrogate him.[32] Architect Lebbeus Woods filed a lawsuit against Universal in February 1996, claiming that his work \"Neomechanical Tower (Upper) Chamber\" was used without permission. Woods won his lawsuit, requiring Universal to remove the scenes, but he ultimately allowed their inclusion in exchange for a \"high six-figure cash settlement\" from Universal.[32][33]After the release of The Zero Theorem in 2013, claims were made that Gilliam had meant it as part of a trilogy. A 2013 review for The Guardian newspaper said; \"Calling it [The Zero Theorem] the third part of a trilogy formed by earlier dystopian satires Brazil and Twelve Monkeys [sic] [...]\";[34] however, Gilliam was interviewed by Alex Suskind for Indiewire in late 2014, saying \"Well, it’s funny, this trilogy was never something I ever said, but it’s been repeated so often it’s clearly true [laughs]. I don’t know who started it but once it started it never stopped\".[35]On August 26, 2013, Entertainment Weekly announced that Syfy was developing a 12 Monkeys television series based on the film. Production began in November 2013. The pilot was written by Terry Matalas and Travis Fickett, who had written for the series Terra Nova. Due to the series being labeled as \"cast contingent\", the series did not move forward until the roles of Cole and Goines were cast.[36] In April 2014, Syfy green-lighted the first season, which consisted of 13 episodes, including the pilot filmed in 2013. The series premiered on January 16, 2015.[37] On March 12, 2015, the series was renewed for a second season that began airing in April 2016.[38]","music_by":"Paul Buckmaster","edited_by":"Mick Audsley","Release":"12 Monkeys was given a limited release in the United States on December 29, 1995. When the 1,629 theater wide release came on January 5, 1996, the film earned $13.84 million in its opening weekend. 12 Monkeys eventually grossed $57,141,459 in US totals and $111,698,000 in other countries, coming to a worldwide total of $168,839,459.[2] The film was able to hold the #1 spot on box office charts for two weeks in January, before dropping due to competition from From Dusk till Dawn, Mr. Holland's Opus and Black Sheep.[16]Based on 59 reviews collected by Rotten Tomatoes, 88% of the critics gave the film positive reviews, with an average rating of 7.4/10. The consensus reads: \"The plot's a bit of a jumble, but excellent performances and mind-blowing plot twists make 12 Monkeys a kooky, effective experience.\"[17] By comparison, Metacritic calculated a 74 out of 100 rating, based on 20 reviews.[18]The film's startling depiction of the world in 2035—where human life has been driven underground by a 1990s viral outbreak that annihilated 99 percent of human life—may not always make sense. But 12 Monkeys rattles with insightful sound and fury, and its bleak visions are hard to shake.Roger Ebert observed 12 Monkeys' depiction of the future, finding similarities with Blade Runner (1982; also scripted by David Peoples) and Brazil (1985; also directed by Terry Gilliam). \"The film is a celebration of madness and doom, with a hero who tries to prevail against the chaos of his condition, and is inadequate\", Ebert wrote. \"This vision is a cold, dark, damp one, and even the romance between Willis and Stowe feels desperate rather than joyous. All of this is done very well, and the more you know about movies (especially the technical side), the more you're likely to admire it. And as entertainment, it appeals more to the mind than to the senses.\"[20]Desson Thomson of The Washington Post praised the art direction and set design. \"Willis and Pitts's performances, Gilliam's atmospherics and an exhilarating momentum easily outweigh such trifling flaws in the script\", Thomson reasoned.[21] Peter Travers from Rolling Stone magazine cited the film's success on Gilliam's direction and Willis' performance.[22] Internet reviewer James Berardinelli believed the filmmakers took an intelligent and creative motive for the time travel subplot. Rather than being sent to change the past, James Cole is instead observing it to make a better future.[23] Richard Corliss of Time magazine felt the film's time travel aspect and apocalyptic depiction of a bleaker future were clichés. \"In its frantic mix of chaos, carnage and zoo animals, 12 Monkeys is Jumanji for adults\", Corliss wrote.[24]Pitt was nominated for an Academy Award for Best Supporting Actor, but lost to Kevin Spacey in The Usual Suspects. Costume designer Julie Weiss was also nominated for her work, but lost to James Acheson of Restoration.[25] However, Pitt was able to win a Golden Globe Award for Best Supporting Actor in a Motion Picture.[26]Gilliam was honored for his directing duties at the 46th Berlin International Film Festival.[11] 12 Monkeys received positive notices from the science fiction community. The film was nominated for the Hugo Award for Best Dramatic Presentation[27] and the Academy of Science Fiction, Fantasy & Horror Films awarded 12 Monkeys the Saturn Award for Best Science Fiction Film. Pitt and Weiss also won awards at the 22nd Saturn Awards. Bruce Willis, Madeleine Stowe, Gilliam and writers David and Janet Peoples received nominations.[28]Universal Studios Home Entertainment's special edition of 12 Monkeys, released on May 10, 2005, contains an audio commentary by director Terry Gilliam and producer Charles Roven, The Hamster Factor and Other Tales of Twelve Monkeys (a making-of documentary) and production notes.[29] An HD DVD of 12 Monkeys was released on March 4, 2008, and includes the same special features as the special edition DVD.[30] A Blu-ray Disc of 12 Monkeys was released on July 28, 2009, and includes the same special features as the previous special edition DVD and HD DVD.[31]","budget":"$29.5 million"}