{"country":"United Kingdom","distributed_by":"Anglo-Amalgamated/ Warner-Pathé","Plot":"A top secret chemical formula has been stolen by STENCH (the Society for the Total Extinction of Non-Conforming Humans). Fearful of what would happen if that formula fell into the wrong hands, the Chief of the Secret Service reluctantly sends the only agent he has left, the bumbling and snide Agent Desmond Simpkins, (Kenneth Williams), and his three trainees, Agent Harold Crump, (Bernard Cribbins), Agent Daphne Honeybutt, (Barbara Windsor), and Agent Charlie Bind (Charles Hawtrey), to find the formula.The Agents travel separately and in different disguises, to Vienna, where they make contact with Carstairs at the Cafe Mozart. Then they travel on to Algiers. Upon the way, they encounter the STENCH agents, the Fat Man and Milchmann (who stole the formula disguised as a milkman). Unfortunately, the agents' lack of experience results in their contact agent, Carstairs (Jim Dale), being floored in an encounter with the Fat Man.Daphne and Harold attempt to steal the formula back whilst disguised as dancing girls in Hakim's Fun House, where the Fat Man is relaxing. The agents also encounter the mysterious Lila (Dilys Laye), whom they are uncertain if they can trust.The three agents end up captives of STENCH; Daphne is interrogated by the evil Dr Crow, head of STENCH, but she fails to succumb. They escape, but are caught up in an underground automated factory process, from which they only escape when Lila pulls a gun on Dr Crow.The group are transported by lift to the surface, which is revealed to be the office of the Chief of the Secret Service; the headquarters of STENCH are below the streets of London. Lila reveals to Simpkins that she is a double agent, working for SNOG - the Society for Neutralising Of Germs. The STENCH headquarters self-destructs, presumably taking the Secret Service with it.","language":"English","carry_on_spying":"Original UK quad poster","cinematography":"Alan Hume","production_company":"Peter Rogers Productions/ Anglo-Amalgamated","directed_by":"Gerald Thomas","release_dates":"June 1964 (1964-06)|||||","Production":"Albert R. Broccoli, the producer of the James Bond film series, objected to the character name \"James Bind agent 006½\" (intended for Charles Hawtrey) and threatened legal action. Producer Peter Rogers therefore changed the name to Charlie and the agent's code number to double 0 – ooh! Poster artist Tom Chantrell also had to modify the poster when similar complaints were voiced that the artwork was too similar to From Russia with Love.The film pokes fun at various spy movies, James Bond being the least of them. They include The Third Man (coincidentally, Eric Pohlmann – who played The Fat Man – also had a minor part in The Third Man), and Casablanca. One or two of Crow's female assistants wear hairstyles similar to that of Modesty Blaise, whose adventures had started in the London Evening Standard the previous year.","produced_by":"Peter Rogers","starring":"Kenneth Williams Barbara Windsor Bernard Cribbins Charles Hawtrey Eric Barker Dilys Laye","running_time":"87 minutes","Critical Reception":"Carry On Spying received critical acclaim, with critics praising its fast pace, satirical intent and Kenneth Williams's performance. It currently holds a 100% 'fresh' critical rating on Rotten Tomatoes, based on 5 reviews and a 62% audience score based on 912. It is generally considered one of the finest films in the series, alongside Carry On Camping, Carry On... Up the Khyber and Carry On Matron.","Filming and locations":"Interiors:","music_by":"Eric Rogers","edited_by":"Archie Ludski","written_by":"Talbot Rothwell Sid Colin","budget":"£148,000"}