{"based_on":"Atonement  by Ian McEwan","country":"United Kingdom France","distributed_by":"Focus Features","screenplay_by":"Christopher Hampton","Plot":"In 1935, Briony Tallis is a 13-year-old girl from a wealthy English family and has just finished writing a play. Briony attempts to stage the play with her three visiting cousins, twin boys and their teenage sister, Lola; however, they get bored and decide to go swimming. Briony stays behind and witnesses a significant moment of sexual tension between her older sister, Cecilia, and Robbie Turner, a servant's son (a man that Briony has a childish infatuation with). Robbie returns home and writes several drafts of letters to Cecilia, including one that is explicitly sexual and erotically charged. Initially written for the sake of humour, he does not intend to send it and sets it aside. On his way to join the Tallis family for dinner, Robbie asks Briony to deliver his letter, only to later realise that he has mistakenly given her the prurient draft. Briony secretly reads the letter and is simultaneously disgusted and jealous. She tells Lola of its contents and they call Robbie a “sex maniac” while debating whether to turn him in to the police. That afternoon, Lola and her younger brothers meet a friend of the Tallis family, a wealthy chocolate manufacturer named Paul Marshall. Though he is much older than her, he excites Lola by flirting with her and treating her like an adult.That evening, Cecilia confronts Robbie about the letter which she has since read. They meet in the library where they make love and tenderly confess their love for one another. During the act, Briony watches through the partially open door and her confused emotions about Robbie become heightened. At dinner it is revealed that Lola's twin brothers have run away; a search party is sent out and Briony goes off alone into the woods looking for them. She eventually stumbles upon a man running away from apparently raping Lola. Lola claims that she does not know the identity of her attacker, but then claims it was Robbie after Briony suggests that it must have been the “sex maniac” who attacked her. In a fit of pique, the still-hurt Briony tells everyone (including the police) that she saw Robbie commit the act. She shows Robbie's shocking letter to her mother and the police. Everyone believes Briony's story except for Cecilia and Robbie's mother; Robbie is arrested and sent to prison.Four years later, Robbie is released from prison on condition that he join the army. He is assigned to A Company, 1st Battalion, Royal Sussex Regiment and sent to France, where he is separated from his unit and attempts to return to them at Dunkirk on foot. He is then shown reuniting with Cecilia (who has not spoken with her family since the incident) in London six months earlier, where they renew their love before he is shipped off to the French front. Briony, now 18, has joined Cecilia's old nursing corps at St. Thomas's in London because she wants to be of some practical use to society after giving up an offer she received from Cambridge. Her attempts at contacting her sister go unanswered as Cecilia cannot forgive her for Robbie's unjust imprisonment. Robbie, gravely ill and wounded, finally arrives at the beaches of Dunkirk where he waits to be evacuated.Sometime later, Briony—at last fully understanding the consequences of her false accusation—visits the now-married Cecilia and Robbie to apologise to them directly. However, her apologies are rather weak and ineffectual; Cecilia coldly replies that she will never forgive her, while Robbie, in a rage that almost becomes physical, confronts Briony and demands that she immediately tell her family and the authorities the truth. Briony admits she knew soon after the incident that the real rapist was Paul Marshall, but that Lola cannot testify against him in a court of law because they have recently been married.Decades later, an elderly Briony (now a published author) gives an interview about her latest book, a autobiographical \"novel\" called “Atonement.” She reveals that she is dying of vascular dementia and states that this last book is one she has been working on for most of her adult life. Briony confesses that the book's ending (in which she apologises to a married Cecilia and Robbie) is fictional: Cecilia and Robbie were never married and never saw each other again once he left for war. In reality, Robbie died at Dunkirk of septicemia while awaiting evacuation and Cecilia died a few months later as one of the flood victims in the Balham tube station bombing during The Blitz. Briony hopes that by reuniting them in fiction she can give them the happy ending they always deserved. The last scene of the movie shows a happy Cecilia and Robbie together once again in what could either be afterlife or a figment of Briony's imagination.","language":"English","Reception":"The film received positive reviews from film critics. The review site Rotten Tomatoes records that 83% of 196 critics gave the film positive reviews, with a consensus that \"Atonement features strong performances, brilliant cinematography and a unique score. Featuring deft performances from James McAvoy and Keira Knightley, it's a successful adaptation of Ian McEwan's novel.\"[22] On other review sites, Metacritic records an average score of 85%, based on 36 reviews.[23]In Britain, the film was listed as #3 on Empire's Top 25 Films of 2007. The Australian edition of Empire gave it a five-star review, praising Wright's direction in the second half of the film, where he demonstrates \"storytelling and technical flair to match his ability with actors\".[24] Time magazine's Richard Corliss named the film one of the Top 10 Movies of 2007, ranking it at #4. Corliss praised the film as \"first beguiling, then devastating\", and singled out Saoirse Ronan as \"terrific as the confused 12-year-old.\"[25][26]The American critic Roger Ebert gave it a four-star review, dubbing it \"one of the year's best films, a certain best picture nominee.\"[27] In the film review television program, At the Movies with Ebert & Roeper, Richard Roeper gave the film \"thumbs up\" adding that Knightley gave \"one of her best performances\". As for the film, he commented that: \"Atonement has hints of greatness but it falls just short of Oscar contention.\"[citation needed]A censored and dubbed version of Atonement was shown to an extremely limited audience in North Korea at the Pyongyang International Film Festival in 2008. The Los Angeles Times reported that \"Screenings of two British films, Atonement and Elizabeth: The Golden Age, were so crowded that guards had to bar the doors to prevent gate-crashers.\"[28]The film appeared on many critics' top ten lists of the best films of 2007.[29]The film has received numerous awards and nominations, including seven Golden Globe nominations, more than any other film nominated at the 65th Golden Globe Awards,[31][32] and winning two of the nominated Golden Globes, including Best Motion Picture Drama. The film also received 14 BAFTA nominations for the 61st British Academy Film Awards including Best Film, Best British Film and Best Director, seven Academy Award nominations, including Best Picture, and the Evening Standard British Film Award for Technical Achievement in Cinematography, Production Design and Costume Design, earned by Seamus McGarvey, Sarah Greenwood and Jacqueline Durran, respectively. Atonement also ranks 442nd on Empire magazine's 2008 list of the 500 greatest movies of all time.[33]Atonement has been named among the Top 10 Films of 2007 by the Austin Film Critics Association, the Dallas-Fort Worth Film Critics Association, the National Board of Review, New York Film Critics Online, the Oklahoma Film Critics Circle, and the Southeastern Film Critics Association.[34][35][36][37][38][39]","box_office":"$129.3 million[2]","cinematography":"Seamus McGarvey","production_company":"StudioCanal Relativity Media Working Title Films","atonement":"UK release poster","directed_by":"Joe Wright","Home media":"Atonement was released on DVD on 4 February 2008 in region 2, and the HD DVD edition followed on 11 March 2008. The North American DVD and HD DVD/DVD combo editions (USA/Canada) were released on 18 March 2008.[40][41] The Blu-ray was released on 26 January 2010.[42]","release_dates":"29 August 2007 (2007-08-29) (VIFF)|7 September 2007 (2007-09-07) (United Kingdom)||||","Production":"The film was produced by Working Title Films and filmed throughout the summer of 2006 in Great Britain.[11]These mainly were:The other places across London were Great Scotland Yard and Bethnal Green Town Hall, the latter being used for a 1939 tea-house scene, as well as the church of St John's, Smith Square, Westminster for Lola's wedding. Re-enactment of the 1940 Balham station disaster took place in the former Piccadilly line station of Aldwych, closed since the 1990s.War scenes (in the French countryside) were filmed in Coates and Gedney Drove End, Lincolnshire; Walpole St Andrew and Denver, Norfolk; and in Manea and Pymoor, Cambridgeshire.Much of the St Thomas's hospital ward interior was filmed at Park Place, Berkshire and exterior at University College London.[6]All the exteriors and interiors of the Tallis family home were at the house mentioned selected from an old Country Life edition to tie in with the period and pool fountain of the novel.[18] This mansion was built in 1889 commissioned by the glove manufacturer John Derby Allcroft. It remains an undivided family home.The third portion of Atonement was entirely filmed at the BBC Television Centre, London. The beach with cliffs first shown on the postcard and later seen towards the end of the film was Cuckmere Haven Seven Sisters, Sussex (near to Roedean School, which Cecilia was said to have attended).","produced_by":"Tim Bevan Eric Fellner Paul Webster","starring":"James McAvoy Keira Knightley Saoirse Ronan Romola Garai Vanessa Redgrave","running_time":"123 minutes[1]","Historical inaccuracy":"The film shows an Avro Lancaster bomber flying overhead in 1935, an aircraft whose first flight was not until 1941. In the scene on the beach at Dunkirk, Robbie is told that the Lancastria has been sunk, an event that actually happened on 17 June 1940, two weeks after the end of the Dunkirk evacuations.[43]","music_by":"Dario Marianelli","edited_by":"Paul Tothill","Release":"The film opened the 2007 Venice International Film Festival, making Wright, at 35, the youngest director ever to be so honoured.[19] The film also opened the 2007 Vancouver International Film Festival.[20] Atonement was released in the United Kingdom and Ireland on 7 September 2007,[21] and in North America on 7 December 2007. Worldwide distribution was managed by Universal Studios, with minor releases through other divisions.[11]The film grossed $129,266,061 worldwide.[2] The film was released in the United Kingdom and Ireland on 7 September 2007, and grossed £11,557,134. It was also given a limited release in North America on 7 December, and grossed $784,145 during its opening weekend, posting a per-cinema average of $24,504 in 32 cinemas.[citation needed]","budget":"$30 million[citation needed]"}