{"country":"Argentina Chile France Netherlands","distributed_by":"Pol-Ka","Plot":"Zapa (Jorge Román) is a locksmith apprentice living the simple life in Corrientes with his family.After the locksmith Polaco (Hugo Anganuzzi) pulls a job on a safe and uses him as a scapegoat, Zapa is made to pay for the crime by serving in the Buenos Aires police jail, which is pictured as notoriously corrupt. This takes him to the La Matanza barrio in Greater Buenos Aires.Here, Zapa is taken in as the protegé of his superior Gallo (Darío Levy) and begins to climb the ladder of corruption. At the same time he has an affair with instructor Mabel (Mimí Ardú).His journey through the political underworld as he frames and bribes ultimately takes him to the edge of innocence, and a final confrontation with El Polaco. ","language":"Spanish","Reception":"New York Times film critic Stephen Holden lauded the film and wrote, \"There are no crusading moralists to clean up the mess in El Bonaerense, Pablo Trapero's grim, dispassionate drama of police corruption, set mostly in contemporary Buenos Aires. This powerful sweat-stained swatch of Argentine neo-realism, filmed in harsh high contrast that throws its characters' faces into deep shadow, follows the initiation of Zapa (Jorge Román), a naïve police recruit, into a labyrinth of sleaze...[the film] is all the more disturbing for refusing to act as an exposé. It just throws up its hands and says that this is the way it is. And its pointed detachment lends certain scenes an almost farcical sense of the absurd.\"[3]WinsNominations","cinematography":"Guillermo Nieto","directed_by":"Pablo Trapero","release_dates":"May 21, 2002 (2002-05-21) (France)|||||","Distribution":"The film was first presented at the 2002 Cannes Film Festival on May 21 in the Un Certain Regard section.[2] It opened in Argentina on September 19, 2002.The picture was screened at various film festivals, including: the Karlovy Vary Film Festival, Czech Republic; the Toronto Film Festival, Canada; the Chicago International Film Festival, USA; the Bergen International Film Festival, Norway; the Stockholm International Film, Sweden; and others.","el_bonaerense":"Theatrical release poster","produced_by":"Pablo Trapero","starring":"Jorge Román Mimí Ardú Darío Levy","running_time":"105 minutes","music_by":"Pablo Lescano","edited_by":"Nicolás Goldbart","written_by":"Nicolas Gueilburt Ricardo Ragendorfer Dodi Shoeuer Pablo Trapero Daniel Valenzuela"}