{"country":"United States","distributed_by":"Miramax Films","Plot":"Alex Rose (Ben Stiller) and Nancy Kendricks (Drew Barrymore) are a young, professional, married New York couple in search of their dream home. When they finally find the perfect Brooklyn brownstone they are giddy with anticipation. The duplex is a dream come true, complete with multiple fireplaces, except for one thing: Mrs. Connelly (Eileen Essell), the old lady who lives on the rent-controlled top floor. Assuming she is elderly and ill, they take the apartment.However, they soon realize that Mrs. Connelly is in fact an energetic senior who enjoys watching her television at top volume day and night and rehearsing in a brass band. As a writer, Alex is attempting to finish his novel against a looming deadline. However, he is interrupted daily by Mrs. Connelly's numerous demands and requests, and what begins as a nuisance quickly escalates into an all-out war. Alex and Nancy try to get Mrs. Connelly to move out, but she refuses. Next, they try to file a noise complaint against her, but discover that she has already went to the police first and filed a harassing complaint against them. Mrs. Connelly soon turns all of Alex and Nancy's friends against them by play-acting as the \"poor, innocent, old lady\" and makes it appear that the young couple are out to harm her.When Nancy loses her job and Alex misses his deadline (all because of the old lady's antics) the pair are trapped at home together with Mrs. Connelly with no place to go. Their rage turns to homicidal fantasy as they plot ways to get rid of their manipulative, no-good neighbor. After peace overtunes and a break-in lead to nothing, Alex and Nancy decide to hire a hitman, named Chick (James Remar), to kill her. However, his asking price for doing the hit is $25,000. Unable to initially come up with the money, Alex approaches his friend and fellow writer, Coop, to ask for a loan, but is rudely rebuffed. Desperate and needing the money in two days, they sell almost every possession they own to pay Chick who will do the hit on Christmas Eve. Chick does break into Mrs. Connelly's apartment as planned, but fails to kill her when she defends herself with her speargun by shooting him in the shoulder, forcing him to flee, and the couple in fact have to rescue the old woman when the struggle results in a fire in her apartment.Accepting defeat, Alex and Nancy decide to evict themselves, but find out that the old woman has died right when they leave. Alex and Nancy, now with no jobs, friends, or money left, move away where they contemplate their strange encounters. But here the audience learns in a climatic plot twist that the realtor of the duplex, Kenneth (Harvey Fierstein) (revealed to be Mrs. Connelly's son) and the ill-tempered NYPD Officer Dan (Robert Wisdom) (Kenneth's gay lover) who had frequently harassed and distrusted the couple and always sided with Mrs. Connelly in her arguments with Alex and Nancy, and Mrs. Connelly herself (who is not in fact dead) have been doing this to others. This wicked and unethical trio have been running a mean-spirited, real-estate scam for several years: Kenneth sells the ground floor apartment only to good-natured young couples, then Mrs. Connelly, aided by the corrupt Officer Dan, harasses and destroys the young couple's lives, eventually forcing them to move out, and then faking Mrs. Connelly's own death so that the couple will never return and leaving Mrs. Connelly, Kenneth and Dan to collect and live off of the sales commission from the next occupants that buy the ground floor apartment. Alex and Nancy were Mrs. Connelly and her son's latest victims among so many.At the conclusion, it is revealed in a voice-over by Alex that he and Nancy relocated to the Bronx. They never saw Mrs. Connelly again, nor did they ever find out about the scam they were the victims of. While Mrs. Connelly, Kenneth and Officer Dan continue their scam by targeting the next friendly young couple that moves into the ground floor apartment right after Alex and Nancy move out, Alex used his unpleasant experience of living there as inspiration for writing his next book, titled \"Duplex\", which became a best-selling novel, saving Alex and Nancy from their life of poverty, and giving the film a semi-happy ending.","duplex":"Theatrical release poster","language":"English","Reception":"The film opened to negative reviews, with many feeling this was not DeVito's best. The film has a 50 on Metacritic, and a 35% rating on Rotten Tomatoes.[2][3] Roger Ebert of the Chicago Sun-Times gave the film two stars out of four and wrote that the \"murder schemes aimed at Mrs. Connell don't generate the laughter they should, maybe because no matter what she does, she still seems, irremediably, unredeemably, a sweet little old lady. [...] 'Duplex' is all about plotting; it tries to impose emotions that we don't really feel. We can't identify with Mrs. Connell, that's for sure, but we can't identify with Alex and Nancy, either, because we don't share their frustration -- and the reason we don't is because we don't believe it. There's too much contrivance and not enough plausibility, and so finally we're just enjoying the performances and wishing they'd been in a more persuasive movie.\"[4]Barrymore earned a Golden Raspberry Award nomination for Worst Actress for her performances in both Duplex and Charlie's Angels: Full Throttle, but lost to Jennifer Lopez for Gigli.On a US $40 million budget, it only grossed US $9,692,135 in the US and the equivalent of $US 19,322,135 worldwide.[5]","box_office":"$19,322,135","cinematography":"Anastas Michos","production_company":"Jersey Films","directed_by":"Danny DeVito","narrated_by":"Danny DeVito","release_dates":"September 26, 2003 (2003-09-26)|||||","produced_by":"Drew Barrymore Stuart Cornfeld Larry Doyle Nancy Juvonen Jeremy Kramer Ben Stiller","starring":"Ben Stiller Drew Barrymore Eileen Essell","running_time":"89 minutes","music_by":"David Newman","edited_by":"Greg Hayden Lynzee Klingman","written_by":"Larry Doyle","budget":"$40 million"}