{"Adaptations":"Army of Darkness had a comic book adaptation and several comic book sequels. The movie adaptation, from publisher Dark Horse Comics, was actually published before the film's theatrical release.[48]Eden Studios, Inc. published the Army of Darkness Roleplaying Game in 2005.","country":"United States","distributed_by":"Universal Pictures","Plot":"After being pulled through a time portal, Ash Williams lands in A.D. 1300, where he is soon captured by Lord Arthur's men, who suspect him to be an agent for Duke Henry, with whom Arthur is at war. He is enslaved along with the captured Henry, his gun and chainsaw confiscated, and is taken to a castle. Ash is thrown in a pit where he fights off a Deadite and regains his weapons from Arthur's Wise Man. After demanding Henry and his men be set free (as he knew Henry was innocent, and his persecution was simply a witch hunt) and killing a Deadite in full view of everyone, Ash is celebrated as a hero. He also grows attracted to Sheila, the sister of one of Arthur's fallen knights.According to the Wise Man, the only way Ash can return to his time is to retrieve the Necronomicon Ex-Mortis, a book with magical powers. After bidding goodbye to Sheila, Ash starts his search for the Necronomicon. As he enters a haunted forest, an unseen force pursues Ash through the woods. Fleeing, he ducks into a windmill where he crashes into a mirror. The small reflections of Ash climb out from the shattered mirror and torment him. One of the reflections dives down Ash's throat and uses his body to become a life-sized clone of Ash and attack him, after which Ash kills and buries the clone.When he arrives at the Necronomicon's location, he finds three books instead of one. Ash eventually finds the real one and attempts to say the magic phrase that will allow him to remove the book safely – \"Klaatu barada nikto\". However, forgetting the last word, he tries to trick the book by mumbling and coughing the missing word. He then grabs the book from the cradle, and rushes back to the castle, while the dead rise from graves all around. During Ash's panicked ride back, his evil copy rises from his grave and unites the Deadites into the Army of Darkness.Despite causing the predicament faced by the medieval soldiers, Ash initially demands to be returned to his own time. However, Sheila is captured by a Flying Deadite, and later transformed into a Deadite. Ash becomes determined to lead the humans against the army of the dead. Reluctantly, the people agree to join Ash. Using scientific knowledge from textbooks in the trunk of his 1973 Oldsmobile Delta 88, and enlisting the help of Duke Henry, Ash successfully leads the medieval soldiers to victory over the Deadites and Evil Ash, saving Sheila and bringing peace between Arthur and Henry in the process. The Wise Men return him to his own time, giving him a potion to drink after reciting the magic phrase.Back in the present, Ash recounts his story to a fellow employee at his job, working in housewares at a store called \"S-Mart\". As he talks to a girl who is interested in his story, a surviving deadite, allowed to come to the present due to Ash again forgetting the last word of the magic phrase, attacks the customers. Ash attacks and kills it using a Winchester rifle from the store's Sporting Goods department, finally ending the deadite threat.The original ending, preferred by Raimi and Campbell themselves, in which Ash oversleeps in the cave and wakes up in a post-apocalyptic future, was restored to the film for the UK VHS release, which also had the S-Mart ending put in as a post-credit extra. This scene has been restored on the Army of Darkness: Director's Cut Region 3 DVD released by Metro-Goldwyn-Mayer, the \"director's cut bootleg edition\" DVD and the double-disc DVD, which also featured the S-Mart ending of the film. The S-Mart ending was shot for the American release; the studio wanted to end the film on a high note for the character of Ash. Raimi believed Ash to be more of a fool, which is why he liked to torture him so much in his films; Ash being a goof and drinking too much potion was in his character.","language":"English","Reception":"Army of Darkness was released by Universal on February 19, 1993 in 1,387 theaters in the United States, grossing $4.4 million (38.5% of total gross) on its first weekend. In total, the film earned $11.5 million in the US.[28]The film currently holds a 72% \"Fresh\" rating on the review aggregate website Rotten Tomatoes, based on 46 reviews,[29] which made its critical reception above average but much lower than The Evil Dead and Evil Dead II, which received 96% and 98% respectively.[30][31] On Metacritic, the film holds a score of 57 out of 100, indicating \"mixed or average reviews\".[32] Roger Ebert gave the film two out of four stars and wrote, \"The movie isn't as funny or entertaining as Evil Dead II, however, maybe because the comic approach seems recycled.\"[33] In her review for The New York Times, Janet Maslin praised, \"Mr. Campbell's manly, mock-heroic posturing is perfectly in keeping with the director's droll outlook.\"[34] Desson Howe, in this review for The Washington Post praised the film's style: \"Bill Pope's cinematography is gymnastic and appropriately frenetic. The visual and make-up effects (from artist-technicians William Mesa, Tony Gardner and others) are incredibly imaginative.\"[35] However, Entertainment Weekly gave the film a \"C+\" rating and wrote, \"This spoofy cast of thousands looks a little too much like a crew of bland Hollywood extras. By the time Army of Darkness turns into a retread of Jason and the Argonauts, featuring an army of fighting skeletons, the film has fallen into a ditch between parody and spectacle.\"[36]Army of Darkness won the Saturn Award for Best Horror Film (1994). It was also nominated for Best Make-Up. Army of Darkness was nominated for the Grand Prize at Avoriaz Fantastic Film Festival, and won the Golden Raven at the Brussels International Festival of Fantasy Film in 1993. The film also won the Critics' Award at Fantasporto, and was nominated for the International Fantasy Film Award in the category of Best Film in 1993. It was also nominated for Best Film at Sitges, the Spanish International Film Festival.","box_office":"$21.5 million[2]","cinematography":"Bill Pope","directed_by":"Sam Raimi","army_of_darkness":"Theatrical release poster","production_companies":"Dino De Laurentiis Communications Renaissance Pictures","release_dates":"October 9, 1992 (1992-10-09) (world premiere)|February 19, 1993 (1993-02-19) (United States)||||","Production":"Plans to make a third Evil Dead film had been circulating for a number of years, even prior to the production of Darkman.[5] Evil Dead II made enough money internationally that Dino De Laurentiis was willing to finance a sequel.[5] Director and script writer Sam Raimi drew from a variety of sources, including literature with A Connecticut Yankee in King Arthur's Court and Jonathan Swift's Gulliver's Travels and films like The Seventh Voyage of Sinbad, Jason and the Argonauts, and The Three Stooges. Evil Dead II, according to Bruce Campbell, \"was originally designed to go back into the past to 1300, but we couldn't muster it at the time, so we decided to make an interim version, not knowing if the 1300 story would ever get made\".[6] Promotional drawings were created and published in Variety during the casting process before the budget was deemed too little for the plot. The working title for the project was Evil Dead III: Army of Darkness.[7] The title \"Army of Darkness\" came from an idea by Irvin Shapiro, during the production of Evil Dead II.[8] This was used after Sam Raimi was unable[why?] to use his original title \"The Medieval Dead.\" (\"The Medieval Dead\" would later be used as the film's subtitle for its UK release as Army of Darkness: The Medieval Dead).[citation needed]Initially, Raimi invited Scott Spiegel to co-write Army of Darkness because he had done a good job on Evil Dead II, but he was busy on rewrites for the Clint Eastwood film The Rookie.[9] After the good experience of writing the screenplay for a film called Easy Wheels, Sam and his brother Ivan decided to co-write the film together.[10] They worked on the script throughout the pre-production and production of Darkman.[5] After filming Darkman, they took the script out and worked on it in more detail. Raimi says that Ivan \"has a good sense of character\" and that he brought more comedy into the script.[10] Campbell remembers, \"We all decided, 'Get him out of the cabin.' There were earlier drafts where part three still took place there, but we thought, 'Well, we all know that cabin, it's time to move on.' The three of us decided to keep it in 1300, because it's more interesting\".[6] Campbell and Tapert would read the script drafts, give Raimi their notes and he would decide which suggestions to keep and which ones to discard.[11]The initial budget was $8 million but during pre-production, it became obvious that this was not going to be enough.[5] Darkman was also a financial success and De Laurentiis had a multi-picture deal with Universal and so Army of Darkness became one of the films. The studio decided to contribute half of the film's $12 million budget.[12] However, the film's ambitious scope and its extensive effects work forced Campbell, Raimi and producer Robert Tapert to put up $1 million of their collective salaries to shoot a new ending and not film a scene where a possessed woman pushes down some giant pillars.[5] Visual effects supervisor William Mesa showed Raimi storyboards he had from Victor Fleming's film Joan of Arc that depicted huge battle scenes and he picked out 25 shots to use in Army of Darkness.[13] A storyboard artist worked closely with the director in order to blend the shots from the Joan of Arc storyboards with the battle scenes in his film.[13]Traci Lords was among the actresses auditioning for the film, saying in 2001, \"I didn't get the part but I clicked with Bruce [Campbell],\" with whom she would later work as a guest star in the TV series Hercules: The Legendary Journeys.[14]Principal photography took place between soundstage and on-location work. Army of Darkness was filmed in Bronson Canyon and Vasquez Rocks Natural Area Park. The interior shots were filmed on an Introvision stage in Hollywood. Raimi's use of the Introvision process was a tribute to the stop-motion animation work of Ray Harryhausen.[13] Introvision uses front-projected images with live actors instead of the traditional rear projection that Harryhausen and others used. Introvision blended components with more realistic-looking results. To achieve this effect, Raimi used 60-foot-tall Scotchlite front-projection screens, miniatures and background plates.[13] According to the director, the advantage of using this technique was \"the incredible amount of interaction between the background, which doesn't exist, and the foreground, which is usually your character\".[15]Shooting began in mid-1991, and it lasted for about 100 days.[16] It was a mid-summer shoot and while on location on a huge castle set that was built near Acton, California on the edge of the Mojave Desert, the cast and crew endured very hot conditions during the day and very cold temperatures at night.[17] Most of the film took place at night and the filmmakers shot most of the film during the summer when the days were longest and the nights were the shortest. It would take an hour and a half to light an area leaving the filmmakers only six hours left to shoot a scene.[18] Money problems forced cinematographer Bill Pope to shoot only for certain hours Monday through Friday because he could not be paid his standard fee. Mesa shot many of the action sequences on the weekend.[19]It was a difficult shoot for Campbell who had to learn elaborate choreography for the battle scenes, which involved him remembering a number system because the actor was often fighting opponents that were not really there.[20] Mesa remembers, \"Bruce was cussing and swearing some of the time because you had to work on the number system. Sam would tell us to make it as complicated and hard for Bruce as possible. 'Make him go through torture!' So we'd come up with these shots that were really, really difficult, and sometimes they would take thirty-seven takes\".[20] Some scenes, like Evil Ash walking along the graveyard while his skeleton minions come to life, blended stop-motion animation with live skeletons[clarification needed] that were mechanically rigged, with prosthetics and visual effects.[20]While Dino De Laurentiis gave Raimi and his crew freedom to shoot the film the way they wanted, Universal took over during post-production.[21] Universal was not happy with Raimi's cut because it did not like his original ending, feeling it was negative.[21] A more upbeat ending was shot a month later in a lumber store in Malibu, California. Then, two months after principal filming was finished, a round of re-shoots began in Santa Monica and involved Ash in the windmill and the scenes with Bridget Fonda.[21] Raimi recalls, \"Actually, I kind of like the fact that there are two endings, that in one alternate universe Bruce is screwed, and in another universe he's some cheesy hero\".[22]Raimi needed $3 million to finish his film, but Universal was not willing to give him the money and delayed its release due to a dispute with De Laurentiis over the rights to the Hannibal Lecter character which Universal needed so that they could film a sequel to The Silence of the Lambs.[23] The matter was finally resolved, but the release date for Army of Darkness' was pushed back from summer of 1992 to February 1993.For the film's poster, Universal brought Campbell in to take several reference head shots and asked him to strike a sly look on his face. They showed him a rough of the Frank Frazetta-like painting. The actor had a day to approve it or, as he was told, there would be no ad campaign for the film.[24] Raimi ran into further troubles when the MPAA gave it an NC-17 rating for a shot of a female Deadite being decapitated early on in the film. Universal wanted a PG-13 rating, so Raimi made a few cuts and was still stuck with an R rating.[25] In response, Universal turned the film over to outside film editors who cut the film to 81 minutes and another version running 87 minutes that was eventually released in theaters, still with an R rating.[25]Danny Elfman, who composed the score for Darkman, wrote the \"March of the Dead\" theme for Army of Darkness.[25] After the re-shoots were completed, Joseph LoDuca, who composed the music for The Evil Dead and Evil Dead II, returned to score the film.[26] The composer used his knowledge of synthesizers and was able to present many cues in a mock-up form before he took them in front of an orchestra.[25] The score is set for a release during the MondoCon in Austin, Texas on 3 and 4 October 2015, on Vinyl, over Mondo Records.[27]","produced_by":"Robert Tapert","starring":"Bruce Campbell|Embeth Davidtz|","running_time":"88 minutes[1]","Sequel":"In March 2013, shortly before the release of Evil Dead, a reboot and loose continuation of the franchise, Raimi confirmed that the next Evil Dead film will be Army of Darkness 2. Campbell confirmed that he would star as an older, but not necessarily wiser, Ash.[37][38] At a WonderCon panel in March 2013, Campbell and Fede Alvarez, director of the reboot, stated that their ultimate plan was for Alvarez's Evil Dead 2 and Raimi's Army of Darkness 2 to be followed by a seventh film which would merge the narratives of Ash and Mia.[39] On October 18, 2013, Campbell once again confirmed in an interview with ComicBook.com that he will be reprising his role as Ash in the sequel.[40] Fede Alvarez posted a status update on his Twitter account that Raimi will direct the sequel.[41] Campbell later commented that the rumor about him returning is false.[42][43]In July 2014, Campbell stated it was likely the planned sequel would instead be a TV series with him as the star. The ten-episode season of Ash vs. Evil Dead[44][45] premiered on Starz on October 31, 2015, with the pilot co-written and directed by Sam Raimi.[46] Due to legal issues with Universal, the events from Army of Darkness can not specifically be mentioned on the show.[47] In addition to Campbell, the series stars Dana DeLorenzo, Ray Santiago,[46] and Lucy Lawless.","music_by":"Danny Elfman (Themes)|Joseph LoDuca|","edited_by":"Bob Murawski|R.O.C. Sandstorm|","written_by":"Sam Raimi|Ivan Raimi|","budget":"$11 million[2]"}