{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"Steve Clark (James Marsden) is a high school senior whose family moves to Cradle Bay, a picturesque coastal town in Washington state's Puget Sound with his parents. It has been nearly one year since Steve's older brother, Allen (Ethan Embry), committed suicide which traumatized the family. Steve's parents tell him that they have relocated from Chicago to Cradle Bay as a fresh start to move on with their lives.During Steve's first day at his new high school, he meets and befriends three outcast students, Gavin Strick (Nick Stahl), U.V. (Chad E. Donella), and Rachel \"Rae\" Wagner (Katie Holmes). Gavin tries to tell Steve that he believes there is something evil about the \"Blue Ribbons\"—a clique of students taking part in a \"special program\" led by the school psychologist, Dr. Caldicott (Bruce Greenwood). Steve is understandably skeptical.Steve witnesses a fight in class between a student, Dickey, and one of the Blue Ribbons. Later, Dickey is trying to buy car parts for his muscle car at an out-of the way marina, and is accosted by the Blue Ribbons. Soon after, Dickey reappears at school, now one of the Blue Ribbons, and having donated his once-prized car to a demolition fundraiser.Steve goes to a local yogurt shoppe where the Blue Ribbons congregate. Steve comments about seeing Dickey and his recent adversary sitting together, to which Dickey replies \"We made peace\". Gavin arrives to meet Steve, and takes him outside after a tense exchange with the group of Blue Ribbons. Gavin shows a photograph of himself and several Blue Ribbons, who were until recently rocker/parties types. The two eavesdrop on a parents meeting, where Gavin learns his parents have signed him up for Caldicott's program. Steve remains skeptical of Gavin's fears of the Blue Ribbons and the program, and wrestles a gun Gavin produces, which he plans to use against his expected abductors. Steve heads home.The following day at lunch, Gavin walks in looking like a Blue Ribbon. When Steve tries to confront Gavin, he gets punched in the stomach for his impertinence. Later, after being chased home, Steve finds Blue Ribbon member Lorna Longley in his living room, ostensibley waiting up after tutoting Steve's younger sister while Steve's parents are \"At a meeting\". Steve suggests she leave. She asks to use the bathroom first, then emerges, partial undressed, and forcefully kisses Steve. Her heightened arousal causes her eye to glow red, startling Steve. Lorna starts saying \"wrong, bad\" then smash her head into a mirror, attacks Steve with a mirror shard, them obliviously leaves the house. She is later seen undergoing treatment at a medical facility under Dr. Caldicott's direction.During this time, Steve also befriends Dorian (William Sadler), the school janitor, who appears to be mentally handicapped and hunts rats for the city for some extra cash. Dorian demonstrates a device called an E-Rat-icator which emits a soft, high pitched whine that is supposed to be innocuous but annoying to rats, which is an abysmal failure. Steve discovers that Dorian is actually highly intelligent, and carries classical literature pieces with him, and that he's hiding because he wishes to be left alone and does not trust society. Dorian also tells Steve that he suspects that the entire community of Cradle Bay is part of a massive conspiracy made up of nearly all of the parents, the local police chief, the school principal and entire school faculty, who hired Dr. Caldicott to \"re-program\" their own children to become the perfect people that they want them to be and not free-thinkers. Rachel finds a CD-R disc that Gavin hid in the school's boiler room, containing a video he made of himself before his \"transformation\", telling about the club and about the history that he learned about Dr. Caldicott. A Blue Ribbon known as \"Chug\" (A.J. Buckley) assaults Rachel in the basement, when Dorian's E-Rat-icator goes off, and immediately sends Chug into an agonized frenzy, during which Rachel slips away. Chug smashes the E-Rat-cator and walks out, apparently oblivious to what has just occurred.During their personal investigation, Steve and Rachel try to find out what exactly has been happening to the Blue Ribbon kids, which leads them to a mental hospital called Bishop Flats following a lead on the disc that Gavin left behind in the basement (which Rachel had retrieved before her encounter with Chug). At Bishop Flats, they find out that mind control is being used to make depressed, awkward and unruly teens become perfect so they can function properly in life, but the programming has some glitches that lead to momentary relapses and violent fits. Also at Bishop Flats, they find Caldicott's daughter, Betty (Julie Patzwald), a failed project who spends her time repeating the same phrase: \"Meet the musical little creatures that hide among the flowers\", along with other damaged test subjects who compulsively brush, floss and apply makeup.After escaping from the hospital, Steve and Rachel return to Cradle Bay to plan to rescue Lindsey before fleeing town. They have a run-in with the town's police chief Cox (Steve Railsback) who is also involved in the conspiracy. He tries to arrest them for being out after curfew. But Dorian shows up under the pretense that he is disposing of dead rats, then knock out the police chief and frees Steve and Rachel, telling them to leave town and go public with what they know about Dr. Caldicott's work.When Rachel and Steve return to Steve's home to get Lindsay (Katharine Isabelle), Steve's parents (Terry David Mulligan and Susan Hogan) reveal that they are also part of the conspiracy and that they moved to Cradle Bay for the purpose to sign him up for Caldicott's program, and Caldicott himself confronts them. Steve and Lindsay try to get out but they get ambushed by a group of Blue Ribbons waiting for them outside the house. They drag Steve and Rachel to the programming center. Steve grabs a scalpel before being strapped into a chair. He confronts Caldicott about the human cost of the reprogram, but Caldicott is dismissive, including in regard to his own daughter. Before the reprogramming can start, Steve uses the scalpel to cut his bonds and escape to rescues Rachel, killing the medical techs. On the way out, they fight and kill Chug, who has been left behind to guard them.Exiting what turns out to be the town's hospital basement, Steve and Rachel are met by Lindsay and U.V. in Rachel's truck. Rushing to catch the early ferry, they meet with a roadblock made of Blue Ribbons and Caldicott on the road. When hope seems lost, Dorian drives up, striking Caldicott, and activating multiple E-Rat-icators that scramble the mind control tech inside the Blue Ribbons' heads. They chase after Dorian and try to destroy the E-Rat-icators Dorian, having been fatally wounded by a gunshot from Caldicott, and believing the Blue Ribbons to be beyond help, drives his car off a cliff with most of the Blue Ribbons hanging onto it. An injured Caldicott reappears, reacting to Steve's declaration that \"It's over\" by saying he will start his experiments again elsewhere. This leads to a final battle between Steve and Caldicott, which Steve wins by kicking Caldicott off the cliff. Steve and Rachel then leave town on the ferry with Lindsay and U.V. to begin a new life elsewhere without their parents.The final scene shows a classroom in an urban high school with kids playing loud music, cursing, and acting up. They are informed that they have a new student teacher. The well-groomed teacher turns around after writing on the board, and it's Gavin, with the blue ribbon \"red twinkle\" still active in his eye.","language":"English","Reception":"The film opened at No. 7 at the North American box office making $7 million USD in its opening weekend. It had a 57% decline in earnings the following week, falling to No. 12.[7]As of November 2015, the film holds a \"rotten\" 35% rating at the film review aggregator website Rotten Tomatoes, receiving 24 negative reviews out of 37.[8]","box_office":"$17,514,980","disturbing_behavior":"Theatrical release poster","cinematography":"John S. Bartley","production_company":"Village Roadshow Pictures Beacon Pictures","directed_by":"David Nutter","Alternate versions":"After filming was completed and director David Nutter edited his director's cut, MGM took the film away from him and had several different versions re-edited and shown to test audiences. Eventually, an 83 minutes long version was the one selected for theatrical release. Many cut scenes from the film focused more on plot and character development. Cuts made to the film were so severe that Nutter thought about having his name removed from the credits.[9]Although a director's cut was never released, there is a fan edit version of the film available, which runs 103 minutes and uses the DVD's deleted scenes, including the film's original ending. There are other deleted scenes which were not released, while the real director's cut ran 115 minutes.[10]The DVD release features eleven deleted scenes featuring more story and character development, as well as a love scene between Steve and Rachel, never used in the theatrical release, but present in the theatrical trailer. Scenes include a conversation between Dorian and Steve, in which Dorian explains a crash that killed four drunken teens, a mother and her young child devastated the town and made them receptive to Caldicott's plan, a conversation between Steve and Rachel on the ferry, in which he tells the circumstances behind his brother's suicide, a ride Steve gets from officer Cox after being chased by the Blue Ribbons and before encountering Lorna at his house, and Steve's mother finding a gun (confiscated from Gavin) hidden under Steve's mattress, which prompts them to bring in Caldecott. Also included is an alternate ending where Gavin meets a different fate than the one used in the theatrical release, and the revelation that Caldicott's program is assisted by a shadowy organization seeking a \"prototype\". In the film commentary the director complained that he objected to particular scenes being removed, but that the producers overrode his objections.U. S. cable network Syfy Universal has been known to air a somewhat unofficial director's cut of the film, with the deleted scenes reinstated, though the film is still shown with the theatrical ending.As they are leaving Bishop Flats, Steve makes the decision to return to Cradle Bay to rescue his sister, which upsets Rachel. Rachel then tells Steve that all her ambitions of escaping Cradle Bay and going to college have now evaporated with their new revelations about the Blue Ribbon program, and implores him to simply escape with her. When he insists on returning for his sister, Rachel relents and goes with him. On the ferry back to Cradle Bay, Steve and Rachel use the time to have sex in Rachel's truck.This scene was removed from all subsequent versions of the film after the 2000 DVD release.Gavin is not affected by the E-rat-acator, because he is wearing his headphones. He confronts Steve and his group on the ferry. Still a friend, Steve pleads with Gavin that they need to get him some help. Gavin refuses on the false belief that everything helped him without the realization of the program's effects which cause him to react. He tries to shoot Steve with a shotgun and UV shoots him three times with the gun that Steve took away from him. As he lies dying on the ground, Gavin escapes out of his hypnosis to chastise a heartbroken UV (for not being able to kill him in fewer than three shots) while the others tend to him. His dying words are a sarcastic remark that his death will prevent him from meeting his pre-transformation idol, Trent Reznor. Despite having survived the events that preceded them, the group is reminded that they still lost a friend in the process as everyone starts to tear up.","See also":"The Stepford Wives, 1975 filmStrange Behavior, 1981 film","release_dates":"July 24, 1998","produced_by":"Armyan Bernstein","starring":"James Marsden Katie Holmes Nick Stahl Bruce Greenwood William Sadler","running_time":"83 minutes","music_by":"Mark Snow","edited_by":"Randy Jon Morgan","written_by":"Scott Rosenberg","budget":"$15 million"}