{"country":"United States Chile","distributed_by":"Dimension Films[2] RADiUS-TWC","screenplay_by":"Eli Roth Nicolàs López Guillermo Amoedo","story_by":"Eli Roth Nicolàs López","aftershock":"US theatrical release poster","Plot":"Three travelers, Gringo, Ariel, and Pollo travel through Chile. They party in a club and meet three young women, sisters Monica and Kylie, and their Russian friend Irina. The two groups pair up and decide to travel down to Valparaiso together. They party in another club at Valparaiso when an earthquake strikes, killing many of the partygoers and trapping some under debris. Ariel's hand is cut off as he tries to help a trapped bartender. The group tries to get out but their exit is blocked by more falling debris. The cleaning lady of the club leads them through a tunnel to a nearby manhole. As they proceed to climb out, a passing truck hits the old lady and kills her. Once out on the street, the group tries to get to their car but find it destroyed. Ariel's condition continues to get worse due to blood loss and the group decides that they need to get him to the hospital on top of the hill as soon as possible. Suddenly, a tsunami warning is heard and they all rush to the cart going up the hill. After some negotiation, they are able to get Ariel on the cart with other people in line. The group watches the cart reaches the top of the hill when an aftershock suddenly occurs, causing the cart to fall all way back down, destroying the cable and killing everyone inside.After mourning the death of their friend, the group heads toward the cemetery, trying to reach the cathedral at the top of the hill through a previously mentioned hidden tunnel. The group comes upon a looting party on the street which turns out to be escaped prisoners from a nearby prison that was damaged during the earthquake. They try to run past but the women of the group attract some attention. While running away, part of a building falls on top of Gringo and pins him in place, still alive and conscious. Monica and Pollo leave to get help while Irina and Kylie stay with Gringo. While they are seeking help, Monica and Pollo come across an out-of-control firetruck. The truck crashes and one of the firefighters in the cab is run through by wooden beams while the other one is trapped. Pollo and Monica get the living firefighter out, who explains that some prisoners were trying to take over the firetruck, which was why it went out of control. Meanwhile, as Irina is trying to comfort the seriously injured Gringo, Kylie hears the prisoners approaching. Gringo tells Kylie and Irina to hide, reasoning that they would only take his money. The women hide in the tombs while the prisoners threaten Gringo. They pour alcohol on him, threatening to light him up if he doesn't tell them where the women were. Frightened, Gringo motions toward their hiding place with his eyes. Irina crawls out of her hiding place and tries to run away. She is quickly captured by the prisoners. The leader of the prisoners rapes Irina while the rest of the gang sit around telling jokes. Gringo throws a rock at the leader, trying to stop him from continuing raping Irina. The leader, enraged, lights him up and burns Gringo alive, killing him. Kylie, hearing all the chaos outside decides to run. The group goes after her, but the leader's brother stays behind to continue raping Irina. Kylie is able to run away, bumping into Monica and the others. They go back for Irina and Pollo axes the leader's brother to death. Just as the group is about to run, the prisoners return, the leader seeing the dead body of his brother and fires at them, killing Irina. The rest of the group manages to escape and comes across a gated building with other survivors who live there. A single mother does not want to let them through but her neighbor wants to open the gate. As Pollo begs, the woman shoots him in the chest injuring him. The others help carry him away but decided to hide him so they can go get help. Pollo's phone suddenly rings and one of the prisoners hears it and finds him. They kill him and continue to go after the others. The group finally arrives at the cathedral where they are saved by a priest who shuts the door just in time. As another aftershock hits, the Cathedral begins to fall apart. The priest leads them to a secret passage inside the cathedral. As the group descends a ladder through the secret passage, another aftershock shakes the ladder off. The priest falls off in the process to his death, and Kylie falls on top of a metal object that pierces her thigh. Monica, meanwhile, is stranded at the top alone as she was the last to go down the ladder. The firefighter attempts to help Kylie by removing the object and takes off his own coat to try to stop the bleeding. Taking off his coat reveals the prison tattoos on his arms and shoulders. He turns out to be one of the escaped prisoners who was taking over the fire truck, Kylie panics and promises that she won't tell anyone.Monica is able to find some ropes and goes down the ladder shaft to an empty landing. She finds Kylie's body in one of the tunnels. The fake firefighter/prisoner then tries to kill her but an aftershock occurs and Monica is able to kill him with the axe instead. Monica finally manages to escape through the tunnel and onto a beach. She walks around the beach, bewildered that she was able to escape to safety at last. As she turns around, she sees a tsunami rushing toward her.","language":"English","Reception":"Rotten Tomatoes gives Aftershock a score of 35% rating based on 49 reviews.[9] Metacritic gives a 39 rating, indicating \"mixed or average reviews\", based on reviews from 20 critics.[10]The film opened at 110 theatres in the United States, and earned $40,179 in its opening weekend.[7]","box_office":"$58,510[7]","cinematography":"Antonio Quercia[1]","production_company":"Cross Creek Pictures Dragonfly Entertainment","directed_by":"Nicolás López","release_dates":"September 11, 2012 (2012-09-11) (TIFF)[3]|May 10, 2013 (2013-05-10) (United States)[4]||||","Production":"The film is directed by Nicolás López and written by López, Eli Roth, and Guillermo Amoedo, from a story by Roth and López. The film was based on true events from the 2010 8.8 earthquake in Chile. It was shot in Chile, in many of the same locations where the destruction took place. The idea came from a conversation with Roth and Lopez, where Lopez described the horrors of not just the earthquake, but the complete chaos and temporary collapse of society in the ensuing hours. The film will be distributed by Dimension Films.Roth raised $2 million in funding from a group of doctors in Buffalo. Distribution rights were presold to recoup the budget costs.[6]López had previous experience shooting using Digital SLR cameras, and after screen tests, convinced Roth that with the right lenses and lighting it would look like 35mm film. The entire movie was recorded using a Canon EOS 5D camera.[8][6]","produced_by":"Eli Roth Brian Oliver Miguel Asensio","starring":"Eli Roth Andrea Osvárt Ariel Levy Natasha Yarovenko Nicolas Martinez Lorenza Izzo","running_time":"89 minutes[5]","music_by":"Manuel Riviero","edited_by":"Diego Macho Gómez[1]","Release":"It initially received a NC-17 rating, and consequently had to be re-edited so that it would achieve an R rating.","budget":"$2 million[6]"}