{"country":"Spain","Awards and nominations":"Goya AwardsSant Jordi AwardsGoya Awards","distributed_by":"Luna Films","Plot":"The film begins with a written disclaimer:During the film you are about to see, you will be subject to subliminal messages and mild hypnosis.This will cause you no physical harm or lasting effect, but if for any reason you lose control or feel that your mind is leaving your body -- leave the auditorium immediately.The disclaimer is accompanied by a narrator, who advises viewers to take caution regarding their surroundings once the film has begun, and not to engage in conversation with any unknown individuals for the duration of the running time.In the Los Angeles theater The Rex, moviegoers watch the film within a film, The Mommy.The Mommy tells the story of John Pressman (Michael Lerner), an extremely myopic, uncontrolled diabetic who works as an ophthalmologist's assistant and is progressively growing blind. For unstated reasons, his overbearing mother Alice (Zelda Rubinstein) hypnotizes him and induces him to murder people so that he can remove their eyes and bring them back to her. One evening, John—against his mother's wishes—barricades himself inside of a movie theater playing The Lost World, where he sets about killing the patrons one by one with a scalpel. Once John's rampage becomes apparent, the surviving moviegoers attempt to flee the now sealed-off theater. The police bring Alice to the theater in an attempt to end the siege; in the course of trying to talk John down, Alice is accidentally shot to death by the police.As The Mommy wears on, patrons of The Rex begin to experience anxiety attacks and disorientation in response to the events onscreen. In particular, one man grows progressively agitated, constantly checking his watch; and a teenage girl, Patty, begins to break down in tears, though she cannot entirely articulate her fear. At a key point in the film, the man exits the theater and approaches the concession stand, where he's recognized by an employee as a frequent patron of The Mommy. Patty's friend, Linda, goes to use the bathroom moments later, and witnesses The Man removing a gun from his jacket and killing the concession worker and another theater employee. The Man drags their bodies to the bathroom—an act synchronized with John killing a woman in the bathroom of a movie theater in The Mommy. Linda escapes the theater and stops a man passing on the street, whom she asks to call the police.In The Rex, the man barricades the projectionist in the projector booth and then slips back into the theater, where he holds Patty at gunpoint and begins reciting dialogue from The Mommy. When John Pressman begins his theater rampage onscreen, the man begins indiscriminately shooting patrons of The Rex, using Patty as a human shield.Outside The Rex, a SWAT team arrives, in synchronicity with the police's arrival at the theater in The Mommy. The police obtain access to the projector booth via the roof and send in a sniper. The man holds Patty hostage in front of the theater, addressing Alice onscreen and asking her to come save him. Attempts by the police to engage the man fail; when the police in The Mommy kill Alice, the man becomes enraged, throws Patty to the ground, and resumes firing into the audience; the police sniper then shoots and kills him. Patty, looking up at the screen, has a vision of John gouging out her eye with a scalpel.Outside, Patty and Linda are reunited and Patty is taken to the hospital. Doctors assure her that she is physically all right, though the experience was mentally scarring. As Linda leaves, John appears in the elevator and gouges out her eyes. He then proceeds to Patty's room and attacks her with a scalpel. As the screen cuts to black, the camera pulls back to show a movie theater of patrons watching the events onscreen, revealing that Patty's story was in fact a film within a film within a film. The credits for Anguish roll as the theater patrons leave one-by one.","language":"English, Spanish","cinematography":"Josep M. Civit","anguish":"Original theatrical poster (U.S.)","directed_by":"Bigas Luna","release_dates":"8 January 1988 (1988-01-08) (U.S.)|||||","produced_by":"Pepón Coromina","starring":"Zelda Rubinstein|Michael Lerner|Talia Paul|Angel Jove|Clara Pastor|","running_time":"86 minutes","music_by":"José Manuel Pagán","edited_by":"Tom Sabin","written_by":"Bigas Luna"}