{"country":"United States","distributed_by":"Universal Pictures","Plot":"Irena Gallier travels to New Orleans from Canada to reconnect with her brother Paul. Both orphaned after their parents died, Irena has been in foster care her entire life. Paul, not so lucky, spent his childhood in and out of institutions and jail. They return to Paul's home where his Creole housekeeper Female (pronounced feh-MAH-leh) helps Irena settle into her brother's house. Later, as Irena sleeps, Paul watches her with a predatory stare. That same night, a prostitute walks into a fleabag motel to meet a john — and is instead mauled by a black panther. The police capture the panther, aided by a team of zoologists: Oliver Yates, Alice Perrin, and Joe Creigh.That same morning, Irena wakes to find her brother missing. Female guesses he went to the mission, and will be home later. She pushes Irena to enjoy New Orleans on her own. When Irena visits the local zoo, she is drawn to the newly captured panther, and stays long after closing hours. When Oliver, the zoo's curator, discovers her, she runs and scales up a tree. Oliver calms her, takes her to dinner, and eventually offers her a job in the gift shop. Irena enjoys her time working alongside Oliver and Alice, until one day she witnesses the new panther rip Joe's arm off during a routine cage cleaning, which leads to Joe's death. Oliver resolves to euthanize the cat, only to find that the animal has escaped, leaving behind a puddle of melted flesh and viscera in its cage.Soon, Paul turns up and tells Irena of their family's werecat heritage. If a werecat mates with a human, the werecat transforms into a panther, and only by killing a human can the werecat regain human form. He also tells her that their parents were actually brother and sister because werecats are ancestrally incestuous and only sex with another werecat prevents the transformation. He makes a sexual advance towards his sister in the hopes that she will understand their predicament and accept, but she doesn't, and flees. She runs and flags down a police car, only to have second thoughts about turning her brother in. But it is too late, a police dog catches the scent of something within the house and a detective is called in. In the Gallier's basement, police find shackles, bones, and remains of dozens of corpses. They figure a wild animal was housed in the basement and call in Oliver to have a look.On the run from her dangerous brother, Irena takes refuge in a frustrated romance with Oliver, afraid of what might happen if she has sex with him. One night Paul (in panther form) breaks into Oliver's house, intent on killing him so he can have Irena to himself, but is shot by Alice. Oliver performs an autopsy on the panther, cutting it open, a green gas escapes and he discovers a human body within the cat. Before he can document the finding, the animal has melted into the same flesh and viscera pool as before.Irena is now trapped. Paul was the only person that it was safe for her to mate with. If she takes a human lover, she will have to kill to regain human form. Eventually, Irena has sex with Oliver, transforms into a panther and flees, sparing Oliver's life. She escapes, but is later trapped on a bridge by police. Shortly after Oliver arrives at the scene, Irena sees him and jumps off the bridge and escapes. Oliver realizes where she is headed and confronts Irena at a secluded lake house, she having regained human form by killing the house's caretaker. Irena tells Oliver she did not kill him because she loves him, and begs him to let her \"be with her own.\" Oliver ties Irena's arms and legs to the posts of the bed and proceeds to have sex with her, knowing what she will become.Later, Oliver is at the zoo working. By this time, he and Alice are romantically involved. He walks to a cage that contains a black panther, implied to be Irena, casually hand-feeding and stroking the animal.","language":"English","Themes":"Director Schrader has said, in relation to the erotic and horror aspects of Cat People, that the film \"contains more skin than blood\". He has described the film as being more about the mythical than the realistic. He has likened the relation between Oliver and Irena to Dante and Beatrice, putting the female on a pedestal.[3]","Release and reception":"The film was released theatrically in the United States by Universal Studios on April 2, 1982. It grossed approximately $7 million at the US box office.[4]The film has been released twice on DVD in the United States; once by Image Entertainment in 1997[5] and again by Universal in 2002.[6]Shout! Factory's division Scream Factory released the film in January 2014 on Blu-ray, when they announced on their Facebook page releasing films from the 1980s in early 2014.The Blu-ray features interviews with Kinski, McDowell, Heard, and O'Toole as well as director Schrader and composer Moroder. McDowell indicated that he was somewhat reluctant to make the film at first because he recalled the original film as \"not being very good\" but was convinced by Schrader's take on the material with its focus on the erotic horror elements. McDowell also revealed that the scene where he leaps on the bed in a cat like fashion was shot with him jumping off the bed. They then ran the film backward. Heard discussed how he almost turned down the role because he believed it was a porno movie. He also recalled that he felt very awkward particularly during the nude scenes. O'Toole discussed the fact that they used cougars that were dyed black because panthers are impossible to train.Cat People received a variety of mixed reviews upon its initial release. The film currently holds a 64% approval rating at the review aggregation website Rotten Tomatoes from 42 critics.[7]Roger Ebert, of the Chicago Sun-Times, gave the film three and a half out of four star rating. He stated, \"Cat People is a good movie in an old tradition, a fantasy-horror film that takes itself just seriously enough to work, has just enough fun to be entertaining, contains elements of intrinsic fascination in its magnificent black leopards, and ends in one way just when we were afraid it was going to end in another.\"[8]Weekly entertainment-trade magazine Variety also gave the film a positive rating by praising Nastassja Kinski's performance, saying: \"Kinski was essential to the film as conceived, and she's endlessly watchable.\"[9]However, Nastassja Kinski stated, when being interviewed by her friend and actress Jodie Foster, in Film Comment that she disliked the film, describing it as \"slick\" and \"manipulative\". This surprised Foster, who asserted she thoroughly enjoyed the film.[10]The film was nominated for three prestigious awards:[11]","box_office":"$21 million[2]","cinematography":"John Bailey","production_company":"RKO Pictures","directed_by":"Paul Schrader","Soundtrack":"The soundtrack album was released by MCA Records the same week as the film. The theme song \"Cat People (Putting Out Fire)\" was performed by David Bowie, who wrote the lyrics to music composed by Giorgio Moroder. The song was released as a single in 1982, and in 1983, Bowie included a re-recorded version of the song on his album Let's Dance. Bowie performed the song live regularly during his 1983 \"Serious Moonlight\" tour. The song was also used in Quentin Tarantino's 2009 film Inglourious Basterds.Bowie's re-recording had guitar by a then-unknown Stevie Ray Vaughan.All compositions by Moroder, lyrics by David Bowie on \"Cat People (Putting Out Fire)\".","cat_people":"Theatrical release poster","release_dates":"April 2, 1982 (1982-04-02)|||||","produced_by":"Jerry Bruckheimer","starring":"Nastassja Kinski|Malcolm McDowell|John Heard|Annette O'Toole|","running_time":"118 minutes[1]","music_by":"Giorgio Moroder","edited_by":"Jacqueline Cambas","written_by":"DeWitt Bodeen|Alan Ormsby|","budget":"$12.5 million[2]"}