{"based_on":"Annie  by Charles Strouse Martin Charnin Thomas Meehan","Cast":"Several singer-actresses made their debuts in this film as Annie's fellow orphans and principal dancers:According to Robert Osbourne of Turner Classic Movies, Drew Barrymore had auditioned for the role of Annie while Bette Midler was an early choice for Miss Hannigan, and Jack Nicholson had been considered for the role of Daddy Warbucks.","Adaptations":"Marvel Comics published a comic book adaptation of the film by writer Tom DeFalco and artists Win Mortimer and Vince Colletta in Marvel Super Special #23 (Summer 1982).[16] The adaptation was also available as an Annie Treasury Edition[17] and as a limited series.[18]The 1993 Hindi film, King Uncle, starring Jackie Shroff, Shahrukh Khan, Anu Agarwal, and Naghma, is loosely based on this film.A sequel, Annie: A Royal Adventure! was made for television and aired on ABC on November 18, 1995. It starred Ashley Johnson, Joan Collins, George Hearn, and Ian McDiarmid. Aside from a reprise of \"Tomorrow,\" there are no songs in it. No cast members from the 1982 film appeared in this sequel. Rooster, Lily and Grace Farrell were cut out of the sequel.In the film, Warbucks (Hearn), Annie (Johnson), an eccentric scientist (McDiarmid), and one of the orphans travel to England, where Warbucks is to be knighted by the King. However, the kids get mixed up in the scheme of an evil noblewoman (Collins) to blow up Buckingham Palace while all the heirs to the throne are present for Warbucks' knighting, thus making her queen.A made-for-TV movie version was broadcast on ABC on November 7, 1999, starring Kathy Bates as Miss Hannigan, Victor Garber as Daddy Warbucks, Alan Cumming as Rooster, Audra McDonald as Grace, Kristin Chenoweth as Lily, and newcomer Alicia Morton as Annie. Produced by The Walt Disney Company in association with Columbia TriStar Television, it received generally positive reviews and high ratings. It also earned two Emmy Awards and a 1999 George Foster Peabody Award. Although truer to the original stage musical than the 1982 version, it condensed much of the full story in an attempt to make it more viewable for children. The film also featured a special appearance by Andrea McArdle, star of the original Broadway production.The film has aired on cable on Hallmark Channel, ABC Family, and Starz after its premiere on ABC.The 1999 version is more comical than the 1982 version's slightly darker tone.On January 20, 2011 it was announced that Will Smith was planning to produce Annie, a remake of The 1982 film. On May 25, 2012 it was announced that Jay-Z was writing new songs for the film.[19] In January 2013, Sony Pictures selected Will Gluck to direct the film.[20][21] Oscar nominee, Quvenzhané Wallis was cast as the title character.[22] The film was released on December 19, 2014.","country":"United States","Awards and nominations":"Annie received Academy Award nominations for Best Art Direction-Set Decoration and Best Music, Original Song Score and Its Adaptation or Best Adaptation Score. Additionally, Carol Burnett and Aileen Quinn each received a Golden Globe Award nomination for Best Actress in a Motion Picture – Comedy/Musical and New Star of the Year in a Motion Picture – Female (Quinn). Quinn won the Young Artist Award, Best Young Motion Picture Actress. The movie was nominated for a Stinkers Bad Movie Awards for Worst Picture.[11]","distributed_by":"Columbia Pictures","language":"English","box_office":"$57 million[3]","cinematography":"Richard Moore","production_company":"Rastar","directed_by":"John Huston","Home media":"The film was released on VHS,Beta and CED Videodisc on November 5,1982 by RCA/Columbia Pictures Home Video. It was re-issued in 1983, 1984, 1985, 1994, and 1997 (in a \"Broadway Tribute Edition\" to coincide with the original play's Broadway 20th anniversary revival that year). There were two widescreen Laserdiscs released, one in 1989 and another in 1994. The film was released in a widescreen DVD edition on December 12, 2000.A \"Special Anniversary Edition\" DVD was released on January 13, 2004 (four days before producer Stark's death). Despite the fact that the first DVD was widescreen, the DVD was in pan and scan (but with DTS sound). Reviewing the disc for DVD Talk, Glenn Erickson, while praising the film overall, called the pan and scan transfer an \"abomination that's grainy and lacking in color.\" He also noted that the short retrospective featurette with Ms. Quinn contained clips from the film in the correct aspect ratio. Erickson also called the music video of \"It's the Hard-Knock Life\" by Play \"pretty dreary\" and attacked the other, child-oriented extras by saying \"Musicals and kids' films aren't just for tots ... and this disc is little more than a headache.\" [15] However, several countries in Region 2 received widescreen versions of this edition including the United Kingdom. The film is set for a \"sing-along edition\" release on Blu-ray on October 2, 2012 in celebration of the 30th anniversary of the film and the 35th anniversary of the Broadway version set a revival in November 2012.","release_dates":"June 18, 1982 (1982-06-18)|||||","Production":"Ray Stark wanted both John Huston and Joe Layton while working as the director and choreographer respectively, to also be executive producer on the film, because it was too large an enterprise for one person. Regarding Huston being given the job of directing the first (and what would be the only) musical in his 40-year directing career, screenwriter Carol Sobieski said: \"Hiring John [Huston] is an outsider risk, and Ray's [Stark] a major gambler. He loves this kind of high risk situation.\"[4]Carol Sobieski, who wrote the screenplay, introduced major differences between the stage musical and the film version. In the stage musical, it is Christmas when Miss Hannigan, Rooster, and Lily are caught at the Warbucks mansion by the United States Secret Service, foiling their plan to kidnap Annie. But in the film, due to summertime shooting, Annie is kidnapped on the Fourth of July leading to Warbucks organizing a citywide search and a climactic ending on the B&O Bridge. Punjab and The Asp, Warbucks' servants/bodyguards, from the original comic strip appear in the film in supporting roles.The film also featured five new songs, \"Dumb Dog\", \"Sandy\", \"Let's Go to the Movies\", \"Sign\", and \"We Got Annie\", and cut \"We'd like to Thank You, Herbert Hoover\", \"N.Y.C\", \"You Won't Be an Orphan for Long\", \"Something Was Missing\", \"Annie\", and \"New Deal for Christmas\". In addition, the song \"Maybe\" has two reprises whereas \"Little Girls\" and \"Easy Street\" do not.Martin Charnin, the lyricist of Annie, was not impressed with the cinematic interpretation. In a 1996 article, he dismissed the adaptation and its production. \"The movie distorted what this musical was\", Charnin reported. \"And we were culpable for the reason that we did not exercise any kind of creative control because we sold the rights for a considerable amount of money.\" Charnin even said that John Huston, who never directed a musical before, and producer Ray Stark made major changes in the film that destroyed the essence of Annie. Warbucks, played by Finney, \"was an Englishman who screamed\". Hannigan, played by Burnett, was \"a man-crazy drunk\". And Annie was \"cute-ed up\". Worse, the emotional relationship between Annie and Warbucks was distorted. They even downplayed the hit song Tomorrow because \"Stark thought it was corny\".[5]Principal photography took place over the course of six weeks at Monmouth University in New Jersey, which has two mansions that were used in the film, one of which is the Shadow Lawn Mansion (now known as Woodrow Wilson Hall).[4] The NX Bridge, an abandoned railroad bridge over the Passaic River in Newark, was used for location shooting of one of the climatic scenes.[6][7]Originally, the intimate song \"Easy Street\" was going to be the biggest number in the film. For this purpose, a specially-created outdoor street set was built costing more than $1 million. It took one week to shoot the scene. However, on reviewing the dailies, the scene was considered to be \"overstuffed\" and \"sour.\" Therefore, a re-shoot was undertaken nearly two months after principal filming had been completed. The scene was replaced with a more intimate number and was shot indoors in a style that mimicked the ambience portrayed in the original 1977 stage musical.[4]","running_time":"128 minutes[2]","budget":"$50 million","screenplay_by":"Carol Sobieski","Plot":"In 1933, during The Great Depression, a young orphan named Annie is living in the Hudson Street Orphanage in New York City. One night, Annie comforts one of the youngest orphans by singing to her (“Maybe”). The orphanage's cruel and alcoholic supervisor Agatha Hannigan (Carol Burnett) hears the singing, and punishes the orphans by making them clean up the orphanage (\"It's the Hard Knock Life\"). Later while trying to flee in a laundry truck, Annie rescues a dog being tormented by a group of boys. She names him Sandy after convincing a dogcatcher that he is hers (“Dumb Dog”), and the pair is escorted back to the orphanage. Soon after, Miss Hannigan discovers Sandy and threatens to send him to the sausage factory (“Sandy”). However, Grace Farrell, a secretary to billionaire Oliver Warbucks, arrives, saying that he wants an orphan to stay at his mansion for a week to help his image. Despite Hannigan's objections, Grace picks Annie and allows Sandy to accompany her.Upon arrival, Annie, Sandy, and Grace meet Warbucks' bodyguards Punjab and The Asp, butlers, maids, and servants (\"I Think I'm Gonna Like It Here\"). Annie quickly endears herself to everyone there. However, Warbucks disapproves, as he had the absurd notion that only boys were orphans and not girls. Meanwhile, Hannigan drunkenly laments her status as the orphanage mistress (“Little Girls”), and is visited by her lowlife brother, Rooster, and his pickpocket girlfriend, Lily St. Regis; both are obvious con artists, who ask to borrow money from Hannigan.Back at the Warbucks Mansion, Annie and Sandy spot a Bolshevik assassin attempting to bomb the mansion. Warbucks and Grace take Annie to Radio City Music Hall to see the Rockettes and a movie (\"Let's Go to the Movies\").The next day Grace asks Warbucks if they can adopt Annie (\"We Got Annie\"). At this point we see that Warbucks and Grace are romantically interested in each other. Warbucks agrees to adopt her and goes to the orphanage to get the adoption papers signed. Despite Hannigan's attempt to seduce him, Warbucks blackmails her into signing (“Sign”). He goes back to the mansion to tell Annie and is about to give her a Tiffany's locket, but Annie tells him that she wants to find her real parents. She shows Warbucks the broken locket she wears; she tells him her parents have the missing piece of the locket, and that they will use it to prove their identities when they return to the orphanage someday to retrieve her. Deciding to help, Warbucks makes an announcement on a radio show and offers a $50,000 reward to her parents (“You're Never Fully Dressed Without a Smile”).A crowd of would-be 'parents' arrives at the Warbucks mansion. To get Annie away from the sensationalism, Warbucks and Punjab take her by auto-copter to the White House to visit President Franklin D. Roosevelt. President Roosevelt tells Warbucks and Annie about his plans for a social welfare program to help the poor, and wants Annie to help as well. Annie performs for Roosevelt and the First Lady (\"Tomorrow\"). Back at the mansion, Annie learns that the search for her parents has not yet been successful.Meanwhile, the Hannigans and Lily plot a scheme to collect the reward, kill Annie, and split the money three ways (“Easy Street”), and Miss Hannigan reveals that Annie's parents perished in a fire many years back. Hearing what has happened, the other orphans attempt to go to Warbucks's mansion but are locked up by the Hannigans and Lily. The orphans then escape again and find out that the Hannigans have captured Annie and the money. Once they reach the house, the girls notify everyone and a shocked Warbucks contacts J Edgar Hoover and the FBI to track down the felons, and he and Grace search for them while Punjab and another servant search from the auto-copter. Rooster, Lily, and Hannigan however are tricked by Annie who escapes and tears up the check in anger. Enraged, Rooster finally loses it and rushes after her in order to kill her. Hannigan, however, sees her brother for who he really is and tries to get him to stop, only to be knocked out. Rooster then pursues Annie up a high railroad bridge. Punjab and the Asp arrive at the scene just in time; Punjab hangs onto a rope to rescue Annie and kicks a stunned Rooster down the bridge and onto a police safety net. Annie is reunited with Warbucks and Grace, while Rooster and Lilly are arrested.Annie gets her wish of a good family at a party. President and Mrs. Roosevelt, her orphan friends, and the servants are enjoying themselves; Hannigan is reformed; and Grace and Warbucks further develop their relationship. (\"Finale/I Don't Need Anything But You/We Got Annie/Tomorrow\") A firework display with Annie's name in it is shown over the credits.","Reception":"Annie received mixed reviews from critics; it currently holds a 52% rating on Rotten Tomatoes based on 25 reviews and a 39/100 on Metacritic.[8] The film grossed $57 million in the United States,[9] making it the 10th highest grossing film of 1982.[10]","Soundtrack":"Annie is a soundtrack album for the 1982 film of the same name.All lyrics written by Martin Charnin, all music composed by Charles Strouse.","annie":"Theatrical release poster","produced_by":"Ray Stark","starring":"Albert Finney|Carol Burnett|Bernadette Peters|Ann Reinking|Tim Curry|Geoffrey Holder|Edward Herrmann|Aileen Quinn|","music_by":"Charles Strouse Ralph Burns","edited_by":"Michael A. Stevenson"}