{"based_on":"Diva  by Delacorta","country":"France","distributed_by":"Compagnie Commerciale Française Cinématographique","screenplay_by":"Jean-Jacques Beineix Jean Van Hamme","Plot":"Young Parisian postman Jules is obsessed with classical music; he is particularly obsessed with Cynthia Hawkins, a beautiful and celebrated American soprano opera singer who has never allowed any of her performances to be recorded.Jules attends a recital at the Théâtre des Bouffes du Nord in Paris, where Hawkins sings the aria \"Ebben? Ne andrò lontana\" from the opera La Wally. He illicitly makes a high-quality bootleg recording of her performance using a Nagra professional tape-recorder. Afterwards, he steals the gown she was wearing from her dressing room.Later, Jules accidentally comes into possession of an audio cassette with the recorded testimony of a prostitute, Nadia, which exposes a senior police officer, Commissaire divisionnaire Jean Saporta, as being the boss of a drug trafficking and prostitution racket. Nadia drops the cassette in the bag of the postman's moped moments before she is killed by Saporta's two henchmen - L' Antillais and Le Curé (\"The West Indian\" and \"The Priest\").Jules is now in danger from Saporta's enforcers. He is also being sought by two Taiwanese men (who want the Hawkins tape) and by the police. The police are after Nadia's cassette as they know it incriminates a prominent gangster, but they are unaware of the gangster's identify and that he's also a senior officer. Jules seeks refuge with his new friends, a young Vietnamese-French woman named Alba who is muse to the mysterious bohemian Serge Gorodish, to whom she introduces Jules.Feeling guilty, Jules returns Hawkins' dress. She is initially angry, but eventually forgives him. Cynthia is intrigued by the young Jules' adoration and a kind of romantic relationship develops, expressed by the background of the piano instrumental, Promenade Sentimentale of Vladimir Cosma, as they walk around Paris in the Jardin des Tuileries early one morning. The Taiwanese try to blackmail Cynthia into signing a recording contract with them. Although they don't yet possess Jules' recording of her performance, they claim they do and threaten to release it as a pirate record if she doesn't co-operate; she indignantly refuses.Jules is spotted by two police officers; they chase him but he escapes by riding his moped through the Paris Métro system. He takes refuge in the apartment of a prostitute he knows, but flees when he realizes she is part of Jean Saporta's criminal network - he leaves just before L' Antillais and Le Curé arrive. They pursue Jules and he is shot and wounded but rescued by Gorodish, who takes him to a remote safe house outside Paris. Now in possession of the recording that incriminates Saporta, Gorodish uses it to blackmail him. Saporta pays off Gorodish, but places a bomb under his car. However, Gorodish has anticipated this and the explosion only results in inadvertently killing the two Taiwanese.Later, Jules returns to Paris, to give Hawkins his bootleg recording and lift the threat of blackmail from her. But he is abducted from outside her hotel by L'Antillais and Le Curé, who were lying in wait for him; they take him to his home with the intention of there killing him. However one of the police officers who earlier chased Jules has been keeping the place under surveillance; she saves him by killing Le Curé and wounding L'Antillais. Commissaire Saporta then arrives on the scene; he kills his surviving henchman and attempts to kill both Jules and the police officer, with the intention of making it appear his dead henchman shot them. Once again Gorodish saves the day by turning out the lights and making Saporta fall down an elevator shaft in the dark.In the film's final scene Jules plays his tape of Cynthia's performance for her and she expresses her nervousness over hearing it, as she \"never heard [herself] sing.\"","language":"French English","Reception":"The film initially was not a commercial success after it's March 1981 release in France, it faced bad press and a hostile reception by critics. However French audiences slowly grew after it was released in the United States and found success there.[5] Diva played for a year in Paris theaters. David Denby, in New York, upon its 1982 American release, wrote \"One of the most audacious and original films to come out of France in recent years...Diva must be the only pop movie inspired by a love of opera.\"[6]Film critic Roger Ebert gave it four out of four stars and praised its cast of characters.[7] He called Beineix \"a director with an enormous gift for creating visual images\" and elaborated on his filmmaking:The movie is filled with so many small character touches, so many perfectly observed intimacies, so many visual inventions—from the sly to the grand—that the thriller plot is just a bonus. In a way, it doesn't really matter what this movie is about; Pauline Kael has compared Beineix to Orson Welles and, as Welles so often did, he has made a movie that is a feast to look at, regardless of its subject. [...] Here is a director taking audacious chances, doing wild and unpredictable things with his camera and actors, just to celebrate moviemaking.[7]Ebert also praised the film's chase scene through the Paris metro, writing that it \"deserves ranking with the all-time classics, Raiders of the Lost Ark, The French Connection, and Bullitt.\"[7]Since its re-release in 2007, Diva has received retrospective acclaim from film critics; review aggregator Rotten Tomatoes gives the film a score of 96% based on reviews from 45 critics, with an average score of 8 out of 10.[8] Lisa Schwarzbaum of Entertainment Weekly gave it an A rating and praised its \"voluptuous romanticism\". She wrote of the film's visual ties to cinéma du look, \"the movie's mad excitement hinges entirely on the pleasure to be had in moving our eye from one gorgeously composed stage set of artifice to another.\"[9]","box_office":"$2,678,103 (USA)[3]","cinematography":"Philippe Rousselot","production_company":"Les Films Galaxie Greenwich Film Productions","directed_by":"Jean-Jacques Beineix","Soundtrack":"Highlights of the soundtrack include the aria Ebben? Ne andrò lontana from Alfredo Catalani's opera La Wally, and a pastiche of Erik Satie's Gnossiennes composed by Vladimir Cosma.","Awards":"The film was entered into the 12th Moscow International Film Festival[10] and was also selected as the French entry for the Best Foreign Language Film at the 54th Academy Awards, but was not accepted as a nominee.[11]","release_dates":"11 March 1981 (1981-03-11) (France)|||||","produced_by":"Claudie Ossard Irène Silberman Serge Silberman","starring":"Frédéric Andréi Wilhelmenia Wiggins Fernandez Richard Bohringer","running_time":"117 minutes[1]","music_by":"Vladimir Cosma","edited_by":"Monique Prim Marie-Josèphe Yoyotte","diva":"Film poster","budget":"about 7.5m FRF[2] then about $1.5m (USA)"}