{"country":"United States","distributed_by":"Warner Bros.","better_off_dead":"Theatrical release poster","Plot":"The story takes place in the fictional town of Greendale in \"the state of Northern California\" and centers on high schooler Lane Myer (John Cusack), whose two main interests are skiing and his girlfriend of six months, Beth (Amanda Wyss). At the start of the film, Beth dumps Lane for the captain of the ski team, Roy Stalin (Aaron Dozier). Roy is handsome, popular, and has skied the dangerous K-12 slope, but is also an arrogant bully who publicly mocks Lane and unfairly rejects him at ski team tryouts. Beth also criticizes Lane's car, an old station wagon. Although Lane also owns a disabled 1967 Camaro, he has not been able to get it running.Lane lives in a suburban development with his mother, Jenny (Kim Darby), a ditzy housewife who improvises gut-wrenching recipes for family meals; his genius little brother, Badger (Scooter Stevens), who never speaks but at the age of \"almost 8\" can build powerful lasers and attract trashy women; and his lawyer father, Al (David Ogden Stiers), who daily tries to stop the menacing paperboy, Johnny, from damaging his garage with thrown newspapers. Furthermore, Johnny claims that the Myers owe him two dollars for newspapers, and persistently hounds Lane uttering the catchphrase, \"I want my two dollars!\" Lane also regularly encounters two Japanese drag racers, one of whom (Yuji Okumoto) learned to speak English by listening to Howard Cosell.Lane cannot get past Beth's rejection and decides that death is the only way out of his misery. He makes several half-hearted attempts at suicide, which all comically fail. With the help of his best friend, Charles de Mar (Curtis Armstrong), who in lieu of \"real drugs\" constantly inhales everyday substances like Jell-O, snow, and nitrous oxide in a whipped cream can (known as a whippit), Lane tries to ski the K-12 himself in hopes of getting Beth back, but wipes out. Lane is further embarrassed when he gets fired from his humiliating fast food job at Pig Burgers in front of Roy and Beth, who are there on a date.As Lane attempts to either end his life or win back his ex-girlfriend, he gradually gets to know a new girl: a French foreign-exchange student named Monique (Diane Franklin), who has a crush on him. She is staying with Lane's overbearing neighbor Mrs. Smith (Laura Waterbury) and her fat, socially backward son Ricky (Daniel Schneider), who are so annoying that Monique pretends she cannot speak English. Monique turns out to be an excellent auto mechanic and skier who helps Lane fix up his Camaro and tries to build his confidence. When Roy insults Monique, Lane challenges him to a ski race down the K-12, with the winner to be captain of the ski team. Monique helps Lane prepare for the race, which he ultimately wins despite losing one ski and being pursued by Johnny. Beth rushes to embrace Lane at the finish line, but he rejects her and, after besting Ricky in a ski-pole swordfight, drives off with Monique in his Camaro. Both Lane and Monique are last seen kissing at home plate at Dodger Stadium as Johnny rides up to them.","language":"English","Reception":"The film received positive reviews from critics with an 82% fresh score on Rotten Tomatoes, based on 22 reviews. The consensus was that \"Better Off Dead is an anarchic mix of black humor and surreal comedy, anchored by John Cusack's winsome, charming performance.\"[1] However, Siskel & Ebert gave the film two thumbs down.[2]According to Savage Steve Holland, Cusack did not like the film and walked out of a screening as both were making One Crazy Summer, later confronting Holland saying Better Off Dead \"was the worst thing I have ever seen. I will never trust you as a director ever again, so don't speak to me.\" Holland claimed that Cusack felt he had been made to look foolish and that his comments \"made me not care about movies anymore\".[3] However, in a 2013 Reddit \"Ask Me Anything\" chat, Cusack, when asked if he hated filming Better Off Dead, responded, \"No, I just thought it could have been better, but I think that about almost all my films. I have nothing against the film. . . . Glad people love it still.\"[4]","box_office":"$10,297,601","cinematography":"Isidore Mankofsky","production_company":"A&M Films CBS Theatrical Films","directed_by":"Savage Steve Holland","Soundtrack":"The film's soundtrack was produced primarily by Rupert Hine.The opening track, \"With One Look (The Wildest Dream)\", was produced by Hine and features Cy Curnin and Jamie West-Oram of The Fixx on lead vocals and guitars respectively. Hine had previously worked with Curnin and West-Oram, and also contributed vocals to the song. The following track, \"Arrested By You\", as well as \"Better Off Dub (Title Music)\" and \"Race The K-12 (Instrumental)\" were performed solely by Hine.\"Dancing in Isolation\" features Terri Nunn of Berlin on lead vocals. Hine produced the song and was reportedly under consideration to produce an album for Berlin.\"Come to Your Rescue\" was performed by Thinkman, a group formed by, and including, Hine for the purpose of restoring his solo career without the music press knowing about it. West-Oram also provided guitar work to this song, as well as the instrumental \"The Falcon Beat\".The only two tracks on the CD without Hine's involvement are \"A Little Luck\" and \"One Way Love (Better Off Dead).\" Valley Girl's Elizabeth Daily, credited on the soundtrack as E. G. Daily, sang lead vocals on both songs and also performed them in the film during the high school dance scene.A number of songs that appear in the film do not appear on the CD soundtrack, including Howard Jones' \"Like To Get To Know You Well\", Van Halen's \"Everybody Wants Some\", Neil Sedaka's \"Breaking Up Is Hard to Do\", Paul Simon's \"Fifty Ways To Leave Your Lover\", Jimi Hendrix's \"Foxy Lady\", Frank Sinatra singing \"A Man Alone\" by Rod Mckuen, Hall & Oates' \"She's Gone\", and Muddy Waters' \"Mannish Boy.\" [5]","release_dates":"August 23, 1985 (1985-08-23)|||||","Production":"Some of the skiing scenes were shot at Snowbird, in Little Cottonwood Canyon, Utah. During the sword fight with ski poles, the word \"Mid Gad\" is plainly visible on the lift machinery; Mid Gad is a ski lift at Snowbird. Most of the ski scenes were shot at Alta Ski Area; the parking lot is Alta's parking lot. It is widely speculated[who?] that many of the \"town\" scenes of the film were shot in various locations throughout La Crescenta, CA, the eastern San Gabriel Valley area of Los Angeles and San Bernardino Counties in California. The exterior of the high school was filmed at the Anderson W. Clark Magnet School (then a junior high school) in La Crescenta, CA. The race scenes were filmed in the city of Sierra Madre. It appears[weasel words] that many of the scenes were shot in Upland, California. Several scenes were filmed in the city of Burbank, as local landmarks are visible in driving scenes. The film's final scene was shot at Dodger Stadium in Los Angeles, California.","produced_by":"Gil Friesen Michael Jaffe Andrew Meyer","starring":"John Cusack|David Ogden Stiers|Diane Franklin|Kim Darby|","running_time":"97 minutes","music_by":"Rupert Hine","written_by":"Savage Steve Holland"}