{"based_on":"A Beautiful Mind  by Sylvia Nasar","country":"United States","distributed_by":"Universal Pictures (North America) DreamWorks Pictures (International)","screenplay_by":"Akiva Goldsman","Plot":"In 1947, John Nash (Crowe) arrives at Princeton University. He is co-recipient, with Martin Hansen (Lucas), of the prestigious Carnegie Scholarship for mathematics. At a reception, he meets a group of other promising math and science graduate students, Richard Sol (Goldberg), Ainsley (Jason Gray-Stanford), and Bender (Rapp). He also meets his roommate Charles Herman (Bettany), a literature student.Nash is under extreme pressure to publish, but he wants to publish his own original idea. His inspiration comes when he and his fellow graduate students discuss how to approach a group of women at a bar. Hansen quotes Adam Smith and advocates \"every man for himself\", but Nash argues that a cooperative approach would lead to better chances of success. Nash develops a new concept of governing dynamics and publishes an article on this. On the strength of this, he is offered an appointment at MIT where Sol and Bender join him.Some years later, Nash is invited to the Pentagon to crack encrypted enemy telecommunication. Nash can decipher the code mentally, to the astonishment of other decrypters. He considers his regular duties at MIT uninteresting and beneath his talents, so he is pleased to be given a new assignment by his mysterious supervisor, William Parcher (Harris) of the United States Department of Defense. He is to look for patterns in magazines and newspapers in order to thwart a Soviet plot. Nash becomes increasingly obsessive about searching for these hidden patterns and believes he is followed when he delivers his results to a secret mailbox.Meanwhile, a student, Alicia Larde (Connelly), asks him to dinner, and the two fall in love. On a return visit to Princeton, Nash runs into Charles and his niece, Marcee (Cardone). With Charles' encouragement, he proposes to Alicia and they marry.Nash begins to fear for his life after witnessing a shootout between Parcher and Soviet agents, but Parcher blackmails him into staying on his assignment. While delivering a guest lecture at Harvard University, Nash tries to flee from people he thinks are foreign Russian agents, led by Dr. Rosen (Plummer). After punching Rosen in an attempt to flee, Nash is forcibly sedated and sent to a psychiatric facility he believes is run by the Soviets.Dr. Rosen tells Alicia that Nash has paranoid schizophrenia and that Charles, Marcee, and Parcher exist only in his imagination. Alicia investigates and finally confronts Nash with the unopened documents he had delivered to the secret mailbox. Nash is given a course of insulin shock therapy and eventually released. Frustrated with the side-effects of the antipsychotic medication he is taking, which make him lethargic and unresponsive, he secretly stops taking it. This causes a relapse and he meets Parcher again.Shortly afterward, Alicia discovers Nash is once again working on his \"assignment.\" Realizing he has relapsed, Alicia rushes into the house to find her baby submerged in the tub. Nash claims that Charles was watching the baby. Alicia calls Dr. Rosen, but Nash believes Parcher is trying to kill her. He rushes in to push Parcher away, and accidentally knocks Alicia and the baby to the ground. As Alicia flees the house with their baby, Nash jumps in front of Alicia's car and begs her to stay. Nash tells her that he realizes that he's never seen Marcee age, even though he's known her for three years. He finally accepts that Parcher and other figures are hallucinations. Against Dr. Rosen's advice, Nash decides not to restart his medication, believing that he can deal with his symptoms himself. Alicia decides to stay and support him in this.Nash returns to Princeton and approaches his old rival, Hansen, now head of the mathematics department. He grants Nash permission to work out of the library and to audit classes. Over the next two decades, Nash learns to ignore his hallucinations. By the late 1970s, he is allowed to teach again.In 1994, Nash wins the Nobel Memorial Prize in Economics for his revolutionary work on game theory, and is honored by his fellow professors. The movie ends as Nash, Alicia, and their son leave the auditorium in Stockholm; Nash sees Charles, Marcee, and Parcher standing to one side and watching him.","Accolades":"In 2002, the film was awarded four 74th Academy Awards, for Best Adapted Screenplay (Akiva Goldsman), Best Picture (Brian Grazer and Ron Howard), Best Director (Ron Howard) and Best Supporting Actress (Jennifer Connelly). It also received four other nominations for Best Actor (Russell Crowe), Best Film Editing (Mike Hill and Daniel P. Hanley), Best Makeup (Greg Cannom and Colleen Callaghan), and Best Original Score (James Horner).[34] At the 55th British Academy Film Awards the film won Best Actor in a Leading Role and Best Actress in a Supporting Role to Russell Crowe and Jennifer Connelly, respectively. It also nominated the film for Best Film, Best Screenplay and the David Lean Award for Direction.[35]At the 2002 AFI Awards, Jennifer Connelly won for Best Featured Female Actor.[36] In 2006, it was named No. 93 in AFI's 100 Years... 100 Cheers. In the following year, it was nominated for AFI's 100 Years...100 Movies (10th Anniversary Edition).[37] The film was also nominated for Movie of the Year, Actor of the Year (Russell Crowe), and Screenwriter of the Year (Akiva Goldsman).[38]","language":"English","Divergence from history":"The narrative of the film differs considerably from the events of Nash's life, as filmmakers made choices for the sense of the story. The film has been criticized for this aspect, but the filmmakers said they never intended a literal representation of his life.[15]One difficulty was the portrayal of his mental illness and trying to find a film visual language for this.[16] Sylvia Nasar said that the filmmakers \"invented a narrative that, while far from a literal telling, is true to the spirit of Nash's story\".[17] Nash spent his years between Princeton and MIT as a consultant for the RAND Corporation in California, but in the film he is portrayed as having worked for the Department of Defense at the Pentagon instead. His handlers, both from faculty and administration, had to introduce him to assistants and strangers.[9] The PBS documentary A Brilliant Madness tried to portray his life accurately.[18]Few of the characters in the film, besides John and Alicia Nash, correspond directly to actual people.[19] The discussion of the Nash equilibrium was criticized as over-simplified. In the film, Nash suffers schizophrenic hallucinations while he is in graduate school, but in his life he did not have this experience until some years later. No mention is made of Nash's homosexual experiences at RAND,[17] which are noted in the biography;[20] both Nash and his wife deny this occurred.[21] Nash fathered a son, John David Stier (born June 19, 1953), by Eleanor Agnes Stier (1921–2005), a nurse whom he abandoned when she told him of her pregnancy.[22] The film did not include Alicia's divorce of John in 1963. It was not until after Nash won the Nobel Memorial Prize in 1994 that they renewed their relationship. Beginning in 1970, Alicia allowed him to live with her as a boarder. They remarried in 2001.[20]Nash is shown to join Wheeler Laboratory at MIT, but there is no such lab. This is a parallel to the Charles Stark Draper Laboratory, a DOD sponsored laboratory on the MIT campus.[23] Instead, he was appointed as C.L.E. Moore Instructor at MIT.[24] The so-called pen ceremony tradition at Princeton shown in the film is completely fictitious.[9][25] The film has Nash saying in 1994: \"I take the newer medications\", but in fact, he did not take any medication from 1970 onwards, something highlighted in Nasar's biography. Howard later stated that they added the line of dialogue because they worried that the film would be criticized for suggesting that all people with schizophrenia can overcome their illness without medication.[9] In addition, Nash never gave an acceptance speech for his Nobel prize.","box_office":"$313.6 million[1]","cinematography":"Roger Deakins","production_company":"Imagine Entertainment","directed_by":"Ron Howard","release_dates":"December 13, 2001 (2001-12-13) (Beverly Hills premiere)|December 21, 2001 (2001-12-21) (United States)||||","Production":"After producer Brian Grazer first read an excerpt of Sylvia Nasar's book A Beautiful Mind in Vanity Fair magazine, he immediately purchased the rights to the film. He eventually brought the project to director Ron Howard, who had scheduling conflicts and was forced to pass. Grazer later said that many A-list directors were calling with their point of view on the project. He eventually focused on a particular director, who coincidentally was available only when Howard was also available. Grazer chose Howard.[3]Grazer met with a number of screenwriters, mostly consisting of \"serious dramatists\", but he chose Akiva Goldsman because of his strong passion and desire for the project. Goldsman's creative take on the project was to avoid having viewers understand they are viewing an alternate reality until a specific point in the film. This was done to rob the viewers of their understanding, to mimic how Nash comprehended his experiences. Howard agreed to direct the film based on the first draft. He asked Goldsman to emphasize the love story of Nash and his wife; she was critical to his being able to continue living at home.[4]Dave Bayer, a professor of Mathematics at Barnard College, Columbia University,[5] was consulted on the mathematical equations that appear in the film. Bayer later said that he approached his consulting role as an actor when preparing equations, such as when Nash is forced to teach a calculus class, and arbitrarily places a complicated problem on the blackboard. Bayer focused on a character who did not want to teach ordinary details and was more concerned with what was interesting. Bayer received a cameo role in the film as a professor who lays his pen down for Nash in the pen ceremony near the end of the film.[6]Greg Cannom was chosen to create the makeup effects for A Beautiful Mind, specifically the age progression of the characters. Crowe had previously worked with Cannom on The Insider. Howard had also worked with Cannom on Cocoon. Each character's stages of makeup were broken down by the number of years that would pass between levels. Cannom stressed subtlety between the stages, but worked toward the ultimate stage of \"Older Nash\". The production team originally decided that the makeup department would age Russell Crowe throughout the film; however, at Crowe's request, the makeup was used to push his look to resemble the facial features of John Nash. Cannom developed a new silicone-type makeup that could simulate skin and be used for overlapping applications; this shortened make-up application time from eight to four hours. Crowe was also fitted with a number of dentures to give him a slight overbite in the film.[7]Howard and Grazer chose frequent collaborator James Horner to score the film because they knew of his ability to communicate. Howard said, regarding Horner, \"It's like having a conversation with a writer or an actor or another director.\" A running discussion between the director and the composer was the concept of high-level mathematics being less about numbers and solutions, and more akin to a kaleidoscope, in that the ideas evolve and change. After the first screening of the film, Horner told Howard: \"I see changes occurring like fast-moving weather systems.\" He chose it as another theme to connect to Nash's ever-changing character. Horner chose Welsh singer Charlotte Church to sing the soprano vocals after deciding that he needed a balance between a child and adult singing voice. He wanted a \"purity, clarity and brightness of an instrument\" but also a vibrato to maintain the humanity of the voice.[8]The film was shot 90% chronologically. Three separate trips were made to the Princeton University campus. During filming, Howard decided that Nash's delusions should always be introduced first audibly and then visually. This provides a clue for the audience and establishes the delusions from Nash's point of view. The historic John Nash had only auditory delusions. The filmmakers developed a technique to represent Nash's mental epiphanies. Mathematicians described to them such moments as a sense of \"the smoke clearing\", \"flashes of light\" and \"everything coming together\", so the filmmakers used a flash of light appearing over an object or person to signify Nash's creativity at work.[9] Two night shots were done at Fairleigh Dickinson University's campus in Florham Park, New Jersey, in the Vanderbilt Mansion ballroom.[10] Portions of the film set at Harvard were filmed at Manhattan College.[11]Many actors were considered for the role of John Nash, including Bruce Willis, Kevin Costner, John Travolta, Tom Cruise,[12] John Cusack, Charlie Sheen, Robert Downey, Jr., Nicolas Cage, Johnny Depp, Ralph Fiennes, Jared Leto, Brad Pitt, Alec Baldwin, Mel Gibson, Sean Penn, Guy Pearce, Matthew Broderick, Gary Oldman and Keanu Reeves.[citation needed] Ron Howard ultimately cast Russell Crowe.The producers had not originally thought of Jennifer Connelly for the role of Alicia. Portia de Rossi, Catherine McCormack, Meg Ryan, Rachel Griffiths and Amanda Peet were among the many actresses who lobbied for the role of Alicia.[citation needed]During production, Ron Howard and Russell Crowe appeared on a video-only webcam stationed at the set's craft services area and also communicated with Steven Spielberg and Tom Cruise on the set of \"Minority Report\" in Los Angeles.[13][14]","produced_by":"Brian Grazer Ron Howard","starring":"Russell Crowe Ed Harris Jennifer Connelly Paul Bettany Adam Goldberg Judd Hirsch Josh Lucas Anthony Rapp Christopher Plummer|","running_time":"135 minutes","a_beautiful_mind":"Theatrical release poster","music_by":"James Horner","edited_by":"Daniel P. Hanley Mike Hill","Release":"A Beautiful Mind received a limited release on December 21, 2001, receiving positive reviews, with Crowe receiving wide acclaim for his performance. It was later released in the United States on January 4, 2002. Rotten Tomatoes showed a 75% approval rating among critics, stating: \"The well-acted A Beautiful Mind is both a moving love story and a revealing look at mental illness.\"[26] Roger Ebert of Chicago Sun-Times gave the film four out of four stars.[27] Mike Clark of USA Today gave three-and-a-half out of four stars and also praised Crowe's performance, calling it a welcome follow-up to Howard's previous film, The Grinch.[28] Desson Thomson of Washington Post found the film to be \"one of those formulaically rendered Important Subject movies\".[26] The mathematics community praised the portrayal of mathematics in the film, including John Nash himself.[6] John Sutherland of The Guardian noted the film's biopic distortions but said, 'Howard pulls off an extraordinary trick in A Beautiful Mind by seducing the audience into Nash's paranoid world. We may not leave the cinema with A level competence in game theory, but we do get a glimpse into what it feels like to be mad - and not know it.[29]During the five-day weekend of the limited release, A Beautiful Mind opened at the #12 spot at the box office,[30] peaking at the #2 spot following the wide release.[31] The film went to gross $170,742,341 in the United States and Canada and $313,542,341 worldwide.[1]A Beautiful Mind was released on VHS and DVD in the United States on June 25, 2002.[32] The DVD set includes audio commentaries, deleted scenes and documentaries. The film was also released on Blu-ray in North America on January 25, 2011.[33]","budget":"$58 million[1]"}