{"country":"United States","distributed_by":"20th Century Fox","Plot":"A young couple, Zach and Samantha McCall, have recently married and have gone to the Dominican Republic for their honeymoon. During Carnival, the couple meet a fortune teller, who repeats to Sam \"they've been waiting\", to which they quickly leave. They find themselves lost on an unknown street they do not remember seeing and are offered a lift from a pushy cab driver, who offers to take them to a local bar dotted with strange symbols. The couple reluctantly accepts and after taking various shots, they fall unconscious. Sam is seemingly taken to an underground chamber in the nightclub and is subject to some kind of ritual by an unseen force. The next morning, Zach and Sam wake in their hotel with no memory of the previous night.A couple of weeks after the honeymoon, Sam discovers she's pregnant despite claiming to have taken birth control pills \"religiously\" ever since the wedding. Though shocked, Zach and Samantha are overjoyed and tell their family and friends the news. The couple later attend their first ultrasound scan where the doctor says that the baby looks healthy and Sam is due by the end of March. At that moment, the ultrasound screen goes static but recovers after a moment. Throughout the course of her pregnancy, Sam begins to experience nosebleeds, stomach bruising, cravings for raw meat (despite being a vegetarian) superhuman strength, telekinetic abilities and unexplained feelings of rage whenever she or the baby appear to be threatened. Also, Zach and Sam keep seeing odd-looking people randomly watching their house. Sam becomes convinced something is seriously wrong with the baby. After a second visit to the doctor, a new doctor appears and performs an amnio after Sam appears nauseous. Before the couple return home, Spanish-speaking men set up hidden cameras to monitor her progress and make sure she doesn't hurt the baby.When Sam is eight months pregnant, the couple attend a holy communion at their church. The priest who officiated Zach and Sam's wedding looks at Sam during the service and violently coughs up blood. Later at home, when Zach is reviewing the communion footage he filmed, he sees the mysterious cab driver sitting in a pew. He visits the priest in the hospital, who explains the symbol is related to summoning the Antichrist. Zach decides to investigate the symbol further and asks his sister, Suzie to stay with Sam. He breaks in to an apparently abandoned house at the end of his street where he finds the CCTV footage of his house inside and is almost caught by the house's inhabitants who appear to be performing a ritual. Zach barely manages to escape.Upon returning home, Zach finds Suzie dead and hears Sam scream and all the glass in the house smashes. He finds Sam in the baby's nursery standing in a trance-like state with a knife to her stomach. Zach screams for her to stop, but she presses the knife to her stomach anyway and there is a violent blast of light. When Zach recovers, he finds Sam lying in her own blood with her stomach cut. She cries and wonders if the baby is all right before dying. Zach breaks down in grief before the cab driver and the second doctor appear. Zach begs the intruders to leave them alone, but the doctor takes the baby regardless. Zach is then arrested and is being interrogated by the police on the death of his wife and sister and disappearance of his child. The ending shows another young couple, on their honeymoon in Paris, where the same cab driver offers a lift.","language":"English","Reception":"Critical reception has been negative. The film currently holds a rating of 18% on Rotten Tomatoes based on 49 reviews, with a rating average of 4 out of 10.[13] The film's consensus reads: \"Derivative and mostly uninspired, Devil's Due adds little to either the found-footage or horror genres that it's content to mimic.\"[14] On Metacritic, the film has a score of 34 out of 100, based on 18 critics, indicating \"generally unfavorable reviews\" from critics.[15]Much of the film's criticism centered upon the film's similarity to other films such as Rosemary's Baby and Paranormal Activity,[16][17] an element that Fearnet reviewer Scott Weinberg remarked was likely more due to decisions by the film's production company than anything else.[18] Weinberg called the movie \"a darkly passionate homage to Rosemary's Baby, the similarities are both intentional and affectionate,\"[18] and Bloody Disgusting gave the film a favorable review, praising the acting of its lead characters, the sense of humor and drawing positive comparisons to the directors' earlier work on V/H/S.[19]Director Eli Roth has been vocal in his support of the film and in a series of posts on his official Twitter account, wrote \"Don't pre-judge Devil's Due because Rosemary's Baby is a 'holy grail' movie. It's so smart, creative, inventive, and fun. Very very scary. The guys at Radio Silence killed it. Devil's Due is a legit scary, smart, horror film. So many awesome scenes. I loved it.\"[20][21]","Promotion":"Fox released its first trailer for the film on October 16, 2013, and a second trailer on December 5, 2013. Whereas the initial marketing campaign focused the intimate thriller aspects of the McCall's love story, later marketing concentrated specifically on the larger horror facets of the film.[9][10]On January 14, prior to the release of the film, Fox promoted the movie by releasing a video of footage of an animatronic baby carriage and demon baby scaring passers-by in New York City.[11] The video went viral shortly thereafter and has had over 20 million views as of January 17, 2014.[12]","box_office":"$36.9 million[2]","cinematography":"Justin Martinez","production_company":"Davis Entertainment TSG Entertainment Radio Silence Productions","directed_by":"Matt Bettinelli-Olpin Tyler Gillett","Soundtrack":"The film contains diagetic music from Elvis Presley, The Gaslight Anthem, Alkaline Trio, Brenton Wood, Berlin, General Public, and Laura Stevenson.[23]","release_dates":"January 17, 2014 (2014-01-17)|||||","Production":"On December 18, 2012, Fox announced that Matt Bettinelli-Olpin and Tyler Gillett would be directing Devil's Due, based upon a script written by Lindsay Devlin.[3] Fox had approached the two directors (who are part of the filmmaking collective Radio Silence) based upon their short 10/31/98 in the 2012 horror anthology V/H/S.[6]Bettinelli-Olpin and Gillett had been approached by several other companies for \"haunted house projects\" but chose to work on Devil's Due over the other projects because they felt that the script was more character based, a \"creepy mood piece\" that focused on the relationship between its two main characters.[6] In an interview, the directors said they \"focused on Zach & Samantha's love story from day one and the horror of watching the person you love degenerate, and being left helpless beyond continuing to love them unconditionally.\"[7]The script had been pitched to them as \"a found-footage take on Rosemary's Baby,\" but the directors wanted to find ways to make their movie different from the 1968 film that they both praise and consider a personal favorite.[6] This included instilling \"a fun energy throughout\" and \"a sense of humor into the script.\"[6]Along with Allison Miller, Zach Gilford was announced to be in the film, which was shot during April 2013 in the Dominican Republic, New Orleans and Paris.[5]Bettinelli-Olpin and Gillett chose to shoot the film primarily with a Sony PMW-EX3, which they chose so that the film's actors could carry it throughout the film. The Canon 5D, Canon Vixia HF G10 and an iPhone 5 were also used in the production.[8]","Use of \"found footage\"":"Common criticism aimed is at the film's use of \"found footage\" and asks the question \"who assembled this footage?\".[16] However, according to the film's directors this was a deliberate choice, \"Audiences are way too smart to have the this is real found footage wool pulled over their eyes anymore,\"[22] and much like Chronicle, \"Devil's Due doesn't pretend to be footage that anyone has found or compiled, it's simply a story told through cameras that exists in that world. In that sense, it's a bit of an experiment that we were able to have fun with and as the character's [sic] lives spiral out of control, we're able to mirror that journey visually by shifting to different POVs.\"[7]","produced_by":"John Davis","starring":"Allison Miller Zach Gilford Sam Anderson Aimee Carrero Vanessa Ray Michael Papajohn Griff Furst","running_time":"89 minutes[1]","devil's_due":"Theatrical release poster","edited_by":"Rod Dean","written_by":"Lindsay Devlin","budget":"$7 million[2]"}