{"country":"United States","distributed_by":"Rearguard Productions","Plot":"On June 9, 1970 at the Meadowvale General Hospital in Southern California, a doctor arrives to attend to three women in labor at the same time. During a solar eclipse, two boys and a girl are born during that time. Ten years later, a young couple are fooling around in the cemetery at night and are killed, via shovel and jumping rope. The next day, Joyce arrives at the Thomas Jefferson Elementary School where Sheriff Brody is talking to Miss Davis' class about murder. He shows the children a handle from a skipping rope and asks if anyone was in the cemetery last night when Ann and Duke were murdered. None of the children say anything and he leaves, saying goodbye to his daughter Debbie. After class, Debbie and her two friends, Curtis and Steven, ask Miss Davis if everyone can be excused for their birthday party next week. The request is denied.Later, Debbie is skipping rope and calls her father outside. Sheriff Brody evades the skateboard, which is supposed to be a trap, and Debbie drops her skipping rope, which is missing a handle. Suddenly, Steven attacks and beats the sheriff with his wooden baseball bat when he bends over. While Steven and Curtis move the body, Debbie spots Timmy watching and she decides to quickly call for her mother. After the sheriff's funeral, Curtis, Steven, Timmy, and another boy are playing hide and seek in the junkyard. While Steven counts, Curtis tells Timmy to get inside a refrigerator, and Curtis locks him in. Timmy manages to escape and returns home where he tells Joyce where he was. Meanwhile, Debbie puts a picture of Miss Davis in her scrapbook, which also contains an article of her father's murder. That night, Debbie turns off the house security system, and lets Curtis switch his replica gun with the sheriff's revolver.A couple days later, Curtis murders their teacher, Ms. Davis at school with the sheriff's revolver. Joyce stumbles upon the body in a closet and when Joyce returns home to find a note from Timmy, telling her he is in the junkyard, she goes looking for him there, only to be attacked by the two boys, by using a car. She avoids the car attack and the car goes over a small cliff. A police officer arrives and Joyce tells him what has happened. That night, Joyce is discussing astrology with Timmy. She says that the solar eclipse that occurred during the births of Debbie, Curtis and Steven would have blocked Saturn, the planet which controls the way a person treats other people. Curtis waits outside with the revolver, but instead kills a young couple in van with the revolver. At Curtis, Steven, and Debbie's birthday party, Curtis tricks Joyce into believing he poisoned the cake to make her look crazy. Soon enough, Debbie's sister, Beverly discovers Debbie's horrible secret with the newspaper clippings in the scrapbook as evidence and learns that she, Curtis and Steven were responsible for the murders, including their father. She realizes that Joyce and Timmy were telling the truth all along and confronts Debbie for it. Debbie blames the scrapbook on Curtis and Mrs. Brody forbids her from hanging out with Curtis. Debbie calls Curtis and tells him and Steven to come to her house. Despite being told to wait for them, Debbie kills her older sister with an arrow and when the boys arrive, they hide the body.The next day, Curtis, Steven, and Debbie attack Timmy and almost strangle him with a garden hose before Joyce finds them and stops them. Debbie once again blames Curtis and Steven and makes herself out to look innocent. The next day, Debbie asks Joyce and Timmy to babysit her later that night and Joyce agrees, not knowing it's a trap. When Joyce and Timmy get to Debbie's house, they are attacked by the kids. However, they fight back and manage to capture Steven and Curtis. While Timmy calls the police from a neighbor's house, Debbie manages to escape from the backyard and gets inside her mother's car. She lies to Mrs. Brody about Curtis and Steven, saying that they did something bad. Her mother believes her and escapes the scene with Debbie. Afterwards, Curtis and Steven are charged by the police much to the shock and anger of the town. Before being taken away, Curtis gives an sinister grin to Joyce and Timmy, intending for revenge. The last scene shows Debbie playing with a tool outside the motel room next to a truck and her mother comes out looking for her. It's revealed that they changed their names and moved to a different area. Her mother has Debbie recite her name again as Beth Simpson and she promises to be a good girl. After they leave, a truck driver is seen dead underneath a parked truck.","language":"English","Critical reception":"Allmovie called it \"a bloody-fun time that's great for all of the wrong reasons.\"[4]","cinematography":"Stephen L. Posey","directed_by":"Ed Hunt","release_dates":"April 28, 1981 (1981-04-28)|||||","produced_by":"Gerald T. Olson","starring":"Susan Strasberg José Ferrer Lori Lethin Melinda Cordell Julie Brown","running_time":"85 min.","music_by":"Arlon Ober","Release":"Bloody Birthday was given a belated limited release theatrically in the United States by Rearguard Productions in 1986. It was later released on VHS by Prism Entertainment in 1986 and Starmaker Entertainment in 1990.The film was officially released on DVD by VCI Home Video in 2003.[2]It was released on Blu-ray by 88 Films in 2014.[3]","written_by":"Ed Hunt Barry Pearson","budget":"Unknown"}