{"based_on":"After Hours  by Edwin Torres","country":"United States","carlito's_way":"Theatrical poster","distributed_by":"Universal Pictures","screenplay_by":"David Koepp","Plot":"In 1975, after serving 5 years of a 30 year prison sentence, Carlito Brigante (Al Pacino) is freed on a legal technicality exploited by his close friend and lawyer, Dave Kleinfeld (Sean Penn). Carlito vows to be through with his criminal activities but is persuaded to accompany his young cousin Guajiro (John Ortiz) to a drug deal held at a bar. Guajiro is betrayed and killed by his suppliers and Carlito is forced to shoot his way out. Afterwards, Carlito takes Guajiro's $30,000 from the botched deal and uses it to buy into a nightclub owned by a gambling addict named Saso (Jorge Porcel) with the intent on saving $75,000 to retire to the Caribbean.As nightclub co-owner, Carlito declines several offers for a business partnership with an ambitious, albeit obnoxious, young gangster from the Bronx named Benny Blanco (John Leguizamo). Carlito also rekindles his romance with his former girlfriend Gail (Penelope Ann Miller), a ballet dancer who moonlights as a stripper. Kleinfeld develops a love interest with Benny's girlfriend, Steffie, a waitress at Carlito's nightclub. Benny's frustration with Carlito's constant rejections boils over and he confronts Carlito one night at his table. Carlito publicly humiliates Benny, who reacts by manhandling Steffie. Fueled by his now extensive use of alcohol and cocaine, Kleinfeld brazenly pulls out a gun and threatens to kill Benny, but Carlito intervenes. Despite being personally threatened by Benny himself, Carlito lets Benny go unharmed; a decision which alienates Carlito's gangster friend and personal bodyguard Pachanga (Luis Guzmán).Kleinfeld, who stole one million dollars in payoff money from his Italian mob-boss client, Anthony \"Tony T\" Taglialucci, is coerced into providing his yacht to help Tony T break out of the Rikers Island prison barge. Kleinfeld begs for Carlito's assistance in the prison break, and Carlito reluctantly agrees. Under cover of night, Carlito, Kleinfeld, and Tony T's son, Frankie, sail to a floating buoy outside of the prison barge where Tony T is waiting. As they pull Tony T aboard, Kleinfeld unexpectedly bludgeons him to death then slits Frankie's throat and dumps both of their bodies in the East River. Carlito immediately severs his ties with Kleinfeld and decides to leave town with Gail. The next day, Kleinfeld barely survives a retaliatory assassination attempt when he's stabbed in the chest at his office by two mobsters.Carlito is apprehended by police and taken to District Attorney Norwalk's (James Rebhorn) office where he is played a tape of Kleinfeld making and offering to testify to false criminal allegations against Carlito. Norwalk advises that he is aware of Carlito as an accomplice to the Taglialucci murders in an attempt to leverage him into betraying Kleinfeld to save himself, but Carlito refuses. Carlito visits Kleinfeld under police protection in the hospital, where Kleinfeld confesses to selling him out. Having noticed a suspicious man dressed in a police uniform waiting in the lobby, Carlito deftly unloads Kleinfeld's revolver and parts ways with him. The man turns out to be Tony T's other son, Vinnie (Joseph Siravo), seeking vengeance for his brother and father. Vinnie sneaks into Kleinfeld's room and executes him without incident because of Kleinfeld's empty gun.Carlito then buys train tickets to Miami for himself and Gail, now pregnant. When he stops by his club to get the stashed money, Carlito is met by a group of Italian mobsters led by Vinnie. The Italians plan on killing Carlito, but he manages to slip out through a secret exit. The Italians pursue him throughout the city's subway system and into Grand Central Terminal where they engage in a gunfight. Carlito kills all of his pursuers except Vinnie, who is shot and killed by police attracted by the gunfire.As Carlito runs to catch the train where Gail and Pachanga are waiting for him, he is ambushed by a disguised Benny, who shoots Carlito several times in the abdomen with a silenced gun. Pachanga admits to the dying Carlito that he is now working for Benny, only to be shot as well. Carlito hands a tearful Gail the money and tells her to escape with their unborn child and start a new life elsewhere. As he is wheeled away on a gurney, Carlito stares at a billboard with a Caribbean beach and a picture of a woman. The billboard then comes to life in his mind, and the woman, who is clearly Gail, starts dancing as Carlito slowly passes away.","language":"English","Reception":"Carlito's Way wrapped on July 20, 1993, and was released on 3 November 1993.[16] Critical response to the theatrical release was somewhat lukewarm. The film was criticized for re-treading old ground,[17] mainly De Palma's own Scarface and The Untouchables.[18][19] Roger Ebert stated in his review that the film is one of De Palma's finest with some of the best set-pieces he has done.[19] Patrick Doyle was praised on his scoring of the film soundtrack, which was described as \"elegiac\" and \"hauntingly beautiful,\" which \"displays Doyle as one of the major talents of modern film scoring.\"[20] Peter Travers (of Rolling Stone) criticised the film for Pacino's \"Rican\" accent slipping into his \"Southern drawl from Scent of a Woman\", \"De Palma's erratic pacing and derivative shootouts\" and \"what might have been if Carlito's Way had forged new ground and not gone down smokin' in the shadow of Scarface.\"[21]On the Siskel & Ebert show, Ebert gave the film a thumbs up while Siskel gave it a thumbs down.[21] Owen Gleiberman (from Entertainment Weekly) described the film as \"a competent and solidly unsurprising urban-underworld thriller\" and is \"okay entertainment,\" but went on to say that the plot would have worked better \"as a lean and mean Miami Vice episode.\"[22] The film has a fresh rating of 80% on the Rotten Tomatoes review site.[23]Bregman was surprised about some of the negative reviews, but stated that some of the same reviewers have since \"retracted\" their views upon further discussions of the film.[12] A few weeks before the film's premiere, De Palma told the crew not to get their hopes up about the film's reception. He correctly predicted that Pacino, having just won an Oscar, would be criticized; Koepp, having just done Jurassic Park, would \"suck\"; Penn would be \"brilliant\" because he had not done anything for a while; and he himself, having not been forgiven for The Bonfire of the Vanities, would not quite be embraced.[10]Carlito's Way premiered with an opening weekend box office taking of over $9 million. At the end of its theatrical run, the film had grossed over $36 million in the United States and $63 million worldwide.[1] Sean Penn and Penelope Ann Miller both received Golden Globe nominations for their respective roles as Kleinfeld and Gail.[24] The post cinematic appreciation of the film was later highlighted when the French publication Cahiers du cinéma named it as Best film of the 1990s along with The Bridges of Madison County and Goodbye South Goodbye.[17][25]Although the film was not considered a success with its initial theatrical run the film was popular on home video and gained a growing fan base.[17] Carlito's Way's influence can be seen in many subsequent forms of media, be it music, television shows or video games. Ken Rosenberg of Grand Theft Auto: Vice City and San Andreas video games was based on Sean Penn's portrayal of Kleinfeld. They look similar, talk in the same manner, have a similar build, have the same clothing style and display similar traits of drug use and increasing paranoia.[26] The character Benny Blanco is parodied in the MMORPG World of Warcraft with the Defias thug \"Benny Blanco\" in Westfall.[27] Benny Blanco is also used as one of names that Adam Hussain from the band Goldie Lookin Chain uses in some of their songs.A clip of Carlito shouting \"Here comes the pain!\" is used in the song \"(sic)\" by Slipknot.[28] Rapper Jay-Z has used samples of Carlito's dialogue in some of his songs including \"Intro/A Million And One Questions/Rhyme No More\",[citation needed] \"Brooklyn's Finest\",[29] and Vol. 2... Hard Knock Life.[citation needed] Jay-Z also references himself playing a lead role in a fictional movie \"Hovito's Way\" in the song \"Allure\".[30] Carlito's ending monologue is sampled on Ghostface Killa's album Ironman.[citation needed] In the 2009 album Loso's Way by American hip hop artist Fabolous the track listings included a song titled \"Pachanga\" which references to Carlito's friend, Pachanga betraying him. Evident in the hook's lyrics \"A Love changes, a thug changes and best friends become strangers, Pachangas\"An additional sample of dialogue from the film can be found in Living Legends' song \"Gotta Question For Ya\" from their album Almost Famous, beginning with the line \"Can you come with me?\".[31]The Prodigy sampled the line \"Hey, remember me? Benny Blanco From The Bronx?\" during their live shows in 1997, however the tune it was used in was not released. The line \"When you can’t see the angles no more, you're in trouble\" was sampled by jungle/drum'n'bass producer DJ Krust in \"Angles\" (1996).[32]","box_office":"$63,848,322[1]","cinematography":"Stephen H. Burum","production_company":"Epic Productions Bregman/Baer Productions","directed_by":"Brian De Palma","Prequel":"Edwin Torres' first novel Carlito's Way was filmed and released direct-to-video in 2005, under the title Carlito's Way: Rise to Power. Although critically panned, Torres did give the film his blessing and considers it to be quite an accurate adaptation of the first half of his novel, with a planned sequel for the second half in the works.[37] It stars Jay Hernandez as Carlito, with Mario Van Peebles, Michael Joseph Kelly, Luis Guzmán, Jaclyn DeSantis, Sean Combs, Burt Young, and Domenick Lombardozzi also appearing. The story is set in 1969, as three prisoners, Earl (Van Peebles), Rocco (Kelly) and Carlito (Hernandez), control their criminal empire within their cell. Upon their release, they soon take control of the drug trade in Spanish Harlem.[38]","Releases":"The film has been released on VHS and LaserDisc standard and widescreen versions.[23] It was later released on DVD in 2004,[33] with an Ultimate Edition following in 2005.[34] The Ultimate Edition DVD includes deleted scenes, an interview with De Palma, a making-of documentary and more.[35] In 2007 an HD DVD version was released, which features the same bonus material as the Ultimate Edition.[36] The film was released on Blu-ray on May 18, 2010.[citation needed]","Music":"Patrick Doyle composed the original score, while Musical supervisor Jellybean Benitez supplemented the soundtrack with elements of salsa, merengue and other authentic styles.[13]||Other songs heard in the film, but not included on the soundtrack, are You Should Be Dancing by The Bee Gees, Fly, Robin, Fly by Silver Convention and Do It ('Til Your Satisfied) by B.T. Express.","release_dates":"November 17, 1993 (1993-11-17)|||||","Production":"Pacino first heard about Carlito Brigante in a YMCA gym in New York in 1973. Pacino was working out for his movie Serpico when he met New York state supreme court Judge Edwin Torres (the author who was writing the novels Carlito's Way and After Hours). When the novels were completed Al read them and liked them, especially the character of Carlito.[5] Inspiration for the novels came from Torres' background, things that were most familiar to him: the East Harlem barrio where he was born and raised in an atmosphere of racial gangs, drugs and poverty.[11] In 1989, Pacino faced a $6 million lawsuit from producer Elliott Kastner. Kastner claimed Pacino had gone back on an agreement to star in his version of a Carlito movie with Marlon Brando as criminal lawyer David Kleinfeld. The suit was dropped and the project was abandoned.[5]Pacino went to producer Martin Bregman with the intention of getting a Carlito film made.[12] First thing on the list was to get a script written that would portray Carlito Brigante's world and provide a suitable showcase for Pacino's talents.[12] David Koepp had just finished writing the script for Bregman's forthcoming The Shadow when producer Michael S. Bregman suggested him to write the script for Carlito's Way.[3] The decision came that the screenplay would be based on the second novel After Hours. Carlito at this stage would match closer with Pacino's age.[4] Although based primarily on the second novel, the title Carlito's Way remained,[4] mainly because of the existence of Martin Scorsese's movie After Hours.[3] Bregman would work closely with Koepp for two years to develop the shooting script for Carlito's Way.[3]Koepp wrestled with the voice-over throughout the writing process. Initially the voice-over was to take place in the hospital, but De Palma suggested the train station platform.[10] The hospital scenes were written 25 to 30 times because the actors had trouble with the sequence, with Pacino even thinking that Carlito would not go to the hospital. With one final re-write Koepp managed to make the scene work to Pacino's satisfaction.[10] In the novels Kleinfeld does not die, but De Palma has a huge sense of justice and retribution. He could not have Carlito killed off and have Kleinfeld live.[10]At one point, The Long Good Friday director, John Mackenzie, was linked with the film. When Carlito's Way and its sequel After Hours were optioned, Martin Bregman had Abel Ferrara in mind. However, when Bregman and Ferrara parted ways, De Palma was brought in. Bregman explained that this decision was not about \"getting the old team back together\", rather than making use of the best talent available.[5] De Palma, reluctantly, read the script and as soon as Spanish-speaking characters cropped up he feared it would be Scarface all over again.[7] He said that he did not want to make another Spanish-speaking gangster movie.[5] When De Palma finally did read it all the way through, he realized it was not what he thought it was. De Palma liked the script and envisioned it as a noir movie.[3] Bregman supervised casting throughout the various stages of pre-production, and carefully selected the creative team who would make the film a reality. This included production designer Richard Sylbert, editor Bill Pankow, costume designer Aude Bronson-Howard and director of photography Stephen Burum.[13]Initially, filming began on March 22, 1993, though the first scheduled shoot, the Grand Central Station climax, had to be changed when Pacino showed up on crutches. Instead, the tension-building pool hall sequence, where Pacino accompanies his young cousin Guajiro on an ill-fated drug deal, started the production.[6] Because the film was heavily character based and featured little action, the early pool sequence had to be elaborate and set up right. A huge amount of time was spent setting it up and filming it.[7] After the film studio had viewed a cut of the pool hall sequence, a note was passed onto the crew stating that they felt the scene was too long. De Palma spent more time adding to the sequence and with the help of editor Bill Pankow made it work. The producers came back saying \"much better shorter.\"[10]Apart from the poster sequence, which was shot in Florida, the entire movie was filmed on location in New York. De Palma roamed Manhattan searching for suitable visual locations. A tenement on 115th Street became the site of Carlito's homecoming: the barrio scene. The courtroom, in which Carlito thanks the prosecutor, was shot in Judge Torres's workplace, the State Supreme Court Building at 60 Centre Street.[6] The Club Paradise was initially in a West Side brownstone as the model for the book's postprandial premises. But this was considered too cramped for filming. A multi-level bistro club designed by De Palma took shape at the Kaufman-Astoria Studios in Long Island City, in a style of 1970's art deco disco.[14]Tony Taglialucci's escape from Rikers Island, a night shoot mid-river, was considered impossible. Instead, the production used a Brooklyn shipyard where Kleinfeld's boat was lowered into an empty \"lock\" into which river water was pumped. Smoke machines and towers of space lights were installed.For a climactic finale, De Palma staged a chase from the platform of the Harlem-125th Street (Metro-North) Station to the escalators of Grand Central Terminal. For the shoot, trains were re-routed and timed so that Pacino and his pursuers could dart from car to hurtling car.[14] The length of the escalator scene during the climactic shoot out at Grand Central Station caused a headache for editor Pankow. He had to piece together the sequences so that the audience would be so tied up in the action that they would not be thinking about how long the escalator was running.[15]","produced_by":"Martin Bregman Michael Scott Bregman Willi Bär","starring":"Al Pacino Sean Penn","running_time":"144 minutes","music_by":"Patrick Doyle","edited_by":"Kristina Boden Bill Pankow","budget":"$30 million"}