{"country":"United States","distributed_by":"United Artists","screenplay_by":"Waldo Salt Robert C. Jones","story_by":"Nancy Dowd","Plot":"In the spring of 1968 in California, Sally (Jane Fonda), a loyal and conservative military wife, is married to Bob Hyde (Bruce Dern), a captain in the United States Marine Corps who is about to be deployed to Vietnam. As a dedicated military officer, Bob sees it primarily as an opportunity for progress. At first, Sally dreads being left alone, but after a while she feels liberated. Forced to find housing off the base she moves into a new apartment by the beach and buys a sports car. With nothing else to do, she decides to volunteer at a local veterans' hospital. This, in part, is motivated by her bohemian friend Vi Munson (Penelope Milford), whose brother Billy has come home after just two weeks in Vietnam with grave emotional problems and now resides in the VA hospital.At the hospital, Sally meets Luke Martin (Jon Voight), a former high school classmate. Like his friend Billy (Robert Carradine), Luke had gone to Vietnam but come back wounded. He is recuperating at the hospital from the injuries he sustained in the Vietnam War and which left him a paraplegic. Filled with pain, anger, and frustration, Luke is now opposed to the war. Luke at first is a bitter young man, but as he is increasingly thrown into contact with Sally, a relationship starts to develop. Eventually, Luke is released from the hospital, and, newly mobile with his own wheelchair, begins to rebuild his life. His relationship with Sally deepens. She is also transformed by him and her outlook on life starts to change. They have happy times, play at the beach, and the two fall in love. Meanwhile, Billy, traumatized by his experiences at war, commits suicide by injecting air into his veins. After Billy’s suicide, Luke has only one obsession: do anything to stop sending young men off to war.Sally and Luke eventually make love, confronting his handicap. It is the first time Sally has had an orgasm. However, she remains loyal to her husband, and both she and Luke know their relationship will have to end when her husband returns home. Bob does return, too soon, claiming he accidentally wounded himself in the leg. He is also suffering from post traumatic stress disorder from what he has seen in combat. Bob then discovers Sally’s affair from Army Intelligence; and both Sally and Luke agree that Sally should try to patch things up with Bob. Bob loses control; menacingly confronting the lovers with a loaded rifle, but ultimately turns away. The film ends with Luke speaking to young men about his experience in Vietnam, intercut with Bob placing his neatly folded Marines dress uniform on the beach, and swimming out into the ocean in the nude (the reasons for which are unclear, whether to kill himself, or as a symbolic act of cleansing). As Sally enters a supermarket at the end, the two doors close behind her, forming the symbolic phrase \"Lucky Out\".","language":"English","Reception":"Coming Home premiered at the 1978 Cannes Film Festival where Voight won the award for Best Actor for his performance.[8]The film was released in America in February 1978; it was a popular success with audiences and generally received good reviews. Charles Champlin from Los Angeles Times commented that: \"Despite an over explicit soundtrack and some moments when the story in fact became a sermon, the movie effectively translated a changed national consciousness into credible and touching personal terms\". The Toronto Sun called the film The Best Years of Our Lives c. 1978 with the same high standards and the same lofty morals of an earlier era\".Coming Home currently holds an 81% \"Fresh\" approval rating on Rotten Tomatoes.[9]","box_office":"$32,653,905[1]","cinematography":"Haskell Wexler","directed_by":"Hal Ashby","Awards":"It won Academy Awards for Best Actor (Jon Voight), Best Actress (Jane Fonda) and Best Original Screenplay (Waldo Salt, Robert C. Jones, and Nancy Dowd).[7] It was nominated for Best Supporting Actor (Bruce Dern), Best Supporting Actress (Penelope Milford), Best Director (Hal Ashby), Best Film Editing (Don Zimmerman), and Best Picture (Jerome Hellman).","release_dates":"February 15, 1978 (1978-02-15)|||||","Production":"Coming Home was conceived by Jane Fonda as the first feature for her own production company, IPC Films (for Indochina Peace Campaign), with her associate producer Bruce Gilbert, an old friend from her protest days. Fonda had in mind to make a film about the Vietnam War inspired by her friendship with Ron Kovic, a paraplegic Vietnam War Veteran, who she met in an antiwar rally.[2] At that time Ron Kovic had recently completed his autobiographical book Born on the Fourth of July which would later become an Oscar-winning motion picture of the same name directed by Oliver Stone, starring Tom Cruise as Kovic.In 1972, Fonda hired Nancy Dowd, an old friend from her days in the feminist movement, to write a script about the consequences of the war as seen through the eyes of a military wife.[3] Originally, Dowd’s story, tentatively titled Buffalo Ghosts, focused on two women, volunteers at a veteran’s hospital, who must come to grip with the emotional toll the war takes on its casualties and their families. The project dragged on for six years, until Bruce Gilbert and producer Jerome Hellman took it. The screenplay was reshaped significantly by the circle of talent who would eventually bring it to the screen: Fonda, Ashby, Wexler, Jon Voight, producer Hellman and screenwriters Waldo Salt and Robert C. Jones. They were united by their opposition to the Vietnam War and by their concern for the veterans who were returning to America facing difficulties adapting to life back home. Rudy Wurlitzer did uncredited work on the script.[4]The film was going to be directed by John Schlesinger who had worked with producer Hellman and Voight in Midnight Cowboy, but he left the project after feeling uncomfortable with the subject matter.[5] He was replaced by Hal Ashby. Fonda was cast from the beginning as Sally Hyde, the housewife. A top box office star was sought for the male lead, to offset the grim nature of the story. Al Pacino, Jack Nicholson, and Sylvester Stallone were all offered the part but declined.[6] Jon Voight had been considered for the role of the husband, but after becoming involved with the film, he campaigned to play the paraplegic veteran. Voight had participated in the antiwar movement and was a friend of Fonda, who was instrumental in helping him land the role, even though he had fallen from popularity since his Midnight Cowboy day. Bruce Dern, long stereotyped in sadistic roles, was chosen as the husband. The screenplay was written and rewritten until the project could wait no longer. Jane Fonda who just finished Julia (1977) was soon going to star in Alan Pakula’s Comes a Horseman (1978). For director Ashby, this was his second film about the 1960s since his 1975 film Shampoo: where in 'Shampoo' he dealt with the beautiful people of the 1960s immersed in the good life and not thinking about Vietnam, Coming Home found others dealing with the horrors of the war and its tragic after effects.Ashby had cast singer-songwriter, Guthrie Thomas, to portray the difficult role of Bill Munson in the film after reviewing Thomas' screen test filmed by Sally Dennison. Thomas joined Ashby and the entire cast at a restaurant in Malibu Beach, California prior to the beginning of production. Thomas was a close friend to Ashby and had been cast in a previous Ashby film, Bound for Glory, starring David Carradine. Upon completion of the cast meeting Thomas privately spoke to Ashby and told his friend, \"Hal, I am a singer-songwriter as you know and not an actor. In all fairness to you and this amazing cast you need an extremely talented actor for this role and not a poor singer. I recommend either Bobby Carradine or Keith Carradine.\" Robert Carradine was cast and portrayed the role of Bill Munson.","coming_home":"Theatrical release poster","produced_by":"Jerome Hellman","starring":"Jane Fonda Jon Voight Bruce Dern","running_time":"126 minutes","edited_by":"Don Zimmerman","budget":"$3 million"}