{"Cast":"One of the supporting actors was the famed choreographer Jack Cole.","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Background":"The original concept for the film reportedly came from Helen Rose, who designed dozens of gowns and dresses for Bacall for Designing Woman. She gives an interview / screen test in the DVD's special features.Lauren Bacall was dealing with husband Humphrey Bogart's eventually-fatal illness during the shooting. According to her autobiography, she took the role (which was originally intended for Grace Kelly) in order to avoid her home situation, but in interviews she said that this film was among her favorites, and that she desperately wanted the part, even accepting a lower salary. She said that Grace Kelly considered the part to have been written for her, and would never forgive Bacall, adding \"She got the prince, I got the part\".[4]Bogart died January 14, 1957, four months before the film's release.Both James Stewart and Cary Grant turned down the role that went to Peck (Grant citing the heavy drinking of the character as the main reason).","Plot":"While on vacation, sports reporter Mike Hagen (Gregory Peck) meets fashion designer Marilla Brown (Lauren Bacall). The two instantly bond and quickly get married, only to realize they have little in common.Mike is a sportswriter and poker enthusiast with working-class friends. Marilla designs clothes for a wide array of artistic personalities. Their friends clash memorably one Wednesday night when his Poker Club and her Drama Society both convene at Marilla's apartment.Marilla becomes suspicious of Mike after she finds a photograph of Lori Shannon (Dolores Gray), Mike's former girlfriend. Mike tries to hide his former relationship, but fails miserably. Complicating matters even further is Mike's continuing series of exposés of the activities of crooked boxing promoter Martin Daylor (Edward Platt). Mike's life is in danger, but he hides that from his wife too. What results is a series of misunderstandings and mishaps.","language":"English","Reception":"The movie ended up being one of both Bacall and Peck's more successful films both critically[5] and commercially, with Bosley Crowther of the New York Times comparing the leading couple with Katharine Hepburn and Spencer Tracy and proclaiming, \"(the film) obviously endeavors to generate the same kind of verve and general sardonic humor as flowed from that older comedy team. It does, too — at least, in certain stretches.\"[6]As for modern reviews, website Rottentomatoes.com has given Designing Woman an overall positive note, regarding it 72 percent \"fresh\" as opposed to \"rotten\",[5] while the website Allmovie.com gives it two and a half stars out of five, crediting Bacall for giving a \"sparkling comic performance\".[7]DVDverdict.com proclaims the comedy as \"shiny, polished, and entertaining\" and states that \"it has held its value well over the years.\"[8]","box_office":"$3,750,000[1]","cinematography":"John Alton","directed_by":"Vincente Minnelli","designing_woman":"Theatrical release poster","narrated_by":"Lauren Bacall Gregory Peck","release_dates":"May 16, 1957 (1957-05-16)|||||","produced_by":"Dore Schary","starring":"Lauren Bacall Gregory Peck Dolores Gray","running_time":"118 minutes","Box Office":"According to MGM records the film earned $2,175,000 in the US and Canada and $1,575,000 elsewhere resulting in a small loss of $136,000.[1]","music_by":"Billy Higgins André Previn W. Benton Overstreet","edited_by":"Adrienne Fazan","written_by":"George Wells","budget":"$1,844,000[1]"}