{"country":"United States","distributed_by":"Filmgroup","Background":"The film was shot in Puerto Rico back-to-back with two other Corman productions, The Last Woman on Earth and Battle of Blood Island, from a script that had previously been filmed as Naked Paradise and Beast from Haunted Cave.[1][2] Griffith rewrote the script to accompany both the locations Corman was shooting on and a comedic storytelling approach, as opposed to the previous versions of the script, which had been straightforward.","Plot":"During the Cuban Revolution, deported American gambler and racketeer Renzo Capetto (Anthony Carbone) comes up with a get-rich-quick scheme and uses his yacht to help a group of loyalists headed by General Tostada (Edmundo Rivera Alvarez) escape with Cuba's national treasury which they plan to use to stage a counterrevolution.American secret agent XK150, using the alias Sparks Moran (Edward Wain a.k.a. Robert Towne), has infiltrated the gang which consists of Capeto's brazenly felonious blond girlfriend Mary-Belle Monahan (Betsy Jones-Moreland), her deceptively clean-cut younger brother Happy Jack (Robert Bean) and a gullible, good-naturedly homicidal oaf named Pete Peterson Jr. (Beach Dickerson) who constantly does animal impressions.Unfortunately despite his other role as the story's omniscient narrator, Sparks is too much the Maxwell Smart-style bumbler to ever really figure out what is going on due both to his own incompetence and his hopeless infatuation with the completely uninterested Mary-Belle who regards his attempts to rescue her from a life of crime with an amused contempt.Capetto plans to steal the fortune in gold and claim that the mythical \"Creature from the Haunted Sea\" rose up and devoured the loyalists, while in fact it is he and his crew who murder the Cuban soldiers with sharpened claw-like gardening tools and leave behind \"footprints\" made with a toilet plunger and a mixture of olive oil and green ink. What Capetto doesn't know however is that there really is a shaggy, pop-eyed sea monster lurking in the very waters where he plans to do the dirty deed and that the creature may make his plan all too easy to pull off!When the monster's insatiable hunger upsets his scheme though, Capetto decides to sink his boat in 30 feet of water off the shore of a small Puerto Rican island and then retrieve the gold at a later time. Complications ensue however when the male members of his gang get romantically involved with the natives, with Pete hooking up with the aptly named Porcina (Esther Sandoval) and Jack with her pretty daughter Mango (Sonia Noemí González), while local working girl Carmelita (Blanquita Romero) takes an instant if inexplicable liking to Sparks.Capetto and his gang go scuba diving to attempt to salvage the loot, but the creature picks them all off one by one except for Sparks and Carmelita, and the movie ends with it sitting on the undersea treasure happily picking its teeth.","language":"English","Release history":"Creature from the Haunted Sea was not released until 1961.[2] The film's marketing campaign did not make the film out to be a comedy, and instead promoted the film as a straight thriller.[8] The film's poster asks \"What was the unspeakable secret of the sea of lost ships?\" and requests that audiences \"do not give away the answer to the secret.\"[2] Many audiences found the advertising to be misleading, which hurt the film's box office.[8]In March 1963, Corman reassembled the cast in Santa Monica to appear in new scenes directed by Monte Hellman for television airings of the film, expanding the length to 74 minutes.[9][10] A title song, sung by Betsy Jones-Moreland, was added by Hellman on the assumption that a film called Creature from the Haunted Sea should have a title song.[9] Hellman also shot footage for television versions of Beast from Haunted Cave, Ski-Troop Attack, and The Last Woman on Earth. According to Hellman, \"That was probably the most fun I've ever had, because I was the producer, writer, and director, and I had absolute control over the crew and how the money was spent and everything. It was really fantastic, plus the fact that it was totally off the wall stuff—it was like Saturday Night Fever.\"[10]In 2008, a colorized version was released by Legend Films.[11] This version is also available from Amazon Video on Demand.[12]","Critical reception":"Film critic Cavett Binion wrote, \"This early bit of \"B\"-movie fluff from Roger Corman and company is a hastily slapped-together melange of crime thriller and monster flick, laced with enough ham-fisted satire to make the entire mess enjoyable.\"[13]","cinematography":"Jacques R. Marquette","directed_by":"Roger Corman","narrated_by":"Robert Towne","release_dates":"June 1961 (1961-06)|||||","Production":"In 1959, following the completion of The Little Shop of Horrors, Roger Corman assembled a small cast and crew and arrived in Puerto Rico to direct The Last Woman on Earth and produce a World War II film titled Battle of Blood Island. According to Corman, \"I had discovered that tax incentives were available if you 'manufactured' in Puerto Rico. That included making movies.\"[1] When Corman still had unused footage left over from The Last Woman on Earth, he decided to make another film.[1][3]Screenwriter Charles B. Griffith was asked to rewrite a screenplay that had previously been filmed as Naked Paradise and Beast from Haunted Cave for the new locations, to complete the screenplay in three days, and that Corman would be playing one of the characters, Happy Jack Monahan. Angered with the situation, Griffith wrote Corman the most difficult role he could think of, requiring the character to be laughing hysterically in one scene and crying like a baby in the next.[2][4] Corman states that when he read the script, he \"realized Happy Jack practically became the lead. I know Chuck did this to drive me crazy. It was too big a role, and required an actor.\"[1] Corman gave the role to the film's boom operator, Robert Bean,[2] who also played the role of the Creature.[5] Griffith was paid $1,500 for his script.[6]Creature from the Haunted Sea was shot in five days.[3] Locals appeared in the film as extras, reportedly being paid $1 an hour.[5] According to Corman, \"I was trying to get more movement into long dialogue scenes. Chuck had one scene in the script that especially bothered me because I couldn't figure out how to give it some action. We were shooting in a palm grove and I had these Americans playing touch football with a coconut. [...] If nothing else, there was a lot of movement in that scene.\"[1] During a scene in which the character Renzo Capetto is shown assembling an automatic pistol, actor Antony Carbone was given a real gun which fell apart unexpectedly. After shooting a take that \"worked perfectly,\" Corman decided that the first take was funnier, and used it in the film with added narration to achieve humorous effect.[1]According to Beach Dickerson, the Creature was made from \"a wetsuit, some moss, lots of Brillo pads. [...] Tennis balls for the eyes, Ping-Pong balls for the pupils, and pipecleaners for the claws. Then we cover him with black oilcloth to make him slimy.\"[1] According to Carbone, the cast \"really had to do some deep concentration in order not to laugh when we saw it.\"[5] Carbone felt that Corman should have shot the scenes featuring the Creature from its point-of-view, so that the audience would never see the Creature. \"That would at least keep a semblance of some fear. Because when you see this Creature, you gotta laugh! Not that the laughter isn't good, but the laughter should not be about the Creature, it should be about the actions of the Creature. For example, when the Creature kills, you should take the action from the actor to make it funny—his eyes pop out, or he puts his finger in his mouth like a child, or some humorous little bit that the person being killed could do. Therefore you sustain both the secrecy of this thing and bring out the comedy. Then I think it would have been at least plausible, in a way.\" Despite Carbone's feelings about Corman's filmmaking aesthetics, he stated that the film was \"very funny\" and he \"had a lot of fun doing it.\"[5]When the cast and crew had difficulty getting out of the country, the cinematographer hid the film from Corman until the cast and crew got paid for the production.[3] Actress Betsy Jones-Moreland stated of the production that \"the only problem with that movie is that it started out to be a takeoff on everything Roger had ever done before. It was to be a comedy, a laugh a minute. Then all of a sudden, somewhere in the middle of it, that got lost and it got to be serious!\" Moreland continued to state that she \"just assumed that nobody would ever see it. In the beginning, because it was going to be a \"sophisticated\" spoof and it was going to be an inside joke, I was not ashamed of it. Later, when it didn't turn out to be that way, when it got off the track and got dumb, then I wished that I'd never heard of it.\"[3]The film's musical score, written by Fred Katz, was originally written for A Bucket of Blood. According to Mark Thomas McGee, author of Roger Corman: The Best of the Cheap Acts, each time Katz was called upon to write music for Corman, Katz sold the same score as if it were new music.[2] The score was used in a total of seven films, including The Wasp Woman and The Little Shop of Horrors.[7]","creature_from_the_haunted_sea":"Theatrical release poster","produced_by":"Roger Corman Charles Hannawalt","starring":"Antony Carbone Betsy Jones-Moreland Edward Wain","running_time":"75 minutes","music_by":"Fred Katz","edited_by":"Angela Scellars","written_by":"Charles B. Griffith"}