{"country":"United States","distributed_by":"Orion Pictures","Critical response":"Amityville 3D was received negatively by critics and, in many cases, was selected as one of the worst films of 1983. Currently it maintains a 0% rating on Rotten Tomatoes.[3]Variety reported “A new cast of characters and the addition of 3-D does little to pump new life, supernatural or otherwise, into this tired genre.”[4] Janet Maslin of The New York Times wrote, \"Once the first two films in a series have exhausted most opportunities for action, the third is liable to average half a dozen exposition scenes for every eventful episode.\" Of the 3D, she said \"3-D exposition is the stuff of which headaches are made; the footage tends to be so dark that you can barely tell whether it's night or day.\"[5]","Plot":"After he exposes a pair of con artists with his partner Melanie (Candy Clark) in the infamous 112 Ocean Avenue house in Amityville journalist John Baxter (Tony Roberts) is persuaded to purchase the house by real estate agent Clifford Sanders (John Harkins). While preparing the house for John, Clifford investigates footsteps in the attic. He is locked in the room, where a swarm of flies attack and kill him. John believes Clifford died of a stroke, even after Melanie shows him some photos she took of the real estate agent before his death which depict him as a rotting corpse.While John is at work, he nearly dies in a malfunctioning elevator. Simultaneously, Melanie experiences bizarre occurrences in John's house. She is found later that night by John, cowering and hysterical against the wall. Her attempts to convince John that something is inside the house fall on deaf ears. Later, while looking over blowups of the photos of Clifford, Melanie discovers a demonic-looking face in the pictures. When she attempts to show the photos to John, she is killed in a horrific car accident. Melanie's death is ruled accidental by everyone, including John, who remains oblivious to the evil in his home.While John is away one day his daughter Susan (Lori Loughlin) and her friend Lisa (Meg Ryan) and two boyfriends use a Ouija board in the attic. The game tells them Susan is in danger. Growing bored, Susan and the others go out in John's motorboat. Susan's mother Nancy (Tess Harper), who has come to look for her, is surprised to see a drenched Susan silently walk up the stairs. Outside John arrives home to find Susan's friends bringing her lifeless body to shore. Nancy has a nervous breakdown and, believing Susan is still alive and will return shortly, refuses to leave, even for Susan's funeral.After having nightmares about the old well in the basement and unable to deal with Nancy's delusions that Susan is still alive, John allows his friend, paranormal investigator Doctor Elliot West (Robert Joy), and a team of paranormal investigators to set up in the house, to help prove if Nancy actually saw something or not. As Elliot and John watch, Nancy is confronted by a spectral being speaking in Susan's voice. Nancy follows the spectre into the basement, where the old well has filled with liquid. Elliot urges whatever is in the well to reveal itself and restore Susan to life. Instead, a demon leaps from the well, burns Elliot's face with fiery breath and drags him to Hell. The house begins to implode. Much of Elliot's team is killed by flying and exploding objects, but John and Nancy and several others escape through a window. As John and Nancy leave, the well bubbles ominously as an eerily glowing fly emerges from it.","language":"English","box_office":"$6.3 million (domestic)","amityville_3-d":"Theatrical release poster","cinematography":"Fred Schuler","directed_by":"Richard Fleischer","release_dates":"November 18, 1983 (1983-11-18)|||||","Production":"Like the previous installment, Amityville 3-D filmed the exterior scenes at the same house in Toms River, New Jersey and a house nearby for the exterior of Nancy's house. The interior was a set in a Mexico studio. The filmmakers almost never got the house to film at again. It was scheduled to be picked up and moved over one lot. They were just able to film the exterior shots before the house was moved. Originally the house had four quarter shaped moon windows, two on both sides. However, by the time of filming in 3D, the owners of the house did not want the eye windows on the side of the house facing the road so they modified them to look like small ordinary square windows. All shots of the \"eye\" windows (except for the most noticeable scene when John and Susan pull up to the house) had to be filmed on the side facing the river that has the sundeck.As with Friday the 13th Part III and Jaws 3-D, which were also released in 3D in 1983, Amityville 3-D was filmed using the ArriVision 3-D process - coordinated, for this film, by cinematographer Tibor Sands. The Arrivision 3D system filmed 3D movies in standard color, with a single camera and one single strip of film. The process utilized a technique in which a special twin lens adapter was fitted to the camera and divided the 35mm frame in half down the middle – the result was that the right eye image was in the lower half of the frame and the left eye image was in the upper. The innovation was to allow a single camera to capture the image that could be merged when with the help of the special polarized glasses.At the box office, movie patrons were given the disposable polarized glasses so they could see the film, creating the illusion that certain props and elements were coming toward the viewers. In this case, a pole that penetrates a car window; a Frisbee that flies toward the screen; a skeleton reaches out its arms; and a set a French doors that fly at the audience during the climactic scene. Most striking are the film's opening titles, in which the large block letters moved outward, and the “3D” were skewed as they moved outward. The process was supposed to be the new beginning for the 3D process, but it did not last long. The chief complaint was that the images in Amityville 3-D were blurry and distorted. Chicago Sun-Times critic Roger Ebert complained on At the Movies, that the images were indistinct, and said “it really looks crummy.” Chicago Tribune critic Gene Siskel said that \"The 3D added nothing to the experience. All you ended up with was eye-strain.\"","Box office":"Amityville 3-D finished its opening box office weekend at #1, with a box office take of $2,366,472 according to Box Office Mojo. The following weekend it dropped to #5 and a 21% drop, in the second weekend. Its final domestic gross ended at $6,333,135. It was ultimately considered a box office flop and ended up being the last film in the series released theatrically until the remake of The Amityville Horror in 2005.","produced_by":"Stephen F. Kesten","starring":"Tony Roberts|Tess Harper|Robert Joy|Candy Clark|","running_time":"105 min (USA) 93 min. (UK)","music_by":"Howard Blake","edited_by":"Frank J. Urioste","Release":"While released theatrically in 3-D, the only 3-D home release of the film has been on DVD in the UK, and as of August 2012, also in Scandinavia. In October 2013, Scream Factory released a 3-D Blu-ray of Amityville 3-D, along with The Amityville Horror and Amityville II: The Possession.[6] A novelization of the film was written by Gordon McGill while Howard Blake wrote a score for the film, which was released on CD in 2000 as part of the Original Orchestral Score for Flash Gordon.","written_by":"David Ambrose"}