{"country":"United States","distributed_by":"Trans World Entertainment","screenplay_by":"William Malone Alan Reed","Plot":"In the film's prologue, two geological researchers for the American multinational corporation NTI encounter an ancient alien laboratory on the moon Titan. In the lab is an egg-like container which is keeping an alien creature alive. The creature emerges and kills the researchers. Two months later, the geologists' spaceship crashes into the space station Concorde in orbit around Earth's moon, its pilot having died in his seat.NTI dispatches a new ship, the Shenandoah, to Titan. Its crew is accompanied by the taciturn security officer Bryce. While in orbit, the crew locate a signal coming from the moon—the distress call of a ship from the rival German multinational Richter Dynamics. Their own landing turns disastrous when the ground collapses beneath their landing site, dropping the ship into a cavern and wrecking it. When radio communication fails, a search party is sent out to contact the Germans.In the German ship, they find one of the containers from the prologue breached, as well as the dead bodies of the crew. Then the creature appears, and kills Susan when she lags behind the escaping group. Fennel enters a state of shock at the sight and Bryce sedates him. When they return to their own ship, the Americans find that one of the Germans, Hofner (Klaus Kinski), has snuck aboard. He tells them how his crew was slain by the creature, which was buried with other organisms as part of a galactic menagerie. He proposes returning to his ship to get some explosives, but the crew are unwilling to risk it.However, it emerges that the victims of the creature become undead controlled by the creature through parasites. Unsupervised in the medbay, Fennel sees the undead Susan through a porthole and follows her outside. She strips naked, and he stands transfixed while she removes his helmet. He asphyxiates, and then she attaches an alien parasite to his head. Now under alien control, Fennel sends a transmission to his crewmates, inviting them over to the German ship. Hofner and Bryce are sent to get some air tanks for the Shenandoah and stand guard over it, while the rest of the crew go over to the Richter ship.Hofner and Bryce stop over at the menagerie on their way, and are attacked by Susan, who has also had a parasite attached. The rest of the crew go over to the Richter ship, and find Fennel with a bandage on his head to conceal his parasite. Captain Davison insists that medical officer Oliver examine his head, so Fennel has her accompany him to the engineering quarters to feed her to the creature. Davison and Perkins notice Fennel doesn't sweat and go check on them. They are too late to rescue Oliver who is decapitated by the creature, but Perkins blows up Fennel's head with his pistol.Soon afterwards Sladen runs into an infected Hofner. She escapes the ship, and in her hurry only puts on her helmet after exiting. Perkins spots her outside and opens the airlock. Now unconscious, Sladen is carried in by Hofner to lure the others. They fight, and Davison manages to defeat Hofner by ripping off his parasite. The three survivors formulate a plan to electrocute the creature with the ship's fusion modules, which can only be accessed by going through the engineering quarters.Suddenly some alarms sound: a creature is making its way through the ship, committing sabotage. Sladen and Davison go through engineering to make their electrocution trap, while Perkins goes to the computer room to monitor the creature. Sladen finishes rigging the trap just in time for the creature's arrival, and they apparently electrocute it to death. However, when Davison leaves, it captures Sladen.Davison and Perkins follow her screaming and find her locked inside engineering. Studying the ship's blueprints, they find another entrance to engineering and sends Perkins to lure away the creature while Davison retrieves Sladen. On the way, Perkins locates one of the bombs Hofner had mentioned just before the creature jumps him. Dying, Perkins manages to attach the bomb to the creature and set off the countdown so Davison can jettison it through the airlock.It climbs back aboard, however, so Davison tackles it, throwing himself out the airlock in the process. When the bomb fails to explode, Bryce appears and shoots it, which sets it off and kills the creature. She recovers Davison and dresses his wounds, and they finally launch the ship.","Accolades":"Nomination","language":"English","cinematography":"Harry Mathias","directed_by":"William Malone","DVD release and other viewing media":"Sometime after the film's release, the film fell into the public domain and received numerous VHS and DVD releases. In 2007, Creature was shown on the horror hosted television series Cinema Insomnia.[2] Apprehensive Films later released the Cinema Insomnia-version onto DVD.[3]In March 2013 director William Malone independently released Creature under its initial title of \"Titan Find\" fully uncut and in widescreen for the first time.","release_dates":"March 1985 (1985-03) (Brussels International Festival of Fantasy Films)|May 8, 1985 (1985-05-08) (United States)||||","produced_by":"William G. Dunn","starring":"Stan Ivar Wendy Schaal Lyman Ward Robert Jaffe Diane Salinger","running_time":"97 minutes","music_by":"Thomas Chase Steve Rucker","creature":"Theatrical release poster","edited_by":"Bette Jane Cohen"}