{"country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Brian Nelson","story_by":"M. Night Shyamalan","Plot":"Ramirez (Jacob Vargas) speaks in a voice-over about stories that his mother told him about the devil sometimes actively seeking out individuals who have sinned while they are still alive on Earth. While taking human form, he traps them in a confined place only to turn them against each other, before killing them one at a time. Ramirez explains that the last victim will die in front of his or her loved one to make cynics of them all. He says that the signs are set in motion with a suicide, as that is when the Devil first makes his presence known. This story is abruptly interrupted by a violent suicide of a man who had fallen from the thirty-fifth floor of a Philadelphia office building. The truck he falls on rolls silently away.Detective Bowden (Chris Messina) is a recovering alcoholic who is assigned to the case of the suicide. He later explains that the reason for his alcoholism was the hit and run death of his wife and son, five years previously, in which the perpetrator was never apprehended. Meanwhile, five strangers board an elevator, which later becomes stuck between floors. When security finds them, they notice that there is CCTV and a radio with which they can call into the elevator, but they have no way of hearing the passengers in return. Bowden takes the investigation regarding the elevator as it is the same building from which the suicide victim jumped.Ramirez is revealed to be one of the security guards and is disturbed by an image of what looks like a screaming face frozen on the video monitor. His boss Lustig (Matt Craven) dismisses the superstitious suspicions and sends repair technician Dwight (Joe Cobden) to investigate the elevators while Bowden tries to ascertain the identities of the individuals. Only four of the five are accounted for: Vince McCormick (Geoffrey Arend), a sleazy mattress salesman; Sarah Caraway (Bojana Novakovic), a pathological liar who plans to leave her rich husband and take his money with her; Ben Larson (Bokeem Woodbine), a temporary security guard with a history of violence; an unnamed older woman whom police mistakenly believe is named Jane Kowski (Jenny O'Hara) who is seen on video to be a thief, and another man who later introduces himself as Tony (Logan Marshall-Green), who does not appear to have signed in at the security desk.The power goes on and off in the elevator, and each time the power is restored, something evil takes place. Dwight falls to his death on top of the elevator, and Lustig is electrocuted trying to restore power. Soon people in the elevator start dying, and the suspicion keeps shifting between all in the elevator. Vince is killed when a mirror broke, the old woman is hanged on a lamp cord from the elevator ceiling, Ben's neck is broken, and Sarah is slit by a broken piece of the mirror in the throat. Finally, the old woman, who is the devil and faked her death, is left with Tony, now revealed as Tony Janekowski by his fiancée, Cheryl (Zoie Palmer). Tony confesses to having been responsible for a hit-and-run five years ago in which he killed a mother and her son. Detective Bowden hears him apologize over the radio.The Devil, powerless now that Tony has repented of his sin, curses before vanishing, and the elevator comes back on line, sparing Tony's life. As bodies of Sarah, Ben, and Vince are wheeled away, Bowden decides to take Tony into custody, and, while en route, informs him that he is the husband and father of the mother and son Tony killed in that accident. But despite saying he'd gone over what he'd say, or what he would do if they'd ever cross paths, he forgives Tony.Ramirez, again in a voice-over, says that his mother always reassured him at the end of her stories, \"If the Devil is real, then God must be real too.\"","devil":"Theatrical release poster","language":"English","box_office":"$62.7 million[1]","cinematography":"Casey Neistat","production_company":"Media Rights Capital The Night Chronicles Blinding Edge Pictures","directed_by":"John Erick Dowdle","narrated_by":"Jacob Vargas","release_dates":"September 17, 2010 (2010-09-17)|||||","Production":"Filming started on October 26, 2009 in Toronto.[3] There was additional shooting for the film several months later in Los Angeles and Philadelphia.[4] Joe Cobden had to train for four months to prepare for his role. He said that preparing for his death scene, which took four days to shoot, was the hardest scene to shoot except for the introduction and closing.","produced_by":"M. Night Shyamalan Sam Mercer","starring":"Chris Messina Logan Marshall-Green Geoffrey Arend Bojana Novakovic Jenny O'Hara Bokeem Woodbine Jacob Vargas","running_time":"80 minutes[1]","Sequels":"Following Devil, two additional movies in the The Night Chronicles series were announced, with the second movie titled Reincarnate (although originally announced as 12 Strangers [10]) and a third as yet untitled third film which borrows the screenplay from an abandoned Unbreakable sequel.[11] As of May 2016, neither sequel has materialized however.","music_by":"Fernando Velázquez","edited_by":"Elliot Greenberg","Release":"The film was set to have a release date on February 11, 2011, but was bumped up to September 17, 2010. The film's trailer debuted online on July 13, 2010.The film was not screened to critics in advance.[7] Devil has received mixed reviews. Review aggregator Rotten Tomatoes reports a mixed score of 52%, with an average rating of 5.2/10, with the site's consensus being \"It's better than many of the other films M. Night Shyamalan has been associated with, but Devil never gets more than a few low-budget thrills out of its fiendishly promising premise.\"[8] Dennis Harvey of Variety gave Devil a lukewarm review, saying \"Like the solid B-thrillers of yore that often outshone A-pics topping double bills, M. Night Shyamalan-produced Devil is nothing very special or original, but it gets the job done briskly and economically.\"[9]The film Devil was released to DVD and Blu-ray Disc on December 21, 2010.[citation needed]","budget":"$10 million[1]","Story sources":"Based on recent film clips, Ysamur Flores and the directors of Devil, John Erick and Drew Dowdle, explain that the movie is based on a Devil's Meeting, which is a premise that the Devil is on Earth to test evildoers by tormenting them.[5] Shyamalan acknowledged that the basic structure of the story was \"an Agatha Christie nod.\"[6] In Christie's 1939 novel And Then There Were None, as in Devil, a group of people with guilty pasts are trapped in an isolated area and begin to die one by one.[citation needed]"}