{"based_on":"Blue Is the Warmest Color  by Julie Maroh","country":"France Belgium Spain[2][3]","distributed_by":"Wild Bunch (France) Cinéart (Belgium) Vértigo Films (Spain)","screenplay_by":"Abdellatif Kechiche Ghalia Lacroix","Themes and interpretations":"Lesbian sexuality is one of the strongest themes of the film, as the narrative deals mainly with Adele’s exploration of her identity in this context. However, the film's treatment of lesbian sexuality has been questioned by academics, due to its being directed from a straight, male perspective. In Sight & Sound, film scholar Sophie Mayer suggests that in Blue is the Warmest Colour, \"Like homophobia, the lesbian here melts away. As with many male fantasies of lesbianism, the film centres on the erotic success and affective failures of relations between women\".[35] The issue of perspective has also been addressed in a Film Comment review by Kristin M. Jones who points out that \"Emma's supposedly sophisticated friends make eager remarks about art and female sexuality that seem to mirror the director’s problematic approach toward the representation of women\".[36]One recurring thematic element addressed by critics and audiences is the division of social class and the exploration of freedom and love between the two central characters, Adèle and Emma.[37][38] The reference to social class is juxtaposed between the two dinner table scenes in the film, with Adèle's conservative middle-class family engaging in discussion over comparatively banal subjects to Emma's more open-minded upper-middle-class family, who focus their discussion primarily on more existential matters: art, career, life and passion. Perhaps one of the most significant differences between Adèle's and Emma's families is that Emma's is aware of their lesbian relationship, while Adèle's conservative parents are under the impression the women are just friends.[39] Some critics have noted that the difference of social class is an ongoing theme in Kechiche's filmography: \"As in Kechiche's earlier work, social class, and the divisions it creates, are a vital thread; he even changed the first name of the story's passionate protagonist from Clémentine to that of his actress, partly because it means \"justice\" in Arabic. His fascination and familiarity with the world of pedagogy, as shown here in Adèle's touching reverence for teaching, is another notable characteristic\", was noted by a Film Comment critic.[40]The film portrays Adele and Emma's relationship with an overarching sense of realism. The camerawork, along with many of Kechiche's directorial decisions allow a true-to-life feel for the film, which in turn has led to audiences reading the film with meaning that they can derive from their own personal experiences. In The Yale Review, Charles Taylor puts this into words: \"Instead of fencing its young lovers within a petting zoo... Kechiche removes the barriers that separate us from them. He brings the camera so close to the faces of his actresses that he seems to be trying to make their flesh more familiar to us than his own.\"[41]Blue Is the Warmest Colour is also filled with visual symbolism.[42][43] The colour blue is used extensively throughout the film—from the lighting in the gay club Adèle visits, to the dress she wears in the last scene and most notably, in Emma's hair and eyes. For Adèle, blue represents an envoy of curiosity, ecstasy, love and ultimately, sadness. Adèle also references Pablo Picasso a number of times,[44][45] who famously went through a melancholy Blue Period. As Emma grows out of her relationship with Adèle and their passion wanes, she removes the blue from her hair and adopts a more natural, conservative hairstyle.[46] There is also a profusion of imagery of food in the film, from the regularly consumed spaghetti to Adèle's first experience tasting oysters.[47] Relationships—both heterosexual and homosexual—are also a common dynamic throughout the film: from Adèle's exploration of failed first romance with Thomas, to her affair with a male colleague, and to her love and loss with Emma.Kechiche explores how food can evoke varying levels of symbolism for instance, through sexually ‘suggestive food metaphors – the appetitive Adèle likes the fat on ham, and learns to eat oysters via Emma’.[48] Additionally he looks at how food can be seen as an indicator of social class, ‘cooking her father’s bolognese as the pièce de résistance for Emma’s graduation party offers a neat class observation; inevitably, however, the dripping spaghetti becomes the pivot for a flirtation with Emma’s friend Samir, positioned as a potential future partner by the film’s end.’[48]One reviewer noted the political stance adopted by Adèle, which changes as her life experiences change and reflect her alternating views: \"Blue is the Warmest Colour is no different; at least, at first. Framed by black and Arab faces, Adèle marches in a protest to demand better funding for education. The music, \"On lâche rien\" (\"We will never give up!\"), by the Algerian-born Kaddour Haddadi, is the official song of the French Communist Party. Yet, soon after she begins her relationship with Emma, we see Adèle marching again, hip-to-hip with her new lover, at a gay pride parade.\"[49]","Plot":"Adèle is an introverted 15-year-old[19] high-school student whose classmates gossip constantly about boys. While crossing the street one day, she passes by a woman with short blue hair and is instantly attracted. She dates a boy at her school for a short while and they have sex, but she is ultimately dissatisfied and breaks off their relationship. After having vivid fantasies about the woman she saw on the street and having one of her female friends behave flirtatiously towards her, she becomes troubled about her sexual identity. One friend, the openly gay Valentin, seems to understand her confusion and takes her to a gay dance bar. After some time, Adèle leaves and walks into a lesbian bar, where she experiences assertive advances from some of the women. The blue haired woman is also there and intervenes, claiming Adèle is her cousin to those pursuing Adèle. The woman is Emma, a graduating art student. They become friends and begin to spend more time with each other. Adèle's friends suspect her of being a lesbian and ostracise her at school. Despite the backlash, she becomes very close to Emma. Their bond increases and before long, the two share a kiss at a picnic. They later have sex and begin a passionate relationship. Emma's artsy family is very welcoming to the couple, but Adèle tells her conservative, working-class parents that Emma is just a tutor for philosophy class.In the years that follow, the two women live with each other as lovers. Adèle finishes school and joins the teaching staff at a local elementary school, while Emma tries to move forward with her painting career. Adèle feels ill at ease among Emma's intellectual friends and Emma belittles her teaching career, encouraging her to find fulfillment in writing. Adèle enjoys playing the stereotypical feminine role in their relationship but Emma becomes physically and emotionally distant. They gradually begin to realise how little they have in common. Emotional complexities manifest in the relationship and Adèle, in an impulsive moment of loneliness and confusion, sleeps with a male colleague.Emma becomes aware of the brief fling and kicks Adèle out of their apartment, leaving Adèle heartbroken and alone. Time passes and although Adèle finds satisfaction in her job as a kindergarten teacher, an indescribable sadness begins to overwhelm her. The two eventually meet again in a restaurant. Adèle is still very deeply in love with Emma and despite the powerful connection that is clearly still there between them, Emma is now in a committed partnership with Lise, the pregnant woman at the party they threw a few years earlier, who now has a young daughter. It is implied that the two had known each other for years, and had become reacquainted during the party. Adèle is devastated, but holds it in. Emma admits that she does not feel sexually fulfilled but has accepted it as a part of her new phase in life. She reassures Adèle, though, that their relationship was special: \"I have infinite tenderness for you. I always will. All my lifelong.\" The two part on amicable terms.The film concludes with Adèle at Emma's new art exhibition. Hanging on one wall is a nude painting that Emma once did of her during the sensual bloom of their life together. Though Emma acknowledges her, her attention is primarily on the gallery's other guests and Lise. Adèle congratulates Emma on the success of her art and leaves after a brief conversation with a young man she met earlier in the film. He chases after her but heads in the wrong direction. Adèle walks away into an ambiguous future as a hang is played over the soundtrack and the film ends.","Accolades":"The film won the Palme d'Or at the 2013 Cannes Film Festival.[14] The actresses were also given the Palme as a special prize.[89][90][91] Kechiche dedicated the award to \"the youth of France\" and the Tunisian revolution, where \"they have the aspiration to be free, to express themselves and love in full freedom\".[92] At Cannes it also won the FIPRESCI Prize.[93] In addition, this is also the first film adapted from either a graphic novel or a comic to win the Palme d'Or.[85] In December 2013 it received the Louis Delluc Prize for best French film in 2013.[94] The film was nominated for the Best Foreign Language Film award at the 71st Golden Globe Awards and the BAFTA Award for Best Film Not in the English Language.[15] At the 39th César Awards, the film received eight nominations with Exarchopoulos winning the César Award for Most Promising Actress.[95][96]","blue_is_the_warmest_colour":"French release poster","language":"French","Reception":"Blue Is the Warmest Colour grossed a worldwide total of $19,492,879.[5] During its opening in France, the film debuted with a weekend total of $2.3 million on 285 screens for a $8,200 per-screen average. It took the fourth spot in its first weekend, which was seen as a \"notably good showing because of its nearly three-hour length\".[64][65] The film had a limited release in the U.S, and it grossed an estimated $101,116 in its first weekend, with an average of $25,279 for four theaters in New York City and Los Angeles.[66]Review aggregation website Rotten Tomatoes gives the film an approval rating of 90% based on 163 reviews and an average score of 8.2/10. The site's critical consensus is: \"Raw, honest, powerfully acted, and deliciously intense, Blue Is the Warmest Colour offers some of modern cinema's most elegantly composed, emotionally absorbing drama.\"[67] On Metacritic, which assigns a normalised rating out of 100 based on reviews from mainstream critics, the film has a score of 88 averaged from 41 reviews, indicating \"universal acclaim\".[68]At Cannes, the film shocked some critics with its long and graphic sex scenes (although fake genitalia were used),[69][30] leading them to state that the film may require some editing before it is screened in cinemas.[70] Several critics placed the film as the front-runner to win the Palme d'Or and it went on to win the coveted prize.[13][70][71][72][73] The judging panel, which included Steven Spielberg, Ang Lee, and Nicole Kidman, made an unprecedented move to award the top prize to the film's two main actresses along with the director. Jury president Steven Spielberg explained:\"The film is a great love story that made all of us feel privileged to be a fly on the wall, to see this story of deep love and deep heartbreak evolve from the beginning. The director did not put any constraints on the narrative and we were absolutely spellbound by the amazing performances of the two actresses, and especially the way the director observed his characters and just let the characters breathe.\"[74][75]Justin Chang, writing for Variety, said that the film contains \"the most explosively graphic lesbian sex scenes in recent memory\".[3] Jordan Mintzer of The Hollywood Reporter said that despite being three hours long, the film \"is held together by phenomenal turns from Léa Seydoux and newcomer Adèle Exarchopoulos, in what is clearly a breakout performance\".[76]Writing in The Australian, David Stratton said, \"If the film were just a series of sex scenes it would, of course, be problematic, but it's much, much more than that. Through the eyes of Adèle we experience the breathless excitement of first love and first physical contact, but then, inevitably, all the other experiences that make life the way it is ... All of these are beautifully documented.[77]In The Daily Telegraph, Robbie Collin awarded the film a maximum of five stars and tipped it to win the Palme d'Or. He wrote: \"Kechiche’s film is three hours long, and the only problem with that running time is that I could have happily watched it for another seven. It is an extraordinary, prolonged popping-candy explosion of pleasure, sadness, anger, lust and hope, and contained within it – although only just – are the two best performances of the festival, from Adèle Exarchopolous and Léa Seydoux.\"[78] Writing for The Guardian, Peter Bradshaw added that \"it is genuinely passionate film-making\" and changed his star rating for the film to five out of five stars after previously having awarded it only four.[7][79] Stephen Garrett of The New York Observer said that the film was \"nothing less than a triumph\" and \"is a major work of sexual awakening\".[80]Andrew Chan of the Film Critics Circle of Australia writes, \"Not unlike Wong Kar-wai's most matured effort in cinema, Happy Together, director Abdellatif Kechiche knows love and relationship well and the details he goes about everything is almost breathtaking to endure. There is a scene in the restaurant where two meet again, after years of separation, the tears that dwell on their eyes shows precisely how much they love each other, yet there is no way they will be together again. Blue Is the Warmest Colour is likely to be 2013's most powerful film and easily one of the best.\"[81]Movie Room Reviews praised the film giving it 4 1⁄2 stars saying \"This is not a movie that deals with the intolerance of homosexuality or what it’s like to be a lesbian. It’s about wanting to explore that piece of yourself you know is there while still dealing with the awkwardness of youth.\"[82]The film was not without its criticisms, many of them about the sex scenes. Manohla Dargis of The New York Times described the film as \"wildly undisciplined\" and overlong and wrote that it \"feels far more about Mr. Kechiche's desires than anything else\".[83][84]Though source author Julie Maroh praised Kechiche's originality, describing his adaptation as \"coherent, justified and fluid ... a masterstroke\",[85] she also felt that he failed to capture the lesbian heart of her story, and disapproved of the sex scenes. In a blog post, she called the scenes, \"a brutal and surgical display, exuberant and cold, of so-called lesbian sex, which turned into porn, and me feel very ill at ease\", saying that in the movie theatre, \"the heteronormative laughed because they don't understand it and find the scene ridiculous. The gay and queer people laughed because it's not convincing, and found it ridiculous. And among the only people we didn't hear giggling were the potential guys too busy feasting their eyes on an incarnation of their fantasies on screen\". She added that \"as a feminist and lesbian spectator, I cannot endorse the direction Kechiche took on these matters. But I'm also looking forward to hearing what other women will think about it. This is simply my personal stance.\"[86]Conversely, Richard Brody, writing in The New Yorker about \"Sex Scenes That Are Too Good\", stated: \"The problem with Kechiche’s scenes is that they're too good—too unusual, too challenging, too original—to be assimilated ... to the familiar moviegoing experience. Their duration alone is exceptional, as is their emphasis on the physical struggle, the passionate and uninhibited athleticism of sex, the profound marking of the characters' souls by their sexual relationship.\"[87]More than 40 critics named the film as one of the ten best of 2013.[88]","box_office":"$19.5 million[5]","cinematography":"Sofian El Fani","production_company":"Quat'sous Films Wild Bunch France 2 Cinéma Scope Pictures Radio Télévision Belge Francofone Vértigo Films","directed_by":"Abdellatif Kechiche","release_dates":"23 May 2013 (2013-05-23) (Cannes)|9 October 2013 (2013-10-09) (France, Belgium)|25 October 2013 (2013-10-25) (Spain)|||","Production":"Director and screenwriter Abdellatif Kechiche developed the premise for Blue Is the Warmest Colour while directing his second feature film, Games of Love and Chance (2003). He met teachers \"who felt very strongly about reading, painting, writing\" and it inspired him to develop a script which charts the personal life and career of a female French teacher. However, the concept was only finalised a few years later when Kechiche chanced upon Julie Maroh's graphic novel, and he saw how he could link his screenplay about a school teacher with Maroh's love story between two young women.[20] Although Maroh's story takes precedence in the adaptation, Adèle's character, named \"Clémentine\" in the book, differs from the original as explored by Charles Taylor in The Yale Review \"The novel includes scenes of the girls being discovered in bed and thrown out of the house and speeches like ‘‘What’s horrible is that people kill each other for oil and commit genocide, not that they give their love to someone.’’[21] In the film, Adèle's parents are seemingly oblivious to her love affair with Emma and politely greet her under the impression that she is Adèle's philosophy tutor. Further themes are explored in Maroh's novel, such as addiction to prescription pills which takes the life of Clémentine / Adèle when she suffers a seizure. Regarding his intention portraying young people, Kechiche claimed: \"I almost wish I was born now, because young people seem to be much more beautiful and brighter than my generation. I want to pay them tribute.\"[22]In late 2011, a casting call was held in Paris to find the ideal actress for the role of Adèle. Casting director Sophie Blanvillain first spotted Adèle Exarchopoulos and then arranged for her to meet Abdellatif Kechiche. Exarchopoulos described how her auditions with Kechiche over the course of two months consisted of improvisation of scenarios, discussions and also of them both sitting in a café, without talking, while he quietly observed her. It was later, a day before the New Year, that Kechiche decided to offer Exarchopoulos the leading role in the film; as he said in an interview, \"I chose Adèle the minute I saw her. I had taken her for lunch at a brasserie. She ordered lemon tart and when I saw the way she ate it I thought, 'It's her!'\"[20][23][24]On the other hand, Léa Seydoux was cast for the role of Emma, ten months before principal photography began in March 2012. Kechiche felt that Seydoux \"shared her character's beauty, voice, intelligence and freedom\" and that she has \"something of an Arabic soul\". He added on saying, \"What was decisive during our meeting was her take on society: She's very much tuned in to the world around her. She possesses a real social awareness, she has a real engagement with the world, very similar to my own. I was able to realise to how great an extent, as I spent a whole year with her between the time she was chosen for the role and the end of shooting.\" Speaking to Indiewire on the preparation for her role, Seydoux said \"During those ten months (before shooting) I was already meeting with him (Kechiche) and being directed. We would spend hours talking about women and life; I also took painting and sculpting lessons, and read a lot about art and philosophy.\"[20][24]Initially planned to be shot in two and a half months, the film took five, from March to August 2012 for a budget of €4 million.[4] Seven hundred and fifty hours of dailies were shot.[25] Shooting took place in Lille as well as Roubaix and Liévin.[26]In terms of cinematography, the shot reverse shot scenes in the film were simultaneously shot with two different cameras. For Kechiche this technique not only facilitates editing but also adds beauty to the scene which feels more truthful.[27] Another characteristic aspect of Blue's cinematography is the predominance of close-ups.Upon its premiere at the 2013 Cannes Festival, a report from the French Audiovisual and Cinematographic Union (Syndicat des professionnels de l'industrie de l'audiovisuel et du cinéma) criticised the working conditions from which the crew suffered. According to the report, members of the crew said the production occurred in a \"heavy\" atmosphere with behaviour close to \"moral harassment\", which led some members of the crew and workers to quit.[4] Further criticism targeted disrupted working patterns and salaries.[28] Technicians accused director Abdellatif Kechiche of harassment, unpaid overtime and violations of labour laws.[29]In September 2013, the two main actresses, Léa Seydoux and Adèle Exarchopoulos, also complained about Kechiche's behaviour during the shooting. They described the experience as \"horrible\", and said they would not work with him again.[30] Exarchopoloulos later said about the rift: \"No, it was real, but it was not as big as it looks. For me, a shoot is a human adventure, and in every adventure you have some conflict.\"[31] In an interview in January 2014, Seydoux clarified: \"I'm still very happy with this film. It was hard to film it and maybe people think I was complaining and being spoilt, but that's not it. I just said it was hard. The truth is it was extremely hard but that's OK. I don't mind that it was hard. I like to be tested. Life is much harder. He's a very honest director and I love his cinema. I really like him as a director. The way he treats us? So what!\"[32]In an interview in September 2013, director Abdellatif Kechiche stated that the film should not be released. Speaking to French magazine Télérama, Kechiche said \"I think this film should not go out; it was too sullied\", referring to the negative press about his on-set behaviour.[33][34]","Distribution":"Blue Is the Warmest Colour had its world premiere at the 66th Cannes Film Festival on 23 May 2013. It received a standing ovation and ranked highest in critics' polls at the festival.[50] In August 2013, the film had its North American premiere at the 2013 Telluride Film Festival and was also screened in the Special Presentation section of the 2013 Toronto International Film Festival on 5 September 2013.[51]The film was screened at more than 131 territories[52] and was commercially released on 9 October 2013 in France with a \"12\" rating.[53] In the United States, the film was rated NC-17 by the Motion Picture Association of America for \"explicit sexual content\". It had a limited release at four theaters in New York City and Los Angeles on 25 October 2013, and expanded gradually in subsequent weeks.[54][55][56][57] The film was released on 15 November 2013 in the United Kingdom[58] and in Australia and New Zealand on 13 February 2014.[59][60][61]La Vie d'Adèle – Chapitres 1 & 2 was released on Blu-ray Disc and DVD in France by Wild Side on 26 February 2014, and in North America, as Blue is the Warmest Color through The Criterion Collection on 25 February 2014.[62] As Blue Is the Warmest Colour, the film was also released on DVD and Blu-ray Disc in Canada on 25 February 2014 by Mongrel Media, in the United Kingdom on 17 March 2014 by Artificial Eye and on 18 June 2014 in Australia by Transmission Films.In Brazil, Blu-ray manufacturing companies Sonopress and Sony DADC are refusing to produce the film because of its content. The distributor is struggling to reverse this situation.[63]","produced_by":"Abdellatif Kechiche Brahim Chioua Vincent Maraval","starring":"Léa Seydoux Adèle Exarchopoulos","running_time":"179 minutes[1]","edited_by":"Albertine Lastera Camille Toubkis Sophie Brunet Ghalia Lacroix Jean-Marie Lengelle","budget":"€4 million[4]"}