{"mandarin":"Jiā Yǒu Xǐ Shì","country":"Hong Kong","distributed_by":"Mandarin Films Ltd. Regal Films Distribution Co. Ltd.","screenplay_by":"Vincent Kok Choi Ting-ting Roman Cheung Eric Yeung","story_by":"Lee Lik-chi Woo Nga-si Raymond Wong Man Hang-yat Philip Cheng Woo Suet-lai","language":"Cantonese","cantonese":"Gaa1 Jau2 Hei2 Si6","box_office":"HK$48,992,188","cinematography":"Lee Kin-keung","production_company":"Regal Films","directed_by":"Clifton Ko","traditional":"家有囍事","Cast and roles":"[1] [2]","simplified":"家有囍事","Plot details":"All's Well, Ends Well is a comic romance of 3 hapless brothers, who eventually learn through their amorous exploits and misadventures that love is only won through gradual nurturing, and quickly lost through the quick, dishonest, selfish ways which they have always taken for granted.Moon (Raymond Wong) is eldest brother and head of the family. The film begins with the celebration of his 7th anniversary wedding with Leng, which celebration he deserts, preferring instead the company of his mistress (Sheila Chan). He turns up at home with her later, forcing his wife (whom he calls 'hag') to leave the house in dismay. Although she is very devoted to her husband and tolerates him for all his misbehaviors, her tolerance stops short of accepting his mistress openly in the family home.So (Leslie Cheung) is an effeminate floral arranger and lecturer at an art school, who is good at cooking and enjoys women's hobbies. His second cousin Mo-seung comes to his house on that same evening, and entirely devours an elaborate gourmet banquet which So had intended as a gift for Leng on her otherwise disastrous wedding anniversary. From that day on, So and Mo-seung are constantly at loggerheads over trivial issues, insulting each other with vulgar metaphors during a mahjong game session, apparently irreconcilable.Foon is a local radio DJ who flirts shamelessly while on air and is well-known among his legion of female fans for his impressive kissing technique. Holli-yuk (Maggie Cheung) calls him on air one day and arranges a date with him. She is an avid Hollywood movie lover who enjoys re-enacting particular love-scenes from movies. She is convinced that Foon shares her romantic outlook and they soon become lovers. Foon, however, is a notorious playboy not eager to settle down. Predictably, Holli-yuk catches him in an act of infidelity. After a freak accident leaves Foon suffering from a mildly debilitating mental illness, Holli-yuk offers to become a nurse for him. Taking advantage of her role as his nurturer, she gleefully devises methods to punish him for his callous behaviour.The brothers' dilemmas are later resolved in similarly titled sequel films. Each story concludes on a cheeky and high-spirited note.","release_dates":"25 January 1992","produced_by":"Clifton Ko Raymond Wong","starring":"Leslie Cheung Stephen Chow Raymond Wong Maggie Cheung Sandra Ng Teresa Mo","running_time":"100 minutes","music_by":"Violet Lam","edited_by":"Kam Ma"}