{"country":"United States","distributed_by":"Paramount Pictures","Plot":"Set during World War I, the film centers on Lili Smith (Julie Andrews), a popular British music hall performer who is regarded as a femme fatale. She is actually a German spy, and the uncle she dotes upon is really Colonel Kurt Von Ruger (Jeremy Kemp), a fellow spy and her contact with the German military.In hopes of gaining valuable information, Lili begins using her feminine wiles on Major William Larrabee (Rock Hudson), a top American pilot. However, Lili soon falls in love with Larrabee and cannot find the courage to betray him. When Larrabee discovers Lili's secret, he refuses to turn her in.","language":"English","Reception":"The film's distribution was badly managed by Paramount executives and Darling Lili barely got a release in most of the United States. Despite setting box-office records at Radio City Music Hall, the film was a commercial failure. Budgeted at $25 million, Darling Lili grossed only $5 million in the US[8]","box_office":"$3,250,000 (US/ Canada rentals)[1]","cinematography":"Russell Harlan","directed_by":"Blake Edwards","Awards and honors":"Despite being a financial failure, Darling Lili did garner important awards and nominations and was a modest success with critics.The song \"Whistling Away the Dark\", music by Henry Mancini, lyrics by Johnny Mercer, was nominated for an Academy Award for Best Original Song. It was performed by Julie Andrews at the beginning of the film, pre-credits, and reprised at the end.Darling Lili was also nominated for the Academy Award for Best Costume Design (Jack Bear and Donald Brooks) and the Academy Award for Best Original Score.Julie Andrews received a nomination for Best Actress, Musical or Comedy, while \"Darling Lili\" won for Best Original Song. The film was also nominated for Best Picture, Musical or Comedy.","darling_lili":"Theatrical release poster","Music":"The original score for Darling Lili was composed by Henry Mancini. He and Johnny Mercer wrote the title tune, as well as \"Whistling Away the Dark\". Songs from the era were performed in the film, including \"It's a Long Way to Tipperary\", \"Pack Up Your Troubles in Your Old Kit-Bag\", \"Keep the Home Fires Burning\", and \"Mademoiselle from Armentieres\".","References":"NotesBibliography","release_dates":"June 24, 1970 (1970-06-24)|||||","Production":"In 1967 Blake Edwards signed a four picture deal with Paramount. The films he would make were Waterhole#3, Gunn, Mr Lucky and Darling Lili. Julie Andrews signed to play the lead in Darling Lili. Production was to start late 1967.[2][3] Executive producer Owen Krump began shooting second unit in 1967.[4]Blake Edwards suffered continual interference from Paramount Pictures executives while making Darling Lili, and it was eventually edited by the studio largely without his input. The director later satirized the problems he faced in the film S.O.B. (1981), which was distributed by Paramount theatrically.Edwards later claimed Darling Lili was budgeted at $11.5 million but ended up costing $16 million. He said half the cost was due to second unit filming in Ireland and he had pleaded with Paramount not to shoot in Europe due to the weather, but they insisted.[5]Problems with the May 1968 protests in France led to much of the planned Parisian shooting to be done in Brussels.[6]Darling Lili made use of Lynn Garrison’s aviation facility at Weston Aerodrome, Leixlip, Ireland. This collection of World War I replica fighter aircraft, facilities and support equipment was originally put together in support of 20th Century Fox’s 1966 film The Blue Max. The aerial fleet included a sole Caudron 277, two Fokker DR 1s, three Fokker D VIIs, two Se 5as and two Pfalz D IIIs (all full-scale replicas). In addition, the studio contracted with Slingsby Aircraft Ltd to build six 7/8th scale SE 5s (the \"Mini SE 5\").[7] The Paramount production utilized the assembled aircraft for thousands of flying hours and accumulated hundreds of hours of aerial footage. Pilots were drawn from the Irish Air Corps and civilian circles. Charles Boddington and Derek Piggott did many of the more spectacular stunts.[7]","produced_by":"Blake Edwards","starring":"Julie Andrews Rock Hudson Gloria Paul","running_time":"136 minutes 107 min (director's cut) 190 min (original roadshow release)","Director's Cut":"In 1991, at the behest of Michael Schlesinger, then the head of Paramount's Repertory division, Edwards was invited to recut and remix Darling Lili back to his original intentions. This Director's Cut was 29\" shorter than the original release and felt smoother and less bloated. A fully restored, new Dolby SR 35mm print premiered at the 1992 Cannes Film Festival during a retrospective of his films, and was attended by Edwards and Andrews; the U.S. Premiere was at the Directors Guild theatre in Los Angeles shortly thereafter, again with both in attendance. Then, after a brief domestic theatrical reissue, it was released to home video and television; this version was later released on Region 1 DVD. However, the original roadshow version, complete with overture and exit music, still survives and has aired on Turner Classic Movies as well as receiving commercial release on Region 2 DVD in Europe.","music_by":"Henry Mancini Johnny Mercer (lyrics)","edited_by":"Peter Zinner","written_by":"William Peter Blatty Blake Edwards","budget":"$25,000,000 USD"}