{"country":"United States","Awards and nominations":"At the 61st Academy Awards, Dangerous Liaisons won three Oscars out of seven nominations, for Best Adapted Screenplay (Christopher Hampton), Best Costume Design (James Acheson), and Best Art Direction (Stuart Craig and Gérard James). Its four unsuccessful nominations were for Best Actress (Glenn Close), Best Supporting Actress (Michelle Pfeiffer), Best Original Score (George Fenton), and the Academy Award for Best Picture.[3] Director Stephen Frears and lead actor John Malkovich were not nominated.At the 43rd British Academy Film Awards, Michelle Pfeiffer won for Best Actress in a Supporting Role, and Christopher Hampton won for Best Screenplay. The film received a further eight nominations, in the categories of Best Direction (Stephen Frears), Best Actress in a Leading Role (Close), Best Cinematography (Philippe Rousselot), Best Costume Design (Acheson), Best Original Film Score (Fenton), Best Editing (Mick Audsley), Best Make Up Artist (Jean-Luc Russier) and Best Production Design (Craig).[3]In addition to his Oscar and BAFTA awards, Christopher Hampton also won the London Film Critics' Circle Award for Screenwriter of the Year, and the Writers Guild of America Award for Best Screenplay Based on Material from Another Medium.[3]Stephen Frears won the César Award for Best Foreign Film[3] and Best Director from the Boston Society of Film Critics. The film was second only to Mississippi Burning in the National Board of Review's Top 10 films.Philippe Rousselot was nominated for both the American Society of Cinematographers Award and the British Society of Cinematographers Award.[3]","distributed_by":"Warner Bros.","Plot":"In 1781 pre-Revolution Paris, the amoral and sexually ravenous Marquise de Merteuil (Glenn Close) plots revenge against her ex-lover, the Comte de Bastide, who has recently ended their relationship. To soothe her wounded pride and embarrass Bastide, she seeks to arrange the seduction and disgrace of his young virgin fiancée, Cécile de Volanges (Uma Thurman), who has only recently been presented to society after spending her formative years in the shelter of a convent.Merteuil calls on the similarly unprincipled Vicomte de Valmont (John Malkovich) to do the deed, offering him her own sexual favors as a reward. Valmont declines, as he has a seduction of his own in progress: Madame de Tourvel (Michelle Pfeiffer), the virtuous wife of a presiding justice, the Président de Tourvel. Merteuil is amused and incredulous at Valmont's hubris; how can he ever hope to bed a chaste, devoutly religious woman like Tourvel? Never one to refuse a challenge, Valmont modifies the proposal: If he succeeds in sleeping with Tourvel, Merteuil must sleep with him as well. Merteuil accepts, on the condition that he furnish written proof of the liaison.At the estate of Valmont's aunt, Madame de Rosemonde (Mildred Natwick), Valmont employs every trick in his considerable repertoire in a vain attempt to attract Tourvel's attention, but she rebuffs all of his advances. Searching for leverage, Valmont instructs his page Azolan (Peter Capaldi) to seduce Tourvel's maid Julie (Valerie Gogan) to gain access to Tourvel's private correspondence. One of the letters he intercepts is from Madame de Volanges (Swoosie Kurtz), Cécile's mother and Merteuil's cousin, warning Tourvel that Valmont is a cad, and a generally nefarious and untrustworthy individual. On reading this, Valmont resolves to do Merteuil's dirty work after all, seducing Cécile as revenge for her mother's only-too-accurate denunciation of him.Meanwhile in Paris, Cécile meets the charming Chevalier Raphael Danceny (Keanu Reeves). Danceny becomes Cécile's music teacher and slowly, with a little coaxing from Merteuil (who knows that Danceny, a poor commoner, can never qualify as a bona fide suitor), they fall in love.Valmont's seduction of Cécile is rapid and unsubtle: After gaining access to her bedchamber on a false pretense, he forces himself upon her as she pleads with him to leave. On the pretext of illness Cécile remains locked in her chambers, refusing all visitors. A concerned Madame de Volanges calls upon Merteuil to speak to her. Cécile, naively assuming that Merteuil has her best interests at heart, confides in her. Merteuil advises Cécile to welcome Valmont's advances; young women should take advantage of all the lovers they can acquire, she says, in a society so repressive and contemptuous of women. The result is a perverse \"student-teacher\" relationship between Cécile and Valmont; by day she is courted by Danceny, and each night she receives a sexual \"lesson\" from Valmont. In the meantime, Merteuil begins an affair with Danceny.Meanwhile, during Valmont’s time as Cécile's \"teacher\", he somehow manages to win Tourvel's heart — but at a cost: Valmont, the lifelong bachelor playboy, falls in love. In a fit of jealousy, Merteuil mocks Valmont and threatens to trash his reputation as a carefree gigolo. She also refuses to honor her end of their agreement, since Valmont has no written proof that the relationship has been consummated. Valmont abruptly dismisses Tourvel with a terse excuse: \"It is beyond my control\". Cécile, meanwhile, after a particularly rough night in Valmont's bed, miscarries his child.Tourvel, overwhelmed with grief and shame, retires to a convent where she refuses all food and drink, and her health deteriorates rapidly. The Valmont-Merteuil toxicity escalates. Valmont warns Danceny of Merteuil’s ulterior motives in seducing him; Merteuil retaliates by informing Danceny that Valmont has been sleeping with Cécile. Danceny challenges Valmont to a duel with swords, and mortally wounds him. With his dying breath, Valmont asks Danceny to communicate to Tourvel—by now at death's door—his genuine love for her. He then gives Danceny his collection of intimate letters from Merteuil; all of Paris learns the entire, grisly range of her schemes and depredations. Booed and humiliated at the opéra by her former friends and sycophants, Merteuil flees the city in disgrace. Cécile, guilt-ridden, returns to the convent whence she came to become a nun.","language":"English","Reception":"Dangerous Liaisons holds a score of 93% on Rotten Tomatoes,[11] and a score of 74 on Metacritic,[12] indicating a positive critical reception.Pauline Kael in The New Yorker described it as \"heaven – alive in a way that movies rarely are.\"[12] Hal Hinson in the Washington Post wrote that the film's \"wit and immediacy is extraordinarily rare in a period film. Instead of making the action seem far off, the filmmakers put the audience in the room with their characters.\"[13] Roger Ebert called it \"an absorbing and seductive movie, but not compelling.\"[14] Variety considered it an \"incisive study of sex as an arena for manipulative power games.\"[15] Vincent Canby in The New York Times hailed it as a \"kind of lethal drawing-room comedy.\"[16]Christopher Hampton received critical acclaim for his screenplay, with Time Out writing that \"one of the film's enormous strengths is scriptwriter Christopher Hampton's decision to go back to the novel, and save only the best from his play.\"[17] James Acheson and Stuart Craig were also praised for their work, with Sheila Benson of the Los Angeles Times stating that \"the film's details of costuming (by The Last Emperor's James Acheson) and production design (by Stuart Craig of Gandhi and The Mission) are ravishing.\"[12] All three would go on to win Academy Awards for their work on this film.Glenn Close received considerable praise for her performance; she was lauded by The New York Times for her \"richness and comic delicacy,\"[16] while Mick LaSalle of the San Francisco Chronicle wrote that, once she \"finally lets loose and gives way to complete animal despair, Close is horrifying.\"[12] Roger Ebert thought the two lead roles were \"played to perfection by Close and Malkovich... their arch dialogues together turn into exhausting conversational games, tennis matches of the soul.\"[14]Michelle Pfeiffer was also widely acclaimed for her portrayal, despite playing, in the opinion of the Washington Post, \"the least obvious and the most difficult\" role. \"Nothing is harder to play than virtue, and Pfeiffer is smart enough not to try. Instead, she embodies it.\"[13] The New York Times called her performance a \"happy surprise.\"[16] Roger Ebert, considering the trajectory of her career, wrote that \"in a year that has seen her in varied assignments such as Married to the Mob and Tequila Sunrise, the movie is more evidence of her versatility. She is good when she is innocent and superb when she is guilty.\"[14] Pfeiffer would later win a British Academy Film Award for her performance.The casting of John Malkovich proved to be a controversial decision that divided critics. The New York Times, while admitting there was the \"shock of seeing him in powdered wigs\", concluded that he was \"unexpectedly fine. The intelligence and strength of the actor shape the audience's response to him.\"[16] The Washington Post was similarly impressed with Malkovich's performance: \"There's a sublime perversity in Frears' casting, especially that of Malkovich... [he] brings a fascinating dimension to his character that would be missing with a more conventionally handsome leading man.\"[13] Variety was less impressed, stating that while the \"sly actor conveys the character's snaky, premeditated Don Juanism... he lacks the devilish charm and seductiveness one senses Valmont would need to carry off all his conquests.\"[15]","box_office":"$34.7 million","cinematography":"Philippe Rousselot","directed_by":"Stephen Frears","dangerous_liaisons":"Theatrical release poster","Soundtrack":"The score of Dangerous Liaisons was written by the British film music composer George Fenton. The soundtrack also includes works by a number of baroque and classical composers, reflecting the story's 18th-Century-French setting; pieces by Antonio Vivaldi, Johann Sebastian Bach, George Frideric Handel and Christoph Willibald Gluck feature prominently, although no French composers are included.[10]","release_dates":"December 16, 1988 (1988-12-16)|||||","Production":"Dangerous Liaisons was the first English-language film adaptation of Laclos's novel. The screenplay was based on Christopher Hampton's Olivier Award-winning and Tony Award-nominated theatrical adaptation for the Royal Shakespeare Company,[4] directed by Howard Davies and featuring Lindsay Duncan, Alan Rickman and Juliet Stevenson.The film was shot entirely on location in the Île-de-France region of northern France, and featured historical buildings such as the Palais Garnier in Paris, the Château de Vincennes in Val-de-Marne, the Château de Champs-sur-Marne, the Château de Guermantes in Seine-et-Marne, the Château du Saussay in Essonne, and the Théâtre Montansier in Versailles.[5]Liaisons was the final film appearance of Academy Award- and Tony Award-nominated actress Mildred Natwick.[6] Drew Barrymore auditioned for the role of Cécile, and Sarah Jessica Parker turned it down before it was offered to Thurman.[6]During production Malkovich had an affair with Pfeiffer. His six-year marriage to actress Glenne Headly ended shortly thereafter.[7][8][9]","produced_by":"Norma Heyman Hank Moonjean","starring":"Glenn Close|John Malkovich|Michelle Pfeiffer|Swoosie Kurtz|Keanu Reeves|Mildred Natwick|Uma Thurman|","running_time":"119 minutes","music_by":"George Fenton","Related adaptations":"Three decades before Dangerous Liaisons, Roger Vadim adapted the Laclos novel into Les Liaisons dangereuses, a French film starring Jeanne Moreau, Gérard Philipe and Annette Vadim. Less than a year after Dangerous Liaisons was released, Miloš Forman adapted the novel into Valmont, starring Colin Firth in the title role, Annette Bening, and Meg Tilly.In 1999, Roger Kumble adapted the novel into Cruel Intentions, a drama involving Prep School students in New York, starring Sarah Michelle Gellar, Ryan Phillippe and Reese Witherspoon as well as a cameo from Dangerous Liaisons cast member Swoosie Kurtz. In 2003, Untold Scandal, a South Korean adaptation, was released; it was set in the same time as the original novel, but in the Kingdom of Joseon. In 2012, a Chinese adaptation, \"Dangerous Liaisons (危險關係),\" was released, directed by Hur Jin-ho, a Korean director, and starring Zhang Ziyi.Almost 25 years after he played Valmont, John Malkovich directed a French-language version of Christopher Hampton's play in Paris, which ran at the Théâtre de l'Atelier.[18][19] In December 2012, the production is being brought to Lansburgh Theatre by the Shakespeare Theatre Company for a limited run in Washington D.C.[20]","edited_by":"Mick Audsley","written_by":"Christopher Hampton","budget":"$14 million"}