{"based_on":"Crouching Tiger, Hidden Dragon  by Wang Dulu","country":"Taiwan[2]|China[2]|Hong Kong[2]|United States[2]|","distributed_by":"Sony Pictures Classics","screenplay_by":"Wang Hui-Ling|James Schamus|Tsai Kuo Jung|","Themes and interpretations":"The name \"Crouching Tiger Hidden Dragon\" is a literal translation of the Chinese idiom \"臥虎藏龍\" which describes a place or situation that is full of unnoticeable masters. It is from a poem of the ancient Chinese poet Yu Xin's (513–581) that reads \"暗石疑藏虎，盤根似臥龍\", which means \"behind the rock in the dark probably hides a tiger, and the coiling giant root resembles a crouching dragon.\"[5] The last character in Xiaohu and Jiaolong's names mean \"Tiger\" and \"Dragon\" respectively.A teacher's desire to have a worthy student, the obligations between a student and a master, and tensions in these relationships are central to the characters' motives, conflicts between the characters, and the unfolding of the film's plot. Li Mu Bai is burdened with the responsibility for avenging his master's death, and turns his back on retirement to live up to this obligation. His fascination with the prospect of having Jen as a disciple also motivates his behavior, and that of Jade Fox.Regarding conflicts in the student-teacher relationship, the potential for exploitation created by the subordinate position of the student and the tensions that exist when a student surpasses or resists a teacher are explored. Jen hides her mastery of martial arts from her teacher, Jade Fox, which leads both to their parting of ways and to Jade Fox's attempt on Jen's life. At the same time, Jade Fox's own unorthodox relationship with a Wudang master (who she claims would not teach her, but did take sexual advantage of her) brought her to a life of crime. At times, Li Mu Bai and Jen's conversations more than hint that the desire for a teacher-student relationship could turn into a romantic relationship.[6] Jen responds to these feelings, and her desire to not submit to a teacher, by turning away from Li Mu Bai when she jumps in the lake after the Green Destiny.Poison is also a significant theme in the film. In the world of martial arts, poison is considered the act of one who is too cowardly and dishonorable to fight; and indeed, the only character that explicitly fits these characteristics is Jade Fox. The poison is a weapon of her bitterness,[7] and quest for vengeance: She poisons the master of Wudang, attempts to poison Jen, and succeeds in killing Mu Bai using a poisoned needle.However, the poison is not only of the physical sort: Jade Fox's tutelage of Jen has left Jen spiritually poisoned, which can be seen in the lying, stealing and betrayal Jen commits. Even though she is the one who initially trained Jen, Jen is never seen to use poison herself. This indicates that there is hope yet to reform her and integrate her into society. In further play on this theme by the director, Jade Fox, as she dies, refers to the poison from a young child, \"the deceit of an eight-year-old girl,\" obviously referring to what she considers her own spiritual poisoning by her young apprentice Jen. Li Mu Bai himself warns that without guidance, Jen could become a \"poison dragon.\"","Plot":"The film is set in the Qing Dynasty during the 43rd year (1779) of the reign of the Qianlong Emperor. Li Mu Bai (Chow Yun-fat) is an accomplished Wudang swordsman. Long ago, his master was murdered by Jade Fox (Cheng Pei-pei), a woman who sought to learn Wudang skills. Mu Bai is also a good friend of Yu Shu Lien (Michelle Yeoh), a female warrior. Mu Bai and Shu Lien have developed feelings for each other, but they have never acknowledged or acted on them due to Yu's arranged marriage with Meng Sizhao (Donnie Yen). Mu Bai, intending to give up his warrior life, asks Shu Lien to transport his sword, also referred to as the Green Destiny, to the city of Beijing, as a gift for their friend Sir Te (Sihung Lung). At Sir Te's estate, Shu Lien meets Jen (Zhang Ziyi), the daughter of Governor Yu (Li Fazeng), a visiting Manchu aristocrat. Jen, destined for an arranged marriage and yearning for adventure, seems envious of Shu Lien's warrior lifestyle.One evening, a masked thief sneaks into Sir Te's estate and steals the sword. Mu Bai and Shu Lien trace the theft to Governor Yu's compound and learn that Jade Fox has been posing as Jen's governess for many years. Mu Bai makes the acquaintance of Inspector Tsai (Wang Deming), a police investigator from the provinces, and his daughter May (Li Li), who have come to Peking in pursuit of Fox. Fox challenges the pair and Sir Te's servant Master Bo (Gao Xi'an) to a showdown that night. Following a protracted battle, the group is on the verge of defeat when Mu Bai arrives and outmaneuvers Fox. Before Mu Bai can kill Fox, the masked thief reappears and partners with Fox to fight. Fox resumes the fight and kills Tsai before fleeing with the thief (who is revealed to be Fox's protégé, Jen). After seeing Jen fight Mu Bai, Fox realizes Jen had been secretly studying the Wudang manual and has surpassed her in combative skills.At night, a desert bandit named Lo (Chang Chen) breaks into Jen's bedroom and asks her to leave with him. A flashback reveals that in the past, when Governor Yu and his family were traveling in the western deserts, Lo and his bandits had raided Jen's caravan and Lo had stolen her comb. She chased after him, following him to his desert cave seemingly in a quest to get her comb back. However, the pair soon fell passionately in love. Lo eventually convinced Jen to return to her family, though not before telling her a legend of a man who jumped off a cliff to make his wishes come true. Because the man's heart was pure, he did not die. Lo came to Peking to persuade Jen not to go through with her arranged marriage. However, Jen refuses to leave with him. Later, Lo interrupts Jen's wedding procession, begging her to come away with him. Nearby, Shu Lien and Mu Bai convince Lo to wait for Jen at Mount Wudang, where he will be safe from Jen's family, who are furious with him. Jen runs away from her husband on the wedding night before the marriage could be consummated. Disguised in male clothing, she is accosted at an inn by a large group of warriors; armed with the Green Destiny and her own superior combat skills, she emerges victorious.Jen visits Shu Lien, who tells her that Lo is waiting for her at Mount Wudang. After an angry dispute, the two women engage in a duel. Although Shu Lien is the superior fighter, Jen, wielding the Green Destiny, destroys each weapon that Shu Lien wields, until Jen loses to a broken sword held at her neck. When Shu Lien shows mercy and lowers the sword, Jen injures Shu Lien's arm. Mu Bai arrives and pursues Jen into a bamboo forest. Following a duel where Mu Bai regains possession of the Green Destiny, he decides to throw the sword over a waterfall. In pursuit, Jen dives into an adjoining river to retrieve the sword and is then rescued by Fox. Fox puts Jen into a drugged sleep and places her in a cavern; Mu Bai and Shu Lien discover her there. Fox suddenly reappears and attacks the others with poisoned darts. Mu Bai blocks the needles with his sword and avenges his master's death by mortally wounding Fox, only to realize that one of the darts hit him in the neck. Fox dies, confessing that her goal had been to kill Jen because she was furious that Jen had hid the secrets of Wudang's far superior fighting techniques from her.As Jen exits to gather up an antidote for the poisoned dart, Mu Bai prepares to die. With his last breaths, he finally confesses his romantic affections for Shu Lien. He dies in her arms as Jen returns, too late to save him. The Green Destiny is returned to Sir Te. Jen later goes to Mount Wudang and spends one last night with Lo. The next morning, Lo finds Jen standing on a balcony overlooking the edge of the mountain. In an echo of the legend that they spoke about in the desert, she asks him to make a wish. He complies and wishes for them to be together again; back in the desert. Jen then suddenly leaps over the side of the mountain.","language":"Standard Mandarin[3]","Reception":"Crouching Tiger, Hidden Dragon was very well received in the Western world, receiving numerous awards. The review aggregator Rotten Tomatoes reported that 97% of critics gave the film positive reviews based on 150 reviews. The site's consensus states: \"The movie that catapulted Ang Lee into the ranks of upper echelon Hollywood filmmakers, Crouching Tiger, Hidden Dragon features a deft mix of amazing martial arts battles, beautiful scenery, and tasteful drama.\"[15] Metacritic reported the film had an average score of 93 out of 100, based on 31 reviews.[16]Some Chinese-speaking viewers were bothered by the accents of the leading actors. Neither Chow (a native Cantonese speaker) nor Yeoh (who was born and raised in Malaysia) speaks Mandarin as a mother tongue. All four main actors spoke with different accents: Chow speaks with a Cantonese accent;[17] Yeoh with a Malaysian accent; Chang Chen a Taiwanese accent; and Zhang Ziyi a Beijing accent. Yeoh responded to this complaint in a December 28, 2000, interview with Cinescape. She argued that \"My character lived outside of Beijing, and so I didn't have to do the Beijing accent.\" When the interviewer, Craig Reid, remarked that \"My mother-in-law has this strange Sichuan-Mandarin accent that's hard for me to understand.\", Yeoh responded: \"Yes, provinces all have their very own strong accents. When we first started the movie, Cheng Pei Pei was going to have her accent, and Chang Zhen was going to have his accent, and this person would have that accent. And in the end nobody could understand what they were saying. Forget about us, even the crew from Beijing thought this was all weird.\"[18]The film led to a boost in popularity of Chinese wuxia films in the western world, where they were previously little known, and led to films such as House of Flying Daggers and Hero marketed towards western audiences. The film also provided the breakthrough role for Zhang Ziyi's career, who noted that:Because of movies like Crouching Tiger, Hidden Dragon, and Hero and Memoirs of a Geisha, a lot of people in the United States have become interested not only in me but in Chinese and Asian actors in general. Because of these movies, maybe there will be more opportunities for Asian actors.\"The character of Lo, or \"Dark Cloud\" the desert bandit, influenced the development of the protagonist of the Prince of Persia series of video games.[19]The film is ranked at No. 497 on Empire magazine's 2008 list of the 500 greatest movies of all time[20] and at No. 66 in the magazine's 100 Best Films of World Cinema, published in 2010.[21]Wu & Chan (2007)[22] look at Crouching Tiger, Hidden Dragon as somewhat of an example of “counter-flow”, a film that has challenged Hollywood’s grip on the film market. They argue that as a product of globalization, the movie did not demonstrate a one-way flow based on Western Ideology, but was multi-directional with the ability for local resources to influence the West and gain economic capital.[22] Despite its international success however and perceived ability to change the flow from East to West, there were still instances of Western adaptation for the movie, such as putting more emphasis on female characters in order to greater execute a balance between gender roles in the East and West.[22] The script of the film was written between Taiwan and Hollywood and in translating the film to English, many cultural references were lost which proved difficult in maintaining the cultural authenticity of the film while still reaching out to the West.[22] The thematic conflict throughout the movie between societal roles and personal desires attribute to the international reception of the film, which resonates with both the Eastern and Western audiences.[22] Additionally, international and western networks were used in the production and promotion of the film, which were needed to conceive its global distribution.[22] Additional marketing strategies were needed for the film in order to attract the Western audience who were unfamiliar with the cultural products of the East.[22]The film premiered in cinemas on December 8, 2000, in limited release within the US. During its opening weekend, the film opened in 15th place, grossing $663,205 in business, showing at 16 locations.[3] On January 12, 2001, Crouching Tiger, Hidden Dragon premiered in cinemas in wide release throughout the US grossing $8,647,295 in business, ranking in 6th place. The film Save the Last Dance came in 1st place during that weekend grossing $23,444,930.[23] The film's revenue dropped by almost 30% in its second week of release, earning $6,080,357. For that particular weekend, the film fell to 8th place screening in 837 theaters. Save the Last Dance remained unchanged in first place grossing $15,366,047 in box office revenue.[3] During its final week in release, Crouching Tiger, Hidden Dragon opened in a distant 50th place with $37,233 in revenue.[24] The film went on to top out domestically at $128,078,872 in total ticket sales through a 31-week theatrical run. Internationally, the film took in an additional $85,446,864 in box office business for a combined worldwide total of $213,525,736.[3] For 2000 as a whole, the film would cumulatively rank at a worldwide box office performance position of 19.[25]Gathering widespread critical acclaim at the Toronto and New York film festivals, the film also became a favorite when Academy Awards nominations were announced in 2001. The film was however screened out of competition at the 2000 Cannes Film Festival.[26]","crouching_tiger,_hidden_dragon":"Theatrical release poster","box_office":"$213.5 million[3]","Cultural references":"The theme of Janet Jackson's song \"China Love\" was related to the film by MTV News, in which Jackson sings of the daughter of an emperor in love with a warrior, unable to sustain relations when forced to marry into royalty.[46]The names of the pterosaur genus Kryptodrakon and the ceratopsian genus Yinlong (both meaning hidden dragon) allude to the film.[47][48]","cinematography":"Peter Pau","Marketing":"The film was adapted into a video game, a comics series, and a 34-episode Taiwanese television series based on the original novel. The latter was released in 2004 as New Crouching Tiger, Hidden Dragon for US and Canadian release.","directed_by":"Ang Lee","production_companies":"Asian Union Film & Entertainment China Film Co-Productions Corporation Columbia Pictures Film Production Asia Edko Films Good Machine International Zoom Hunt Productions","release_dates":"6 July 2000 (2000-07-06) (Hong Kong)|7 July 2000 (2000-07-07) (Taiwan)|8 December 2000 (2000-12-08) (United States)|||","Production":"The film was originally written as a novel series by Wang Dulu starting in the late 1930s. The film is adapted from the storyline of the fourth book in the series, Crouching Tiger, Hidden Dragon.Although its Academy Award was presented to Taiwan, Crouching Tiger, Hidden Dragon was in fact an international co-production between companies in four regions: the Chinese company China Film Co-Production Corporation; the American companies Columbia Pictures Film Production Asia, Sony Pictures Classics and Good Machine; the Hong Kong company EDKO Film; and the Taiwanese Zoom Hunt International Productions Company, Ltd; as well as the unspecified United China Vision, and Asia Union Film & Entertainment Ltd., created solely for this film.[8][9]The film was made in Beijing, with location shooting in the Anhui, Hebei, Jiangsu and Xinjiang provinces of China.[10] The first phase of shooting was in the Gobi Desert where it would consistently rain. Director Ang Lee noted that \"I didn't take one break in eight months, not even for half a day. I was miserable -- I just didn't have the extra energy to be happy. Near the end, I could hardly breathe. I thought I was about to have a stroke.\"[11] The stunt work was mostly performed by the actors themselves and Ang Lee stated in an interview that computers were used \"only to remove the safety wires that held the actors.\" \"Most of the time you can see their faces,\" he added, \"That's really them in the trees.\"[12]Another compounding issue was the difference between accents of the four lead actors: Chow Yun-fat is from Hong Kong and speaks Cantonese natively, and Michelle Yeoh is from Malaysia and speaks English. Only Zhang Ziyi spoke with a native Mandarin accent that Ang Lee wanted.[11] Chow Yun Fat said that on \"the first day [of shooting] I had to do 28 takes just because of the language. That's never happened before in my life.\"[11]Because the film specifically targeted Western audiences rather than the domestic audiences who were already used to Wuxia films, English subtitles were needed. Ang Lee, who was educated in the West, personally edited the subtitles to ensure they were satisfactory for Western audiences.The score was composed by Tan Dun, originally performed by Shanghai Symphony Orchestra, Shanghai National Orchestra, and Shanghai Percussion Ensemble. It also features many solo passages for cello played by Yo-Yo Ma. The \"last track\" (A Love Before Time) features Coco Lee, who later performed it at the Academy Awards. The music for the entire film was produced in two weeks.[13]","produced_by":"Bill Kong|Hsu Li-Kong|Ang Lee|","starring":"Chow Yun-fat|Michelle Yeoh|Zhang Ziyi|Chang Chen|","running_time":"120 minutes[1]","Sequel":"A sequel to the film, Crouching Tiger, Hidden Dragon: Sword of Destiny, was released in 2016. It was directed by Yuen Woo-ping, who was the action choreographer for the first film. It is a co-production between Pegasus Media, China Film Group Corporation, and the Weinstein Company.[42] Unlike the original film, the sequel was filmed in English for international release and dubbed to Mandarin for Chinese releases.Sword of Destiny is based on the book Iron Knight, Silver Vase, the next (and last) novel in the Crane-Iron Pentalogy. It features a mostly new cast, headed by Donnie Yen. Michelle Yeoh reprised her role from the original.[43] Zhang Ziyi was also approached to appear in Sword of Destiny but refused, stating that she would only appear in a sequel if Ang Lee were directing it.[44]In the United States, the sequel was for the most part not shown in theaters, instead being distributed via the video streaming service Netflix.[45]","music_by":"Tan Dun","edited_by":"Tim Squyres","budget":"$17 million"}