{"arrebato":"Spanish film poster","directed_by":"Iván Zulueta","country":"Spain","release_dates":"9 June 1980 (Spain)","Plot":"José Sirgado (Eusebio Poncela) is a frustrated horror film director and heroin addict in a tumultuous relationship with Ana (Celicia Roth). The cousin of his ex-girlfriend Marta, Pedro (Will More), sends him a video tape, an audio cassette, and the key to his apartment despite the fact that the two have only met twice; once when José came with Marta to visit the family and Pedro asked for his help in controlling time in his films, and a second time when José returns with Ana to give Pedro a device for his camera that can help him in achieving this goal. Pedro describes his life after the gift on the cassette as José watches his film at the same time, explaining that one night after falling asleep he discovered that his camera turned on by itself and filmed him. After developing the film, he discovers a red frame in which the camera has lost the image of his sleeping. Curious, Pedro allows the camera to film him multiple times as he sleeps, only to discover that the red still frames are growing in number. Unsure of what the frames mean, he asks his cousin Marta to watch him as he sleeps. As she watches one of his films, the camera moves on its own to face Marta, who disappears. When he only has one more frame left before the entire film becomes red, Pedro sends the film, his audio instructions, and the key to José, instructing him to come to his apartment and develop the final film. José complies, finding the apartment empty, and discovers the film to be entirely red except for one frame of Pedro's face. The image begins to move, with Pedro gesturing towards the bed with a subtle smile, implying that José should also let the camera film him as he sleeps; the image becomes blurred and then changes into José's own face, which makes a similar gesture. The final scene of the film finds José getting into Pedro's bed to experience the same \"rapture\" as his friend.[1]","produced_by":"Nicolás Astiarraga","starring":"Eusebio Poncela Cecilia Roth Will More Marta Fernández Muro Carmen Giralt Helena Fernán-Gómez","running_time":"105 minutes","language":"Spanish","music_by":"Negativo Iván Zulueta","edited_by":"José Luis Peláez José Pérez Luna María Elena Sáinz de Rozas","cinematography":"Ángel Luis Fernández"}