{"based_on":"the poem The City in the Sea by Edgar Allan Poe","country":"United Kingdom USA","distributed_by":"American International Pictures (US) Anglo-Amalgamated (UK)","Plot":"Around the turn of the century, American mining engineer Ben Harris is working on the Cornish coast in England when he finds a body washed up on the beach.Ben makes inquiries at the nearby hotel. While talking to the hotelier’s daughter, fellow American Jill Tregellis, and an eccentric artist, Harold Tufnell-Jones, a mysterious intruder appears but disappears.Later that night Jill is kidnapped by gill men. Ben, Harold and Harold's goose follow the trail through a secret door into the caves under the house where they are sucked into a pool.They emerge in a cavernous city on the ocean floor. The city was built by a race of ancients who survive only as a breed of gill men. The city is now inhabited by a group of smugglers led by the cruel and tyrannical Captain who hid down there in 1803 and due to the strange mixture of oxygen have not aged in over a century. However, the volcano that powers the city has become unstable. The Captain now imprisons them until Ben can come up with a means of maintaining it.","language":"English","Reception":"The film was released in New York on a double bill with Beach Blanket Bingo. New York Times thought it was the better of the two movies, calling it \"a briny safari\".[6]","city_under_the_sea":"Film poster by Reynold Brown","cinematography":"Stephen Dade","production_company":"Bruton Film","directed_by":"Jacques Tourneur","release_dates":"June 1965 (1965-06)|||||","Production":"Shooting took place in the United Kingdom. Charles Bennett says he wrote a good script and AIP wanted him to come to Britain to work on the script but would not pay his way. The script was rewritten in Britain by Louis M Heyward. Bennett hated the changes and called the resulting film \"the worst thing I was ever involved in.\"[3]According to Susan Hart, Charles Bennett's original script was good but was heavily rewritten. She also says there was tension between the producers, Dan Haller and his British counterpart George Willoughby.[4]Louis M. Heyward confirms this tension and admits to rewriting the script to add humour; in particular, he says he added the comic chicken and introduced the character played by David Tomlinson. Heyward says that Willoughby quit after these changes.[5]","produced_by":"Daniel Haller executive Nat Cohen uncredited James H. Nicholson Samuel Z. Arkoff Nat Cohen","starring":"Vincent Price Tab Hunter Susan Hart David Tomlinson John Le Mesurier","running_time":"85 min.","music_by":"Stanley Black","written_by":"Charles Bennett Louis M. Heyward David Whittaker (additional dialogue)"}