{"Cast":"Rest of cast:","country":"United States","distributed_by":"United Artists","Critical response":"The New York Times, in its May 1950 review, described it as a \"fairly obvious and plodding recital, involving crime, passion, stolen iridium, gangland beatings and one man's innocent bewilderment upon being caught up in a web of circumstance that marks him for death\". O'Brien's performance had a \"good deal of drive\", while Britton adds a \"pleasant touch of blonde attractiveness\".[4]In 1981 Foster Hirsch carried on a trend of more positive reviews, calling Bigelow's search for his own killer noir irony at its blackest. He wrote, \"One of the film's many ironies is that his last desperate search involves him in his life more forcefully than he has ever been before... Tracking down his killer just before he dies — discovering the reason for his death — turns out to be the triumph of his life.\"[5] Critic A. K. Rode notes Rudolph Maté's technical background, writing,D.O.A. reflects the photographic roots of director Rudolph Maté. He compiled an impressive resume as a cinematographer in Hollywood from 1935 (Dante's Inferno, Stella Dallas, The Adventures of Marco Polo, Foreign Correspondent, Pride of the Yankees, and Gilda, among others) until turning to directing in 1947. The lighting, locations, and atmosphere of brooding darkness were captured expertly by Mate and director of photography Ernest Lazlo.[6]Michael Sragow, in a review of a DVD release of the film, characterized it as a \"high-concept movie before its time.\"[7]In 2004, D.O.A. was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\"","screenplay_by":"Russell Rouse|Clarence Greene|","story_by":"Russell Rouse|Clarence Greene|","Plot":"The film begins with what a BBC reviewer called \"perhaps one of cinema's most innovative opening sequences.\"[3] The scene is a long, behind-the-back tracking sequence featuring Frank Bigelow (Edmond O'Brien) walking through the hallway of a police station to report his own murder. Oddly, the police almost seem to have been expecting him and already know who he is.A flashback begins with Bigelow in his hometown of Banning, California, where he is an accountant and notary public. He decides to take a one-week vacation in San Francisco, but this does not sit well with Paula Gibson (Pamela Britton), his confidential secretary and girlfriend, as he does not want her to accompany him.Bigelow accompanies a group from a sales convention on a night on the town. At a \"jive\" nightclub called \"The Fisherman,\" unnoticed by Bigelow, a stranger swaps his drink for another. The nightclub scene includes one of the earliest depictions of the Beat subculture. The next morning, Bigelow feels ill. He visits a doctor's office, where tests reveal he swallowed a \"luminous toxin\" for which there is no antidote. A second opinion confirms the grim diagnosis, and the other doctor implies that the poisoning must have been deliberate. Bigelow remembers his drink tasted strange.With a few days to live at most, Bigelow sets out to untangle the events behind his impending death, interrupted occasionally by phone calls from Paula. She provides the first clue: a man named Eugene Phillips, who had been urgently trying to contact Bigelow for the last few days, had suddenly died. Bigelow travels to Phillips' import-export company in Los Angeles, first meeting Miss Foster (Beverly Garland) (whose on-screen credit reads \"Beverly Campbell\"), the secretary, and then Mr. Halliday (William Ching), the company's comptroller, who tells him Eugene Phillips committed suicide by jumping from his office a day earlier. From there, the trail leads to Phillips' widow (Lynn Baggett) and brother Stanley (Henry Hart).The key to the mystery is a bill of sale for what turns out to be stolen iridium. Bigelow had notarized the document for Eugene Phillips six months earlier on behalf of Phillips' business associate. He connects Phillips' mistress, Marla Rakubian (Laurette Luez), to gangsters led by Majak (Luther Adler). They capture Bigelow. Since Bigelow has learned too much, Majak orders his psychotic henchman Chester (Neville Brand) to kill him. However, Bigelow manages to escape.Bigelow thinks Stanley and Miss Foster are his killers, but when he confronts them he finds Stanley has been poisoned too—after having dinner with Mrs. Phillips. He directs them to call an ambulance and tells them what poison has been ingested so that, in Stanley's case at least, prompt treatment may save his life. Stanley tells Bigelow he found evidence that Halliday and Mrs. Phillips were having an affair. Bigelow realizes that the theft was merely a diversion. Eugene discovered the affair and Halliday killed him.Halliday and Mrs. Phillips used the investigation of the iridium as a cover for their crime, making it seem that Eugene Phillips had killed himself out of shame. However, when they discovered that there was evidence of his innocence in the notarized bill of sale, Halliday murdered anyone who had knowledge of the bill of sale. Bigelow tracks Halliday down and shoots him to death in an exchange of gunfire.The flashback comes to an end. Bigelow finishes telling his story at the police station and dies, his last word being \"Paula.\" The police detective taking down the report instructs that his file be marked \"D.O.A.\"","language":"English","cinematography":"Ernest Laszlo","production_company":"Cardinal Pictures","directed_by":"Rudolph Maté","Remakes":"D.O.A. was dramatized as an hour-long radio play on the June 21, 1951, broadcast of Screen Director's Playhouse, starring Edmond O'Brien in his original role.The film was remade in Australia in 1969 as Color Me Dead, directed by Eddie Davis.[10] In 1988 it was filmed again as D.O.A., directed by Annabel Jankel and Rocky Morton, with Dennis Quaid as the protagonist.[1]In 2011, the Overtime Theater staged a world-premiere musical based on the classic film noir. D.O.A. a Noir Musical was written and adapted by Jon Gillespie and Matthew Byron Cassi, directed by Cassi, with original jazz and blues music composed by Jaime Ramirez. The new musical played to sold-out audiences during its five-week run. Recipient of an ATAC Globe Award in 2012 for \"Best Adapted Script\".","d.o.a.":"Theatrical release poster","release_dates":"April 30, 1950 (1950-04-30)|||||","Production":"The shot of Edmond O'Brien running down Market Street (between 4th and 6th Streets) in San Francisco was a \"stolen shot,\" taken without city permits, with some pedestrians visibly confused as O'Brien bumps into them. D.O.A. producer Harry Popkin owned the Million Dollar Theater at the southwest corner of Broadway and Third Street in downtown Los Angeles, directly across the street from the Bradbury Building at 304 South Broadway, where O'Brien's character confronted his murderer. Director Rudolph Maté liberally used Broadway and the Bradbury Building during location shooting and included the Million Dollar Theater's blazing marquee in the background. The theater would later serve the same function when Ridley Scott filmed Blade Runner at the Bradbury Building.After \"The End\" and before the listing of the cast, a credit states the medical aspects of this film are based on scientific fact, and that \"luminous toxin is a descriptive term for an actual poison.\"The bop jazz band playing at the Fisherman's Club while O'Brien's glass is being spiked was filmed on a Los Angeles soundstage after principal photography was completed. According to Jim Dawson in his 1995 book Nervous Man Nervous: Big Jay McNeely and the Rise of the Honking Tenor Sax, the sweating tenor saxophone player was James Streeter, also known as James Von Streeter. Other band members were Shifty Henry (bass), Al \"Cake\" Wichard (drums), Ray LaRue (piano), and Teddy Buckner (trumpet). However, rather than use the live performance, the music director went back and rerecorded the soundtrack with a big band, not a quintet as seen in the film, led by saxophonist Maxwell Davis.[8] Film score was composed by Dimitri Tiomkin.[9]","produced_by":"Leo C. Popkin","starring":"Edmond O'Brien|Pamela Britton|Luther Adler|Beverly Campbell|Neville Brand|Lynn Baggett|William Ching|Henry Hart|Laurette Luez|","running_time":"83 minutes","music_by":"Dimitri Tiomkin","edited_by":"Arthur H. Nadel"}