{"country":"United States","distributed_by":"Walt Disney Studios Motion Pictures","Plot":"African Cats, referred to as a \"true life adventure,\"[10] tells the true story of two animal families living in the wild by using real-life footage.[11] The film focuses on a young lion cub named Mara raised by her mother Layla, a mother cheetah named Sita who is raising five newborns, and Fang, the leader of Mara and Layla′s pride, defending his family from a banished lion named Kali. [12][13] With so many species competing for space and food in the savanna, the animals must figure out what′s the best way to survive.The film begins by introducing Sita, a cheetah who lives in the vast plains of the Maasai Mara National Reserve, in Kenya, and has just given birth to five cubs to take care of. Then we see Mara, a six-month-old lion cub, with her mother Layla, who both belong to the River pride, which lives in the south of the park. The pride′s leader is named Fang, an old male lion, who has a distinctive broken tooth because of an earlier fight. In the north of the Maasai Mara, Sita and her cubs coexist with another lion pride led by a large male named Kali, who wishes to expand his pride and territory by taking over Fang′s southern pride and territory, which however he cannot reach as the Pride Lands are divided by the crocodile infested river.Sita′s cubs are playing while Kali and one of his four sons are on patrol. Sita, seeing them as a serious danger to her cubs, goads them so as to lure them away. However, after the confrontation, the cubs have scattered. Sita desperately calls for them. As it gets darker, hyenas are seen and heard. In the morning, three of the five cubs return to Sita. Although she continues to call for the rest of them, it′s clear that they have been killed by hyenas.Layla was injured by a zebra′s kick while hunting. As the wildebeest begin to migrate to greener pastures, so does the River pride. However, due to her injury and old age, Layla has trouble keeping up. Mara stays alongside her mother and tries to help on her way. Soon, they begin to lose track of the pride. Knowing that Mara needs her family for her survival, Layla forces through her injury, and they soon find themselves within the River pride once more.As time passes, Sita′s cubs have thrived, and begin to show more of their cheetah nature. One day, a gang of three adult cheetah brothers roaming about zone in on Sita. Again, Sita finds herself having to divert attention from rivals so that they don′t find her cubs. However, being fellow cheetahs, they don′t tire as easily as lions do; and soon, the brothers separate Sita from her cubs. As they circle them, the cubs stand their ground and hiss at the bullies, meaning they have inherited their mother′s prowess and bravery. Before the cheetah brothers can do anything, a passing elephant chases them away – meaning that in the savanna, even bullies get bullied.Some time later, the river has lessened. Kali and his largest son take advantage of it so they can cross and begin their assault on the River pride. They head towards the southern territory. Fang, upon seeing them approaching, runs for his life, but Layla doesn′t back away – knowing that Mara could be killed should the assault succeed, she fearlessly attacks the rivals. Soon, the other lionesses, inspired by Layla′s courage, join in the fight. Kali and his son are defeated, and return to the northern territory empty-handed. Victory completed, Fang returns, and life returns to usual for the pride as well. Meanwhile, hyenas approach Sita and her cubs, but the brave mother cheetah, having already lost two cubs to them, doesn′t back away; sure enough, she attacks them fearlessly, not letting them anywhere near her cubs. Finally, the hyenas give up the fight and leave – Sita′s bravery has kept the remaining cubs alive and free from danger.Layla was injured ever further during the fight. Seeing that she might not make it, on a rainy day – which the lions take advantage of to bond with each other –, for Mara′s sake, she goes to her sister Malayka – who has cubs of her own – and reconnects with her so as to maintain a spot in the pride for Mara. Once she sees that Mara is accepted by Malayka, Layla slips away from the pride to find a nice quiet place to die.As time goes by, Kali reunites with his four sons. Although they have shown signs of betrayal with ideas of dethroning him, Kali is still strong, and shows them that he's the boss and that only he will wear the crown. Together, they are the most powerful force in the land. They return for another assault. Upon seeing them, Fang runs, never to be seen or heard from again – if he is to ever return again, he′ll be shown no mercy.Kali takes over the pride and exiles Fang′s cubs, including Mara – now a young adult. Her male cousins are seen as the number one threat to Kali and his sons, so they hunt them down. Seeing that they can no longer stay within their pride, Fang′s male cubs have no choice but to cross the river, even though its level has grown and it′s infested with crocodiles. As they get near the northern bank, one of them is nearly caught in the jaws of a crocodile; nonetheless, they reach land unscathed. The lionesses refuse to admit Kali as their leader, the wound of losing their cubs still far too fresh in their minds.Mara, banished from her pride, tries to live on her own and fend for herself. However, she was banished before she was taught to hunt, and finds her first attempts at catching meals on her own, even small warthogs and especially big rhinos and buffaloes, humiliatingly unsuccessful. She learns that there are benefits in belonging to a pride.Soon the wildebeest return, and the lionesses begin to hunt for their new cubs – Kali′s offspring, having made peace with him and his sons. Mara successfully hunts and feasts. Soon after, she proves herself to the pride, and is at last welcomed back – Layla′s sacrifice for raising her cub was not in vain.Sita′s cubs are now young adults, and they′re thriving. They hone their hunting skills, they practice on a serval and a jackal, and even get to cross the river. Afterwards, they encounter hyenas then Kali′s pride, and learn to stand up to hyenas like a true brave cheetah does, and to avoid and outrun lions (instead of hunting them!). Finally, they successfully hunt an antelope for food. Sita, seeing that her cubs are now ready to forge their own path, leaves them and returns to the solitary life of a cheetah.At the end of the film, the narrator (Samuel L. Jackson in the US version, Patrick Stewart in the UK version) shows Mara and Sita′s cubs as the finest examples of a mother′s love.During the credits, it is shown that Sita has become one of the most successful cheetah mothers to roam the plains, that her cubs went their separate ways, that Mara has been accepted by her pride and is now ready for motherhood herself, that Kali still reigns supreme on both sides of the river, and that the filmmakers are still looking for Fang.","language":"English","african_cats":"Theatrical release poster","box_office":"$30.9 million[1]","production_company":"Disneynature","Marketing":"A trailer for the film has appeared in several movies. Some prints of the movie contain the short \"Mordecai and Rigby: Ringtoneers\". The first trailer aired on Beauty and the Beast: Diamond Edition.","directed_by":"Alastair Fothergill Keith Scholey","narrated_by":"Samuel L. Jackson","Music":"\"The World I Knew\" is a song performed by American recording artist Jordin Sparks, and serves as the theme song of African Cats. The song was written by Ryan Tedder and inflo who also produced the song.[26] It was released by Walt Disney Records as a digital download on April 12, 2011 on iTunes and amazon.com.[27][28] The film also features music by composer Nicholas Hooper; Hooper's soundtrack to the film was chosen as one of the 97 Original Scores eligible for a nomination at the 84th Academy Awards in 2011.[29]Jordin describes the song as being about \"everybody having a path they have to take but when you have that one person next to you or a few friends, if you have your family with you pretty much you can face another day, you can get through any obstacle and you can make it through anything.\"The song's music video was shot in In Burbank, California. The video places Jordin in a surreal world of sparkling butterflies and magic waterfalls, as she sings about eternal love. Viewers also get to see footage from the movie, including scenes involving lion and cheetah cubs.[30] The video premiered on Disney Channel on April 2, 2011 during The Suite Life Movie and played at the end credits of the film.[31]","release_dates":"April 22, 2011 (2011-04-22)|||||","Production":"The families of the animals in African Cats were filmed on the Maasai Mara National Reserve, a major game region in southwestern Kenya.[14] The Maasai Mara is one of the few remaining places in Africa where lions, cheetahs and leopards live in large numbers and in close proximity.[15] To help achieve scientific accuracy, the directors recruited Dr. Sarah Durant of the Zoological Society of London. Durant worked in Tanzania for the last 19 years, studying cheetahs and working toward the conservation of all of Africa’s large carnivores.[14] The film is narrated by Samuel L. Jackson.","Box office":"The film earned $3.3 million on its opening day, which was just short of Earth's $4.1 million start and was the third-highest grossing opening day for a documentary film. However, Friday accounted for 55% of its opening weekend, as it set the record for the highest Friday percentage share for a movie,[23] and grossed just over $6 million for its opening weekend, ranking in sixth place with a per-theater average of $4,921 from 1,220 theaters. The opening was the same as Disneynature's previous film, Oceans. The film's worldwide gross was $30,857,747.[1]","produced_by":"Alix Tidmarsh Keith Scholey","running_time":"89 minutes","music_by":"Nicholas Hooper","Release":"The film was released on April 22, 2011, and as of April 12, 2011, over $1.7 million in tickets were sold in advance of the film's release.[2][6] As of May 2, 2011, ticket sales translated into 50,000 acres of land saved in Kenya.[7][8][9] The full-length trailer for African Cats was originally released on December 7, 2010.[16] The film was released in France on February 1, 2012, with the title of \"Félins\" (felines). The film was released on April 27, 2012 in the United Kingdom with narration by Patrick Stewart The premiere was attended by several important guests of honour, including Prince William and Catherine, Duchess of Cambridge and Lucy Rosen.[17]The film has received generally positive reviews from critics. Based on 68 reviews collected by Rotten Tomatoes, the film has an overall approval rating of 71% with an average rating of 6.2/10.[18] Its consensus states \"It isn't quite as majestic as its subjects, but African Cats boasts enough astounding footage -- and a big enough heart -- to keep things entertaining.\" [18] Another review aggretator, Metacritic, calculated an average rating of 63 based on 18 reviews.[19]The film was released as a Blu-ray/DVD combo pack and movie download on October 4, 2011 (the same day as The Lion King Diamond Edition Blu-ray/DVD combo pack). The DVD version of the release includes the \"Disney & Nature\" and \"Save the Savanna\" bonus features, while the Blu-ray version additionally includes the music video for \"The World I Knew\" by Jordin Sparks and a behind-the-scenes extra called \"Filmmaker Annotations.\" The movie download version includes the two bonus features from the DVD, plus three segments from the \"Filmmaker Annotation\" Blu-ray extra.Disneynature will also donate a portion of the home media proceeds earned through October 10, 2011 to the African Wildlife Foundation's \"Save the Savanna\" initiative.[20][21][22]"}