{"country":"United States","distributed_by":"The Cannon Group Universal Studios","screenplay_by":"Christopher Cosby|Mel Friedman|Sheldon Lettich|","story_by":"Sheldon Lettich","Legacy":"Bloodsport was followed by three sequels: Bloodsport II: The Next Kumite (1996), Bloodsport III (1997) and Bloodsport 4: The Dark Kumite (1999). They were released direct-to-video, and Jean-Claude Van Damme did not appear in them.A remake of Bloodsport is planned. Phillip Noyce was attached to direct a screenplay by Robert Mark Kamen. Screen Daily explains, \"The story will follow an American who goes to Brazil to recover from the violence he has experienced in Afghanistan who gets involved in a martial arts contest.\"[14] On July 24, 2013, Relativity Media announced that they will make the reboot with James McTeigue directing and will be shot in Australia and Brazil.[15]An all-female remake of Bloodsport titled Lady Bloodfight (originally Lady Bloodsport) is set to be released in 2016 from producer Bey Logan and directed by Chris Nahon with action choreography by Hung Yan Yan.[16] Originally set to star Jet Tranter and Selina Lo,[17] the film now stars martial artist/stuntwoman Amy Johnston, Kathy Wu, Jet Tranter, Mayling Ng and Jenny Wu. The story follows \"a beautiful but troubled American girl\" named Jane (Johnston) backpacking through Japan who is recruited and trained to fight in a vicious, all-female, underground martial arts tournament known as “The Kumite”. Principal photography began in September 2014 and shot in locations such as China, Hong Kong, and Macau.","Plot":"U.S. Army Captain Frank Dux (pronounced \"Dukes\"), trained from his youth in the ways of Ninjutsu by Senzo Tanaka, honors his mentor by taking the place of Tanaka's deceased son Shingo in the illegal Kumite martial-arts tournament. During his childhood, Dux and a group of friends invaded Tanaka's home to steal a katana, but he was apprehended by Senzo and Shingo while attempting to return the katana to its display rack. Impressed by Dux's honesty and lack of fear, Senzo had him train with Shingo in martial science. Following Shingo's death, Senzo agreed to train Dux as a member of the Tanaka clan. When Dux's superiors learn of his invitation to the Kumite, they refuse to let him go; in return, he goes AWOL, says goodbye to his mentor and leaves for Hong Kong. Two CID officers, Helmer and Rawlins, are summoned to track down and arrest Dux for desertion.After arriving in Hong Kong, Dux befriends American fighter Ray Jackson and Victor Lin, who becomes the manager/liaison for Jackson and Dux. The two Americans and the defending Kumite champion Chong Li—a fighter with a savage streak—all make it through the first day of the Kumite. Dux earns the enmity of Li after breaking his record for the fastest knockout. Dux becomes involved with American journalist Janice Kent, who is attempting to investigate the Kumite, but is shocked by its violence. On the second day of the tournament, Jackson is matched against Li. Although Jackson gains the upper hand, he gloats instead of finishing Li, who violently beats him, putting him in the hospital. Dux vows that he will avenge Jackson. Kent tries to convince Dux to pull out of the tournament, but he refuses.On the last day of the competition, Dux is cornered by Helmer and Rawlins. After defeating the local police, he promises to give himself up once the tournament is over. Dux advances to the tournament final to face Li, who has alienated the audience by killing his previous opponent remorselessly. Dux is a formidable foe, so Li resorts to blinding him with a crushed salt pill. Dux uses his other senses (as Senzo had taught him) to overcome the handicap and force Li to shout \"matté\" (a cry of surrender), becoming the first Western winner of the Kumite. He then returns to the United States with the CID officers.","language":"English","box_office":"$65 million[2]","cinematography":"David Worth","production_company":"Golan-Globus","directed_by":"Newt Arnold","Soundtrack":"Bloodsport's soundtrack score was composed by Paul Hertzog, who also composed another Jean-Claude Van Damme film titled Kickboxer. The soundtrack contains the songs \"Fight to Survive\" and \"On My Own\", both performed by Stan Bush. Bush's songs are replaced on the soundtrack with alternate versions sung by Paul Delph, who was nominated for a Grammy for this work. The film plays the song \"Steal the Night\" by Michael Bishop during a scene where Dux runs from Helmer and Rawlins. The song was not released until the mid-2000s, as a single containing a vocal and instrumental version. On June 26, 2007, Perseverance Records released a limited edition CD of the soundtrack including, for the first time, the original film versions of the Stan Bush songs.","release_dates":"February 26, 1988 (1988-02-26)|||||","Production":"Co writer Sheldon Lettich came up the idea for the film.I had known Frank Dux for a number of months before I came up with the idea for Bloodsport. Frank told me a lot of tall tales, most of which turned out to be bullshit. But his stories about participating in this so-called \"Kumite\" event sounded like a great idea for a movie. There was one guy who he introduced me to, named Richard Bender, who claimed to have actually been at the Kumite event and who swore everything Frank told me was true. A few years later this guy had a falling-out with Frank, and confessed to me that everything he told me about the Kumite was a lie; Frank had coached him in what to say.[7]Producer Mark Di Salle said he was looking for \"a new martial arts star who was a ladies man\", but Van Damme appeals to both genders.[2] The movie is one of the few films featuring scenes filmed inside Kowloon Walled City before its destruction.[8]","produced_by":"Mark DiSalle|Yoram Globus|Menahem Golan|","starring":"Jean-Claude Van Damme|Donald Gibb|Leah Ayres|Norman Burton|Forest Whitaker|Bolo Yeung|","running_time":"92 minutes","bloodsport":"Theatrical release poster","music_by":"Paul Hertzog","edited_by":"Carl Kress","Release":"The Los Angeles Times reports a US box office gross of $11.7 million.[9] The Chicago Tribune said it cost $2 million, made $15 million in the US and Canada, and grossed $50 million elsewhere. It also sold 150,000 videocassette units, making it Cannon's most profitable film of the year.[2]Warner Bros. released the DVD in the US on October 1, 2002.[10]Rotten Tomatoes, a review aggregator, reports that the film received positive reviews from 33% of 18 surveyed critics; the average rating was 4.3/10.[11] Leonard Klady of the Los Angeles Times wrote, \"Hacking through the jungle of cliche and reservoir of bad acting in Bloodsport [...] are some pretty exciting matches.\"[12]Van Damme was nominated for a Golden Raspberry Award for Worst New Star.[13]","budget":"$1.5–2 million[1][2]"}