{"based_on":"Charlie and the Chocolate Factory  by Roald Dahl","country":"United States|United Kingdom[2]|Australia|","distributed_by":"Warner Bros. Pictures","screenplay_by":"John August","Plot":"Charlie Bucket (Freddie Highmore) is a kind and loving boy living in poverty with his parents (Noah Taylor and Helena Bonham Carter) and four bedridden grandparents. They all rely on his father for income, employed at a toothpaste factory, responsible for putting the caps on the tubes. Down the street is Willy Wonka's (Johnny Depp) chocolate factory, which reopened after industrial espionage forced him into seclusion and to sack his employees. Charlie's Grandpa Joe (David Kelly) worked for Wonka before the termination.Wonka announces a contest whereby children that find five Golden Tickets hidden in Wonka bars will be given a tour of the factory and one a chance to be presented with an unknown grand prize. Four tickets are quickly found: the greedy and gluttonous Augustus Gloop (Philip Wiegratz) from Düsseldorf; the spoiled and rotten Veruca Salt (Julia Winter) from Buckinghamshire; the competitive and boastful Violet Beauregarde (AnnaSophia Robb) from Atlanta; and the arrogant and aggressive Mike Teavee (Jordan Fry) from Denver. Charlie hopes to find a ticket but chances are small as money is tight so the best has to be made of his annual birthday present of one Wonka bar and a bar bought by Grandpa Joe's money. All hope is crushed when the last ticket is claimed in Russia. Charlie, on finding some money in the street, just intends to enjoy one chocolate bar when news breaks that the last ticket was fake. Charlie finds the bar he just bought has the last Golden Ticket. Bystanders attempt to separate him from it, only for the shopkeeper (Oscar James) to see that he keeps the ticket and gets back home with it.Grandpa Joe offers to accompany Charlie on the tour, but Charlie explains how he was offered money for the ticket and intends to sell it. Grandpa George (David Morris) reminds Charlie that money is far more common than the tickets, and convinces Charlie to keep it. The visitors find Wonka to be peculiar, lonely and acting odd at the mention of \"parents\". The tour shows how fantastical the factory operates under the efforts of the short humans called Oompa-Loompas. The other four children succumb to temptation, and end up being caught in the factory workings and have to be safely recovered by the Oompa-Loompas, albeit in worse shape than at the start of the tour: Augustus falls into a river of chocolate and has been sucked up by a pipe before being rescued from the fudge processing center; Violet expands into an over-sized blueberry when she tries an experimental piece of chewing gum; Veruca is thrown away as a \"bad nut\" by trained squirrels; and Mike is shrunk down to a few inches in height after being the first person transported by Wonka's new television advertising invention.Charlie is congratulated as the only remaining child and the winner of the grand prize, Wonka's heir to the factory. Unfortunately, Wonka stipulates that Charlie's family has to stay behind ergo Charlie rejects the offer. Charlie learns that Wonka had a troubled past with his father, Wilbur Wonka (Christopher Lee); a dentist. Willy was forbidden from eating candy of any type or quantity and had torture device-like braces affixed to his teeth. But once Willy got a taste, he wanted to become a confectioner, against his father's wishes and he left home to follow his dream. Wonka later returned to find his father and home completely gone. Wonka's candies are selling poorly and he comes to associate his unhappiness with the sorry financial state of his company, so he makes an effort to find Charlie who helps him locate Wilbur. When they visit, it appears that despite his strict avoidance of candy, the dentist has followed Willy's success and they reconcile. Wonka allows Charlie's family to move into the factory while he and Charlie plan new product lines to produce.","language":"English","box_office":"$475 million[4]","cinematography":"Philippe Rousselot","directed_by":"Tim Burton","narrated_by":"Geoffrey Holder","production_companies":"The Zanuck Company Plan B Entertainment Village Roadshow Pictures","release_dates":"July 10, 2005 (2005-07-10) (Grauman's Chinese Theatre)|July 15, 2005 (2005-07-15) (United States)|July 29, 2005 (2005-07-29) (United Kingdom)|||","Production":"Author Roald Dahl disapproved of the 1971 film adaptation and declined the film rights to produce the sequel, Charlie and the Great Glass Elevator.[5] Warner Bros. and Brillstein-Grey Entertainment entered discussions with the Dahl estate in 1991, hoping to purchase the rights to produce another film version of Charlie and the Chocolate Factory. The purchase was finalized in 1998,[6] with Dahl's widow, Felicity (\"Liccy\"), and daughter, Lucy, receiving total artistic control and final privilege on the choices of actors, directors and writers. The Dahl Estate's subsequent protection of the source material was the main reason that Charlie and the Chocolate Factory had languished in development hell since the 1990s.[7][8]Scott Frank was hired to write the screenplay in February 1999, after approaching Warner Bros. for the job.[8] Frank, a recent Oscar nominee for the R-rated crime film Out of Sight, wanted to work on a film that his children could enjoy.[9][10][11] As an enthusiastic fan of the book, he intended to remain more truthful to Dahl's vision than the 1971 film had been.[8] Nicolas Cage was under discussions for Willy Wonka, but lost interest.[5][12] Gary Ross signed to direct in February 2000,[13] which resulted in Frank completing two drafts of the screenplay[11] before leaving with Ross in September 2001.[14] Both Warner Bros. and the Dahl Estate wanted Frank to stay on the project, but he faced scheduling conflicts and contractual obligations with Minority Report (2002) and The Lookout (2007).[11]Rob Minkoff entered negotiations to take the director's position in October 2001,[15] and Gwyn Lurie was hired to start from scratch on a new script in February 2002. Lurie said she would adapt the original book and ignore the 1971 film adaptation. Dahl's estate championed Lurie after being impressed with her work on another Dahl adaptation, a live-action adaptation of The BFG, for Paramount Pictures, which was never made (Paramount distributed the earlier 1971 film version of Charlie, and later sold the rights to WB).[16] In April 2002, Martin Scorsese was involved with the film, albeit briefly, but opted to direct The Aviator instead.[5][12] Warner Bros. president Alan F. Horn wanted Tom Shadyac to direct Jim Carrey as Willy Wonka, believing the duo could make Charlie and the Chocolate Factory relevant to mainstream audiences, but Liccy Dahl opposed this.[7]After receiving enthusiastic approval from the Dahl Estate, Warner Bros. hired Tim Burton to direct in May 2003.[6] Burton compared the project's languishing development to Batman (1989), which he directed, in how there had been varied creative efforts with both films. He said, \"Scott Frank's version was the best, probably the clearest, and the most interesting, but they had abandoned that.\"[17] Liccy Dahl commented that Burton was the first and only director the estate was happy with. He had previously produced another of the author's adaptations with James and the Giant Peach (1996), and, like Roald and Liccy, disliked the 1971 film because it strayed from the book's storyline.[7]\"As a child, Dahl was the author who I connected to the most. He got the idea of writing a mixture of light and darkness, and not speaking down to kids, and the kind of politically incorrect humor that kids get. I've always liked that, and it's shaped everything I've felt that I've done.\"During pre-production Burton visited Dahl's former home in the Buckinghamshire village of Great Missenden. Liccy Dahl remembers Burton entering Dahl's famed writing shed and saying, \"This is the Buckets' house!\" and thinking to herself, \"Thank God, somebody gets it.\" Liccy also showed Burton the original handwritten manuscripts, which Burton discovered were more politically incorrect than the published book. The manuscripts included a child named Herpes after the sexually transmitted disease.[17] Burton immediately thought of Johnny Depp for the role of Willy Wonka, who joined the following August for his fourth collaboration with the director.[18]Lurie's script received a rewrite by Pamela Pettler, who worked with Burton on Corpse Bride, but the director hired Big Fish screenwriter John August in December 2003 to start from scratch.[12] Both August and Burton were fans of the book since their childhoods.[17] August first read Charlie and the Chocolate Factory when he was eight years old, and subsequently sent Dahl a fan letter. He did not see the 1971 film prior to his hiring, which Burton believed would be fundamental in having August stay closer to the book.[19] The writer updated the Mike Teavee character into an obsessive video game player, as compared to the novel, in which he fantasized about violent crime films. The characters Arthur Slugworth and Prodnose were reduced to brief cameo appearances, while Mr. Beauregarde was entirely omitted.[20]Burton and August also worked together in creating Wilbur Wonka, Willy's domineering dentist father. Burton thought the paternal character would help explain Willy Wonka himself and that otherwise he would be \"just a weird guy\".[3] The element of an estranged father-son relationship had previously appeared in Big Fish, similarly directed by Burton and written by August. Warner Bros. and the director held differences over the characterizations of Charlie Bucket and Willy Wonka. The studio wanted to entirely delete Mr. Bucket and make Willy Wonka the idyllic father figure Charlie had longed for his entire life. Burton believed that Wonka would not be a good father, finding the character similar to a recluse.[21] Burton said, \"In some ways, he's more screwed up than the kids.\" Warner Bros. also wanted Charlie to be a whiz kid, but Burton resisted the characterization. He wanted Charlie to be an average child who would be in the background and not get in trouble.[17]Prior to Burton's involvement, Warner Bros. considered or discussed Willy Wonka with Bill Murray, Christopher Walken, Steve Martin, Robin Williams, Nicolas Cage, Jim Carrey, Michael Keaton, Robert De Niro, Brad Pitt, Will Smith, Mike Myers, Ben Stiller, Leslie Nielsen, John Cleese, Eric Idle, Michael Palin, Patrick Stewart, and Adam Sandler.[22][23][24][25][26][27][28][29] Dustin Hoffman and Marilyn Manson reportedly wanted the role as well.[24][30] Pitt's production company, Plan B Entertainment, however, stayed on to co-finance the film with Warner Bros.[7] Coincidentally, Cleese, Idle and Palin (as well as the other three Monty Python members) had all previously expressed interest in playing Wonka in the 1971 film adaptation.[29] Johnny Depp was the only actor Burton considered for the role,[17] although Dwayne Johnson was Burton's second choice in case Depp was unavailable.[31] Depp signed on without reading the script under the intention of going with a completely different approach than what Gene Wilder did in the 1971 film adaptation.[32] Depp said regardless of the original film, Gene Wilder's characterization of Willy Wonka stood out as a unique portrayal.[7]Depp and Burton derived their Willy Wonka from children's television show hosts such as Bob Keeshan (Captain Kangaroo), Fred Rogers, and Al Lewis from The Uncle Al Show, and Depp also took inspiration from various game show hosts.[33] Burton recalled from his childhood that the characters were bizarre but left lasting impressions. He said, \"It was kind of a strange amalgamation of these weird children's TV show hosts.\"[17] Depp based Wonka's look (over-exaggerated bob cut and sunglasses) on Vogue magazine editor Anna Wintour.[34]Comparisons were drawn between Willy Wonka and Michael Jackson. Burton disagreed with the comparisons and said Jackson, unlike Wonka, liked children.[21] Depp said the similarities with Jackson never occurred to him. Instead, he compared Wonka to Howard Hughes in his \"reclusive, germaphobe, controlling\" manner.[33] Burton agreed with the similarity to Hughes. He also compared Wonka to Charles Foster Kane in Citizen Kane as inspiration: \"somebody who was brilliant but then was traumatized and then retreats into their own world\".[17] Depp wanted to sport prosthetic makeup for the part and have a long, elongated nose, but Burton believed it would be too outrageous. During production, Gene Wilder, in an interview with The Daily Telegraph, accused the filmmakers of only remaking the 1971 film for the purpose of money. Depp said he was disappointed by Wilder's comment, and responded that the film was not a remake, but a new adaptation of Dahl's 1964 book.[3]The casting calls for Charlie Bucket, Violet Beauregarde, Veruca Salt, and Mike Teavee took place in the United States and United Kingdom, while Augustus Gloop's casting took place in Germany. Burton said he sought actors \"who had something of the character in them\" and found Mike Teavee the hardest character to cast.[17] Burton was finding trouble casting Charlie, until Depp, who worked with Freddie Highmore on Finding Neverland, suggested Highmore for the part.[5] Highmore had already read the book before, but decided to read it once more prior to auditioning.[35] The actor did not see the original film adaptation and chose not to see it until after Burton's production so his portrayal would not be influenced.[36]Before Adam Godley was officially cast as Mr. Teavee, Dan Castellaneta, Tim Allen, Ed O'Neill, Bob Saget, and Ray Romano were all considered for the role.[22]It has been rumored that Gregory Peck was considered for the role of Grandpa Joe.[37] Other actors that were considered for Grandpa Joe included Richard Attenborough, Kirk Douglas, Albert Finney, Anthony Hopkins, Paul Newman, Max von Sydow, David Warner, Christopher Lloyd and Peter Ustinov.[38]Principal photography for Charlie and the Chocolate Factory started on June 21, 2004[12] at Pinewood Studios in England.[39] Director Tim Burton and composer Danny Elfman found filming somewhat difficult because they were simultaneously working on Corpse Bride.[21] The Wonka Factory exterior was coincidentally constructed on the same backlot Burton had used for Gotham City in Batman (1989).[17] The ceremonial scene required 500 local extras.[7] The Chocolate Room/River setpiece filled Pinewood's 007 Stage. As a consequence of British Equity rules, which state that children can only work four and a half hours a day, filming for Charlie and the Chocolate Factory languished for six months and ended in December 2004.[17]The architecture of the Bucket family home was influenced by Burton's visit to Roald Dahl's writing hut. Like the book, the film has a \"timeless\" setting and is not set in a specific country. \"We've tried not to pinpoint it to any place,\" production designer Alex McDowell explained. \"The cars, in fact, drive down the middle of the road.\"[7] The town, whose design was shaped by the black and white urban photography of Bill Brandt, Pittsburgh and Northern England, is arranged like a medieval village, with Wonka's estate on top and the Bucket shack below.[7] The filmmakers also used fascist architecture for Wonka's factory exterior, and designed most of the sets on 360° sound stages, similar to cycloramas. Burton biographer Mark Salisbury wrote that Charlie and the Chocolate Factory \"melds 1950s and '70s visuals with a futuristic sensibility that seems straight out of a 1960s sense of the future.\"[17] The \"TV Room\" was patterned after photographs from 2001: A Space Odyssey, Danger: Diabolik and THX 1138. Danger Diabolik also served as inspiration for the Nut Room and Inventing Room.[17]Tim Burton avoided using too many digital effects because he wanted the younger actors to feel as if they were working in a realistic environment.[40] As a result, forced perspective techniques, oversized props and scale models were used to avoid computer-generated imagery (CGI).[17] Deep Roy was cast to play the Oompa-Loompas based on his previous collaborations with Burton on Planet of the Apes and Big Fish. The actor was able to play various Oompa-Loompas using split screen photography, digital and front projection effects.[3] \"Tim told me that the Oompa-Loompas were strictly programmed, like robots — all they do is work, work, work,\" Roy commented. \"So when it comes time to dance, they're like a regiment; they do the same steps.\"[41]A practical method was considered for the scene in which Violet Beauregarde turns blue and swells up into a giant 10-foot blueberry. A suit with an air hose was considered at one point for the beginnings of the swelling scene, before the decision was made to do the entire transformation in CGI. The visual effects house Cinesite was recruited for this assignment. In some shots of AnnaSophia Robb's head, a facial prosthetic was worn to give the impression that her cheeks had swelled up as well. Because this decision was made late in the film's production, any traces of Violet's blueberry scene were omitted from trailers or promotional material.Rather than rely on CGI, Burton wanted the 40 squirrels in the Nut Room to be real. The animals were trained every day for 10 weeks before filming commenced. They began their coaching while newborns, fed by bottles to form relationships with human trainers. The squirrels were each taught how to sit upon a little blue bar stool, tap and then open a walnut, and deposit its meat onto a conveyor belt.[7] \"Ultimately, the scene was supplemented by CGI and animatronics,\" Burton said, \"but for the close-ups and the main action, they're the real thing.\"[17] Wonka's Viking boat for the Chocolate River sequence floats down a realistic river filled with 192,000 gallons of faux melted chocolate.[42] \"Having seen the first film, we wanted to make the chocolate river look edible,\" McDowell says. \"In the first film, it's so distasteful.\" The production first considered a CGI river, but Burton was impressed with the artificial substance when he saw how it clung to the boat's oars. Nine shades of chocolate were tested before Burton settled on the proper hue.[7]The original music score was written by Danny Elfman, a frequent collaborator with director Tim Burton. Elfman's score is based around three primary themes: a gentle family theme for the Buckets, generally set in upper woodwinds; a mystical, string-driven waltz for Willy Wonka; and a hyper-upbeat factory theme for full orchestra, Elfman's homemade synthesizer samples and the diminutive chanting voices of the Oompa-Loompas.[43]Elfman also wrote and performed the vocals for four songs, with pitch changes and modulations to represent different singers.[44] The lyrics to the Oompa-Loompa songs are adapted from the original book, and are thus credited to Roald Dahl.[43] Following Burton's suggestion, each song in the score is designed to reflect a different archetype.[44] \"Wonka's Welcome Song\" is a maddeningly cheerful theme park ditty, \"Augustus Gloop\" a Bollywood spectacle (per Deep Roy's suggestion),[41] \"Violet Beauregarde\" is 1970s funk, \"Veruca Salt\" is 1960s bubblegum pop / psychedelic pop, and \"Mike Teavee\" is a tribute to late 1970s hard rock (such as Queen) / early 1980s hair bands.[43][44]The original motion picture soundtrack was released on July 12, 2005 on Warner Bros. Records.","produced_by":"Brad Grey|Richard D. Zanuck|","starring":"Johnny Depp|Freddie Highmore|David Kelly|Helena Bonham Carter|Noah Taylor|Missi Pyle|James Fox|Deep Roy|Christopher Lee|","running_time":"115 minutes[1]","music_by":"Danny Elfman","charlie_and_the_chocolate_factory":"Theatrical release poster","edited_by":"Chris Lebenzon","Release":"Charlie and the Chocolate Factory had its premiere at the Grauman's Chinese Theatre, on July 10, 2005, where money for the Make-a-Wish Foundation was raised.[45] The film was released in the United States on July 15, 2005 in 3,770 theaters[46] (including IMAX theaters).[47]Early in the development of Charlie and the Chocolate Factory in February 2000, Warner Bros. announced their intention of marketing the film[13] with a Broadway theatre musical after release. The studio reiterated their interest in May 2003,[6] however, the idea was postponed by the time filming began in June 2004.[7] The main tie-in for Charlie and the Chocolate Factory focused on The Willy Wonka Candy Company, a division of Nestlé. A small range of Wonka Bars were launched, utilizing their prominence in the film.[48] The release of Charlie and the Chocolate Factory also rekindled public interest in Roald Dahl's 1964 book, where it remained on the New York Times Best Seller list from July 3 to October 23, 2005.[49][50]Charlie and the Chocolate Factory earned $56,178,450 in its opening weekend,[46] the fifth-highest opening weekend gross for 2005 and stayed at #1 for two weeks.[51] The film eventually grossed $206,459,076 in US totals and $268,509,687 in foreign countries, coming to a worldwide total of $474,968,763. It was the fifty-eighth highest grossing film of all time when released,[46] as well as seventh-highest for the US[51] and eighth-highest worldwide for the year of 2005.[52]Charlie and the Chocolate Factory received positive reviews. Rotten Tomatoes gives the film a rating of 83%, based on 221 reviews, with an average rating 7.2/10. The site's consensus reads, \"Closer to the source material than 1971's Willy Wonka & the Chocolate Factory, Charlie and the Chocolate Factory is for people who like their Chocolate visually appealing and dark.\"[53] By comparison, Metacritic calculated an average score of 72 out of 100, based on 40 critics, indicating \"generally favorable reviews\".[54]Owen Gleiberman of Entertainment Weekly praised Charlie and the Chocolate Factory, writing \"Johnny Depp as Willy Wonka may be a stone freak, but he is also one of Burton's classic crackpot conjurers, like Beetlejuice or Ed Wood.\"[55] Roger Ebert gave an overall positive review and enjoyed the film. He was primarily impressed by Tim Burton's direction of the younger cast members, but was disappointed with Depp's performance: \"What was Depp thinking of? In Pirates of the Caribbean he was famously channeling Keith Richards, which may have primed us to look for possible inspirations for this performance.\"[56] Mick LaSalle from the San Francisco Chronicle found Charlie and the Chocolate Factory Burton's \"best work in years. If all the laughs come from Depp, who gives Willy the mannerisms of a classic Hollywood diva, the film's heart comes from Highmore, a gifted young performer whose performance is sincere, deep and unforced in a way that's rare in a child actor.\"[57] Peter Travers wrote in Rolling Stone magazine that \"Depp's deliciously demented take on Willy Wonka demands to be seen. Depp goes deeper to find the bruises on Wonka's secret heart than what Gene Wilder did. Depp and Burton may fly too high on the vapors of pure imagination, but it's hard to not get hooked on something this tasty. And how about that army of Oompa-Loompas, all played by Deep Roy, in musical numbers that appear to have been choreographed by Busby Berkeley on crack.\"[58]Ann Hornaday of The Washington Post criticized Depp's acting. \"The cumulative effect isn't pretty. Nor is it kooky, funny, eccentric or even mildly interesting. Indeed, throughout his fey, simpering performance, Depp seems to be straining so hard for weirdness that the entire enterprise begins to feel like those excruciating occasions when your parents tried to be hip. Aside from Burton's usual eye-popping direction, the film's strenuous efforts at becoming a camp classic eventually begin to wear thin.\"[59]In 2007, Gene Wilder said he chose not to see the film. \"The thing that put me off ... I like Johnny Depp, I like him, as an actor I like him very much ... but when I saw little pieces in the promotion of what he was doing, I said I don't want to see the film, because I don't want to be disappointed in him.\" [60] In 2013, Wilder called the film \"an insult\". He also criticized the choices that Burton made as a director, saying \"I don't care for that director. He's a talented man, but I don't care for him doing stuff like he did.\"[61]Costume designer Gabriella Pescucci received an Academy Award nomination, but lost to Colleen Atwood on Memoirs of a Geisha.[62] Johnny Depp lost the Golden Globe Award for Best Actor in a Musical or Comedy to Joaquin Phoenix in Walk the Line.[63] More nominations followed from the British Academy Film Awards for Visual Effects, Costume Design (Pescucci), Makeup & Hair (Peter Owen and Ivana Primorac) and Production Design (Alex McDowell).[64] Charlie and the Chocolate Factory was also nominated for the Saturn Award for Best Fantasy Film, as well as Performance by a Younger Actor (Freddie Highmore), Music (Danny Elfman) and Costume (Pescucci).[65] Elfman and screenwriter John August were nominated for a Grammy Award with \"Wonka's Welcome Song\".[66]","budget":"$150 million[3]"}