{"country":"United States","distributed_by":"Paramount Pictures","Plot":"Zachary \"Zack\" Mayo (Richard Gere) is preparing to report to Aviation Officer Candidate School. As he is doing so, he has brief flashbacks of his childhood. After the death of his unnamed mother (who committed suicide), an adolescent Zack was sent to live with his only living relative, his father Byron Mayo (Robert Loggia), who is stationed in the Philippines. The elder Mayo, a Chief Petty Officer/ Chief Boatswain's Mate, made no attempt to hide his heavy drinking and hiring of prostitutes from a young Zack. When Zack said he needed help, Byron said he did not ask to get married nor be a father. The flashbacks advance to the present, where Zack has just graduated from college and informs his father he will be going to AOCS. Byron, who hates officers, tells Zack that his dream of becoming an officer is as unrealistic as hoping to become President. Despite his father's discouragement, Zack is determined to go through with his childhood dreams of becoming a Navy pilot and prove to him that he can make it.Upon arrival at the Officer Candidate School, Zack and his fellow AOCs are shocked by the harsh treatment they receive from their head Drill Instructor, Marine Gunnery Sergeant Emil Foley (Louis Gossett, Jr.). Foley makes it clear that the 13-week program is designed to eliminate Officer Candidates who are found to be mentally or physically unfit for commission as an Ensign in the U.S. Navy, which will earn them flight training worth over $1,000,000. Foley warns the male candidates about the \"Puget Sound Debs\"—young women in the area who dream of marrying a Naval Aviator to escape their dull, local lives. Foley claims they scout the regiment for officer candidates, and will feign pregnancy or even stop using birth control to become pregnant to trap the men.Zack becomes friends with fellow candidates Sid Worley (David Keith), Emiliano Della Serra (Tony Plana), Lionel Perryman (Harold Sylvester), and Casey Seeger (Lisa Eilbacher). Zack and Sid meet two local young women – factory workers – at a Navy Ball. Zack begins a romantic relationship with Paula Pokrifki (Debra Winger) and Sid with Lynette Pomeroy (Lisa Blount).Foley rides Zack mercilessly, believing he lacks motivation and is not a team player. When Zack's side business of selling pre-shined shoes and belt buckles is discovered, Foley hazes him for a weekend in an attempt to make him DOR (\"Drop on Request\", a Navy term for requesting termination of training[4]), but Zack refuses. Foley states Mayo will be declared unfit, which frightens Zack into admitting he has no options in civilian life. Satisfied that Zack has come to a crucial self-realization, Foley punishes Mayo by making him clean all the urinals, but does not recommend attrition. Henceforth, Zack starts behaving like a team player.Zack and Paula spend the next weekend together and she takes him home for dinner to meet her family. Her stepfather behaves strangely, and when Zack asks why, she shows him an old picture of her real father. He was an AOC who had an affair with her mother, but deserted her following his commissioning and refused to marry her when she became pregnant with Paula.Zack is close to breaking the record time for negotiating the obstacle course, but Seeger, the female candidate, faces disqualification when she cannot negotiate the 12-foot-high wall (3.7 m). Zack abandons his attempt to break the course record in order to coach Seeger over the wall, and she makes it.Zack attends dinner with Sid and his parents and learns that Sid has a long-time girlfriend back home. Sid plans to marry her after he receives his commission. Meanwhile, Lynette has been dropping hints to Sid that she may be pregnant. Sid agonizes over this possibility, especially when Lynette tells him she will not have an abortion. After having a severe anxiety attack during a high-altitude simulation in a pressure chamber, Sid realizes he joined the officer training program out of a sense of obligation to his family, and he DORs. He leaves the base without saying goodbye, so Zack and Paula go out to look for him.Sid goes to Lynette's house and proposes marriage. She is elated until he tells her he DORed, and she would not be marrying a Navy pilot after all. Disgusted, she turns him down and confesses she was not pregnant. She says she thought he understood. She wants to marry an aviator, escape from her small town and live an exciting life overseas. She berates him for dropping out and gives back the engagement ring he bought her. Crushed, Sid goes to the motel where he and Lynette spent his free weekends, asks for their old room, and begins drinking.Zack and Paula arrive shortly after Sid leaves and ask about Sid's whereabouts. Zack curses Lynette for trying to trick Sid, and he and Paula rush off to search for him. Zack finds Sid hanging from the shower head in his motel room. Paula tries to comfort Zack, but he rejects her and heads back to base with the intent to DOR himself. Foley will not let him quit, so close to graduation and feels bad about what happened to Worley. Zack challenges Foley to an unofficial martial arts bout. Although Zack dominates for most of the fight, Foley wins by kicking Zack in the groin and then tells him he can quit now if he still wishes to do so.Zack shows up for graduation and is sworn into the Navy with his class. Following naval tradition, he receives his first salute from Foley in exchange for a US silver dollar. While tradition calls for the drill instructor to place the coin in his left shirt pocket, Foley places the coin in his right pocket, acknowledging that Zack was a special candidate. Zack thanks him for not giving up on him and tells him he never would have made it without him. While leaving the base, he sees Foley initiating a set of new candidates for basic training who are in the same position he was 13 weeks prior.Zack, now Ensign Mayo with orders to undertake flight training, seeks out Paula at the factory where she works and declares his love to her. He picks her up and (in a scene that has become iconic) walks out with her in his arms to the applause of her co-workers, including Lynette.","an_officer_and_a_gentleman":"Original film poster","language":"English","Reaction":"An Officer and a Gentleman was an enormous box office success and went on to become the third-highest grossing film of 1982, after E.T.: The Extra Terrestrial and Tootsie.[13] It grossed $3,304,679 in its opening weekend[14] and $129,795,554 overall at the domestic box office.[15] It sold an estimated 44 million tickets in the US.An Officer and a Gentleman was well received by critics and is widely considered one of the best films of 1982.[16][17][18] The film holds an 81% \"Fresh\" rating on the review aggregate website Rotten Tomatoes, based on 27 reviews, with the consensus: \"Old-fashioned without sacrificing its characters to simplicity, An Officer and a Gentleman successfully walks the fine line between sweeping romance and melodrama\".[19] It received rave reviews from critics, most notably from Roger Ebert, who gave it four stars. Ebert described An Officer and a Gentleman as \"a wonderful movie precisely because it's so willing to deal with matters of the heart...it takes chances, takes the time to know and develop its characters, and by the time this movie's wonderful last scene comes along, we know exactly what's happening, and why, and it makes us very happy.\"[20]Rex Reed gave a glowing review where he commented: \"This movie will make you feel ten feet tall!\" The British film critic Mark Kermode, an admirer of Taylor Hackford observed, \"It's a much tougher film than people remember it being; it's not a romantic movie, it's actually a movie about blue-collar, down-trodden people.\"The film also received recognition from the American Film Institute. It is ranked number 29 on AFI's 100 Years…100 Passions, a list of America's greatest love stories.[21] An Officer and a Gentleman was also named the 68th most inspiring movie on 100 Years…100 Cheers.[22] The song \"Up Where We Belong\" was also ranked number 75 on AFI's 100 Years…100 Songs.[23]Film Award wins:Academy Award nominations:Other Award wins:","box_office":"$129.8 million[2]","cinematography":"Donald E. Thorin","production_company":"Lorimar Productions","directed_by":"Taylor Hackford","release_dates":"July 28, 1982 (1982-07-28)|||||","Production":"The film was shot in late 1981 on the Olympic Peninsula of Washington state, at Port Townsend and Fort Worden. The U.S. Navy did not permit filming at NAS Pensacola in the Florida panhandle, the site of the Aviation Officer Candidate School[5] in 1981. Deactivated U.S. Army base FT Worden stood in for location of the school, an actual Naval Air Station in the Puget Sound area, NAS Whidbey Island. However, that installation, which is still an operating air station today, was and is a \"fleet\" base for operational combat aircraft and squadrons under the cognizance of Naval Air Force Pacific, not a Naval Air Training Command installation.A real motel room, in The Tides Inn located in Port Townsend, was used for the film. Today, there is a plaque outside the room commemorating this (although the room has been extensively refurbished in the interim). Some early scenes of the movie were filmed in Bremerton, with ships of the Puget Sound Naval Shipyard in the background.The \"Dilbert Dunker\" scenes were filmed in the swimming pool at what is now Mountain View Elementary School (Port Townsend Jr High School during filming). According to the director's commentary on the DVD, the dunking machine was constructed specifically for the film and was an exact duplicate of the actual one used by the Navy. As of 2010, Mountain View Elementary is closed and is now home to the Mountain View Commons, which holds the police station, food bank and the YMCA, the latter of which holds the pool.The filming location of Paula Pokrifiki's house was 1003 Tremont in Port Townsend. As of 2009, the house was shrouded by a large hedge, and the front porch had been remodeled. The neighboring homes and landscape look identical to their appearance in the film, including the 'crooked oak tree' across the street from the Pokrifiki home. This oak tree is visible in the scene near the end of the film in which Richard Gere returns to the home to request Paula's help in finding his friend Sid. In the film, the plot has Paula living a ferry ride away from the naval base. In reality, Paula's home is located approximately 8 blocks from Fort Worden.Lynette Pomeroy's house was located on Mill Road, just west of the main entrance of the Port Townsend Paper Corp. mill. The house no longer exists, but the concrete driveway pad is still visible.The interior of the USO building at Fort Worden State Park was used for the reception scene near the beginning of the film.The concrete structure used during the famous Richard Gere line \"I got nowhere else to go!\" is the Battery Kinzie located at Fort Worden State Park. The scene was filmed on the southwest corner of the upper level of the battery. The 'obstacle course' was constructed specifically for the film and was located in the grassy areas just south and southeast of Battery Kinzie.The decompression chamber was one of the only sets constructed for the film and as of 2013, it is still intact in the basement of building number 225 of the Fort Worden State Park. It can be seen through the windows of the building's basement.Building 204 of Fort Worden State Park was used as the dormitory and its porch was used for the film's closing 'silver dollar' scene.The blimp hangar used for the famous fight scene between Louis Gossett Jr. and Richard Gere is located at Fort Worden State Park and as of 2013 is still intact, but has been converted into a 1200-seat performing arts center called the McCurdy Pavilion.The filming location for the exterior of 'TJ's Restaurant' is located at the Point Hudson marina in Port Townsend. The space is now occupied by a company that makes sails. The fictional \"TJ's\" is an homage to the Trader Jon's bar in Pensacola, Florida, as a famous Naval Aviator hangout until it closed later in November 2003. For years, it was traditional for graduating Aviation Officer Candidate School classes to celebrate their commissioning at \"Trader's\".Originally, country music singer and occasional actor John Denver was signed to play Zack Mayo. But a casting process eventually involved Jeff Bridges, Christopher Reeve, and Richard Gere.[6][7] Gere eventually beat all the other actors for the part. John Travolta had turned down the role, as he did with American Gigolo (another Richard Gere hit).[7][8]The role of Paula was originally given to Sigourney Weaver,[9] then to Anjelica Huston[9] and later to Jennifer Jason Leigh, who dropped out to do the film Fast Times at Ridgemont High instead.[10] Eventually, Debra Winger replaced Leigh for the role of Paula. Rebecca De Mornay,[10] Meg Ryan,[9] and Geena Davis[9] auditioned for the role of Paula.Taylor Hackford kept Louis Gossett, Jr. in separate living quarters from the other actors during production so Gossett could intimidate them more during his scenes as a drill instructor.[11] In addition, Gossett was advised by US Marine Corps Gunnery Sergeant Buck Welscher.[11]Richard Gere rides a 750cc T140E Triumph Bonneville introduced halfway in the 1978 selling season. Two T140E Bonnevilles were supplied by Dewey's Cycle Shop in Seattle. One had Receipt no.16787 dated April 8, 1981, as sold to Paramount Pictures. In the United Kingdom, Paramount successfully linked with Triumph Motorcycles (Meriden) Ltd to do a mutual promotion. Triumph's then-chairman, John Rosamond, in his book Save The Triumph Bonneville! (Veloce 2009), states it was agreed cinemas showing the film would be promoted at their local Triumph dealer, and T140E Triumph Bonnevilles supplied by the dealer would be displayed in the cinema's foyers.Richard Gere balked at shooting the ending of the film, in which Zack arrives at Paula's factory wearing his naval dress whites and carries her off the factory floor. Gere thought the ending would not work because it was too sentimental. Director Taylor Hackford agreed with Gere until, during a rehearsal, the extras playing the workers began to cheer and cry. When Gere saw the scene later, with the music underneath it (\"Up Where We Belong\") at the right tempo, he said it gave him chills. Gere is now convinced Hackford made the right decision.[12] Screenwriter Michael Hauge, in his book Writing Screenplays That Sell, echoed this opinion: \"I don't believe that those who criticized this Cinderella-style ending were paying very close attention to who exactly is rescuing whom.\"","produced_by":"Martin Elfand Douglas Day Stewart","starring":"Richard Gere|Debra Winger|David Keith|Louis Gossett, Jr.|","running_time":"122 minutes","music_by":"Jack Nitzsche","edited_by":"Peter Zinner","Release":"Two versions of the film exist. The original, uncensored R-rated cut and an edited-for-broadcast television cut (which first aired on NBC in 1986) are nearly identical. The main difference is that the nudity and a majority of the foul language is edited out when the film airs on regular television. However, the group marching song near the beginning of the film and Mayo's solo marching song are not voiceover edits; they are reshoots of those scenes for television. Also, the sex scene between Mayo and Paula is cut in half, and the scene where Mayo finds Sid's naked body hanging in the shower is also edited.","written_by":"Douglas Day Stewart","budget":"$6 million[1]"}