{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"Ronald Miller (Dempsey) is a typical high school nerd living in Tucson. He has spent all summer mowing lawns to save up for a telescope. However, at an opportune moment he makes a deal with popular cheerleader Cynthia \"Cindy\" Mancini (Peterson). Cindy had borrowed a suede outfit that belonged to her mother, without her permission, and needs to replace it quickly after Quint (Cort McCown) accidentally spilled red wine on it at a party. Having few options except telling her Mom the truth, she reluctantly agrees to his proposal. He will give her $1000 to purchase a new suede outfit, and she will help him look \"cool\" by pretending to be his girlfriend for a month, even though she already has a boyfriend named Bobby who is away at his freshman year at the University of Iowa. He feels that he can be a part of the popular crowd if they think she is dating him. Both agree never to reveal their financial arrangement.Ronald then trades his nerdy-but-loyal friends for the shallow popular students and undergoes a complete clothing and hair makeover under Cindy's direction. Over the course of the month, they discover each other's individuality and a bond develops organically between the two. Cindy soon starts to genuinely like Ronald and appreciates his company. She opens up to him as he washes her car at her house, she goes inside to get a poem that she had written that meant the world to her and lets him read it. She gets to know him better as he reveals his interests in astronomy and space travel. They gaze at the moon and he tells her how when they are their parents age \"people will be working there and living there... maybe even us\". On the last date which Ronald has \"paid\" for, Cindy hints that she would like to kiss Ronald, signifying that she has real feelings for him, but he misunderstands and assumes she wants to talk about their breakup. They dramatically \"break up\" in front of a crowd at school but Ronald takes things too far and says some hurtful things about Cindy in front of their friends. She becomes cool and distant but warns him that popularity is hard work and he needs to make sure he \"stays [him]self\". The next day, Cindy appears disgusted with Ronald when she sees him behaving arrogantly at school and becomes jealous when she sees him flirting with her best friends Barbara and Patty, whom he later takes out on dates.Ronald continues playing \"cool\" by hanging out with the jocks and hot chicks. He takes Patty to a dance at school, where he performs a dance he learned from an African cultural show on public television (he mistakenly thought he was watching American Bandstand). At first, the other kids are mystified, but they soon join in and Ronald's new \"trendy\" dancing further increases his popularity at school. On Halloween night, he and some other boys drive to the house of Kenneth (Courtney Gains), Ronald's best friend and the jocks test his loyalty by coercing him to hurl dog feces at Kenneth's house. Kenneth is lying in wait and catches Ronald but lets him go before his Dad can call the police and ignores Ronald the next day at school.At a New Year's Eve party at Big John's (Bruskotter)house, Ronald gets drunk and has sex with his date, Iris (DeVasquez) in the bathroom. Cindy walks by and hears Ronald reciting to Iris the very poem that she had written and let him read. Devastated, she starts drinking heavily. Later, as a surprise, Bobby (Cindy's boyfriend) shows up at the party, as he still has strong ties to the athletes at the school. After he learns about her relationship with Ronald through Quint and Ricky (Mejia), Cindy is brutally dumped in front of her friends. In anger and frustration, she tells the party-goers the truth about her relationship with Ronald and his \"cool\" pretenses. She scolds her friends for falling for his act and for being \"a bunch of followers\". \"Our little plan worked, didn't it Ronald?\" Cindy says as she squashes his popularity, placing Ronald at the bottom rung of the high school social order. Rejected and dejected, Ronald leaves the party alone to spend the night in his garage, crying himself to sleep. When school resumes after the holiday break, he immediately becomes a social pariah. The \"jocks\" once again tease him and throw food at him, but the nerdy crowd abandons him as well. He is distressed at being socially ostracized and his attempts to reconcile with both Cindy and Kenneth are rebuffed.However, a moment comes to redeem himself when he defends his best friend Kenneth against the onslaught of Quint. Kenneth was helping Patty (DeMoss) with her math homework when Quint comes over and tells him to go back to his side of the cafeteria or take a serious beating. Ronald threatens to break Quint's pitching arm if he does not leave Kenneth alone (who had only been tutoring Patty out of sincere kindness, with no ulterior motive), and points out that they were all friends at one time. When they were nine, Quint had fallen out of their tree house and broken his arm, they carried him twelve blocks to the hospital as he cried all the way. He tells Quint that he wanted to be with the popular crowd, but he had messed up and tried to buy his way in, but Kenneth was just trying to make friends by being himself. Ronald goes on to say that the cool/nerd dynamic is \"all bullshit, it's tough enough just being yourself\" and walks away. Quint apologizes to Kenneth and the two shake hands as the whole school applauds.Cindy recognizes Ronald's worth after that and the two reconcile when she decides to hop on the back of his riding lawn mower instead of hanging out with her popular friends. He asks her to prom and the two kiss as the title song plays. Closing credits roll while the two of them ride off into the sunset on the lawn mower.","language":"English","Critical reception":"Can't Buy Me Love received mixed reviews from critics. Caryn James, in The New York Times, wrote that the film missed its mark and traded its potential originality for a bid at popularity by writing, \"Michael Swerdlick, the writer, and Steve Rash, the director...waste a chance to make the much deeper, funnier movie that strains to break through. [The film]...has an identity crisis that's a mirror-image of Ronald's own. He thinks he wants popularity at any price, though he's really a sincere guy. The film thinks it wants to be sincere, when all it truly wants is to be popular, just like the other kids' movies, so it sells off its originality.\"[4] Roger Ebert gave the film half a star out of a possible 4, writing: \"If 'Can't Buy Me Love' had been intended as a satirical attack on American values—if cynicism had been its target—we might be on to something here. But no. On the basis of the evidence, the people who made this movie are so materialistic they actually think this is a 'teenage comedy'. Can't they see the screenplay's rotten core?\"[5]The film currently holds a 48% rating on Rotten Tomatoes based on 21 reviews. In 2006, it ranked number 41 on Entertainment Weekly's list of the 50 Best High School Movies.[6][7]","box_office":"$31,623,833","Remake":"In 2003, Can't Buy Me Love was remade as Love Don't Cost a Thing starring Nick Cannon and Christina Milian.[8] Though the triggering event differs between the two movies, many of the aspects/scenes from the original film are reinterpreted in this remake, such as the eating of raw egg in the Home Economics classroom, as well as the cheerleader telling the bully that he is sitting in the wrong section in the cafeteria that he (the bully) need to sit in the \"asshole section\" of the cafeteria.","cinematography":"Peter Lyons Collister","production_company":"Touchstone Pictures Silver Screen Partners III Apollo Pictures The Mount Company","directed_by":"Steve Rash","Production notes":"The film was shot on location in Tucson, Arizona, at Tucson High Magnet School (then known as Tucson High School).[2] The choreography is by Paula Abdul, who makes an uncredited appearance as a dancer.[3] When the filmmakers decided to make this a non-union shoot, the Screen Actor's Guild protested the filming, going so far as to send representatives to the school to discourage students from appearing on camera.[dubious – discuss] Because of this, none of the school's drama students chose to appear as extras in the film.[dubious – discuss][citation needed]On a date where the main characters begin to bond, they jump the perimeter wall and explore the 309th Aerospace Maintenance and Regeneration Group Aircraft Bone Yard on Davis–Monthan Air Force Base that contains 4,400 aircraft. Although the characters say they jump the fence at 309 AMARG (The Boneyard) the actual scene looks more like it was shot at Bob's Air Park, an aircraft recycler just outside the Boneyard, which has since been sold.However, it is clearly the Air Force Bone Yard as evidenced by the large number of B-52s in the distance shot. Such aircraft are covered in a treaty with the former Soviet Union (now Russia), and doubtless would not be permitted out of the custody of the Air Force.[dubious – discuss]","Awards":"Young Artist Award","release_dates":"August 14, 1987 (1987-08-14)","can't_buy_me_love":"Theatrical release poster","produced_by":"Thom Mount","starring":"Patrick Dempsey|Amanda Peterson|Dennis Dugan|","running_time":"94 minutes","music_by":"Robert Folk","edited_by":"Jeff Gourson","written_by":"Michael Swerdlick"}