{"country":"United States","distributed_by":"20th Century Fox","Plot":"NYPD detective Billy Taggart (Mark Wahlberg) is arrested for the murder of Mikey Tavarez, who was believed to have raped and murdered sixteen-year-old Yesenia Barea but \"walked\" on a technicality. Chief Carl Fairbanks (Jeffrey Wright), goes to Mayor of New York City Nicholas Hostetler (Russell Crowe) with a witness and evidence. Hostetler buries the evidence, and a judge clears Taggart as having shot Tavarez in self-defense. The mayor calls Taggart to his office for a private meeting and calls him \"a hero,\" but still forces him to leave the police.Seven years later, Taggart is living with his girlfriend Natalie Barrow (Natalie Martinez), an aspiring actress. Taggart's private detective business is on the verge of bankruptcy when Mayor Hostetler hires him to investigate his wife, Cathleen Hostetler (Catherine Zeta-Jones), whom he thinks is having an affair. Helped by his assistant, Katy Bradshaw (Alona Tal), Taggart learns that Cathleen is seeing Paul Andrews (Kyle Chandler), the campaign manager of Hostetler's rival in the upcoming elections, Jack Valliant (Barry Pepper).At a fundraiser for Hostetler's campaign, Cathleen reveals to Taggart that she knows he has been following her, and advises him not to trust her husband. Taggart delivers to Mayor Hostetler photos taken of Cathleen meeting with Andrews.At a film debut party, Barrow reveals that her real name is Natalia Barea, and that Yesenia was her sister. At the screening, Taggart is shocked at Natalie's sex scene, and strongly disapproves. He had thought it would express poetic love, but finds it akin to porn. Combined with guilt over working for Hostetler, Taggart descends into regular drinking bouts. He argues with Natalie over the scene and about the people she is seeing during her work. She breaks off the relationship.Taggart gets drunk, brawling with strangers while walking the city streets. He receives a phone call from Katy telling him Chief Fairbanks wants him at a murder scene. When he arrives, he learns that Andrews, Vaillant's campaign manager, has been found murdered.Taggart tells Fairbanks that he was hired by Mayor Hostetler to investigate his wife. They learn that the candidate Valliant was in Andrews' apartment, and the two men were lovers. Valliant reveals that Andrews was scheduled to meet Todd Lancaster (James Ransone), son of Hostetler's wealthy benefactor, contractor Sam Lancaster (Griffin Dunne). A furious Cathleen tells Taggart that Andrews was a close friend of hers, not a lover, and that he had promised her information about Hostetler's plans for the Bolton Village Housing Project. The deal was expected to enrich both Sam Lancaster and the mayor. Hostetler wanted to find out Cathleen's source, so he manipulated Taggart into tracking her.Taggart decides to investigate Mayor Hostetler for corruption. He goes to Lancaster's construction business, and finds workers destroying loads of documents. Stealing some of the documents, he discovers that Bolton Village has been sold in order to build high-rise office buildings, rather than a new housing development. Hundreds of impoverished people will be left homeless while Hostetler and Lancaster make a profit. After leaving Lancaster's, Taggart is pursued in a car chase by Hostetler's men, who run him off the road and take back the documents.Taggart visits Sam's son Todd Lancaster, who says he had intended to give Andrews a copy of the demolition contract as evidence against Hostetler on the night Andrews was murdered. He gives it to Taggart instead. Taggart confronts Mayor Hostetler, who is unfazed because he has kept a video showing that Taggart murdered Tavarez in cold blood. Since there is no statute of limitations on murder, Taggart can still be prosecuted and face prison time. Taggart records their conversation, as the Mayor admits to his own corrupt dealings.Willing to make the recording public, although he would endanger his freedom, Taggart turns the recording over to Commissioner Fairbanks. While Hostetler is at home celebrating a successful debate, Fairbanks arrives to arrest him. Fairbanks tells the mayor he was having an affair with Cathleen. In the film's final scene, Taggart meets Fairbanks at a bar and they toast Valliant, who has won the election. Katy comes in to say goodbye before the two men leave the bar.","language":"English","broken_city":"Theatrical release poster","Critical reception":"The film received mixed to negative reviews from critics. On Rotten Tomatoes, the film has a rating of 29%, based on 143 reviews, with an average rating of 4.7/10. The site's consensus reads, \"Broken City's thinly sketched, formulaic script offers meager rewards for all but the least demanding noir aficionados.\"[18] Metacritic gives the film a score of 49 out of 100, based on 38 critics, indicating \"mixed or average reviews\".[19]Emily Helwig writing for The Hollywood Reporter said that critics \"have been less than thrilled\" with Broken City. \"While many praise the talented cast and others enjoyed the cinematography, some critics add that Brian Tucker's screenplay might have been the problem and that it may have been a better story told as a period piece.\"[20] Michael Phillips of the Chicago Tribune praises the cinematography of Ben Seresin, describing it as having an \"autumnal glow\" but criticizes the \"coincidence and improbability\" of the script, which lets down the able cast.[20][21] Richard Roeper gave it 3 out of 4 stars, criticizing the script but saying, \"It's pretty trashy and sometimes stupid. But there was never a moment when I wasn't entertained on one level or another.\"[22]","box_office":"$34.7 million[2]","cinematography":"Ben Seresin","production_company":"Regency Enterprises Emmett/Furla Films Inferno Distribution 1984 Private Defense Contractors Black Bear Pictures","directed_by":"Allen Hughes","Home media":"Broken City was released on DVD[16] and Blu-ray on April 30, 2013.[17]","release_dates":"January 18, 2013 (2013-01-18)|||||","Production":"Broken City was directed by Allen Hughes and written by Brian Tucker. In May 2008, Mandate Pictures bought Tucker's unsolicited screenplay intending to hire a director and cast to film later in the year.[4] In the following July, Mandate entered a deal with the production company Mr. Mudd to jointly produce one film per year, the first being Broken City. The companies aimed to hire the cast and crew by late 2008.[5] Production did not commence as planned, and the project remained in an incomplete state of development. It became part of the film industry's 2008 black list of \"best, albeit unproduced, screenplays.\"[6]In June 2011, Emmett/Furla Films began development of Broken City with an anticipated budget of $60 million. Allen Hughes was attached to direct.[7] By the following October, Regency Enterprises joined the project to co-finance with Emmett/Furla Films. Variety reported that Regency founder Arnon Milchan wanted to produce \"edgier fare\" like it previously did with the 1990s films Heat and L.A. Confidential.[8] This would be Hughes' first feature film directing effort without his twin brother Albert. (Allen also directed the TV movie Knights of the South Bronx (2005) and a few episodes of the American version of the TV series Touching Evil.[9]) Hughes said about working on his own, \"The issue is learning that you're going to be in a room sometimes, and there's going to be eight guys assaulting you, creatively. Back in the day, when it was me and him, they could have had 15 people in the room, and they were all getting laid out.\" He met Tucker in 2010 at the Palm restaurant in West Hollywood, where he learned about the screenwriter's Broken City.[6]With a production budget of $35 million,[10] shooting began in New York City in November 2011.[11] Filming also took place in the Carrollton neighborhood of New Orleans and in other parts of Louisiana.[12]","produced_by":"Randall Emmett Mark Wahlberg Stephen Levinson Arnon Milchan Teddy Schwarzman Allen Hughes Remington Chase Brandt Andersen","starring":"Mark Wahlberg Russell Crowe Catherine Zeta-Jones Jeffrey Wright Barry Pepper","running_time":"108 minutes","music_by":"Atticus Ross Claudia Sarne Leopold Ross","edited_by":"Cindy Mollo","Release":"Broken City was released in 2,620 theaters in the United States and Canada on January 18, 2013.[13] The film competed with fellow openers Mama and The Last Stand, as well as Silver Linings Playbook in its widening release.[14] The Los Angeles Times said the film drew \"the most interest from older audiences\".[10]Prior to Broken City's release, Variety reported that the film was estimated to have \"a low to mid-teens opening\" weekend.[14] It grossed $8.3 million on Friday through Sunday, ranking fifth. It grossed $9.5 million through the holiday (Martin Luther King, Jr. Day) on Monday.[15] Broken City grossed $19,701,164 in the United States and Canada.[1]","written_by":"Brian Tucker","budget":"$35 million[1]"}