{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"Maurice Pogue has retrograde amnesia, a form of amnesia that prevents him from remembering anything that happened to him the day before. He realizes from a recording he made for himself the previous night (Sunday) – to keep himself in the know – that he's a private investigator in Los Angeles, and acquired the condition after being injured during a case. Pogue tells himself not to reveal his condition to anyone, as he's the key witness in the case against the man responsible for his amnesia. Appearing on the recording is a strange woman, Sarah Novak, who informs him she has been living under the alias Beth Holly in San Francisco, and she has come to L.A. because she is being blackmailed. The police then come to Pogue's office, and take him to what turns out to be his birthday party. He tells his friend Dolby that he's seen Sarah, and learns from Dolby that Sarah is dead. While at the party, Pogue also meets Anthony Doover, his doctor – the only person who knows of Pogue's condition.Two henchmen take him from the party to meet Philip Cornell, the man Pogue is to testify against. Cornell offers Pogue a large sum of money to deny witnessing Cornell's involvement in the crime. On re-examining his files at the office, Pogue learns that Sarah was once Cornell's lover, who decided to testify against Cornell lest he kill her because of her knowledge of his illegal activities. Sarah hired Pogue to protect her but was killed by a car bomb, the same bomb that caused his amnesia. That night, Pogue meets Sarah at a fashion show she's modeling in. She tells him the girl that was killed in the explosion was a double, and that someone's threatening to tell Cornell she's still alive. Sarah also tells Pogue about a valuable coin Cornell stole from the L.A. County Museum, which she in turn stole from him. Sarah tells Pogue that she gave him the coin the morning before the explosion; Pogue cannot remember. The only clue the two have about the coin's location is one word Pogue said when Sarah gave it to him: \"Baby\".The next morning, Pogue has forgotten everything again. Cornell shows up to his office to get Pogue's sworn statement but Pogue, mistaking Cornell for his landlord, gives him a check for rent. Pogue tries throughout the day to figure out where the coin is but doesn't find any answers. Later on, he meets with Sarah; she stays at his place for the night and they make love. Pogue wakes up the following day remembering everything from the day before. Through learning his dog is Baby, he recalls that he hid the coin in its collar. He takes Sarah to a pay phone to call the people who are blackmailing her; Pogue notices that her handwriting is not the same as on the note the coin was wrapped in. Thus realizing she cannot really be Sarah Novak, he switches the coin without her knowledge. He then follows her and finds that Doover and she set up the scam to get the coin. When Doover says they'll have to start all over again after they failed to get the coin, the woman posing as Sarah refuses to go through with it again. That night, while sitting in Pogue's car outside his office, the woman reveals into one of Pogue's recorders that she's really Beth Holly, whom Doover had hired because of her resemblance to Novak. Cornell's men then kidnap Beth when they see her in the car.On Thursday morning, Cornell, who has figured out that Pogue has the coin, abducts Pogue and takes him to his home, where he attempts to torture him to give up the coin. Pogue and Holly escape, and rush to Cornell's trial. During the trial, Pogue falls back in his chair and hits his head, then suddenly regains his memory. He tells Beth that he put the coin in a parking meter and she speeds off to get it. Pogue then gives his testimony against Cornell, which prompts Cornell to change his plea in the case. Pogue finds Beth back at his apartment and the story ends when the two kiss and go inside.","language":"English","Reception":"The film aggregator site Rotten Tomatoes gave it a 19% approval rating based on 16 reviews; the average rating is 4.1/10.[6] At Allmovie, the film received a 1.5 out of 5-star rating.[7] David Nusair of Apollo Guide stated, \"You're virtually guaranteed to have forgotten it by the following morning.\"[8] Brian Lowry of Variety wrote that although the film has \"a few inspired comic moments\", it is a rehash of Groundhog Day.[9] Caryn James of The New York Times wrote that it is \"perfectly pleasant to sit through, but always feels as if it's about to become funnier than it is\".[10] Peter Rainer of the Los Angeles Times wrote that it does not live up to its good premise.[11]","clean_slate":"Theatrical release poster","box_office":"$7.4 million (US)[1]","cinematography":"Andrew Dunn","directed_by":"Mick Jackson","Soundtrack":"The CD soundtrack composed by Alan Silvestri was released by Music Box Records.","release_dates":"May 6, 1994 (1994-05-06)|||||","produced_by":"Lili Fini Zanuck|Richard D. Zanuck|","starring":"Dana Carvey|Michael Gambon|Valeria Golino|Michael Murphy|James Earl Jones|Olivia d'Abo|Kevin Pollak|","running_time":"107 minutes","music_by":"Alan Silvestri","edited_by":"Priscilla Nedd-Friendly","Release":"Clean Slate debuted in 1,457 theatres across the United States on May 6, 1994.[2] The film grossed $3,136,130 during its opening weekend, ranking number four at the box office. In its second week, though released in 17 more theatres, it made $1,498,602, more than a 50% drop in gross income.[3] The film eventually grossed a total $7,355,425 in the United States.[4]It was released on DVD in the US on October 8, 2002.[5]","written_by":"Robert King"}