{"country":"Japan United States","distributed_by":"Universal Studios","Plot":"In the town of Moorehigh in 1957, the patients of Dr. Evan Rendell kept disappearing. After some investigation, the citizens of Moorehigh found that he and his son Evan Jr. (nicknamed \"Dr. Giggles\" for his hideous laugh), were ripping out patients' hearts—in an attempt to bring back the doctor's dead wife. The townspeople stone Dr. Rendell to death, but Evan Jr. disappeared.Thirty-five years later, Giggles escapes from a mental asylum, killing everyone in his path. In Moorehigh, 19-year-old Jennifer Campbell, her boyfriend Max Anderson, and their friends are planning their spring break. Jennifer, upset that her father is dating again shortly after her mother's death, is further angered when she is diagnosed with a heart condition and is forced to wear a heart monitor to determine if she needs surgery. Meanwhile, Dr. Giggles breaks into his father's abandoned office and starts going through the doctor's old files, gathering a list of names. He begins to stalk and kill several of the town's residents, including Jennifer's friends.Jennifer comes home from a party, and deciding that she's had enough of her heart monitor, dumps it in a fish tank. Jennifer's father finds her heart monitor and goes to look for her, leaving his girlfriend Tamara behind to also be killed by Giggles. Jennifer returns to the party and sees Max kissing another girl. Distraught, she runs into a house of mirrors. Giggles sees Jennifer and notices that she has the same heart condition as his mother and goes after her. He follows and kills the girl, but Jennifer sees him coming and manages to escape. Officers Magruder and Reitz find her and take her to the police station.Giggles makes his way to Jennifer's house and attacks her father. Officer Magruder goes to investigate Jennifer's house and finds her father there, lying in a pool of blood. Giggles attacks and kills Magruder, but not before Magruder seriously wounds him in the side with a bullet. Reitz arrives soon after, finding his partner dead and Jennifer's father wounded but alive. Meanwhile, Giggles returns to his hideout, performing surgery on himself to remove the bullet. He then kidnaps Jennifer and tells her that he plans to replace her \"broken\" heart with one of those he took from the bodies of her friends. Reitz and Max arrive to save her. Max and Jennifer escape, but Reitz is killed when Giggles' hideout is destroyed.Jennifer is taken to the hospital, where she is told that the traumatic events of the evening have damaged one of her heart valves, and she is going to need surgery to replace it. While she is being prepped, Dr. Giggles reappears, having survived the explosion, and is cutting a bloody path through the hospital staff to get to Jennifer. He chases her to a janitor's closet where she spills a bottle of cleaning fluid onto the floor and hits him with a pair of defibrillator paddles, electrocuting him. She finally kills him by stabbing him through the chest with two of his own instruments. Dr. Giggles then breaks the fourth wall, staring at the camera and asking, \"Is there a doctor in the house?\" before dying.Recovering in the hospital, Jennifer is visited by Max and her also-recovering father.","dr._giggles":"Theatrical release poster","language":"English","Reception":"Variety gave the film a negative review, calling it a \"wildly uneven horror film,\" noting that \"More care in scripting and fewer cheap yocks could have resulted in a viable new paranoid horror myth.\"[5] Vincent Canby also criticized the script in his review for The New York Times, stating, \"The screenplay is stitched together from variations on cliches used by or about the medical community.\"[6] The Washington Post noted that \"Manny Coto turns to co-writer Graeme Whifler time and again for punchlines in a desperate attempt to revive a script that begins in critical condition and ends up DOA.\"[7]Sight & Sound noted that the films satire \"gives way to a few nicely nasty moments\" but that the film never tops the visual flair of the opening credits.[8]","box_office":"$8,403,433","cinematography":"Robert Draper","production_company":"Largo Entertainment JVC Entertainment.inc Dark Horse Entertainment","directed_by":"Manny Coto","release_dates":"October 23, 1992 (1992-10-23)|||||","Production":"The house that appears in Dr. Giggles was built in Metzger Park in the unincorporated community of Metzger, Oregon.[2]","produced_by":"Stuart M. Besser","starring":"Larry Drake Holly Marie Combs Cliff DeYoung Glenn Quinn Keith Diamond Richard Bradford","running_time":"96 minutes","music_by":"Brian May","edited_by":"Debra Neil-Fisher","Release":"The original release was on October 23, 1992 and the re-release on December 12, 2009 at New Beverly Cinema in Los Angeles.[3][4]","written_by":"Manny Coto and Graeme Whifler"}