{"che":"Promotional poster","country":"Spain Germany United States","distributed_by":"Morena Films (Spain) Warner Bros. (France) IFC Films (US)","Plot":"In Havana 1964, Che Guevara is interviewed by Lisa Howard who asks him if reform throughout Latin America might not blunt the \"message of the Cuban Revolution.\"In 1955, at a gathering in Mexico City, Guevara first meets Fidel Castro. He listens to Castro’s plans and signs on as a member of the July 26th Movement.There is a return to 1964 for Guevara’s address before the United Nations General Assembly in New York City, where he makes an impassioned speech against American imperialism, and defends the executions his regime has committed, declaring \"this is a battle to the death.\"March 1957. Guevara deals with debilitating bouts of asthma as his group of revolutionaries meet up with Castro’s. Together, they attack an army barracks in the Sierra Maestra on May 28, 1957.On October 15, 1958, the guerrillas approach the town of Las Villas. The Battle of Santa Clara is depicted with Guevara demonstrating his tactical skill as the guerrillas engage in street-to-street fighting and derail a train carrying Cuban soldiers and armaments. Near the film‘s end, they are victorious. With the Cuban Revolution now over, Guevara heads to Havana, remarking \"we won the war, the revolution starts now.\"The second part begins on November 3, 1966 with Guevara arriving in Bolivia disguised as a middle-aged representative of the Organization of American States hailing from Uruguay, who subsequently drives into the mountains to meet his men. The film is organized by the number of days that he was in the country. On Day 26, there is solidarity among Guevara's men despite his status as foreigner. By Day 67, Guevara has been set up for betrayal. He tries to recruit some peasants only to be mistaken for a cocaine smuggler. On Day 100, there is a shortage of food and Guevara exercises discipline to resolve conflicts between his Cuban and Bolivian followers.By Day 113, some of the guerrillas have deserted and the Bolivian Army has discovered their base camp. Much to Che's disappointment Tamara \"Tania\" Bunke, Guevara's revolutionary contact, has botched elaborate preparations and given away their identity. On Day 141, the guerrillas capture Bolivian soldiers that refuse to join the revolution and are free to return to their villages. CIA advisers arrive to supervise anti-insurgent activity and training. On Day 169, Guevara's visiting friend, the French intellectual Régis Debray, is captured at Muyupampa by the Bolivian Army, which launches an aerial attack on Day 219.Guevara grows sick and by Day 280 can barely breathe as a result of his acute asthma. On Day 302, the Bolivian Army kills Tania Bunke, Juan Acuña Ñunez, and several others in Che's forces in an ambush as they attempt to cross the Vado del Yeso after a local informant tells the Bolivian troops about the movements of the rebels. By Day 340, Guevara is trapped by the Bolivian Army in the Yuro Ravine near the village of La Higuera. Che is wounded and captured. The next day, a helicopter lands and a Cuban American CIA agent Félix Rodríguez emerges. The Bolivian high command are then phoned and give approval for Guevara's execution. He is shot on 9 October 1967, and his corpse lashed to a helicopter's landing skids and flown out.In a final flashback scene, Guevara is aboard the Granma in 1956, looking out over the ocean. He sees the Castro brothers alone at the bow of the ship; Fidel is talking and Raúl is taking notes. Guevara hands a peeled orange to one of his comrades and returns his gaze to the lone brothers before the scene fades to black.","language":"Spanish English","Reception":"Early reviews were mixed, although there were several critics who spoke glowingly of the project.[50] Cinematical's James Rocchi described the biopic as \"expressive, innovative, striking, and exciting\" as well as \"bold, beautiful, bleak and brilliant\". Rocchi went on to brand it \"a work of art\" that's \"not just the story of a revolutionary\" but \"a revolution in and of itself\".[51] Columnist and critic Jeffrey Wells proclaimed the film \"brilliant\", \"utterly believable\", and \"the most exciting and far-reaching film of the Cannes Film Festival\". In further praise, Wells referred to the film as \"politically vibrant and searing\" while labeling it a \"perfect dream movie\".[52]Todd McCarthy was more mixed in his reaction to the film in its present form, describing it as \"too big a roll of the dice to pass off as an experiment, as it's got to meet high standards both commercially and artistically. The demanding running time forces comparison to such rare works as Lawrence of Arabia, Reds and other biohistorical epics. Unfortunately, Che doesn't feel epic—just long\".[53] Anne Thompson wrote that Benicio del Toro \"gives a great performance\", but predicted that \"it will not be released stateside as it was seen here\".[50] Glenn Kenny wrote, \"Che benefits greatly from certain Soderberghian qualities that don't always serve his other films well, e.g., detachment, formalism, and intellectual curiosity\".[54]Peter Bradshaw, in his review for The Guardian, wrote, \"Perhaps it will even come to be seen as this director's flawed masterpiece: enthralling but structurally fractured—the second half is much clearer and more sure-footed than the first—and at times frustratingly reticent, unwilling to attempt any insight into Che's interior world\".[55] In his less favorable review for Esquire, Stephen Garrett criticized the film for failing to show Guevara's negative aspects, \"the absence of darker, more contradictory revelations of his nature leaves Che bereft of complexity. All that remains is a South American superman: uncomplex, pure of heart, defiantly pious and boring\".[56] Richard Corliss had problems with Del Toro's portrayal of Guevara: \"Del Toro—whose acting style often starts over the top and soars from there, like a hang-glider leaping from a skyscraper roof—is muted, yielding few emotional revelations, seemingly sedated here ... Che is defined less by his rigorous fighting skills and seductive intellect than by his asthma\".[57] In his review for Salon.com, Andrew O'Hehir praised Soderbergh for making \"something that people will be eager to see and eager to talk about all over the world, something that feels strangely urgent, something messy and unfinished and amazing. I'd be surprised if Che doesn't win the Palme d'Or ... but be that as it may, nobody who saw it here will ever forget it\".[58]Soderbergh replied to the criticism that he made an unconventional film: \"I find it hilarious that most of the stuff being written about movies is how conventional they are, and then you have people ... upset that something's not conventional. The bottom line is we're just trying to give you a sense of what it was like to hang out around this person. That's really it. And the scenes were chosen strictly on the basis of, 'Yeah, what does that tell us about his character?'\".[18]After Cannes, Soderbergh made a few minor adjustments to the film. This included adding a moment of Guevara and Fidel Castro shaking hands, tweaking a few transitions, and tacking on an overture and entr'acte to the limited \"road show\" version. Moreover, he removed the trial of guerrilla Lalo Sardiñas, which Chicago film critic Ben Kenigsberg found \"regrettable\", stating that it was \"not only one of the film's most haunting scenes but a key hint at the darker side of Che's ideology\".[22]In her review for The New York Times, based on a screening at the New York Film Festival, Manohla Dargis observes that \"throughout the movie Mr. Soderbergh mixes the wild beauty of his landscapes with images of Che heroically engaged in battle, thoughtfully scribbling and reading, and tending to ailing peasants and soldiers\".[59] According to Dargis, \"Che wins, Che loses, but Che remains the same in what plays like a procedural about a charismatic leader, impossible missions and the pleasures of work and camaraderie\", referring to the \"historical epic\" as \"Ocean's Eleven with better cigars\".[59] However, Dargis notes that \"Mr. Soderbergh cagily evades Che's ugly side, notably his increasing commitment to violence and seemingly endless war, but the movie is without question political—even if it emphasizes romantic adventure over realpolitik—because, like all films, it is predicated on getting, spending and making money\".[59]Film critic Glenn Kenny wrote, \"Che seems to me almost the polar opposite of agitprop. It flat out does not ask for the kind of emotional engagement that more conventional epic biopics do, and that's a good thing\".[60] In his review for UGO, Keith Uhlich wrote, \"The best to say about Del Toro's Cannes-honored performance is that it's exhausting—all exterior, no soul, like watching an android run a gauntlet (one that includes grueling physical exertions, tendentious political speechifying, and risible Matt Damon cameos)\".[61] Slant magazine gave Che two-and-a-half stars out of four and wrote, \"The problem is that, despite his desire to sidestep Hollywood bio-hooey, the director is unable to turn his chilly stance into an ideological perspective, like Roberto Rossellini did in his demythologized portraits of Louis XIV, Garibaldi and Pascal\".[62]In his review for Salon magazine, Andrew O'Hehir wrote, \"What Soderbergh has sought to capture here is a grand process of birth and extinguishment, one that produced a complicated legacy in which John McCain, Barack Obama, and Raúl Castro are still enmeshed. There will be plenty of time to argue about the film's (or films') political relevance or lack thereof, to call Soderbergh names for this or that historical omission, for this or that ideological error. He's made something that people will be eager to see and eager to talk about all over the world, something that feels strangely urgent, something messy and unfinished and amazing\".[63]On 4 December 2008, Che premiered at Miami Beach's Byron Carlyle Theatre, as part of the Art Basel Festival. Taking place only a few miles from Little Havana, which is home to the United States' largest Cuban American community, the invitation-only screening was met with angry demonstrators.[64] The organization Vigilia Mambisa, led by Miguel Saavedra, amassed an estimated 100 demonstrators to decry what they believed would be a favorable depiction of Guevara. Saavedra told reporters from the El Nuevo Herald that \"you cannot offend the sensitivities of the people\", while describing the film as \"a disgrace\".[65] A supporter of the demonstration, Miami Beach's mayor Matti Herrera Bower, lamented that the film was shown, while declaring \"we must not allow dissemination of this movie\".[65] When asked days later about the incident, Del Toro remarked that the ability to speak out was \"part of what makes America great\" while adding \"I find it a little weird that they were protesting without having seen the film, but that's another matter\".[66] For his part, Soderbergh later stated that \"you have to separate the Cuban nationalist lobby that is centered in Miami from the rest of the country\".[67]On 7 December 2008, Che premiered at Havana's 5,000+ person Karl Marx Theater as part of the Latin American Film Festival.[68] Benicio Del Toro, who was in attendance, referred to the film as \"Cuban history\", while remarking that \"there's an audience in there ... that could be the most knowledgeable critics of the historical accuracy of the film\".[68] The official state paper Granma gave Del Toro a glowing review, professing that he \"personifies Che\" in both his physical appearance and his \"masterly interpretation\".[69] After unveiling Che in Havana's Yara Cinema, Del Toro was treated to a 10-minute standing ovation from the 2,000+ strong audience, many of whom were involved in the revolution.[70]On 12 December 2008, Che was screened at New York City's sold out 1,100 person Ziegfeld Theater. Upon seeing the first image on the screen (a silhouette of Cuba), the crowd erupted into a raucous cry of \"¡Viva, Cuba!\"[71] Following the film, and the standing ovation it received, Soderbergh appeared for a post program Q&A.[72] During the sometimes contentious conversation with the audience, in which Soderbergh alternated between defensiveness and modesty, the director categorized Guevara as \"a hard ass\", to which one audience member yelled out, \"Bullshit, he was a murderer!\"[71] The filmmaker settled down the crowd and explained, \"It doesn't matter whether I agree with him or not—I was interested in Che as a warrior, Che as a guy who had an ideology, who picked up a gun and this was the result. He died the way you would have him die. He was executed the way you would say he executed other people\".[72] Soderbergh ended the 1 am Q&A session by noting that he was \"agnostic\" on Che's standing, but \"loyal to the facts\", which he insisted were all rigorously sourced.[71]On 3 March 2009, Venezuelan President Hugo Chávez, himself an avowed Marxist and admirer of Che Guevara, greeted Del Toro and co star Bichir at the Presidential Palace in Caracas. The day prior Del Toro attended a screening of the film at a bullfighting ring-turned cultural center, where he was \"mobbed by adoring fans\".[73] Del Toro then visited the state-run Cinema Town, a film production facility President Chávez launched to help Venezuela produce its own movies as an alternative to what Chávez calls Hollywood's cultural imperialism. Del Toro described Che as \"a totally Latin American movie\" and stated that he had \"a good meeting with the President\".[74]Part One has a 67% rating at Rotten Tomatoes,[75] while Part Two has an 80% rating.[76] Scott Foundas of the LA Weekly proclaimed Che \"nothing if not the movie of the year\".[77] In his review for the Village Voice, J. Hoberman wrote, \"At its best, Che is both action film and ongoing argument. Each new camera setup seeks to introduce a specific idea—about Che or his situation—and every choreographed battle sequence is a sort of algorithm where the camera attempts to inscribe the event that is being enacted\".[78] Hoberman compared Soderbergh's directing style and \"non-personalized\" historical approach on the film to Otto Preminger's observational use of the moving camera, or one of Roberto Rossellini's \"serene\" documentaries.[78] Armond White, in his review for the New York Press, wrote, \"Out-perversing Gus Van Sant's Milk, Soderbergh makes a four-hour-plus biopic about a historical figure without providing a glimmer of charm or narrative coherence\".[79] In his review for The New York Times, A.O. Scott writes, \"Mr. Soderbergh once again offers a master class in filmmaking. As history, though, Che is finally not epic but romance. It takes great care to be true to the factual record, but it is, nonetheless, a fairy tale\".[80] Sheri Linden, in her review for the Los Angeles Times, wrote, \"in this flawed work of austere beauty, the logistics of war and the language of revolution give way to something greater, a struggle that may be defined by politics but can't be contained by it\".[81] In her review for the Washington Post, Ann Hornaday wrote, \"The best way to encounter Che, is to let go of words like 'film' and 'movie', words that somehow seem inadequate to the task of describing such a mesmerizing, fully immersive cinematic experience. By the end of Che, viewers will likely emerge as if from a trance, with indelibly vivid, if not more ambivalent feelings about Guevara, than the bumper-sticker image they walked in with\".[82]Entertainment Weekly gave a \"B+\" rating to the first half of the film and a \"C-\" rating to the second half, and Owen Gleiberman wrote, \"As political theater, Che moves from faith to impotence, which is certainly a valid reading of Communism in the 20th century. Yet as drama, that makes the second half of the film borderline deadly ... Che is twice as long as it needs to be, but it is also only half the movie it should have been\".[83] James Verniere of The Boston Herald gave the film a B-, describing the work as a new genre of \"arthouse guerrilla nostalgia\", while lamenting Che as the film version of Alberto Korda’s iconic 1960 photograph Guerrillero Heroico. In Verniere's view, so much information was missing, that he recommended one first see The Motorcycle Diaries to fill in the background.[84] In her review for USA Today, Claudia Puig wrote, \"With its lyrical beauty and strong performances, the film can be riveting. Its excessive length and rambling scenes also make it maddening. It is worth seeing for its attention to visual detail and ambitious filmmaking, but as a psychological portrait of a compelling historical figure, it is oddly bland and unrevealing\".[85] Anthony Lane, in his review for The New Yorker, wrote, \"for all the movie’s narrative momentum, Che retains the air of a study exercise—of an interest brilliantly explored. How else to explain one’s total flatness of feeling at the climax of each movie?\"[86] Taking a more positive stance, film critic Chris Barsanti compared Che to a \"guerrilla take on Patton\", calling it \"an exceptionally good\" war film, which rivaled The Battle of Algiers in its \"you-are-there sensibility\".[87] Roger Ebert awarded the film 3.5 our of 4 stars and addressed the film's length: \"You may wonder if the film is too long. I think there's a good reason for its length. Guevara's experience in Cuba and especially Bolivia was not a series of events and anecdotes, but a trial of endurance that might almost be called mad\".[88]Film Comment ranked Che as the 22nd best film of 2008 in their \"Best Films of 2008\" poll.[89] Film critics Roger Ebert,[90] and James Rocchi[91] went further, naming Che one of the best films of 2008. The film appeared on several critics' top ten lists of the best films of 2008.[92]Looking back at the experience of making Che, Soderbergh has said that he now wishes that he had not made the film and remarked, \"Literally I'd wake up and think, 'At least I'm not doing that today.'\"[93] The director blamed piracy for the film's financial failure and felt that \"It's a film that, to some extent, needs the support of people who write about films. If you'd had all these guys running around talking in accented English you'd [have got] your head taken off\".[93]","box_office":"US$40.9 million[3]","cinematography":"Steven Soderbergh (as Peter Andrews)","production_company":"Telecinco Cinema Wild Bunch Section Eight Productions","directed_by":"Steven Soderbergh","Home media":"The film was released on Region 1 DVD in January 2009 exclusively from Blockbuster for 60 days as per an agreement with IFC.[100] The Criterion Collection was originally scheduled to release the film on Region 1 Blu-ray Disc in December 2009.[101] However, the release date was re-scheduled to 19 January 2010. The two-disc Blu-ray Disc release features 1080p video and a Spanish DTS-HD Master Audio 5.1 soundtrack (with English subtitles).Additional supplements include audio commentaries on both films featuring Jon Lee Anderson—author of Che Guevara: A Revolutionary Life, and a 20-page booklet featuring an essay by film critic Amy Taubin.[102] There are also three short documentaries on Guevara: Making Che—a documentary about the film's production,[103] Che and the Digital Revolution—a documentary about the Red One Camera technology that was used in the film's production,[103] and End of a Revolution—a 1968 documentary by Brian Moser who was in Bolivia looking for Che when Che was executed.[103][104]","Awards":"Del Toro was awarded the Best Actor Award at the Cannes Film Festival for his performance in Che and in his acceptance speech dedicated his award \"to the man himself, Che Guevara and I want to share this with Steven Soderbergh. He was there pushing it even when there [were lulls] and pushing all of us\".[94] Guevara's widow Aleida March, who is president of the Che Guevara Studies Center, sent a congratulatory note to Del Toro upon hearing the news of his award.[95] Del Toro was awarded a 2009 Goya Award as the best Spanish Lead Actor for his depiction of Che.[96] Actor Sean Penn, who won an Oscar for his role in Milk, remarked that he was surprised and disappointed that Che and Del Toro were not also up for any Academy Award nominations. During his acceptance speech for the Best Actor's trophy at the Screen Actors Guild Awards, Penn expressed his dismay stating, \"The fact that there aren't crowns on Soderbergh's and Del Toro's heads right now, I don't understand ... that is such a sensational movie, Che.\"[97] In reference to what Penn deemed a snub, he added \"Maybe because it's in Spanish, maybe the length, maybe the politics\".[97]On 31 July 2009, Del Toro was awarded the inaugural Tomas Gutierrez Alea prize at a Havana ceremony attended by U.S. actors Robert Duvall, James Caan and Bill Murray. Named after a prolific Cuban filmmaker, the new award was voted for by the National Union of Writers and Artists of Cuba. Del Toro remarked that it was \"an honor\" to receive the award and thanked Che director Steven Soderbergh.[98]Che was also awarded \"The White Camel\", the top award handed out at the sixth annual Sahara International Film Festival, whose ceremony took place during the spring of 2009 in the Wilaya of Dakhla at the Sahrawi refugee camps of 30,000 residents. Executive producer Alvaro Longoria, attended to accept the award when Del Toro couldn't because of filming for The Wolf Man. After dismounting the prize (which was a literal camel) Longoria remarked that \"this is real, this is what Benicio and Steven tried to tell in the movie. It’s right here, a people fighting a war for their dignity and their land. The principles of Che Guevara are very important to them.\" However, Longoria returned the live animal before departing, opting for a camel statuette in its place.[99]","release_dates":"21 May 2008 (2008-05-21) (Cannes)|5 September 2008 (2008-09-05) (Spain: The Argentine)|12 December 2008 (2008-12-12) (United States)|7 January 2009 (2009-01-07) (France: The Argentine)|27 January 2009 (2009-01-27) (France: Guerrilla)|","Production":"Originally, Che was intended to be a much more traditional film based on Jon Lee Anderson's 1997 biography Che Guevara: A Revolutionary Life. Actor Benicio del Toro and producer Laura Bickford optioned the film rights to Anderson's book. However, after two years they had not found a suitable writer and the rights expired.[4] During this time, Del Toro and Bickford researched the events depicted in Guerrilla with the idea of exploring Guevara's attempts to start a revolution in Bolivia.[5] Del Toro has said that he previously only thought of Guevara as a \"bad guy\".[6] For his role, Del Toro spent seven years \"obsessively researching\" Guevara's life, which made him feel like he \"earned his stripes\" to interpret the character.[7] Preparation included looking at Guevara's photographs and reading his personal writings. Del Toro read Don Quixote, one of Guevara's favorites, and the first book published and given out free after the Cuban Revolution.[7] Del Toro then personally met with people from different stages of Guevara's life, including Guevara's younger brother and childhood friends,[8] traveling to Cuba where Del Toro met Guevara's widow, family, and \"tons of people that loved this man\".[6] The visit included a five-minute encounter at a book fair with Fidel Castro, who expressed that he was happy for the \"serious\" research being undertaken.[9] Such research included collaborating with the three surviving guerrillas from Guevara's ill-fated Bolivian campaign, and with several guerrillas who fought alongside him in Cuba. While researching for both films, Soderbergh made a documentary of his interviews with many of the people who had fought alongside Guevara.[10] In his encounters with people ranging from fellow guerrillas to Guevara's driver, Del Toro described the reaction as \"always the same\", stating that he was \"blown away\" by the \"bucketful of love\" they still harbored for Guevara.[7] In an interview, Del Toro described Guevara as \"a weird combination of an intellectual and an action figure, Gregory Peck and Steve McQueen, wrapped in one\".[11] After the film's production concluded, Del Toro professed that \"when you tell the story of Che, you're telling a story of the history of a country, so you have to be very careful\".[8]Del Toro and Bickford hired screenwriter Benjamin A. van der Veen to write the screenplay's first drafts, and their extensive research took them to Cuba where they met with several of the remaining members of Guevara's team in Bolivia as well as the revolutionary's wife and children. It was during this phase of development that the filmmakers discovered Terrence Malick had been in Bolivia as a journalist in 1966 working on a story about Che. Malick came on as director and worked on the screenplay with van der Veen and Del Toro, but after a year-and-a-half, the financing had not come together entirely and Malick left to make The New World, a film about Jamestown, Virginia.[2] Afraid that their multi-territory deals would fall apart, Bickford and Del Toro asked Steven Soderbergh, who was previously on board as producer, to direct.[2] The filmmaker was drawn to the contrast of \"engagement versus disengagement. Do we want to participate or observe? Once Che made the decision to engage, he engaged fully. Often people attribute that to a higher power, but as an atheist, he didn't have that. I found that very interesting\".[12] Furthermore, he remarked that Guevara was \"great movie material\" and \"had one of the most fascinating lives\" that he could \"imagine in the last century\".[13] Bickford and Del Toro realized that there was no context for what made Guevara decide to go to Bolivia. They began looking for someone to rewrite the screenplay; Peter Buchman was recommended to them because he had a good reputation for writing about historical figures, based on a script he worked about Alexander the Great.[14] He spent a year reading every available book on Guevara in preparation for writing the script. The project was put on hold when Bickford and Del Toro made Traffic with Soderbergh.[5]Soderbergh wanted to incorporate Guevara's experiences in Cuba and at the United Nations in 1964. Buchman helped with the script's structure, which he gave three storylines: Guevara's life and the Cuban Revolution; his demise in Bolivia; and his trip to New York to speak at the U.N. Buchman found that the problem with containing all of these stories in one film was that he had to condense time and this distorted history.[5] Soderbergh found the draft Buchman submitted to him \"unreadable\" and after two weeks decided to split the script into two separate films.[2] Buchman went back and with Del Toro expanded the Cuban story for The Argentine.[2] Additional research included reading Guevara's diaries and declassified documents from the U.S. State Department about his trip to New York and memos from his time in Bolivia.[5]Soderbergh found the task of researching such a popular historical figure as Guevara a daunting one: \"If you go to any bookstore, you'll find an entire wall of Che-related material. We tried to go through all of it, we were overwhelmed with information. He means something different to everyone. At a certain point we had to decide for ourselves who Che was\".[12] The original source material for these scripts was Guevara's diary from the Cuban Revolution, Reminiscences of the Cuban Revolutionary War, and from his time in Bolivia, Bolivian Diary.[2] From there, he drew on interviews with people who knew Guevara from both of those time periods and read every book available that pertained to both Cuba and Bolivia.[15] Bickford and Del Toro met with Harry \"Pombo\" Villegas, Urbano and Benigno—three men who met Guevara during the Cuban Revolution, followed him to Bolivia, and survived.[5] They interviewed them individually and then Pombo and Benigno together about their experiences in Cuba and Bolivia. Urbano was an adviser while they were filming in Spain and the actors often consulted with him and the others about specific details, like how to hold their guns in a certain situation, and very specific tactical information.[5]In December 2008, Ocean Press, in cooperation with the Che Guevara Publishing Project, released Che: The Diaries of Ernesto Che Guevara, with a movie tie-in cover.[16] The book's aim was to compile all the original letters, diary excerpts, speeches and maps on which Soderbergh relied for the film. The text is interspersed with remarks by Benicio del Toro and Steven Soderbergh.[16]Initially, Che was going to be made in English and a strong interest in financing it was met; however, when the decision was made to make it in Spanish and break it up into two films, the studios' pay-TV deals, which were for English-language product only, \"disappeared\", according to Bickford, \"and, at that point, nobody wanted to step up\".[17] The director defended his decision to shoot almost all of the film in Spanish in an interview: \"You can't make a film with any level of credibility in this case unless it's in Spanish. I hope we're reaching a time where you go make a movie in another culture, that you shoot in the language of that culture. I'm hoping the days of that sort of specific brand of cultural imperialism have ended\".[18] Both films were financed without any American money or distribution deal; Soderbergh remarked, \"It was very frustrating to know that this is a zeitgeist movie and that some of the very people who told me how much they now regret passing on Traffic passed on this one too\".[19] Foreign pre-sales covered $54 million of the $58 million budget.[2] Wild Bunch, a French production, distribution and foreign sales company put up 75% of the budget for the two films, tapping into a production and acquisition fund from financing and investment company Continental Entertainment Capitol, a subsidiary of the U.S.-based Citigroup. Spain's Telecinco/Moreno Films supplied the rest of the budget.[20]In 2006, shortly before the U.N. Headquarters underwent major renovations, Del Toro and Soderbergh shot the scenes of Guevara speaking to the U.N. General Assembly in 1964.[5] The director wanted to shoot the first part of The Argentine in Cuba, but was prevented from travelling there by the U.S. government's embargo.[21] Doubling Santa Clara proved to be difficult because it was a certain size and had a certain look. Soderbergh spent four to five months scouting for a suitable replacement, looking at towns in Veracruz/Yucatán before settling on Campeche, which had the elements they needed.[21]The original intention was for The Argentine to be shot using anamorphic 16 mm film because, according to the director, it needed \"a bit of Bruckheimer but scruffier\".[19] He kept to his plan of shooting The Argentine anamorphically, and Guerrilla with spherical lenses.[19] Soderbergh wanted to use the new RED One rather than 16 mm film because of its ability to replicate film stock digitally but initially, it was not going to be available on time.[5] However, their Spanish work papers and visas were late and Del Toro and Soderbergh were grounded in Los Angeles for a week. The director was meanwhile informed that the prototype cameras were ready.[5]Each half of the film focuses on a different revolution, both fundamentally the same in theory but vastly different in outcome, reflecting the Marxist notion of dialectics.[22] Soderbergh wanted the film's two parts to mimic the voice of the two diaries they were based on; the Cuban diaries were written after the fact and, according to the director, \"with a certain hindsight and perspective and a tone that comes from being victorious\", while the Bolivian diaries were \"contemporaneous, and they're very isolated and have no perspective, at all. It's a much more tense read, because the outcome is totally unclear\".[23]Soderbergh shot the films back-to-back in the beginning of July 2007 with Guerrilla shot first in Spain for 39 days and The Argentine shot in Puerto Rico and Mexico for 39 days. The director conceived The Argentine as \"a Hollywood movie\" shot in widescreen 'scope aspect ratio, with the camera either fixed or moving on a dolly or a Steadicam.[2] Guerrilla was shot, according to Soderbergh, \"in Super-16, 1.85:1. No dollies, no cranes, it's all either handheld or tripods. I want it to look nice but simple. We'll work with a very small group: basically me, the producer Gregory Jacobs and the unit production manager\".[19] According to the director, the portion set in Cuba was written from the victor's perspective and as a result he adopted a more traditional look with classical compositions, vibrant color and a warm palette.[21] With Guerrilla, he wanted a sense of foreboding with hand-held camerawork and a muted color palette. Soderbergh told his production designer Antxon Gomez that the first part would have green with a lot of yellow in it and the second part would have green with a lot of blue in it.[21]At the end of The Argentine, Soderbergh depicts Guevara's derailment of a freight train during the Battle of Santa Clara. In filming the sequence, Soderbergh balked at the digital effects solution and managed to reallocate $500,000 from the overall $58 million budget to build a real set of tracks and a train powered by two V-8 car engines. To film the scene, they had six rehearsals, and could only shoot the scene once.[24]Many aspects of Guevara's personality and beliefs affected the filming process. For instance, close-ups of Del Toro were avoided due to Guevara's belief in collectivism, with Soderbergh remarking, \"You can't make a movie about a guy who has these hard-core sort of egalitarian socialist principles and then isolate him with close-ups.\"[22] According to Edgar Ramirez, who portrays Ciro Redondo, the cast \"were improvising a lot\" while making The Argentine, and he describes the project as a \"very contemplative movie\", shot chronologically.[25] While filming outdoors, Soderbergh used natural light as much as possible.[5] Del Toro, who speaks Puerto Rican Spanish, tried to speak the best Argentinean Spanish (Rioplatense Spanish) he could without sounding \"stiff\".[6] Prior to shooting the film's final scenes that depict Guevara's time in Bolivia at the end of his life, Del Toro shed 35 pounds to show how ill Guevara had become. The actor shaved the top of his head rather than wear a bald cap for the scenes depicting Guevara's arrival in Bolivia in disguise.[26]Soderbergh has said that with Che, he wanted to show everyday tasks, \"things that have meaning on a practical level and on an ideological level\", as a \"way of showing what it might have been like to be there\".[2] While addressing the issue after at the Toronto International Film Festival, Soderbergh remarked that he was trying to avoid what he felt were typical scenes for a biographical film and that he would tell screenwriter Peter Buchman, that he was \"trying to find the scenes that would happen before or after the scene that you would typically see in a movie like this\".[22] Soderbergh was not interested in depicting Guevara's personal life because he felt that \"everybody on these campaigns has a personal life, they all left families behind, that doesn't make him special and why should I go into his personal life and nobody else's?\"[14]Soderbergh decided to omit the post-revolution execution sentences of \"suspected war criminals, traitors and informants\" that Guevara reviewed at La Cabana Fortress because \"there is no amount of accumulated barbarity that would have satisfied the people who hate him\".[27] Soderbergh addressed the criticism for this omission in a post release interview where he stated: \"I don't think anybody now, even in Cuba, is going to sit with a straight face and defend the events. La Cabana was really turned into a Roman circus, where I think even the people in power look back on that as excessive. However, every regime, in order to retain power when it feels threatened, acts excessively ... This is what people do when they feel they need to act in an extreme way to secure themselves\".[27] The filmmaker noted as well that, \"with a character this complicated, you’re going to have a very polarized reaction\".[22] Furthermore, he was not interested in depicting Guevara's life as \"a bureaucrat\", stating that he was making a diptych about two military campaigns, declaring the pictures \"war films\".[27] Soderbergh said, \"I'm sure some people will say, 'That's convenient because that's when he was at his worst.' Yeah, maybe—it just wasn't interesting to me. I was interested in making a procedural about guerrilla warfare\".[17]Soderbergh described the Cuban Revolution as \"the last analog revolution. I loved that we shot a period film about a type of war that can't be fought anymore\".[28] Soderbergh has said that he is open to making another film about Guevara's experiences in the Congo but only if Che makes $100 million at the box office.[12]","Distribution":"Theatrical distribution rights were pre-sold to distributors in several major territories, including France, the United Kingdom, Scandinavia, Italy, and Japan (Nikkatsu); Twentieth Century Fox bought the Spanish theatrical and home video rights.[20] IFC Films paid a low seven-figure sum to acquire all North American rights to Che after production had completed and released it on 12 December 2008 in New York City and Los Angeles in order to qualify it for the Academy Awards.[29][30] The \"special roadshow edition\" in N.Y.C. and L.A. was initially planned as a one-week special engagement—complete with intermission and including a full-color printed program—but strong box-office results led to its re-opening for two weeks on 9 January 2009 as two separate films, titled Che Part 1: The Argentine and Che Part 2: Guerrilla.[31] Soderbergh said that the program's inspiration came from the 70 mm engagements for Francis Ford Coppola's Apocalypse Now.[21] The film was expanded to additional markets on 16 and 22 January both as a single film and as two separate films.[32][33] IFC made the films available through video on demand on 21 January on all major cable and satellite providers in both standard and high definition versions.[34]Che was screened on 21 May at the 2008 Cannes Film Festival reportedly running over four hours.[35] Following this screening, Soderbergh cut 5–7 minutes from each half.[36] It was shown at the 46th New York Film Festival[37] and was shown at the 33rd Toronto International Film Festival as Che with a 15-minute intermission and as two separate films, The Argentine and Guerrilla,[38] where it was considered the festival's \"must-see\" film.[39] Che made its sold-out L.A. premiere at Grauman's Chinese Theatre on 1 November 2008 as part of the AFI Fest.[17]Che was screened in Guevara's homeland of Argentina in November 2008.[40] To mark the occasion, the streets of Buenos Aires were decorated with large posters of Del Toro in his role as the guerrilla fighter, unprecedented in the city's history. When questioned by the press on Guevara's ideas and use of violence, Del Toro stated that if he had lived during the 1960s, he would have agreed with Guevara, and that although he did not support violent revolution now, in the '60s he may \"have been another person and in agreement with armed war\".[40]Del Toro and Soderbergh both attended the French premiere in late November 2008, where they took questions from the press. Del Toro remarked that the \"legendary rebel\" was still pertinent because \"the things that he fought for in the late 1950s and mid 1960s are still relevant today\", adding that \"he did not hide behind curtains ... he stood up for the forgotten ones\".[41] When asked why he made the film, Soderbergh stated, \"I needed to make the film, and that is a different feeling. I felt like, if I am worth anything, I have to say yes. I can't say no\".[41] The following day, the Dubai International Film Festival would describe Soderbergh's narrative as a \"magisterial ... compelling experience\", with Del Toro's performance as \"blue-chip\".[42]Che opened in single theaters in N.Y.C. and L.A. where it made $60,100 with sellouts of both venues.[43] Based on this success, IFC Films executives added two weekends of exclusive runs for the roadshow version, starting 24 December in N.Y.C. and 26 December in L.A.[44] This successful run prompted IFC Films to show this version in nine additional markets on 16 January. Che will be shown in its entirety, commercial and trailer free with an intermission and limited edition program book at every screening.[45] Soderbergh has said that the film's roadshow version will not be released on DVD but released in two parts with the animated map that opens the roadshow's second half missing from Part II, as well as the overture and intermission music.[46]According to Variety, it had grossed $164,142 in one weekend, at 35 locations in North America and $20 million from a half-dozen major markets around the world, led by Spain at $9.7 million.[47] As of May 2009, it has grossed $1.4 million in North America and $29.8 million in the rest of the world for a worldwide total of $30 million.[48] Eventually, Che made good profit for IFC Films.[49]","produced_by":"Laura Bickford Benicio del Toro","starring":"Benicio del Toro","running_time":"257 minutes[1]","music_by":"Alberto Iglesias","External links":"Multimedia","edited_by":"Pablo Zumárraga","written_by":"Peter Buchman Benjamin A. van der Veen","budget":"US$58 million[2]"}