{"country":"United States","distributed_by":"Paramount Pictures","desperate_characters":"Videotape cover","Plot":"Sophie and Otto Bentwood are a middle-aged, middle class, childless Brooklyn Heights couple trapped in a loveless marriage. He is an attorney, she a translator of books. Their existence is affected not only by their disintegrating relationship but by the threats of urban crime and vandalism that surround them everywhere they turn, leaving them feeling paranoid, scared, and desperately helpless. The film details their fragile emotional and psychological states as they interact with each other and their friends.","language":"English","Critical reception":"In his review in the New York Times, Vincent Canby said, \"I must confess that Desperate Characters left me, if not unmoved, then unenriched. It's as if its cheerlessness had been bottled straight, without the additive that transforms recognizable experience into art . . . In every respect, the screenplay is a vast improvement over Gilroy's Pulitzer Prize-winning The Subject Was Roses. Its literary style, however, is similar, and it's a style to which I . . . find it difficult to respond. His characters talk in great chunks of theatrical exchanges, and monologues, which not only deny the splendid accuracy of the situations and the settings, but also somehow make me suspicious of the integrity of the characters. This is especially true of the supporting characters, who are always telling us too much, remembering too many details out of the past, nudging us for sympathy and never letting us discover them at our own speed . . . I have a feeling that the director has perfectly served the writer. That is to say that Gilroy has realized the movie he intended to make. I wish I liked it more.\"[2]Roger Ebert of the Chicago Sun-Times described it as \"a terribly interesting and well-acted movie that does not deserve some of the criticism it's getting . . . Kenneth Mars offers a deeply felt, complex performance . . . Shirley MacLaine, as his wife, achieves one of the great performances of the year. She proves that we were right, when we saw her in films like The Apartment, to know that she really had it all, could go all the way with a serious role. Watching Miss MacLaine and Mars work together is enough to justify the movie, whatever you think of its urban paranoia.\"[3]TV Guide rates it 3½ out of a possible four stars and calls it a \"well-written if somewhat stagey character study [with] one of Maclaine's best performances.\"[4]Stanley Kauffmann of The New Republic called this \"a film of authenticity, of delicately realized intangibles: small-scale about large issues, truthful without settling for honest-to-God TV fact.\" He lists it as a \"top film worth seeing\" in late 1971. 9/25/71, Vol. 165 Issue 13, p24-34, 2p","cinematography":"Urs Furrer","production_company":"ITC Entertainment","directed_by":"Frank D. Gilroy","release_dates":"September 22, 1971 (1971-09-22)|||||","Production":"Sir Lew Grade had signed Shirley MacLaine to make a TV series Shirley's World. She asked Grade to fund the film which she did for minimal payment and a share of the profits; Grade agreed. He says the budget was so low he managed to recoup his money.[1]","produced_by":"Frank D. Gilroy","starring":"Shirley MacLaine","running_time":"97 minutes","edited_by":"Robert Q. Lovett","written_by":"Frank D. Gilroy Paula Fox","budget":"$250,000[1]"}