{"advantageous":"Theatrical release poster","country":"United States","distributed_by":"Netflix","Plot":"Set in the near future, Gwen (Jacqueline Kim) works as the face of the Center For Advanced Health And Living, selling people on cosmetic procedures. Despite her relatively affluent position in life she is working for below scale and is having difficulty sustaining the lifestyle she wants to ensure that her daughter, Jules, has a solid education and future. When she is abruptly let go from her job Gwen's optimism quickly dissolves as she realizes that the only offer she has for employment is as an egg donor as women are rapidly becoming infertile. The firing comes at a critical juncture in Gwen's life as she desperately needs money in order to ensure Jules's position at an elite school.Desperate, Gwen reaches out to her old employers asking Fisher (James Urbaniak) to use her as one of the first subjects to transfer her consciousness into a new body allowing her to keep her old job by becoming more youthful and racially ambiguous. Fisher assures her that if she agrees to the body transfer her daughter's future will be ensured as the Center will do everything they can to ensure Jules's future and protect Gwen as the face of the company. He also warns her that the procedure is in its infancy and for a year Gwen will have to take shots to help her breathe every two hours and will face pain that won't go away. He explains that the technology isn't there yet and begs her to not agree to have the procedure done.Before agreeing to do the procedure Gwen tries one last desperate measure. She reaches out to her cousin Lily and her husband Han (Ken Jeong) for help. Gwen and Han had an affair years ago and though Lily is forgiving of the affair her attitude changes once she learns that Gwen has a child fathered by Han. She explains to Gwen that they need more time to think about helping her especially considering the suddenness of the news, but Gwen tells her she has no time. Lily then tells Gwen that she and her husband cannot spare the money, as they have children of their own.Gwen breaks the news of her procedure to Jules, who seems understanding. Together they go to see Gwen's future body. After Christmas Gwen completes the procedure and returns home in a new body, Gwen 2.0 (Freya Adams). Though she is disoriented and in pain she does her work for the center well. Jules, warned that her mother might be slightly different, takes care of her and administers her shots when she has difficulty breathing. However Gwen 2.0 has trouble understanding and relating to Jules after the procedure. She goes to Fisher and tells him that she wants to separate from Jules, thinking Jules can take care of herself and she needs the time alone. Fisher is furious and reveals to Gwen 2.0 that she is not actually Gwen, but a twin that was implanted with Gwen's memories; he explained the twin process to her because he thought it would be easier for the twin Gwen to merge with the donor's memories if she didn't know. Gwen's original consciousness died during the procedure but she was willing to go through with it in order to assure her daughter's future. Gwen 2.0 is unaffected by the news and tells Fisher the part of Gwen that loved Jules did not transfer. When she returns home she tells Jules that her mother is dead. Jules initially hides the shot Gwen 2.0 needs in order to breathe but finally gives it to her. When she tells Gwen 2.0 she is not sure why she is alive, Gwen 2.0 reassures her that her kindness is unique to her. Jules tells her she sounds like her mother.Gwen 2.0 sees a message from Lily and Han where they apologize for their initial dismissal and tell her that they want to help her and Jules. Gwen 2.0 goes to their home and breaks the news about Gwen to them. Later she organizes a picnic where Jules can meet Han, Lily and their boys for the first time.","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 80% of 15 surveyed critics gave the film a positive review; the average rating is 6.6/10.[3] Metacritic rated it 59/100 based on nine reviews.[4] Dennis Harvey of Variety called it a \"thinking person’s sci-fi tale\" whose methodical pacing eventually slows down to a near-crawl.[5] Leslie Felperin wrote, \"Perhaps the perfect film for geeky women’s studies majors, this is bursting with interesting ideas and details but has some significant flaws\".[6] Manohla Dargis of The New York Times wrote, \"It’s a kick to see how effectively Ms. Phang has created the future on a shoestring even if she hasn’t yet figured out how to turn all her smart ideas into a fully realized feature.\"[7] G. Allen Johnson of the San Francisco Chronicle rated it 3/4 stars and wrote that \"the last half hour is so irresistibly creepy that it's sure to invoke discussion after the screening\".[8] Alan Scherstuhl of The Village Voice wrote that the film \"demands we consider just how much beauty-minded societies demand of women\". Because of its unconventional structure, Scherstuhl says it is likely to alienate viewers who are looking for a traditional story.[9] Kevin P. Sullivan of Entertainment Weekly rated it C and called it a \"missed opportunity\".[10] Mike D'Angelo of The Dissolve rated it 3/5 stars and wrote that despite the feature film adaptation's filler, fans of intelligent science fiction may be interested.[11] Diego Costa of Slant Magazine rated it 1.5/4 stars and wrote, \"Advantageous's visual effects are sophisticated for a low-budget film, and the acting is pleasantly realistic, but filmmaker Jennifer Phang portrays this very near future like a universe of such quietness and sterility that it's difficult to care about its inhabitants.\"[12]","cinematography":"Richard Wong","production_company":"Good Neighbors Media D.K. Entertainment I Ain't Playin' Films","directed_by":"Jennifer Phang","release_dates":"January 26, 2015 (2015-01-26) (Sundance Film Festival)|June 23, 2015 (2015-06-23) (United States)||||","produced_by":"Robert M. Chang|Ken Jeong|Jacqueline Kim|Moon Molson|Theresa Navarro|","starring":"Jacqueline Kim|James Urbaniak|Freya Adams|Ken Jeong|Jennifer Ehle|Samantha Kim|","running_time":"90 minutes","music_by":"Timo Chen","edited_by":"Sean Gillane|Jennifer Phang|","Release":"The film premiered at the Sundance Film Festival on January 26, 2015.[1] The film was released exclusively to Netflix on June 23, 2015.[2]","written_by":"Jacqueline Kim|Jennifer Phang|"}