{"country":"United Kingdom","Plot":"Captain S Melly (Kenneth Connor) is put in charge of an experimental mixed-battery during the darkest days of the Second World War. It is a relief for Captain Bull (David Lodge) to greet his relief but Melly is not prepared for the ball-squeezing Sergeant Major \"Tiger\" Bloomer (Windsor Davies) and the randy antics of Bombardier Ready (Jack Douglas), Sergeant Tilly Willing (Judy Geeson) and Sergeant Len Able (Patrick Mower). Forever feigning illness or hiding in their underground \"snoggery\", the troops are happily getting to grips with each other rather than the enemy. Most prominent of the females is Private Alice Easy (Diane Langton) who tries to charm her new commanding officer but only succeeds in propelling her top button into his system! Private Jennifer Ffoukes-Sharpe (Joan Sims) pines for \"Tiger\" while everybody – including little Gunner Shorthouse (Melvyn Hayes) – gets a piece of the action. Even after a tip-off to the medical officer, Major Butcher (Julian Holloway) segregation and rigorous training, the unit is still a shower. However, an inspection by the cowardly Brigadier (Peter Jones) and Major Carstairs (Peter Butterworth) is interrupted by an airborne attack and Melly's troop finally prove they are real British bulldogs.","language":"English","cinematography":"Ernest Steward","directed_by":"Gerald Thomas","release_dates":"October 1976","Production":"This film featured few established members of the Carry On team. Carry On regular Kenneth Connor played a leading role, but the only other long-time regulars present, Joan Sims and Peter Butterworth, had only small roles.Windsor Davies, who had joined the series with a main role in the preceding film Carry On Behind, again plays a major role. Other main roles are played by established and recognisable actors Judy Geeson and Patrick Mower, both newcomers to the Carry On films.The film was originally certified AA by the then British Board of Film Censors which would have restricted audiences to those aged fourteen and over, but was cut down to the non-age limited A certificate by heavily toning down the scenes featuring topless nudity and removing one comic use of the word fokker. However it still proved to be a major commercial failure and was withdrawn from some cinemas after just three days.[1]","produced_by":"Peter Rogers","starring":"Kenneth Connor Windsor Davies Patrick Mower Judy Geeson Jack Douglas Joan Sims Peter Butterworth Melvyn Hayes Peter Jones","running_time":"89 min.","carry_on_england":"Original UK quad poster","Filming and locations":"Interiors:Exteriors:","music_by":"Max Harris","edited_by":"Richard Marden","written_by":"David Pursall Jack Seddon","budget":"£250,000"}