{"country":"United States","distributed_by":"Universal Pictures","Plot":"In the 1970s, in France, an American couple, former dancer Vanessa and her husband Roland, a successful writer, have been married 14 years. They drive to a coastal hotel. Roland wants to write a story while staying there. The two are barely on speaking terms; Vanessa is withdrawn and grieving for an unknown reason. Roland appears to drink too much and seems unhappy that Vanessa is no longer interested in him sexually.Roland becomes friendly with the hotel owner, an older man still grieving his much-loved late wife, but who carries on, cheerfully accepting what life has given him. Vanessa watches a local fisherman who goes out every day on the out-going tide and returns on the incoming one, catching few fish, but contented.Vanessa and Roland strike up a friendship with an attractive young couple staying in the room next to them. Soon after, they discover that the wall between their two rooms has a disused radiator pipe hole, enabling them to watch the couple in their bedroom talking and having sex.Gradually their experiences at the hotel enable Vanessa and Roland to start patching up their relationship. However, Vanessa has a liaison with the young husband in the next room, seriously damaging the relationship between the young couple, and triggering a confrontation with Roland, during which he tells her that if she wishes to hurt him, she should just go ahead and hurt him physically. Roland asserts that her seduction of the husband was motivated by his wife's revealing that she was pregnant, and demands an admission.Roland is able to finish writing a new book. It seems that the young couple may be able to work their way through the episode of cheating, and come out stronger on the other side. As Vanessa and Roland leave the hotel and drive away, it is learned that two miscarriages caused Vanessa's lasting grief and withdrawal. However, she and Roland appear to be more reconciled.","language":"English|French|","Reception":"By the Sea opened theatrically in ten venues, earning $96,250, ranking number 38 in the domestic box office.[15] As of December 10, the film has grossed $538,460 in the United States and Canada, and $2,796,467 overseas for a worldwide total of $3,334,927.[2]The film received mixed to negative reviews from critics. On Rotten Tomatoes, the film holds a rating of 33%, based on 135 reviews, with an average rating of 4.8/10. The site's consensus reads, \"By the Sea may intrigue celebrity voyeurs or fans of a certain type of arthouse cinema, but for most viewers, its beauty won't be enough to offset its narrative inertia.\"[16] On Metacritic, the film has a score of 44 out of 100, based on 34 critics, indicating \"mixed or average reviews\".[17] Justin Chang, Chief Film Critic for variety.com said: \"By the Sea always offers something to tickle the eye and ear, even as it leaves the heart and mind coolly unstirred.\"[18]","box_office":"$3.3 million[2]","cinematography":"Christian Berger","production_company":"Jolie Pas Plan B Entertainment","directed_by":"Angelina Jolie Pitt","by_the_sea":"Theatrical release poster","release_dates":"November 5, 2015 (2015-11-05) (AFI Fest)|November 13, 2015 (2015-11-13)||||","Production":"In May 2014, it was announced that Angelina Jolie would co-star with Brad Pitt in a film titled By the Sea, to be written and directed by Jolie.[3] The Hollywood Reporter speculated it would be a relationship drama that Jolie wrote several years ago, centering on a couple with issues who take a vacation in a last-ditch effort to save their marriage.This was the first cinematic collaboration between the two since Mr. & Mrs. Smith (2005).[4] Prime Minister Joseph Muscat of Malta confirmed the project, stating that it would be partially filmed at Mġarr ix-Xini.[5][6]Jolie has stated that the film \"at its core, is about grief\" further noting that the loss of her mother in 2007 caused a great deal of sadness for her.[7] To that end, the movie resembles movies of the 1960s and 70's; Jolie stated that her mother \"loved films of that period\" [7] Christian Berger is the cinematographer; he used mostly natural light throughout filming,[8] while Jon Hutman is the production designer.[9] Principal photography and production began on August 19, 2014, in Gozo, Malta, and ended on November 10, 2014.[10][11]","produced_by":"Angelina Jolie Pitt|Brad Pitt|","starring":"Brad Pitt|Angelina Jolie Pitt|","running_time":"122 minutes[1]","music_by":"Gabriel Yared","edited_by":"Martin Pensa|Patricia Rommel|","Release":"In May 2015, the film was slated for a November 13, 2015 release.[12]Stills from the film were released on September 15, 2014.[13] On August 6, 2015, a teaser trailer for the film was released.[14]By the Sea was release on DVD & Blu-ray in the United Kingdom on April 18, 2016. It was later released in Australia on June 9, 2016, and it's release in Canada and United States on July 5, 2016.","written_by":"Angelina Jolie Pitt","budget":"$10 million[2]"}