{"country":"United States","distributed_by":"Rogue Pictures","Box office and critical reception":"The film grossed $11,718,595 in the United States and an additional $333,329 overseas, giving the film a total gross of $12,051,924; based on a $3 million budget, the film was a moderate success.[5] Rotten Tomatoes reported that 92% of critics gave positive reviews based on 124 reviews with an average score of 7.7/10. The general consensus is \"Dave Chappelle's Block Party is a raucous return to the spotlight for the comic. Buoyed by Chappelle's witty, infectious humor and outstanding performances from some of the more socially conscious artists in hip-hop like Mos Def, Kanye West, the Roots, and (will wonders never cease?) the reunited Fugees, this documentary/concert film is a joyous experience. With an appealing mix like that, who doesn't want to attend this Party?\"[6] Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, the film has received an average score of 84 based on 30 reviews.[7] The DVD has sold a total of 1,240,405 copies since 2006, grossing a total of $18,776,445.[8]","Plot":"The film follows Chappelle during the summer of 2004, up until September 18, 2004, when he threw a block party on the corner of Quincy Street and Downing Street in the Clinton Hill neighborhood of Brooklyn, New York City. The film features nearby sites including the Broken Angel House in Clinton Hill, Brooklyn as well as areas in Fort Greene, Brooklyn and Bedford-Stuyvesant, Brooklyn. The film was produced before Chappelle's highly publicized decision to walk away from a $50 million deal to continue his hit Chappelle's Show, and gained prominence after the announcement.He invited several hip hop and neo-soul musical artists to perform at the party, including Kanye West, Mos Def, Jill Scott, Erykah Badu, and The Roots along with The Central State University Marching Band. Lauryn Hill was also scheduled to perform at the party, but since Columbia Records refused to release her songs for use in the production, she decided instead to reunite The Fugees for the occasion. In addition, Chappelle performed comedy monologues and sketches in between the musical acts.","language":"English","box_office":"$12 million[2]","cinematography":"Ellen Kuras","production_company":"Bob Yari Productions","directed_by":"Michel Gondry","dave_chappelle's_block_party":"Promotional poster","Soundtrack":"A compilation of \"music from and inspired by\" the film was released on March 14, 2006.[4]The album was released by Geffen Records, and produced by Corey Smyth for Blacksmith Music Corp and Questlove.All the songs were recorded live in concert, except \"Born & Raised\", an exclusive new studio track from Mos Def and Talib Kweli's Black Star. Many performances, including The Fugees' reunion performance, could not be included due to legal restraints with the groups' record labels.Chappelle's version of Thelonious Monk's \"'Round Midnight\" was featured in the film, but was not released on the compilation.Cody chesnuTT was featured in the film with his song ″Parting Ways″ among others, was not released on the compilation but is shown on the end credits.","release_dates":"September 12, 2005 (2005-09-12) (Toronto International Film Festival)|March 3, 2006 (2006-03-03) (United States)||||","produced_by":"Dave Chappelle Michel Gondry","starring":"Dave Chappelle","running_time":"103 minutes","music_by":"Corey Smyth","written_by":"Dave Chappelle","budget":"$3 million[1]"}