{"Cast":"Lead elves voiced by Sanjeev Bhaskar, Robbie Coltrane, Joan Cusack, Rhys Darby, Jane Horrocks, Iain McKee, Andy Serkis, and Dominic West.","country":"United Kingdom United States","distributed_by":"Columbia Pictures","story_by":"Sarah Smith (uncredited)","Plot":"On Christmas Eve, hundreds of Christmas elves helm the command centre of Santa Claus's mile-wide,[6] ultra–high-tech sleigh-esque craft, the S-1. The current Santa (Malcolm) and the Christmas elves deliver presents to every child in the world using advanced equipment and military precision. These complex operations are micromanaged by Malcolm's oldest son Steve and his obsequious elfin assistant Peter (among thousands of more elves) at mission control underneath the North Pole, while Steve's clumsy and panophobic younger brother Arthur answers the letters to Santa. During a delivery operation, when a child wakes up and almost sees Malcolm, a Christmas elf back in the S-1 inadvertently presses a button, causing a present to fall off a conveyor and go unnoticed.Having completed his 70th mission, Malcolm is portrayed as far past his prime and whose role in field operations now is largely symbolic. Nonetheless, he is held in high esteem, and delivers a congratulatory speech to the enraptured elves. Much to Steve's frustration, who has long anticipated succeeding his father, Malcolm announces he looks forward to his 71st. During their family Christmas dinner, Arthur's suggestion for the family to play a board game degenerates into a petty quarrel between Malcolm and Steve, while Malcolm's father and predecessor Grandsanta, bored by retirement, resentfully criticises their over-modernization. Distraught, the various family members leave the dinner table. When Arthur humbly compliments Steve that he believes he will be a great Santa Claus, Steve rudely dismisses Arthur's overture. Later, their father shares with his wife Margaret his grave doubts about his self-identity should he retire.Meanwhile, a Christmas elf named Bryony finds the missed present—a wrapped bicycle that has yet to be delivered—and alerts Steve and Peter to the problem. Arthur is alarmed when he recognises the present as a gift for Gwen, a little girl whose letter he had personally replied to. Arthur alerts his father, who is at a loss as to how to handle the situation; Steve argues that one missed present out of billions is an acceptable error whose correction can wait a few days. Grandsanta on the other hand, apparently learning of the dire situation, proposes delivering the gift using Eve, his old wooden sleigh, and the great-great-grandchildren of the original eight reindeer, forcefully whisking away a reluctant Arthur and a stowaway Bryony. They get lost in three different continents, lose several of their reindeer, and land in danger several times, ultimately being mistaken for aliens and causing an international military incident. Through all this, Arthur eventually learns, to his compounding disappointment, that Grandsanta's true motive is to fulfill his ego, that Steve refuses to help them out of petty resentment and possibility of his brother being made hero overshadowing his work, and that his own father has gone to bed, apparently content even though a present was not delivered.Finally, stranded in Cuba after losing the sleigh and the remaining reindeer, Arthur renews his sense of purpose—that it all comes down to having presents delivered, regardless of how it is done and who did it—and with Grandsanta's and Bryony's help manages to recover the sleigh. Meanwhile, the elves grow increasingly alarmed at rumours of this neglected delivery and the Clauses' unthinkable indifference, sending them into a panic. In response, Malcolm, Margaret, and Steve take the high-tech sleigh-craft to deliver a superior present—to the wrong child.In the meantime, Arthur and his party lose the remaining reindeer and a US Predator drone scrambled by Chief De Silva of UNFITA intercepts and opens fire on them thinking that they were aliens, causing Arthur to bail out of the sleigh, via parachute. Ultimately with Margaret and Bryony's help, all the male Clauses arrive at Gwen's house before she awakens, only to have all but Arthur quarrel about who gets to actually place the gift. Noticing that only Arthur truly cares about the girl's feelings, the elder Clauses collectively realise that he is the sole worthy successor. As a result, Malcolm gives Arthur the honour and Steve, upon learning of his own errors, acknowledges that his brother is the worthy Santa instead of him and forfeits his supposed birthright to his brother. In a fitting conclusion, Gwen glimpses a snow-bearded Arthur in a wind-buffeted sweater just before he vanishes up into the S-1.With the crisis resolved, Malcolm goes into a happy retirement with Margaret; he also becomes Grand-Santa's much-desired new companion and plays Arthur's board game with him for many happy hours. Meanwhile, Steve finds true contentment as Chief Operating Officer while Bryony is promoted to Vice-President of Packing, Pacific Division. In a nod to traditionalism once neglected, the high-tech S-1 is re-christened EVIE in honour of Grandsanta's old sleigh and refitted to be pulled by a team of five thousand reindeer—led by the original eight, all of whom managed to return safely via innate navigational abilities. Finally, Arthur happily guides the entire enterprise in the proper spirit as the new Santa.","arthur_christmas":"Theatrical release poster","language":"English","Reception":"Arthur Christmas received generally positive reviews, praising its fresh take on the Christmas premise. Review aggregator, Rotten Tomatoes, reports that 92% of critics gave the film positive reviews, earning a \"Fresh\" rating. The site's consensus reads: \"Aardman Animations broadens their humor a bit for Arthur Christmas, a clever and earnest holiday film with surprising emotional strength.\"[5] The film won a Golden Tomato Award at the 13th Golden Tomato Awards as the best reviewed animated film of 2011.[17] On Metacritic, another review aggregator, the film holds a score of 69 based on 32 reviews.[18]John Anderson from Newsday praised the film, saying, \"The results are not only funny and fresh, but represent a new way of tackling the whole yuletide paradigm: Santa as a high-tech hereditary monarchy.\"[19] Michael O'Sullivan of The Washington Post also wrote a positive review, saying that it is \"unexpectedly fresh, despite the familiar-sounding premise\".[20] Neil Genzlinger of The New York Times wrote that \"the plot may be a little too cluttered for the toddler crowd to follow, but the next age group up should be amused, and the script by Peter Baynham and Sarah Smith has plenty of sly jokes for grown-ups.\"[21] One of the few negative reviews came from Rene Rodriguez of The Miami Herald, who thought that \"the movie fails utterly at coming up with a story that merits all the eye candy.\"[22]Arthur Christmas has earned $46,462,469 in North America,[3] $33,334,089 in the UK,[23] and $67,622,914 in other countries, for a worldwide total of $147,419,472.[3]In the United Kingdom the film opened in second place with a £2.5 million weekend gross, behind Immortals. It topped the box office in its fourth week, by which time the cumulative gross was £11.5 million. The film returned to the top of the box office on week seven, during Christmas Week, grossing £2.05m and a total of £19.7m.[24]In the United States and Canada the film earned $2.4 million on its opening day and $1.8 million on Thanksgiving Day. It would go on to gross $12.1 million over the three-day weekend and $16.3 million over the five-day. This was on par with studio expectations. The film went on to gross nearly $50 million domestically against a $100 million budget.[25][26]","box_office":"$147 million[3]","cinematography":"Jericca Cleland","production_company":"Aardman Animations Sony Pictures Animation","directed_by":"Sarah Smith","Video game":"An iOS video game titled Arthur Christmas: Elf Run was released in the United Kingdom on 9 November 2011, on iTunes App Store.[39] On 18 November 2011, the game was released worldwide on the iOS and Android platform.[40] Released as a free and a premium version, the game allows players to play as delivery elves, who must quickly and quietly deliver gifts to children. Another iOS app based on the film is Arthur Christmas Movie Storybook, which was released on 30 November 2011.[41]","Soundtrack":"Arthur Christmas: Original Motion Picture Soundtrack is the soundtrack to the film of the same name. It was composed by Harry Gregson-Williams and released on 14 November 2011 by Sony Classical.[38] Originally, Michael Giacchino and Adam Cohen were going to compose the score.[4]","release_dates":"11 November 2011 (2011-11-11) (United Kingdom)|23 November 2011 (2011-11-23) (United States)||||","Production":"Arthur Christmas was first announced in 2007, under the name Operation Rudolph.[9][10] It was the first film made by Aardman in partnership with Sony Pictures Entertainment and its subsidiaries.[11]Aardman spent 18 months on pre-production on the story and design in the UK before relocating to Sony's Culver City, US, for another 18 months of production.[12] On 27 April 2009, it was reported that the production had begun with Aardman and Sony Pictures Imageworks working together on animation.[13]","produced_by":"Steve Pegram","starring":"James McAvoy Hugh Laurie Bill Nighy Jim Broadbent Imelda Staunton Ashley Jensen","running_time":"97 minutes[1]","music_by":"Harry Gregson-Williams","edited_by":"John Carnochan James Cooper","Release":"The film was released on 11 November 2011 in the United Kingdom and on 23 November 2011 in the United States.[4] The music video for Justin Bieber's song Santa Claus is Coming to Town, which plays over the end credits, was exclusively shown in theatres before the film.[14]Arthur Christmas was released on DVD, Blu-ray and Blu-ray 3D on 6 November 2012, in the US,[15] and 19 November 2012 in the UK.[16]","written_by":"Peter Baynham Sarah Smith","budget":"$100 million[2]"}