{"based_on":"Dylan Dog  by Tiziano Sclavi","dylan_dog:_dead_of_night":"Theatrical release poster","country":"United States","distributed_by":"Freestyle Releasing","Plot":"In New Orleans, Dylan Dog, an ace detective whose specialty is paranormal cases, narrates how he helped people with their cases until his wife, Cassandra, was killed by vampires. Since then he has been doing regular cases with his \"partner\", Marcus Deckler.One night, when teenager Elizabeth Ryan calls her father, without getting an answer, she goes to her father's room and finds him dead on the floor. She is then surprised, and almost attacked, by a strange, hairy, creature. The next day, Dylan is informed, by Marcus, that Elizabeth asked for (and later hires) him. When Dylan interrogates her, she explains that he is the only one that can help her and shows to him a card (that is his old detective card) that says \"No pulse?, No problem\". Dylan sees it, stands up and goes out, stating that he doesn't \"do that\" any more, followed by Marcus.That night Marcus is attacked and killed by an unknown creature (who Dylan thinks is the same creature that killed Elizabeth's father). Dylan decides to officially help Elizabeth with her case. He takes his old, but helpful, case and rides to Elizabeth's house. After taking and analyzing a hair sample, he tells Elizabeth that the creature that killed her father is a female, eighteen- to nineteen-year-old werewolf, who is a member of the Cysnos werewolf family. Dylan visits the Cysnos family leader, Gabriel, who has a past related to Dylan's activities, and realizes that Gabriel's 19-year-old daughter Mara might be his main suspect, an idea that Gabriel hates. After he is told off by Gabriel, Dylan is attacked by Gabriel's older son Wolfgang who is then knocked unconscious by Dylan (who was using a silver gauntlet).Dylan then finds Mara dead in a warehouse and is briefly attacked by an unknown vampire. He then goes to Elizabeth in order to determine what connections may exist between those involved. She shows him a book of artifacts her father imported and indicates that one of the items pictured is now missing after having been smuggled into the country. The same vampire from earlier attacks Dylan and Elizabeth at her home along with two others demanding \"The Heart.\" Dylan fends them off long enough for them to make an escape and continue the investigation.Dylan then goes to the morgue (which is run by zombies) to see Marcus's wound and discovers that Marcus has been turned into a zombie (and he also has a missing arm). Marcus is shocked and surprised but he accepts his condition. When they go for a new arm, Dylan talks with the owner and is informed that the vampires, led by Vargas, are after an artifact known as \"The heart\". Dylan then goes to the Corpus House, a nightclub owned by Vargas. He talks to Vargas, who denies being involved with the murders and tells Dylan to go while he still lets him to do so.Dylan then visits his old vampire friend, Borelli. Borelli tells Dylan that the artifact known as \"The heart\" is called \"The heart of Belial\", a cross-like relic that holds the blood of Belial, an ancient monster who cannot be killed unless his/her master is destroyed. After he finds the heart in the tomb of vampire elder known as Sclavi, Dylan is ambushed by Vargas' men. After he awakens, Vargas traps him and Marcus inside the crypt, and takes the Heart. After Marcus digs himself out and releases Dylan, the duo goes after Vargas who has taken Elizabeth to the Corpus House. Vargas reveals to Elizabeth that he intends to turn her into a vampire and inject the blood of Belial into her. Dylan enters the Corpus House and finds that both Vargas and Elizabeth are gone.On his way to find Elizabeth and Vargas, Dylan realizes that Elizabeth is the real enemy and wants to turn Vargas into Belial as a revenge for her father's murder. She tells him that the reason is not revenge, instead she says that they are the \"good guys\" and the undead (vampires, werewolves, zombies, etc.) must pay. Dylan says that she is wrong and that she is the monster. She injects the blood into Vargas's body and escapes, but before she can do so she is attacked by Marcus who is knocked down by her. Dylan fights off Belial (who is slowly taking over Vargas's body) when Elizabeth tries to stop Belial from killing Dylan, claiming he should do as she says because she is its master. Belial states the anyone who stops him, including his master, is his enemy. After knocking her away, Belial continues after Dylan while Elizabeth escapes while Wolfgang (who was called by Dylan before the battle) and his werewolf allies attack Elizabeth. They manage to subdue and kill Elizabeth, and at the same time Belial dies in front of Dylan leaving Vargas's unconscious body. Dylan gives the heart to Wolfgang, the only one that Dylan can trust to protect it, and goes with Marcus.Finally, Dylan decides to revive his paranormal detective agency. Using copies of the same card that Elizabeth gave him earlier, calling Marcus \"partner\"; something that Marcus had wanted for a long time.","language":"English Italian","Reception":"The film grossed $4 million worldwide ($1.2 million domestically) on a $20 million production budget.Dylan Dog: Dead of Night was panned by critics. The film currently holds an 8% \"rotten\" rating on review aggregate website Rotten Tomatoes with a consensus stating the film is \"an uninspired, feebly-acted horror/comedy that produces little scares and laughs.\"[6] Luca Raffaelli of la Repubblica, said \"it's a good B-movie inspired by a great top-league European comic\", and pointed out that the character of Brandon Routh \"is hollow\" while the original comic character \"uses the horror to talk about modern society's problems\".[7] Roberto Castrogiovanni (www.Movieplayer.it) tries not to compare the movie to the original comic, but states that \"not everything is perfect\", and the biggest problem is \"the original plot and the development of the screenplay\": the plot is predictable, dialogues contain the usual stereotypes, and the main character is just the usual American action-man.[8] Federica Aliano (www.Film.it) heavily criticized the movie, saying \"it's far worse than any bad expectation\", and highlighted the big difference with the original comic: \"the mature feeling of Tiziano Sclavi's masterpiece could never be achieved by using splatter and beautiful images, but by using psychological introspection and by projecting into reality the nightmares and fears of characters and readers\".[9] Federico Gironi (Coming Soon Television) refers to the film without comparing it to the original comic, and notes many similarities with Underworld, Buffy the Vampire Slayer, and True Blood, which make the film \"like baby food, good for an extremely young target [audience] without a deep critical edge\", although the director \"avoids disappointing the audience and gets a couple of good gags [in]\".[10] The film was also negatively received by Marco Lucio Papaleo (www.Everyeye.it), who gave it an overall score of 5 out of 10: \"Technically Dylan Dog: Dead of Night is not bad, and sometimes even interesting. But it is not Dylan Dog. And even if all the names were changed, it would just be a nice movie, but actually [one] already seen and useless.\"[11]","box_office":"$4,634,062[2]","cinematography":"Geoffrey Hall","production_company":"Hyde Park Entertainment Long Distance Films Platinum Studios Prana Studios","directed_by":"Kevin Munroe","release_dates":"March 16, 2011 (2011-03-16) (Italy)|April 29, 2011 (2011-04-29) (United States)||||","Production":"The film was produced by independent film companies Platinum Studios and Hyde Park Entertainment, distributed by Freestyle Releasing, and directed by Kevin Munroe. It starred Brandon Routh, Sam Huntington, Anita Briem, Peter Stormare, and Taye Diggs. This was the second time Routh and Huntington co-starred in a film together, the previous film being Superman Returns.","produced_by":"Gilbert Adler Scott Mitchell Rosenberg","starring":"Brandon Routh Sam Huntington Anita Briem Peter Stormare Taye Diggs","running_time":"108 minutes[1]","music_by":"Klaus Badelt","edited_by":"Paul Hirsch","Release":"The film was released in the United States and Canada on April 29, 2011.[4] The film was released in Italy on March 16, 2011. The world premiere took place on March 15.[5]","written_by":"Thomas Dean Donnelly Joshua Oppenheimer","budget":"$20 million[2]"}