{"Cast":"Schroeder, Pig-Pen, Frieda, Violet, Patty, Babette, and Jacques appear but had no lines.","country":"United States","distributed_by":"Paramount Pictures","Plot":"The story begins with Linus introducing to his class two French students named Babette and Jacques, who will be spending two weeks at Charlie Brown's school in order to get accustomed the United States. In exchange Charlie Brown, Linus, Peppermint Patty, Marcie, Snoopy and Woodstock head to Europe on a student exchange plan for part of the school year. Charlie Brown is not very positive about the trip because of a letter from France that arrived before he left, inviting him to stay at a French chateau, the Château du Mal Voisin (Chateau of the Bad Neighbor). The letter is written in French, but Marcie, who has been studying French, translates it.They arrive first in London, where Snoopy leaves the group temporarily to play tennis at Wimbledon. When they arrive across the English Channel in France, they pick up a troublesome rental car, which must be driven by Snoopy as none of the others have a drivers' licence. (Neither does Snoopy, but nobody questions that.)Upon their arrival, the four go to their respective homes. Patty and Marcie go to stay at a farm, where they meet a boy named Pierre, who immediately attracts their attention. It's obvious that Marcie and Pierre have a spark between them - obvious to everyone except Patty, who manages to convince herself that Pierre likes her. Charlie Brown, Linus, and Snoopy go to the chateau, which they find is apparently abandoned, though somebody keeps leaving food for them and making their beds after they leave for school. (In fact, during their first night, they went to sleep covering themselves in clothing from their luggage, but woke up with pillows, blankets and a breakfast laid out for them.) In reality, the chateau is occupied by an unfriendly baron, and the person leaving Charlie Brown and Linus food is the baron's kindly niece, Violette.Eventually Linus manages to track her down and demand what is going on. Violette says that although her uncle is mean spirited, she must remember what a US Army soldier had done for her family by helping them out in the Second World War. Violette shows Linus a picture of the soldier, and he comments that the soldier looks like Charlie Brown and it's revealed that the soldier is Charlie Brown's grandfather. They continue to investigate further, the mystery culminating in an accidental fire in the attic of the chateau, doused before too much damage occurs.At the end of the movie the Baron, thankful they saved the chateau, has a change of heart and allows the gang inside, and Charlie Brown learns the truth behind the mysterious letter he received, and he, Snoopy, Linus, Patty and Marcie leave their new friends to see more of the French countryside, and eventually return home to the US.","bon_voyage,_charlie_brown_(and_don't_come_back!!)":"Theatrical release poster","language":"English","box_office":"$2 million[1]","directed_by":"Bill Melendez|Phil Roman|","production_companies":"Bill Melendez Productions Lee Mendelson Film Productions United Feature Syndicate","release_dates":"May 30, 1980 (1980-05-30)|||||","produced_by":"Bill Melendez|Lee Mendelson|","starring":"Arrin Skelley|Daniel Anderson|Patricia Patts|Casey Carlson|Annalisa Bortolin|Laura Planting|Bill Melendez|","running_time":"76 minutes","music_by":"Ed Bogas|Judy Munsen|Additional:|Doug Goodwin|","edited_by":"Roger Donley|Chuck McCann|","written_by":"Charles M. Schulz"}