{"based_on":"Friend by Diana Henstell","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Bruce Joel Rubin","Plot":"Teenage science genius Paul Conway (Matthew Laborteaux) and his single mother Jeannie (Anne Twomey) move into their new house in the town of Welling. He soon becomes friends with newspaper delivery boy Tom Toomey (Michael Sharrett). Living next door to Paul is the beautiful Samantha Pringle (Kristy Swanson) and her abusive, alcoholic father Harry (Richard Marcus). Paul built a robot named BB (Charles Fleischer), which occasionally displays autonomous behavior, such as being protective of Paul. Paul, Jeannie, and BB meet Paul's professor, Dr. Johanson (Russ Marin), at Polytech, a prestigious university Paul has a scholarship at. Dr. Johanson gives them a tour of the new laboratory Paul will have access to.While Tom helps Paul teach BB how to deliver newspapers, they stop at the house of reclusive harridan Elvira Parker (Anne Ramsey), who threatens the boys with a double-barreled shotgun and expresses instant dislike for BB. Walking away, the three encounter a motorcycle gang led by bully Carl (Andrew Roperto). When Carl intimidates Paul by pushing him into garbage, BB assaults him by grabbing his crotch. The gang rides away with Carl vowing revenge.Paul, Samantha, Tom, and BB begin to develop a close friendship, much to Harry's annoyance. One day, while playing basketball, BB accidentally tosses the ball onto Elvira's porch. She stomps out of her house and takes the ball, refusing to give it back, with BB taking note of Elvira's hostile attitude. On Halloween night, Samantha comes over with a bloody nose (presumably from her father's abuse) and asks for ice. Samantha goes out with Paul, Tom, and BB. Tom decides to pull a prank on Elvira. BB unlocks her gate and Samantha rings her doorbell. When alarms go off, they hide in a shrubbery nearby. When Elvira sees BB standing near her porch, she shoots him with her shotgun without hesitation, destroying him. Paul is devastated by the loss of his robotic friend.On Thanksgiving Day, Samantha joins Paul and Jeannie for dinner. Afterwards, Paul and Samantha share their first kiss. Samantha returns home late at night, outraging her father. He punches her and pushes her down the stairs. At Polytech's hospital, Paul learns that Samantha is now brain-dead and will also be on life support for 24 hours, after which the plug will be pulled. As BB's microchip can interface with the human brain, Paul decides to use it to revive Samantha. The boys enter the hospital using the key taken from Tom's father, who works as a security guard there. After Tom deactivates the power from the basement, Paul takes Samantha to his lab. He inserts the microchip into Samantha's brain and takes her back to his house, hiding her in the shed. After he activates the microchip, Samantha \"wakes up\", but her mannerisms are completely mechanical, suggesting BB is in control of her body.The police arrive at Samantha's home and inform Harry that her body has disappeared. In the middle of the night, Paul finds Samantha staring at the window, looking at her father, and he deactivates the microchip. The next morning, Paul awakens and finds Samantha gone. He searches for her in the street to no avail. Samantha goes back to her house and down the cellar. When Harry finds the cellar door open and goes downstairs, she attacks him, breaks his wrist and snaps his neck. Paul finds Samantha and Harry's corpse in the cellar. Horrified, he hides the body, takes Samantha back to his home and locks her in his bedroom. At night, Samantha breaks into Elvira's house and attacks her by throwing her at the wall of her living room. As a terrified Elvira screams for her life, Samantha kills her by throwing the basketball she stole from Tom at her head, causing it to explode. Elvira's headless corpse then walks around the living room until it collapses.When Tom learns of Samantha's rampage, he and Paul get into a fight. Tom threatens to call the police and end this once and for all. Still being protective of Paul, Samantha jumps out the attic window and attacks Tom, with Paul and Jeannie intervening. Trying to get her under control, Paul slaps Samantha, which results in her trying to strangle him. Samantha then lets him go and runs away. As Paul goes after her, he again encounters Carl, who gets into a fight with him. Samantha goes back for Paul, grabs Carl and throws him at an incoming police car, the impact killing him. She runs back to Paul's shed, where Paul comforts her and realizes she's regaining some of her humanity. However, the police arrive with their weapons pointed at Samantha, who yells out Paul's name in her human voice. She runs towards him, trying to protect him, with Sergeant Volchek (Lee Paul) thinking she's trying to attack him and shooting her. She says Paul's name one more time before dying in his arms.Later at the morgue, Paul tries to steal Samantha's body once more, not having learned his lesson. Suddenly, Samantha grabs Paul's neck and her face rips apart, revealing a terrifying variant of BB's head. Her skin strips away, revealing half-robotic bones underneath. With a robotic voice, Samantha tells him to come with her. When Paul refuses, she snaps his neck off-screen, killing him.","language":"English","Critical reception":"The film was panned by critics. AllMovie gave the film a generally negative review, writing, \"It's an intriguing combination of elements, but the end result is a schizoid mess\", calling Craven's direction \"awkward\" and opining that it \"lacks the intense, sustained atmosphere of his previous horror hits.\"[26] The film currently has a 0% \"rotten\" rating on Rotten Tomatoes, and was a bomb at the box office, grossing $8,988,731 in the U.S. on an $11 million budget.Although a critical and financial failure, over the years, Deadly Friend has been regarded by some as a cult classic and has garnered a fan following.[2]","box_office":"$8,988,731 (US)[1]","cinematography":"Philip H. Lathrop","directed_by":"Wes Craven","deadly_friend":"Theatrical release poster","Original version and deleted scenes":"According to the book Wes Craven: The Art of Horror by John Kenneth Muir, Craven's original cut of the film was \"a teenage film filled with charm, wit, and solid performances by likeable teens Swanson and Laborteaux. It was definitely a mainstream, PG film all the way, similar in tone to Real Genius or Short Circuit, but the point was made that Craven could direct something other than double-barreled horror.\"[21]The original cut of the movie did not include the gory dream sequences, the infamous basketball decapitation sequence, the opening jump scare scene at the beginning of the film where the thief tries to steal from Jeannie's minivan but BB stops him by grabbing his throat, and the ending where Samantha turns into a robot and kills Paul. All of these scenes were added because of script re-write demands and re-shoots forced by Warner Bros. executives, former Warner Bros. executive vice president Mark Canton, and the producers.[22]In original cut of the film, Sam smashes Elvira through her front door leaving the upper half of her body hanging outside the door and the lower half still inside. In Bruce Joel Rubin's original script drafts, Elvira is electrocuted by Sam. In the scene where Elvira's body is carried out on a gurney, it's still visible that her has a big hole which was made in her original death scene. Dialogue said by a neighbor character where he says that her head is all over the walls in her house is heard off-screen, meaning that it was most likely added later when the scene was changed. Parts of the original death scene can be seen in theatrical trailer. Promotional stills, lobby cards, and other pictures show more deleted scenes, all of which show more of the character and plot-centric parts removed from the final cut for reasons such as pacing and story changes following re-shoots and re-editing. An article by Joseph Maddrey, \"Deadly Friend: An Autopsy\", goes into more detail regarding the troubled production of the film.[23]The back cover of Warner Bros.' Twisted Terror DVD release shows a still of a ghostly-looking Samantha wearing a white dress. This is one of few stills revealing the original ending, where after Samantha gets shot by the police, Paul dreams she's in his room saying goodbye to him. Other stills of this ending have been confirmed to exist but they're very rare, although one can be seen on a fansite dedicated to actress Kristy Swanson.[24]Due to the all of the gore scenes that were added into the film and also because of Craven's bad history with the MPAA, they gave the film an X rating. It had to be cut and submitted thirteen times in order to get R rating.[25] Most of the cuts were made to the death scenes of Harry and Elvira. A supposedly uncut version was released on DVD by Warner Bros. on September 25, 2007 as part of the Twisted Terror Collection.","release_dates":"October 10, 1986 (1986-10-10) (U.S.)|||||","Production":"Wes Craven and Bruce Joel Rubin's original intent for the film was for it to be a science fiction thriller with the primary focus being on the dark love story between Paul and Samantha. Craven filmed this version of the film and Warner Bros. decided to screen it to a test audience mostly consisting of his fan base. The response from them was negative, criticizing the lack of violence and gore seen in Craven's other films. The studio eventually discovered Craven's popularity as a horror film director.The executive vice president of Warner Bros. at the time, Mark Canton, demanded Rubin write six additional gore scenes into his script, each bloodier then the last. Following the negative reactions from test audiences that saw Craven's first cut of the film and wanted a much more grisly product, it was re-edited in post-production and the more graphic deaths and other re-shot scenes were included, making the final film appear tonally jumbled.Editor Michael Eliot was brought in by Warner Bros. to re-edit the original cut of Deadly Friend. Eliot went on to do the same for two other Warner Bros. films, Out for Justice and Showdown in Little Tokyo. While new scenes were added, others such as more scenes between Paul and Samantha that would have made the film more of a love story as originally intended were deleted for length and pacing reasons. Since re-writes, re-shoots, and post production re-editing heavily changed the original story, Craven and Rubin expressed strong anger and heartbreak at the studio and then virtually disowned the film.[4]Craven was no longer attracted to the story because of Samantha going on a killing spree when she’s revived. He was much more interested in exploring the adults around her, all of whom seem to be monsters in human skin. In his own words: \"The scares don’t come from her, but from the ordinary people, who are actually much more frightening. A father who beats a child is a terrifying figure. That’s the one person you’re afraid of in the movie. The idea is along the lines that adults can be horrible, without being outside what society says is acceptable.\"[5]In an interview with Fangoria, actress Kristy Swanson, who plays Samantha, said that she found herself and the other actors caught up in the studio's attempts to strong-arm Craven into making the film more visceral than what was originally intended. During both production and re-shoots, changes to the script were being made, title changes were being discussed, and there were many discussions about how violent and bloody the final film would be. All of these issues caused problems for the actors. Regarding the title changes, when Craven started the project, it was titled Friend, much like the Diana Henstell novel it was based on. The title was later changed to Artificial Intelligence and then to A.I. before the studio and producers finally settled on Deadly Friend.[6]Kristy Swanson was 16 years old during filming. She thought it was very challenging to play the character of Sam. Today, Swanson is proud of her work in the film. In a 1996 interview with Starlog magazine, Swanson had this to say about the film: \"It was my first starring role in a feature. I was 16. I committed myself completely to it. I just went full out with it. I wanted to do the best job I could possibly do. I was having the time of my life. As for the movie itself, some people love it, some people hate it. It is what it is. I really enjoyed making Deadly Friend. At that point in my life, it was spectacular.\"[7]Some time after the film was released in theaters, Swanson mentioned in a promotional interview (Fangoria #60, \"The Prettiest Deadly Friend\") some problems she had during filming: \"I felt that, at times, people on the set thought I was just this dumb teenager who had to be lend around by the hand,\" she confessed. \"Nobody actually patted me on the head or anything like that, but I had a hard time getting the point across that even though I may have been young, I was a young actress.\"Professional mime artist Richmond Shepard taught Swanson all of the robotic movements that her character has in the film. In an interview, Swanson said this about learning to walk in that specific way: \"Getting those moves down was difficult at first. You don't think walking that way is hard until you actually try doing it. But Richmond was a good teacher and I picked up on most of the moves pretty quickly.\" Wes Craven at first wasn't convinced that she could handle the role of Samantha: \"Eventually, he changed his mind. He was always encouraging me, prodding me in subtle ways to get me to give a scene everything I could. There were days when we were behind schedule, or a particular scene was not working, where he would get a little upset, but I found Wes Craven to be a very patient man.\" She also mentioned her throwing of the basketball during the filming of Elvira's new death scene: \"Wes kept at me to throw it as hard as I could to indicate great speed. I must have tossed that ball a hundred times. My arm sure felt like I did.\"During filming of one of the studio-demanded scenes where Sam has a nightmare where her father attacks her in her room and she stabs him with a glass vase, there were difficulties on set with the special effects. Swanson mentioned, \"The scene was set up so that I would hit a protective device inside his shirt. But during one take, I missed the device and glass actually shattered on his chest. I freaked out because I thought I had really stuck this glass into his chest. Everybody else just laughed.\" In another incident, the great amount of fake blood turned out to be a problem. \"We had been working on that scene a long time. Finally, it was time for blood to spray out, but something leaked and we had blood spraying all over the set and myself. I was so tired that I started yelling, \"More blood!\" and the effects people really pumped it out.\"[8]In an interview with Maxim magazine in May of 2000, Swanson said that the fake head of Elvira that was decimated by the basketball was stuffed with actual cow brains that the production crew picked up from a butcher shop. In a 2006 interview for The Hills Have Eyes, Craven mentioned problems that the basketball scene had with the MPAA: \"On Deadly Friend, we had a scene where a nasty old lady gets her head knocked off with a basketball. The actual scene as it was originally cut was fabulous. She was running around the room like a chicken with its head cut off for ten, fifteen seconds. It was bizarre and wonderful and they cut the shit out of it. So I compiled what we called our \"Decapitation Compilation,\" all the films that I knew of that had decapitations in them that had an R, and sent it to them. They immediately sent it back saying they just base it on what they feel in the room at the time. And we had like eight or ten films in there, like The Omen where the guy gets his head cut off by the sheet of glass, and it didn't matter to them.\"[9]Craven had a hand in selecting Bruce Joel Rubin to write the screenplay for Deadly Friend. Rubin agreed with Craven that the film should have a gentler tone than his other features. Craven couldn't write the script himself because he was directing episodes of The Twilight Zone at the time. Craven and producer Robert M. Sherman hired Rubin as the screenwriter because they read his script for Jacob's Ladder, which was unproduced at the time.[10]For the scene chronicling the transplant of BB's microchip into Samantha's brain, Craven called on the advice of retired neurosurgeon William H. Faeth, who has a cameo in the film as a coroner in Sam's hospital room. Craven said that he was very helpful on all the anatomical details. Craven himself studied anatomy a great deal before filming started.[11]The robot, BB, cost over $20,000 to build. Craven used a company called Robotics 21. His eyes were constructed from two 1950's camera lenses, a garage remote control unit, and a radio antenna taken from a Corvette. BB could actually lift 7,500 pounds in weight. The voice of BB was provided by Charles Fleischer, who appeared in Wes Craven's previous film A Nightmare on Elm Street as a doctor and later provided the voice of Roger Rabbit in Who Framed Roger Rabbit in 1988.[6]Matthew Laborteaux, who played Paul, said in an interview with Starlog that Craven didn't want to turn Deadly Friend into a horror film. In Laborteaux's words: \"Wes said that one thing he didn't want to do was make this a horror movie, because it's one of his first large-budget movies which isn't from New Line Cinema or Joe Blow Pictures. That gave me a little sense of security knowing that he wanted to do a nice picture.\"[12]Earlier in production when the film was originally going to be PG-rated sci-fi thriller, Craven wanted to make something that was similar to John Carpenter's 1984 sci-fi film Starman. Also, according to Swanson in a 1987 interview with Fangoria writer Mark Shapiro, \"Craven suggested that I take a look at the movie Starman because what he wanted to do with Deadly Friend was similar in tone to that film.\" Interestingly enough, John Carpenter directed Starman because he wanted to get away from his reputation as a director of violent films, just like Wes Craven wanted to make Deadly Friend with a PG rating in mind so he could prove that he could make a film that wasn't simply \"blood and guts\" horror.[13]According to Wes Craven, the film had twenty producers and each had their own idea of what the film should be like. Although the film has much of Craven's trademark iconography including nightmare sequences, Craven originally didn't want to film them, but during the re-shoots, he was told by the producers to include few of them. As Craven said, \"They were mine, but they came very late. It was after the film was shot and the producers said, 'Let's put dream sequences in.'\"[6]Wes Craven once said this regarding why re-shoots and re-writes were demanded by the studio: \"We started off doing a picture that Warner Bros. indicated they wanted to do, a macabre love story with a twist. About five weeks into the shoot, they realized who I was and told me not to be inhibited by what they had told me in the past. In a way, I had held back. So, in the last week of shooting, I made up one little nightmare scene and put it into the film. It was the big hit of the screening. So then they came to me and said, 'Listen, what we need is more of that stuff. What we're doing is adding to the deaths of a few people, a jump for the beginning, a new closing scene, and two nightmares-- that sort of Wes Craven touch.'\"[14][15]At the same time, while shooting the film and having problems with the studio-forced re-shoots, Craven and his ex-wife Mimi were going through a divorce, and he even faced a major lawsuit in court with a person who claimed not only to have written A Nightmare on Elm Street, even though Craven himself wrote that film and no one else did, but that Craven stole the story. On top of all that, he was removed from two major studio projects, Beetlejuice and Superman IV: The Quest For Peace, both of which were ironically also distributed by Warner Bros.[16]In a 1990 interview with Fangoria journalist Daniel Schweiger, screenwriter Bruce Joel Rubin said this about the ending and why it stayed in the film: \"That robot coming out of girl's head belongs solely to Mark Canton, and you don't tell the president of Warner Bros. that his idea stinks!\" Rubin also said how at the time, people were still blaming him for the ending where Samantha turns into a robot, even though Canton was the one who conceived it. He also mentioned that despite the fact that studio destroyed the love story of the movie that he and Craven enjoyed, he still enjoyed working with Craven, confirming that he wasn't the one who wanted to change the film and that he should not be blamed for what happened to it. Rubin even said that production was one of the happiest experiences he ever had.[17][18]In another interview, Rubin told the story about how the $36,000 that he got paid for writing the script for Deadly Friend saved him from going nearly broke due to the four months long Writer's Guild strike and also helped him with a bar mitzvah for his son and to buy a house. In the same interview, Rubin said how at first, he didn't want to write the script, but after changing his mind, he called Robert M. Sherman and got the job. He also said how working on the film was one of the most extraordinary experiences of his life: \"It was a horror film with a lot of elements that are not things I wanted on my resume. And it didn't do very good business, but it was total fun. My kids were on the set every night. My five-year-old Ari was totally in love with Kristy Swanson, who was the lead. She later became Buffy the Vampire Slayer in the movie. She was really sweet to him and even took him on a date.\"[19]The theatrical trailer of the movie that Warner Bros. made represented it as a straight-up horror film, with not one frame of BB anywhere. The mixture of teenagers and terror as seen in trailer implied that Deadly Friend would be like Craven's A Nightmare on Elm Street. In an interview with Fangoria,[20] Craven said that the deadline for delivering the first cut of Deadly Friend with all of the studio-demanded sequences included, and delivering his original script for A Nightmare on Elm Street 3: Dream Warriors, which he was writing with Bruce Wagner, was virtually the same, making it very difficult for him to do both things at once.Deadly Friend was released in theaters on October 10, 1986 because Warner Bros. aimed at Halloween trade in order to make the film a financial success, but the film ended up being a critical and commercial failure.","produced_by":"Robert M. Sherman","starring":"Matthew Laborteaux|Kristy Swanson|Michael Sharrett|Anne Twomey|","running_time":"91 minutes","music_by":"Charles Bernstein","edited_by":"Michael Eliot","budget":"$11,000,000[citation needed]"}