{"based_on":"Bruce Lee: The Beginning  by Robert Clouse Bruce Lee: The Man Only I Knew  by Linda Lee Cadwell","country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Rob Cohen John Raffo Edward Khmara","Legacy":"A video game of the same name was released in the mid 1990s to various consoles.In the film The Fast and the Furious, Dragon was on Dominic Toretto's television during a scene in his house. Both films are directed by Rob Cohen.","Plot":"The film begins with a nightmare of Bruce Lee's father (Ric Young), who sees a terrifying phantom (Sven-Ole Thorsen) in black samurai armor that haunts the young Bruce Lee (Sam Hau). In a montage that passes quickly through his teenage years in Hong Kong, Bruce is shown receiving instruction in traditional Chinese martial arts. As a young adult, Bruce (Jason Scott Lee) fights with British sailors harassing a young Chinese woman, this results in him having to leave Hong Kong. His father suggests that Bruce go to the US, since he was actually born in San Francisco when his father was on a tour there and has a US birth certificate. His father asks Bruce to become a success, so big a success that his name will be famous even back in Hong Kong.In the US Bruce works as a dishwasher at a Chinese restaurant, until a violent brawl with four of the cooks, the restaurant owner (Nancy Kwan) arrives and fires Bruce. As well as severance, she gives him an \"all-purpose loan\" and exhorts him to invest in an education. While studying philosophy in college, he begins to teach martial arts classes, where he meets Linda Emery (Lauren Holly). They marry in defiance of Linda's racist mother (Michael Learned). Linda suggests that Bruce open a martial arts school, but his Chinese peers demand he not train \"blacks or Americans\" and challenge him to settle the matter via \"combat\". Bruce defeats Johnny Sun (John Cheung) in an secretive, illegal, no-holds-barred honor match, but an embittered Sun, attacks Bruce after having already admitted defeat. Sun's cowardly, vengeful attack results in a seriously debilitating back injury for Lee.Linda is upset that Bruce did not tell her about the match, however nurtures him through his recovery, despite his despair and assumption that she will abandon him. She convinces him to examine his flaws and weaknesses and thus develop the fighting philosophy of Jeet Kune Do, which is published in \"The Tao of Jeet Kune Do.\" During this period Linda gives birth to their first child, Brandon, which helps to assuage a reconciliation with Linda's mother.Some months later, during Ed Parker's martial arts tournament, Bruce faces Johnny Sun again, in a 60-second demonstration of his new fighting style. Johnny Sun appears to have the upper hand in the first half minute, but then Bruce dominates Sun, finishing by kicking him over the top rope into the crowd. Bruce was praised by the crowd after the fight.After the match, Bruce meets Bill Krieger (Robert Wagner) and is hired for The Green Hornet television series. Bruce and Bill work together and create the idea for the Kung Fu television series. At a cast party, Linda says she is now pregnant with their second child, Shannon. Shortly afterwards, there is an announcement for the cancellation of The Green Hornet. Kung Fu makes it to television, but stars David Carradine, and not Bruce.Bruce travels back home for his father's funeral, where Philip Tan (Kay Tong Lim), a Hong Kong film producer, informs Bruce of his fame there, where the The Green Hornet show is called The Kato Show. Bruce begins work on the feature film The Big Boss. In the filming of the final scene, set in an ice factory, the brother of Johnny Sun attacks Bruce, wanting revenge. The Big Boss is a success and Bruce makes several more films – working as actor, director and editor. This causes a rift between Bruce and Linda, as she wishes to return to the US. Bill Krieger shows up, and although he knows that Bruce is still angry with him, he offers him a chance to work on a big-budget Hollywood movie, particularly as Linda wishes to return to the States.On the 32nd day of shooting Enter the Dragon, during the climactic \"room of mirrors\" sequence, Bruce has a terrifying vision of the phantom samurai that has haunted his dreams since childhood, however this time, he saves his son Brandon and defeats the dark warrior. The film ends during a shot of the final scene of Enter the Dragon, with a voice-over by Linda informing the audience of his death before the movie's release, and her preferred choice to discuss his life, not his death.","language":"English","Reception":"The film received generally positive reviews,[14][15][16] with a rating of 83% on RottenTomatoes, based on 18 reviews counted.[17]The film debuted at #1 at the box office.[18][19] The film had a domestic gross of $35,113,743, with an additional $28,400,000 earned in foreign territories. The film grossed $63,513,743 worldwide.[2]","box_office":"$63.5 million[2]","cinematography":"David Eggby","directed_by":"Rob Cohen","Soundtrack":"The soundtrack for Dragon: The Bruce Lee Story was composed by Randy Edelman. Edelman's soundtrack is best known for its use in film trailers, particularly the love theme Bruce and Linda and The Premiere of the Big Boss.[21] The uncredited song playing during the kitchen fight scene at the beginning of the film is \"Green Onions\" by Booker T. & the M.G.'s.[22]","dragon:_the_bruce_lee_story":"Theatrical release poster","release_dates":"May 7, 1993 (1993-05-07)|||||","Production":"The film is based upon the biography Bruce Lee: The Man Only I Knew, written by Linda Lee Cadwell, Bruce Lee's widow.[4]The role for Bruce Lee was first offered to his real-life son Brandon Lee, who declined. Brandon Lee died in a shooting accident while filming for the film The Crow in March 1993, less than two months before this film's release.[8] The film is dedicated to his memory at the end credits. In the film Brandon was portrayed as a child by Iain M. Parker.To prepare for their roles both lead actors Jason Scott Lee and Lauren Holly trained in Bruce Lee's Martial Arts style of Jeet Kune Do for months under former Lee student-turned-instructor Jerry Poteet.[9][10] Jason Scott Lee continued to train in Jeet Kune Do under Poteet up until Poteet's death in 2012.Jerry Poteet also portrayed himself in the film, he can be seen in the background of many scenes. Van Williams, who played The Green Hornet in the 1960s TV series of the same name appears as the director of The Green Hornet in this film. Bruce Lee's daughter, Shannon Lee, has a cameo appearance as a singer in the party scene (singing \"California Dreamin'\"), at which Linda tells Bruce she is pregnant for the second time – carrying Shannon.The tombstone that Bruce is forced to see when confronting his demon towards the end of film is the actual tombstone of Bruce Lee. The picture on it is different from the one that is actually on the real one but the date of birth, date of death and the epitaph are the same.Scenes from Dragon: The Bruce Lee Story were deleted by British authorities, ostensibly to meet age-rating prior to its release in the United Kingdom, in particular the scenes in the Lantern Festival dance party in Hong Kong where a British sailor who abuses a woman, is confronted by Bruce Lee,[11][12][13] and the fight between Bruce Lee and his inner demon near the end of the film was shortened in a way that viewers cannot see Bruce Lee fighting with the nunchaku weapon.","produced_by":"Raffaella De Laurentiis Rick Nathanson John Badham","starring":"Jason Scott Lee Lauren Holly Robert Wagner","running_time":"120 minutes","music_by":"Randy Edelman","edited_by":"Peter Amundson","budget":"$14 million[1]"}