{"based_on":"A Midnight Clear  by William Wharton","country":"United States","a_midnight_clear":"VHS cover","distributed_by":"Columbia Tristar Home Video (VHS) MGM Home Entertainment (DVD)","Plot summary":"In the early phase of the Battle of the Bulge in December 1944, a small US Army intelligence and reconnaissance squad (selected for their high IQs), are sent to occupy a deserted chateau near the German lines to gather information on the enemy’s movements. Losses from an earlier patrol has reduced the squad to just six men- Sgt Knott, Miller, Avakian, Shutzer, Wilkins and Mundy. On their way to the chateau, they discover the frozen corpses of a German and an American in a standing embrace, seemingly arranged by the Germans as a grim joke.Settling in to their temporary home, they soon discover they are not alone. A group of German soldiers has occupied a position nearby. Knott, Mundy and Shutzer, while out on a patrol, suddenly see a trio of German soldiers aiming their weapons at them but the enemy then vanish without shooting. The Germans, clearly more skilled and experienced than the young GIs, soon leave calling cards, start a snowball fight one evening and offer a Christmas truce. At first, the Americans think the Germans are taunting them but it eventually becomes clear that the enemy want to parlay. Shutzer speaks enough German to communicate with the enemy who turn out to be a small group of youngsters still in their teens, commanded by an aging NCO. Having survived the Russian front, the Germans say they wish to surrender. But they ask that the Americans pretend that they were captured in combat so as to protect their families back home from possible retribution for their desertion. The Americans agree, but keep the plan from Wilkins, who has been mentally unstable since learning of the death of his child back home.The two groups meet and proceed to fire their weapons into the air as planned. However Wilkins hears the shooting and thinks the engagement is real. Arriving at the scene, Wilkins opens fire at the Germans whereupon the latter, thinking they have been tricked, immediately shoot back. The situation immediately goes out of control and Knott's squad are forced to kill all of the enemy soldiers but not before Mundy is fatally hit and Shutzer is also badly wounded. Mundy’s final words are to beg the others not to tell Wilkins that the skirmish was intended to be fake. The squad’s superior officer arrives, reprimanding them for their conduct, before taking Shutzer back for treatment (they later receive word that he died in hospital). Left alone again, the four remaining soldiers quietly reflect as they try and celebrate Christmas, cleaning Mundy’s body in a bathtub. Shortly afterwards, the squad is forced to flee as the Germans attack the area in strength. Carrying Mundy’s corpse, they disguise themselves as medics and escape back to American lines. There Knott is informed that Wilkins has been recommended for the Bronze Star and transferred to the motor pool, while the rest of the squad will be sent into the front line to fight as regular infantry.","screenplay_by":"Keith Gordon","language":"English","Critical reception":"The film received mostly positive reviews, with an 86% favorable rating on Rotten Tomatoes based on 35 reviews.[1] The Washington Post reviewer lauded it as \"a war film completely unlike any other, a compelling accomplishment that's more soul than blood and bullets.\"[2] Vincent Canby of The New York Times praised the film's solid construction, concluding that \"In A Midnight Clear, just about everything works.\"[3]Reviewing the film's 2012 DVD release in The Observer, Philip French described the film as \"an ironic, at times surreal fable.....and the plot's twists are matched by the sharpness of its moral insights.\"[4]","box_office":"$1,526,697","cinematography":"Tom Richmond","production_company":"InterStar Releasing Beacon Communications A&M Films Sovereign Pictures","directed_by":"Keith Gordon","release_dates":"April 24, 1992","produced_by":"Bill Borden Dale Pollock Armyan Bernstein Tom Rosenberg Marc Abraham","starring":"Peter Berg|Kevin Dillon|Arye Gross|Ethan Hawke|Gary Sinise|Frank Whaley|John C. McGinley|","running_time":"108 minutes","music_by":"Mark Isham","edited_by":"Don Brochu","budget":"$5 million"}