{"based_on":"Juicy and Delicious  by Lucy Alibar","country":"United States","distributed_by":"Fox Searchlight Pictures","screenplay_by":"Lucy Alibar Benh Zeitlin","Plot":"As a storm approaches a southern Louisiana bayou community called the \"Bathtub\" (a community cut off from the rest of the world by a levee), six-year-old Hushpuppy and her ailing, hot-tempered father Wink are optimistic about their life and their future. The children in school are being taught by Miss Bathsheba about nature and the release of prehistoric creatures called \"Aurochs\" from the melting ice caps. At home, Hushpuppy fends for herself while her father is missing. When he returns, he is wearing a hospital gown and bracelet. They argue, and when Hushpuppy returns to her house, she deliberately sets it on fire. A chase ensues between the two, and she ends up getting slapped by Wink. When she retaliates by punching him in the chest, Wink collapses. Hushpuppy, realizing the damage she has caused, runs for help only to find her father missing when she returns.Meanwhile, in the Arctic, the frozen Aurochs in an ice shelf start drifting into the ocean.Many of the Bathtub residents start fleeing due to the threat of an approaching storm. Wink reappears, staggering along the side of the road; he finds Hushpuppy and takes her home to start barricading before the storm hits. In an effort to make his daughter feel better, Wink attempts to scare off the storm by firing a rifle at the clouds. The next day, the two tour the devastation and connect with surviving residents.The Bathtub residents celebrate and make plans to rebuild their community, but the environment is damaged because of the salt water brought in by the storm surge to fresh waters. Wink hatches a plan to drain the water away by destroying the levee. He and a small group of friends plant dynamite and blow a hole in the wall using an alligator gar, and the water recedes. Authorities arrive and enforce a mandatory evacuation order, removing the residents of the Bathtub to an emergency shelter. Wink receives surgery, but it is too late to restore his health. At the first opportunity, the evacuees leave and escape back to their homes.Aware of her father’s condition, Hushpuppy searches for her absent mother. She and her friends swim to a boat, which takes them to a floating bar, known as the Elysian Fields. Hushpuppy meets a cook who may be her mother, though the woman doesn't recognize her. The cook says that the girl can stay with her if she wants, but Hushpuppy says that she's got to go home. Hushpuppy and her friends return home where she confronts the Aurochs. As the Aurochs leave, Hushpuppy returns home. She says her last goodbyes to the dying Wink, listening to his last heartbeat. She sets his funeral pyre ablaze, standing together with the remaining residents of the Bathtub.","beasts_of_the_southern_wild":"Theatrical release poster","Accolades":"The film won the Caméra d'Or award at the 2012 Cannes Film Festival[30] after competing in the Un Certain Regard section.[31][32] It also won the Grand Jury Prize: Dramatic at the 2012 Sundance Film Festival, where it premiered,[33] and the Grand Jury Prize at the 2012 Deauville American Film Festival. The film went on to earn the Los Angeles Film Festival's Audience Award for Best Narrative Feature and the Seattle International Film Festival's Golden Space Needle Award for Best Director.[34] In October, it was announced that the film had won the Sutherland Trophy for Most Innovative Debut.[35] On January 10, 2013, the film was nominated for four Oscars, in the categories of Best Picture, Best Director (Benh Zeitlin), Best Actress (Quvenzhané Wallis), and Adapted Screenplay (Lucy Alibar & Benh Zeitlin).[36][37] The script won the 2012 Ray Bradbury Award for Outstanding Dramatic Presentation from the Science Fiction and Fantasy Writers of America.[38]","language":"English","Reception":"The film has received largely positive critical reviews. According to Metacritic, which assigns aggregate scores from the amount of positive or negative critical reviews of films, Beasts of the Southern Wild has an 86/100 based on 44 critic reviews, indicating \"universal acclaim\".[13] Similarly, Rotten Tomatoes reports that the film has received a \"Certified Fresh\" rating of 86% from 182 reviews (156 positive, 26 negative), with the consensus: \"Beasts of the Southern Wild is a fantastical, emotionally powerful journey and a strong case of filmmaking that values imagination over money.\"[14] The film was designated a 2012 \"Critics' Pick\" by the reviewers of The New York Times. Author and critic A. O. Scott, writing for The New York Times, calls Beasts a\"blast of sheer, improbable joy, a boisterous, thrilling action movie with a protagonist who can hold her own... Hushpuppy, the 6-year-old heroine of 'Beasts of the Southern Wild,' has a smile to charm fish out of the water and a scowl so fierce it can stop monsters in their tracks. The movie, a passionate and unruly explosion of Americana, directed by Benh Zeitlin, winks at skepticism, laughs at sober analysis and stares down criticism.\"[15]Scott subsequently named Beasts of the Southern Wild the third-best film of 2012.[16] Roger Ebert called the film a \"remarkable creation... Sometimes miraculous films come into being, made by people you've never heard of, starring unknown faces, blindsiding you with creative genius. \"Beasts of the Southern Wild\" is one of the year's best films.\"[17]Conversely, critic Cole Smithey described it as \"one of the worst films to come out of 2012\", awarding it 0 stars out of 5 and calling the film \"infuriating, insulting, and bathed in patronizing condescension\".[18] Michael Phillips of the Chicago Tribune said that Beasts was \"the most divisive film of 2012,\" opining that \"The filmmaker comes from a perspective of great empathy and considerable skill. But he's a pile driver as a dramatist. The film's screw-tightening methods are so overbearing, the story, the characters, the little girl's plight have to struggle to breathe or develop anything like an inner life.\"[19] Author and activist bell hooks wrote a negative review of the film, saying \"the vibrancy in this film is generated by a crude pornography of violence\" and calling Hushpuppy \"a miniature version of the ‘strong black female matriarch,’ racist and sexist representations have depicted from slavery on into the present day.\"[20]The performance of newcomer Quvenzhané Wallis has been met with critical acclaim. Amy Biancolli of the San Francisco Chronicle says,\"Regarding Wallis' performance as Hushpuppy: it isn't one. It's a fact. Onscreen she simply is, a being as elemental, incontestable and strong as the advancing aurochs. She was 6 when the film was shot, yet the ferociousness of her presence – the anger and wisdom inside her – suggest someone older or ageless.\"[21]Lou Lumenick of the New York Post says that, upon second viewing,\"the best reason to wade into this (let’s be honest) challenging but hugely rewarding film is Quvenzhané Wallis — a 6-year-old with no acting experience at the time of filming — who’s unforgettable as the film’s fierce young protagonist... It’s the effortlessly charismatic Wallis who deserves a Best Actress Oscar nomination.\"[22]Peter Travers of Rolling Stone describes Wallis as \"flat-out amazement.\" He adds that \"there's no way you won't be captivated by Wallis, chosen ahead of 3,500 candidates to play the tiny folk hero who narrates the story. Her performance in this deceptively small film is a towering achievement.\" [23]A.O. Scott of The New York Times describes the character of Hushpuppy, \"Played by Quvenzhané Wallis, an untrained sprite who holds the camera’s attention with a charismatic poise that might make grown-up movie stars weep in envy, Hushpuppy is an American original, a rambunctious blend of individualism and fellow feeling.\" [24] Roger Ebert wrote in his positive review for the Chicago Sun-Times, that Hushpuppy is \"played by a force of nature named Quvenzhané Wallis... She is so uniquely and particularly herself that I wonder if the movie would have been possible without her.\" [25] On January 10, 2013, Wallis was nominated for the Academy Award for Best Actress. At 9 years old, she is the youngest ever nominee in that category.[26]In an interview with People magazine, President Barack Obama described the film as \"spectacular.\"[27] The film's acclaim resulted in its Centerpiece screening at the 2012 Traverse City Film Festival.[28] Sight & Sound film magazine listed the film at #5 on its list of best films of 2012.[29]","Further reading":"Yaeger, Patricia, \"Beasts of the Southern Wild and Dirty Ecology,\" Southern Spaces, 13 February 2013.","box_office":"$21.9 million[2]","cinematography":"Ben Richardson","production_company":"Cinereach Court 13 Journeyman Pictures","directed_by":"Benh Zeitlin","Setting and location":"The fictional island of the film, \"Isle de Charles Doucet\" known to its residents as the Bathtub, was inspired by several isolated and independent fishing communities threatened by erosion, hurricanes and rising sea levels in Louisiana's Terrebonne Parish, most notably the rapidly eroding Isle de Jean Charles. It was filmed in Terrebonne Parish town Montegut.[5]","narrated_by":"Quvenzhané Wallis","release_dates":"January 20, 2012 (2012-01-20) (Sundance)|June 27, 2012 (2012-06-27)||||","Production":"The film was shot on 16mm film, and director Benh Zeitlin created the production with a small professional crew, and with dozens of local residents in and around Montegut, Louisiana. The filmmakers call themselves \"Court 13\" and are the first credited at the end of the film.[6] During the audition, Quvenzhané Wallis (who was five years old,[7][8] though the casting call had been for girls between six and nine years) impressed the filmmakers with her reading ability, as well as a tremendous scream and her ability to burp on command, both of which are utilized in the film.[9] Dwight Henry, who plays Wink, was not looking for an acting job and had no acting experience. As he explained in an interview with the San Diego Reader:Before I was cast in the part I owned a bakery called Henry's Bakery and Deli right across the street from the casting agency where Court 13 had their studio. They used to come over and have lunch or breakfast in the morning. After a few months we kinda developed a relationship. They used to put these fliers in the bakery with a phone number to call if you were interested in appearing in one of their movies.[10]During a slow hour, he read for the part, and was chosen. However, at the time, Henry was in the middle of moving to a larger building (which would become the Buttermilk Drop Bakery and Café, in the Tremé neighborhood of New Orleans[11][12]), and the film-makers had trouble finding him. He explained that he could not leave a new business, but they were determined to have him. Henry concluded, \"I was in Hurricane Katrina in neck-high water. I have an inside understanding for what this movie is about. I brought a passion to the part that an outside actor who had never seen a storm or been in a flood or faced losing everything couldn't have. … I was two-years-old when Hurricane Betsy hit New Orleans and my parents had to put me on the roof of the house. An outsider couldn't have brought the passion to the role that I did.\"[10]","produced_by":"Dan Janvey Josh Penn Michael Gottwald","starring":"Quvenzhané Wallis Dwight Henry","running_time":"93 minutes[1]","music_by":"Dan Romer Benh Zeitlin","edited_by":"Crockett Doob Affonso Gonçalves","budget":"$1.8 million"}