{"country":"United States Australia","darkness_falls":"Theatrical Release poster","distributed_by":"Columbia Pictures","screenplay_by":"Joe Harris James Vanderbilt John Fasano","story_by":"Joe Harris","Novelization":"Joe Harris wrote Darkness Falls: The Tragic Life of Matilda Dixon, a prequel comic, which was published by Dark Horse Comics.[citation needed] Keith R. A. DeCandido wrote a novelization of the film, which was published by Pocket Books in December 2002.[citation needed]","Plot":"In the town of Darkness Falls, widow Matilda Dixon (Antony Burrows) was adored by the town's children. Matilda gave them gifts and gold coins when they lost teeth, earning her the nickname Tooth Fairy. A fire in her home left her face disfigured and sensitive to light; she wore a white porcelain mask and only left her house at night. The town's adults were suspicious of Matilda; they blamed her when two children went missing. They hanged her and removed her mask, exposing her face to light. Dying, Matilda swore vengeance upon the town. When the two missing children returned home unharmed, the townsfolk realized their mistake and quickly buried Matilda's body. The story of Matilda Dixon, the Tooth Fairy, became a legend that was told for many generations after her death; her dark spirit visits children on the night they lose their last baby tooth. If anyone sees her when she visits, they are cursed and marked for her vengeance if they survive their encounter with her.Kyle Walsh (Joshua Anderson), an antisocial teenager befriended by Caitlin Greene (Emily Browning), loses his last baby tooth. That night he sees Matilda in his bedroom and realizes the story is true; Matilda is now a vindictive spirit dressed in black robes and a white porcelain mask. Knowing light is her weakness, he shines a flashlight into her face and hides in the brightly lit bathroom. His mother (Rebecca McCauley) tries to persuade him there is nothing in his room; she is killed after seeing Matilda. The next morning, police arrive and Kyle is taken to a mental hospital after mistaken speculations that he killed his mother.Twelve years later, Caitlin (Emma Caulfield) telephones Kyle (Chaney Kley) to ask for his help with her younger brother Michael (Lee Cormie), who refuses to sleep in the dark. Kyle still suffers fear and paranoia from his encounter with Matilda; he has dozens of flashlights, medications for anxiety and depression, and drawings of Matilda on his walls. Kyle visits the hospital to talk to Michael; he realizes Michael, who now fears darkness and is thought to be insane, has also seen Matilda. Kyle at first denies any relation to his condition and walks away from Caitlin, who believes his story and has secretly been afraid of darkness since Kyle's mother's murder.Kyle is beset upon by his childhood neighbors; he tries to warn others of Matilda but faces ridicule and skepticism, which leads to the death of many townspeople. A lightning storm blacks out the whole town; realizing Michael and Caitlin are in grave danger, Kyle rushes to the hospital where Michael is being treated. He rescues them as they are being stalked by Matilda. Kyle loses his bag of flashlights but gains allies as others realize his story is true. Matilda is determined to kill Kyle, whom she could not conquer. Kyle, Michael, and Caitlin hide in the local lighthouse; the largest light source in the town. They are helped by several medical personnel, all of whom are killed by Matilda on the way.Pursued by Matilda, they discover the lighthouse has defective wiring, which they try to repair. Their only protection is two small kerosene lanterns that have insufficient oil. During the struggle, Matilda tries to kill Kyle, but before she can do so, the lighthouse lights up. The sudden exposure to light caused Matilda pain; she drops her mask and it shatters. Kyle can see her disfigured face and realizes she is now vulnerable. She resumes her attack, during which Kyle's right sleeve catches fire and he kills Matilda by striking her face with it.As the film ends, a boy is being tucked into bed by his parents. He is scared because he had just lost his last baby tooth. He finds his mother replaced the tooth with a gold coin, showing that Matilda Dixon and her curse are gone.","language":"English","Reception":"Darkness Falls was panned by critics upon its release. According to review aggregate website Rotten Tomatoes, 9% of critics out of 127 reviews gave the film a positive review, with an average rating of 3.3/10; the critical consensus is: \"A derivative movie where the scares are few and things don't make much sense\".[3] On Metacritic, the film has a score of 23 out of 100, indicating \"generally unfavorable reviews\", based on reviews from 27 critics.[4]Despite the critical failure, Darkness Falls was a commercial success; it opened at number one in the U.S. box office and recouped its $11 million budget in its opening weekend on January 24, 2003, making $32,551,396 domestically and $47,488,536 worldwide.[5]","box_office":"$47.5 million[2]","cinematography":"Dan Laustsen","production_company":"Revolution Studios Distant Corners","directed_by":"Jonathan Liebesman","Soundtrack":"All music composed by Brian Tyler.","release_dates":"January 24, 2003 (2003-01-24)|||||","produced_by":"John Fasano John Hegeman William Sherak Jason Shuman","starring":"Chaney Kley Emma Caulfield","running_time":"86 minutes","music_by":"Paul Andrews Brian Tyler","edited_by":"Timothy Alverson Steve Mirkovich","budget":"$11 million[1]"}