{"country":"France United States","distributed_by":"Relativity Media (US) EuropaCorp (France)","screenplay_by":"Luc Besson Adi Hasak","story_by":"Luc Besson","Plot":"Experienced CIA agent Ethan Renner (Kevin Costner), originally from Pittsburgh, works with a team to capture the Albino, lieutenant to an arms trafficker called the Wolf, as he is selling a dirty bomb to some terrorists.[6] The Albino deduces the trap when he recognizes one of the agents, whom he kills. Renner is able to cripple the Albino by shooting him in the leg, but not capture him. Meanwhile, elite CIA assassin Vivi Delay (Amber Heard), who has been personally assigned by the Director to kill the Wolf, monitors the operation and notices Renner has unknowingly seen the Wolf.Renner is nearly disabled by an extreme cough, which is diagnosed as terminal brain cancer which has spread to his lungs. He is given only a few months to live, and will not see the next Christmas. For decades he has kept his dangerous career a carefully guarded secret from his wife Christine (Connie Nielsen) and daughter Zooey (Hailee Steinfeld), at the cost of losing them. He decides to spend his remaining time trying to fix his relationship with his estranged daughter, and if possible, his ex-wife. He returns to Paris, where he and his family live separately, to find the Réunion family of Jules is squatting in his apartment. He is told by the government that he is not permitted to evict indigent squatters until after the winter.He makes an awkward reconnection with Christine and Zooey, and tells Christine of his terminal illness. She allows him to reconnect with Zooey, and when she has to go out of the country on business, she is forced to let him look after Zooey. Vivi recruits him to find and kill the Wolf, in exchange for an experimental drug that could extend his life significantly. Renner reluctantly accepts, to get more time with his family. Vivi tells him the way to trap the Wolf is by getting the Albino, in turn by getting his accountant, in turn by kidnapping the gang's limousine driver.All the while Renner is fighting the hallucinogenic effect of the medicine, which occurs whenever his heart rate goes too high, and which he can only control by consuming alcohol. He must also deal with Zooey's school problems, including her habit of lying so she can sneak out partying. He manages to keep her out of trouble, and slowly reestablishes a father relationship with her, which impresses his wife.He tracks the Wolf and the Albino into the subway, but they gain the upper hand when he is disabled by the hallucinations. The Albino attempts to kill him by pushing him in front of an oncoming train, but Renner manages to push the Albino on the track instead. The Wolf escapes.The family is invited to a party thrown by Zooey's boyfriend's father, who happens to be the Wolf's business partner. Renner manages to protect Christine and Zooey, kill all the Wolf's men, and trap the Wolf in an elevator before breaking the cable. The Wolf manages to survive, wounded, but Renner is again disabled and drops his gun where the Wolf can get it. Vivi kicks the gun back to Renner, telling him to finish the job and kill the Wolf, but he decides not to, because \"I promised my wife I'd quit.\" Vivi then kills the Wolf.At last retired, Renner survives to Christmas, which he is spending at a beach house with Zooey and Christine. He discovers a small, red wrapped gift package, which contains another vial of the cancer medicine. Vivi is seen on a hill behind the house smiling as Renner opens the package.","language":"English","box_office":"$52.6 million[2]","3_days_to_kill":"Theatrical poster","cinematography":"Thierry Arbogast","production_company":"EuropaCorp Wonderland Sound and Vision","directed_by":"McG","release_dates":"12 February 2014 (2014-02-12) (Los Angeles)|21 February 2014 (2014-02-21) (United States)|19 March 2014 (2014-03-19) (France)|||","Production":"On 7 August 2012 Deadline reported that Kevin Costner had been offered the role of Ethan Renner, a government assassin in the McG-directed film.[3] The film, set in France, was scripted by Luc Besson and Adi Hasak, with EuropaCorp having produced while Relativity Media has North American rights.[3] On 2 October 2012, it was confirmed that actor Costner had closed the deal to star as lead in the film.[7] On 29 November 2012, Hailee Steinfeld joined the cast of the film as female lead, and the film began production in early 2013.[8] On 13 December, Amber Heard also joined the cast.[9] Later, on 7 January 2013, Connie Nielsen was added to the cast.[10]On 7 January 2013, crews were filming scenes in Paris and Belgrade, and shooting wrapped in April.[10] Some scenes in Paris were filmed in the studios and in the central nave of the Cité du Cinéma, founded by Luc Besson in Saint-Denis. Scenes in Belgrade were filmed in front of Hotel Jugoslavija.[11]","produced_by":"Ryan Kavanaugh|Marc Libert|","starring":"Kevin Costner|Amber Heard|Hailee Steinfeld|","running_time":"117 minutes[1]","music_by":"Guillaume Roussel","edited_by":"Audrey Simonaud","Release":"On 31 January 2013, photos from the set of the film were released.[12] In November 2013, stills from the film were released.[13] On 17 December 2013, the studio released the first trailer and the poster for the film.[14] On 30 January 2014, Relativity released a new Super Bowl 2014 spot.[15]On 28 May 2013, Relativity set a release date of 14 February 2014 for the film.[16] Later, on 30 October, the film's date was shifted back a week, to 21 February 2014.[5]3 Days to Kill has received poor reviews from critics. Rotten Tomatoes gives the film a score of 28% based on 108 reviews, with an average rating of 4.4 out of 10. The site's consensus states: \"3 Days to Kill uneasily mixes technically accomplished action sequences with an underdeveloped family conflict.\"[17] On Metacritic, the film has a score of 40 out of 100, based on 30 critics, indicating \"mixed or average reviews\" from critics.[18]3 Days to Kill grossed $12,242,218 in its opening weekend, finishing in second place behind The Lego Movie ($31.3 million). The film grossed a domestic total of $30,697,999 and a foreign total of $21,900,000, bringing its total gross to $52,597,999.[2]","budget":"$28 million[2]"}