{"mandarin":"Fēi Lóng Měng Jiāng","country":"Hong Kong","distributed_by":"Golden Harvest Fortune Star Paragon Films Ltd. Media Asia Group","Plot":"A fishery is seeking court action against a local chemical factory for polluting the water. The mysterious chemical company hires lawyer Jackie Lung (Jackie Chan) to find information that will discredit the fishery. He employs his arms dealer friend, Wong (Sammo Hung) to woo the fishery owner, Miss Yip (Deannie Yip), to try to convince her to settle out of court. Lung also brings in crackpot inventor and professional criminal, Tung (Yuen Biao), to bug her apartment. Unfortunately, Wong and Tung are unaware of each other's roles and soon come into confrontation, whilst Lung tries to maintain the peace.Wong falls for Miss Yip, whilst Lung woos her cousin, Miss Wen (Pauline Yeung), an environmental scientist who is going to testify on Miss Yip's behalf. The three men inadvertently discover that the chemical company is just a facade for a narcotics empire, ran by Hua Hsien-Wu (Yuen Wah). They soon come up against Hua's thugs, and ultimately infiltrate the factory for a showdown with Hua himself and his henchman - martial arts master (Benny Urquidez).","language":"Cantonese Yue Chinese","Reception":"On the Hong Kong Legends DVD release of Dragons Forever, Hong Kong cinema expert Bey Logan offers his opinion of why the film underperformed both in the domestic and Japanese markets. The primary reason cited is that the actors played roles against type. Jackie Chan plays a slick lawyer who chases women, in contrast to the happy-go-lucky everyman characters he usually plays.[3][4] Similarly, Yuen Biao plays an eccentric and possibly mentally disturbed character, rather than the underdog character fans were used to. For Sammo Hung, rather than the timid character that's been described in earlier films, he instead plays like a rascal. Logan explains that in general, the cinema going public in Hong Kong are not as open to such departures of role as, perhaps, the public in the West would be.[3]Additional reasons cited include the occasional use of coarse language in the film, and the scenes of narcotics production, particularly Hung's character being injected with drugs against his will. The fact that Chan's character has a relationship with a woman may also have had an effect, particularly in the Japanese market, as many female viewers couldn't accept that their idol wasn't single. On learning that Chan was in a relationship in real life, one Japanese fan had committed suicide and another poisoned herself in the offices of Golden Harvest.[3]","cantonese":"Fei1 Lung4 Maang2 Zeong1","cinematography":"Jimmy Leung Cheung Yiu-tso","directed_by":"Sammo Hung Corey Yuen","dragons_forever":"Dragons Forever DVD cover","traditional":"飛龍猛將","Versions":"Two scenes with Timothy Tung Te-Biao (Yuen Biao) visiting a psychiatrist (played by Lucky Stars veteran, Stanley Fung) were cut from the domestic Hong Kong print, and the Japanese print of the film, but remain for the international version. These scenes appeared as extras on the Hong Kong Legends DVD of the film, entitled Couch Potato and Mr Kinetic.[2] In the latter, the psychiatrist was in the process of being robbed. So that Tung would not realise a robbery was taking place, one of the robbers, posing as the psychiatrist, gave him advice over the intercom - to \"kill the witnesses\", which explains why Tung attacks Jackie Lung (Chan) and Ling (Pauline Yeung) in a later scene, wearing a mask and armed with a knife.Several scenes were slightly trimmed for the international version. The only scene completely omitted shows how Tung Te-Biao leads Jackie and Ling into the chemical factory, having informed them about the danger Wong Fei-Hung (Sammo Hung) was in. They locate a hidden door, leading to where Wong is held captive and the drugs are refined. Ling distracts the guard, allowing Jackie the opportunity to attack.","simplified":"飞龙猛将","release_dates":"11 February 1988 (1988-02-11)|||||","Box office":"Dragons Forever grossed an impressive HK$33,578,920 in its Hong Kong theatrical run.[4]","produced_by":"Raymond Chow Leonard Ho Barney Wu","starring":"Jackie Chan Sammo Hung Yuen Biao Deannie Yip Pauline Yeung Yuen Wah Benny Urquidez","running_time":"94 minutes","music_by":"James Wong Chin Yung Shing","edited_by":"Peter Cheung Joseph Chiang","written_by":"Gordon Chan Leung Yiu-ming Szeto Chuek-hon"}