{"country":"United States","distributed_by":"N/A","Plot":"The first half of the movie centers around Elaine Cheng (played by Cindy Cheung), a single mother and immigrant living in the Boston suburbs, and the life she provides for her two children (played by Michael Chen and Crystal Chiu). As a way to cope and entertain themselves, the kids invent things. The mother is drawn to pyramid schemes as a way to get ahead and repeatedly loses money. Eventually her two young children are left to fend for themselves when their mother is arrested by the police. The film is loosely based on Tze Chun's own childhood,[1] as well as his Sundance 2007 short film, Windowbreaker.[2]","Accolades":"The film also won the following 17 festival awards:","language":"English","cinematography":"Chris Teague","directed_by":"Tze Chun","release_dates":"January 18, 2009 (2009-01-18) (Sundance)|March 12, 2010 (2010-03-12) (United States)||||","Production":"Though set in Boston, the film shot 20 days in and around New York City and 4 days in Boston.[3] The film premiered at Sundance just 10 months after the first draft of the script was completed.[4]","Distribution":"Tze Chun and the film's producer Mynette Louie were named in Ted Hope's list of \"21 Great Free Thinkers of Indie Film\" for their DIY festival/DVD distribution strategy.[5] The film debuted theatrically in Boston on February 26, 2010, and in New York and Los Angeles on March 12, 2010, followed by additional theatrical engagements in other cities. It was released on Video-on-Demand beginning in June 2010, and on DVD on August 10, 2010.","produced_by":"Mynette Louie Trevor Sagan","starring":"Cindy Cheung (actress) Michael Chen Crystal Chiu","running_time":"86 minutes","Critical Reception":"The film was very well received by critics, including The New York Times, Los Angeles Times, The Village Voice, New York Post, Variety, LA Weekly, USA Today, Chicago Reader, Film Threat, and The Boston Globe. It was named one of the Top 13 Films of 2009 by Hammer to Nail, and one of the best undistributed films of 2009 by several critics including IFC's Alison Willmore. In 2010, the year of its commercial release, it made several more \"best films of the year\" lists including the list by Turner Classic Movies' blog.","music_by":"T. Griffin","edited_by":"Anna Boden","written_by":"Tze Chun"}