{"country":"India","distributed_by":"Yash Raj Films","screenplay_by":"Atul Sabharwal","Plot":"The story is set in the town of Gurgaon, an industrial city near NCT Delhi. The film is presented from the view of ACP Arya Phogat (Prithviraj Sukumaran). ACP Arya, a police officer, has been brought up by his uncle, DCP Ravikant Phogat (Rishi Kapoor). His father, police inspector Vijaykant Phogat (Anupam Kher), had lost interest in life years back, after messing up an operation to kill Yashvardhan Singh (Jackie Shroff), due to lack of evidence against him. Yashvardhan’s wife, Veera (Tanvi Azmi), had become a police informer against her own husband and had to run away from him with one of her twin children Vishal (Arjun Kapoor) while Ajay is left with Yashvardhan. Vijaykant hides Vishal and Veera – whom he has begun to love – and passes it off as a botched encounter for which he takes the entire blame. Suspended from the police force, Vijaykant has a tough time over the years, caught between the love for his real family and son ACP Arya, and his adopted wife and son. Years later, just before he dies, he reveals to Arya that he has another wife and kid but doesn't reveal their real identity. Vijaykant dies few days later and Arya goes to meet Veera. There he is shocked to see Vishal, who is the exact replica of Ajay (Arjun Kapoor).Ravikant, who is corrupt to the core, hatches a plot to expose the criminal activities of Yashvardhan, a mission left incomplete by his brother Vijaykant. He joins forces with nephew Arya and convinces Vishal to enter Yashvardhan’s house, posing as Ajay. To facilitate matters, Ajay is kidnapped by Ravikant and Arya and held captive by them, paving the way for Vishal to take his place and leak information about Yashvardhan's illegal activities to the police. Vishal has to pose as Ajay not just in front of his own father, Yashvardhan, but also in front of Neena Wadhwa (Amrita Singh), Yashvardhan's paramour and business partner. Vishal also has to feign an affair with his twin brother’s girlfriend, Ritu (Sashaa Agha). As days pass, Vishal falls in love with Ritu. Vishal keeps leaking information about his dad to Ravikant and Arya, who move forward in their exposé with the help of the incriminating evidence. On the other hand, Ravikant and Arya unite Ajay with mother Veera and also try to brainwash him (Ajay) into spilling the beans about his father’s illegal businesses before them.Over time, Vishal develops a soft corner for his father and pleads for his safety from police. He also wins the confidence of his father, who is unaware that Vishal has replaced Ajay in the house. Calamity befalls Yashvardhan because of action initiated by Ravikant, and he has to be hospitalised. Vishal manipulates things in such a way that Neena has to resign from Yashvardhan Singh’s company. Even as the tension between Arya and foster-brothers Ajay and Vishal refuses to be diffused, the task before Ravikant and Arya becomes very difficult. To make matters more difficult for Ravikant, his son-in-law, Vishnu (Sumeet Vyas), lays his hands on evidence against Ravikant’s equally corrupt police officer-son, ACP Dev (Sikandar Kher). Since Vishnu is the only honest cop in the family, he threatens to expose brother-in-law Dev and in order to prevent this Ravikant kills Vishnu. Ravikant also plans to take over Yashvardhan's empire with help from Neena. Ravikant orders Arya to kill Veera and Ajay. Arya, disillusioned by Ravikant's inhuman attitude, finally understands the choice his father Vijaykant made earlier to protect Vishal and his mother.Meanwhile, Vishal is called for a meeting by Neena and her new partner, Bilal. Ravikant wants Vishal to use the meeting to give him more information about Yashvardhan. Ravikant plans things in such a way that Yashvardhan would be killed once the meeting between Vishal and Neena is over. Arya realises that Ravikant wants to eliminate Yashvardhan not as much to complete brother Vijaykant’s mission as to take over Yashvardhan’s business empire. Also, Vishal has revenge written all over him because Neena’s son, Inder (Kavi Shastri), had killed Ritu. Here, Ajay finally relents and agrees to help Arya but he also wants his dad, Yashvardhan’s safety. Arya asks Ajay to attend the meeting in place of Vishal. Ajay kills Inder and when Inder's gang tries to kill Ajay, Arya's police team encounters all. Meanwhile Arya has sent Vishal to the Hospital to save Yashvardhan. He also arranges his Police force to raid the Hospital. However Dev sends back the team. He later corners Vishal and Yashvardhan in the Hospital Store Room. Just when Dev was about to kill them, Ajay appears and shoots him. Ajay and Yashvardhan convinces Vishal to escape. Just when Vishal escapes Dev shoots and kills Yashvardhan. In retaliation Ajay kills Dev. When Dev's team was about to kill Ajay, Arya's police force rescues him by arresting Ajay. Arya helps Vishal and Veera escape. Ravikant meets Arya and Arya informs that he has the recordings of Neena's meeting which will expose Ravikant. Ravikant shoots Arya and just when he was about to kill him Vishal comes back and kills Ravikant.Arya, even though injured, rides back to his pregnant wife Suman (Swara Bhaskar). Vishal and Veera gets back to their earlier life while Ajay is jailed. The film then moves one year forward where we are shown that Ajay has re-united with Vishal and Veera once he is released from Jail. We also hear a voiceover of Arya saying \"This system of collection has been in place for years. The money from this system goes all the way up to the seniors and ministers. The nexus is not going to come to an end with just my Uncle's death. The DCP said that only two powers would survive - the politicians and the corporates. But if a policeman doesn't take bribes from any of them then he won't fear them either.\" In the final scene we see Arya leaving Veera's home once he makes sure that Ajay is re-united with his family.","language":"Hindi","Critical reception":"The response of critics and audience was positive. Meena Iyer of The Times of India gave the film 3.5/5 stars.[6] Sukanya Verma of Rediff.com gave the film 3/5 stars, saying performances of Rishi Kapoor and Arjun Kapoor are the best thing about Aurangzeb.[7]","box_office":"₹230 million (US$3.4 million) [2]","cinematography":"Karthik Ganesh","production_company":"Yash Raj Films","directed_by":"Atul Sabharwal","release_dates":"17 May 2013 (2013-05-17)|||||","Box office":"On its opening day the film made a collection of ₹3 million (US$45,000). It had a 3 week run at the theaters declaring itself as an Above average venture.[1]","aurangzeb":"First Look Poster","produced_by":"Aditya Chopra","starring":"Prithviraj Sukumaran Arjun Kapoor Sasha Agha Rishi Kapoor Jackie Shroff","running_time":"137 min","music_by":"Amartya Rahut Vipin Mishra","edited_by":"Niraj Voralia","budget":"₹200 million (US$3.0 million)[1]"}