{"country":"United States","distributed_by":"Rogue Pictures","Plot":"A young mild-mannered American couple, Cliff (Zahn) and Cydney (Jovovich), are celebrating their marriage by hiking to a remote beach in Hawaii while on their honeymoon. On their way, they see two hitchhikers, Cleo (Shelton) and Kale (Chris Hemsworth). They offer the pair a ride but change their minds when the two seem possibly dangerous.After they begin the hike, the couple comes in contact with Nick (Olyphant), a solo hiker who claims to be an Iraq War veteran. Nick saves Cydney's life when she slips while attempting to cross a narrow ledge. The trio approaches a group of frightened female hikers discussing a double murder in Honolulu. The victims had their teeth pulled out and fingertips removed. Cliff suspects the hitchhiking couple are the murderers, and Cydney and Cliff discuss whether or not they should turn back, but decide to continue hiking with Nick. They subsequently meet up with Nick's sexy girlfriend, Gina (Sanchez) at the Secret Falls Waterfall.Cliff suspects Kale and Cleo are following them. When he notices their permits are missing, Cliff sees Kale and Cleo's bags by the trail and goes through them, but he does not find the permits. After making camp, Nick and Cliff split up to search for Kale and Cleo. Cliff runs into a guide who is bringing Cliff the permits they left behind. Cliff and Nick return to the campsite. Nick brings a goat he has killed, and Gina proceeds to butcher the animal, explaining she had learned how while working in the meat department of a grocery store.The following day, Kale and Cleo are arrested for the murders. A container full of pulled teeth is found in one of their bags. The two couples are relieved by the arrests, and they continue their hike to the beach. Cliff rents two kayaks so he and Nick can explore a marine cave.As Gina idly looks through the photos on Cydney and Cliff's video camera, she is terrified when she realizes the couple are not who they claim to be. Gina sets off after Nick and Cliff, while Cydney chases after Gina.Flashbacks reveal that Cliff and Cydney are drug-addicted sociopaths who murdered the newlyweds. They kill people and steal their identities in order to, as Cliff explains, \"live a hundred different lives and achieve a kind of immortality\". It is also revealed that \"Cliff\" had planted the bag of teeth in Kale and Cleo's bag to frame them for the murders.In the Sea cave, Cliff suddenly reveals his true murderer identity and shoots Nick in the head. Gina witnesses this from the cliffs above. Then Cliff shoots at her, but misses. Cydney sneaks up on Gina and attacks her. Gina is stabbed in the leg but manages to push Cydney off the cliff into the water.Even though they haven't had a signal during the entire trip, Gina fortuitously receives a call on her cell phone from a phone company representative. She begs him to call the police. She spots Cydney below in the kayak just as Cliff pops up over the cliff ledge to grab her feet. Gina stabs him in the hand with Cydney's knife and flees.While Cliff chases Gina and Cydney kayaks ashore to intercept the police, Nick, saved by the titanium plate in his head from his war wound, wakes up. Gina runs into a group of men searching for their stolen kayaks, who tell her she is safe now. Cliff tries to convince the men that Gina is irrational due to meth use. But one of the group happens to be an EMT and notices Cliff's enlarged pupils, which undermines his story. So Cliff shoots and kills the entire group of men. Gina uses Cliff's distraction as an opportunity to run toward the beach. Nick arrives and fights Cliff, getting the upper hand. At that point, the police arrive by helicopter with a rifle aimed at Nick. Cydney is also in the helicopter, and the police want her to confirm that Nick is the killer, but she pauses. Cydney identifies Cliff as the murderer and says he ruined her life. The police sharpshooter kills Cliff as he reaches for his gun to kill Nick. Later Nick finally proposes to Gina in the helicopter but due to their traumatic encounters, they both agree to not having a honeymoon.","a_perfect_getaway":"Theatrical release poster","language":"English","Reception":"The film received mixed to positive reviews from critics. Based on an average of 22 reviews, Metacritic gave the film 63 out of 100.[3] A Perfect Getaway averaged 61% on Rotten Tomatoes based on 133 reviews.[4]The New York Times referred to the film as a \"genuinely satisfying cheap thrill\".[5] More mixed reviews include the Times Online, which gave the film 3 out of 5 stars, adding that it is a \"smart\" thriller but is a \"little too tricky for its own good\".[6] Additionally, The Guardian rated the film 60% and said that the film is a \"flawed but entertaining thriller\".[7] Michael Phillips gave the film 2 1/2 stars (out of four) and stated that A Perfect Getaway \"has the fortitude to venture off the beaten path of formula.\"[8]Timothy Olyphant was the first runner-up for Toronto Film Critics Association Award for Best Supporting Actor.","box_office":"$22,852,638[1]","cinematography":"Mark Plummer","production_company":"Relativity Media QED International","directed_by":"David Twohy","release_dates":"August 7, 2009 (2009-08-07)","produced_by":"Ryan Kavanaugh Mark Canton Tucker Tooley Robbie Brenner","starring":"Timothy Olyphant Milla Jovovich Kiele Sanchez Steve Zahn","running_time":"Theatrical cut: 97 minutes Unrated cut: 107 minutes","music_by":"Boris Elkis","edited_by":"Tracy Adams","Release":"The film was released in the United States on August 7, 2009 and grossed $5,948,555 in its opening weekend.[1] The film made £418,703 in its first week in the United Kingdom and reached number 10 at the UK box office.[citation needed] Worldwide, it grossed $22,852,638.[citation needed]The unrated director's cut DVD and Blu-ray were released on December 29, 2009.[2]","written_by":"David Twohy","budget":"$14 million[1]"}