{"country":"United Kingdom United States","distributed_by":"Avco Embassy Pictures Metro Goldwyn Mayer (current)","carbon_copy":"Theatrical release poster","Plot":"Roger Porter (Washington) is the long-lost black son of Walter Whitney (Segal), a respectable businessman who lives in the all-white community of San Marino, California. Walter, who is Jewish, has been hiding that fact for purposes of professional advancement in the business which his anti-Semitic father-in-law (Warden) heads.Once Roger turns up at Walter's office, it turns out that he is the result of Walter's relationship with a black woman, who is now dead. Walter's father-in-law had warned him that the relationship would be harmful to his career, so he broke it off.Walter attempts to help Roger by telling his wife Vivian (Saint James) that he wants to adopt him. She accepts, but soon regrets the decision and ends up kicking Walter out. Her father also fires him, taking his car and benefits in the process. Penniless, he and Roger check into a motel, and later move into an apartment. Walter ends up as a menial manual laborer, shovelling horse manure.The final ten minutes makes the transition from comedy to drama, where Walter has to choose between either acceptance that Roger is his son, or alienation of Roger to salvage his own position in society.","language":"English","box_office":"$9,566,593","cinematography":"Fred J. Koenekamp","production_company":"First City - Hemdale - RKO Pictures","directed_by":"Michael Schultz","release_dates":"25 September 1981 (1981-09-25)|||||","Home video releases and TV broadcasts":"This film is hardly shown on television due to its racial themes, though it was broadcast once on ABC in March 1983 and does sometimes appear on premium movie channels, along with the most recent airing on Comedy Central in 2011 (though the print used was from the 1980s TV airing, meaning less-than-stellar film quality and had moderate edits).The film was released on VHS in 1983, 1989, 1994, and 1999. It was released on laserdisc only once in 1984.The film was released on DVD in 2004 by MGM-DVD, but the film was presented in full screen and the film master is from the laserdisc release, being low resolution and often with shifts in quality and color balance.A remastered, uncut high-quality HD print is sometimes broadcast on the MGM-HD Channel. The film has appeared on ThisTV, which features films from the MGM library, and Bounce TV.","produced_by":"Stanley Shapiro Carter DeHaven","starring":"George Segal Denzel Washington","running_time":"92 min.","music_by":"Bill Conti","Filming Locations":"417 Amapola Ln, Bel Air, Los Angeles, California (Home the family lived in)","written_by":"Stanley Shapiro"}