{"based_on":"Diary of a Mad Black Woman  by Tyler Perry","country":"United States","distributed_by":"Lionsgate","Plot":"Helen (Kimberly Elise) and Charles (Steve Harris) McCarter have money, success, and a fine home. Their lives were perfect -- on the surface. Helen is unemployed and Charles, an attorney, has been having multiple affairs. On their 18th wedding anniversary, Helen finds all her belongings in a U-Haul, as Charles is kicking her out for Brenda (Lisa Marcos), his young mistress and the mother of his two children.Helen kicks the driver, Orlando (Shemar Moore), out of the truck and visits her intimidating grandmother, Madea (Tyler Perry). Madea takes Helen in and helps her get back on her feet, to the dismay of Madea's brother, Joe (Perry). Joe's son, Brian (Perry), acts as Madea and Helen's attorney after Charles and Brenda catch the pair breaking into and vandalizing Charles's mansion. Because Madea is a repeat offender, the judge (Mablean Ephriam) places her under house arrest and sets a $5,000 property or cash bond for Helen.Brian kicks his addict wife, Deborah (Tamara Taylor), out of their home. Helen cultivates a relationship with Orlando. Jamison Milton Jackson (Gary Anthony Sturgis) asks Charles to be his defense attorney in his trial for shooting an undercover cop during a drug deal and to possibly bribe the judge. It is revealed that Charles receives much of his money through drug deals and buying off judges.In court for divorce, Helen lets Charles keep all the money and property, provided he pay Brian's attorney fees. She also wants Charles to pay for her mother's nursing home, since he made her admit her mother. Charles agrees. The jury finds Jamison guilty, and Charles loses the case. Jamison snatches the bailiff's gun and shoots Charles.Orlando proposes to Helen. Before Helen can respond, she sees the shooting on the news and goes to the hospital with Brian. They run into Brenda. The doctor says Charles might be paralyzed for life and asks if they should resuscitate him if things deteriorate. Brenda chooses to let Charles die, but Helen, still Charles's legal wife, tells the doctor to do everything they can for him. Charles recovers, returns home with Helen, and resumes his verbal abuse. Helen retaliates for years of verbal and emotional abuse. Brenda is revealed to have emptied Charles's bank account and left with the children. Their maid, Christina, leaves because Charles has no money to pay her. All of Charles's friends and associates have turned their backs on him.Helen and Orlando argue when he learns she has moved back in with Charles to look after him. He leaves in anger. Charles realizes his mistakes and apologizes to Helen. He becomes a kinder man, while she helps him recover. He regains his ability to walk one day in church, where Deborah, now clean and sober, reconciles with Brian. Charles hopes to start over with Helen, but during a family dinner, she gives him her wedding ring and signed divorce papers and tells him she will always be his friend. She finds Orlando, asks him to propose again, and accepts when he does.","language":"English","Reception":"Diary of a Mad Black Woman received mostly negative reviews. Rotten Tomatoes gives the film a score of 16% based on 112 reviews. The site's consensus reads \"Tyler Perry's successful play can't make the move to the screen; this mix of slapstick, melodrama and spirituality lacks a consistent tone.\"[3] Metacritic gives the film a weighted average score of 36% based on reviews from 30 critics, which the site considers \"generally unfavorable reviews\".[4] Despite the negative reviews, CinemaScore reported that audiences gave the film a rare \"A+\" grade.[5] Roger Ebert gave the film one out of four stars, arguing that the Madea character \"is not remotely plausible [and] not merely wrong for the movie, but fatal to it.\" However, Ebert also wrote that Elise, Tyson and Harris offered effective performances and that \"[t]here's a good movie buried beneath the bad one.\"[6]On its opening weekend, the film arrived at #1 with $21.9 million. The film grossed an estimated $50.6 million in the United States and Canada with an additional $19,000 internationally for an estimated worldwide total of $50.7 million.[1]In early 2008, playwright Donna West filed suit against Perry, contending that he stole material from her 1991 play, Fantasy of a Black Woman. Veronica Lewis, Perry's attorney, said there was no need for her client to appropriate the work of others.[7]On December 9, 2008, the case was tried before Judge Leonard Davis in the United States District Court for the Eastern District of Texas. The jury returned an 8–0 verdict in favor of Perry.[8][original research?]","box_office":"$50.7 million[1]","cinematography":"David Claessen","production_company":"Lionsgate BET Pictures","directed_by":"Darren Grant","diary_of_a_mad_black_woman":"Theatrical release poster","Music":"The soundtrack was released by Motown Records on April 19, 2005.","release_dates":"February 25, 2005 (2005-02-25)|||||","produced_by":"Reuben Cannon","starring":"Kimberly Elise Steve Harris Shemar Moore Tamara Taylor Tiffany Evans Cicely Tyson Tyler Perry","running_time":"116 minutes","music_by":"Camara Kambon","edited_by":"Terilyn A. Shropshire","written_by":"Tyler Perry","budget":"$5.5 million[1]"}