{"based_on":"The Delta Force  by Menahem Golan James Bruner","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"South American drug lord Ramon Cota (Billy Drago), the richest drug kingpin in the world, controls the cocaine industry with an iron fist. His drugs pour steadily into America, corrupting the country's youth and causing a feud between the DEA and San Carlos, Cota's (fictional) country of origin.The film opens during a carnival in Rio de Janeiro, as an undercover task force led by several DEA agents conducts surveillance on a private party that Cota is attending (similar to a Mardi Gras ball); however, the surveillance team is ambushed and massacred by Cota's hitmen, who are masquerading as carnival performers. Due to the Rio fiasco, The DEA enlists the support of the U.S. Army's Delta Force in order to infiltrate San Carlos. They are aided by an undercover agent within Cota's drug cartel.General Taylor orders Colonel Scott McCoy (Chuck Norris) and his partner, Major Bobby Chavez (Paul Perri) to bring Cota to court. They pose as airline passengers while Cota is en route to Geneva to deposit his drug money in a Swiss bank account, and are able to capture him during a short interval in which the plane enters U.S. airspace. However, their efforts amount to nothing as Cota is easily able to post bail and escape. Unable to contain his rage, Chavez furiously lashes out at Cota in court. Cota decides to strike at Chavez by having Chavez's pregnant wife and 13-year-old brother killed.Out on a personal mission of vengeance, Chavez is captured by Cota's forces and is tortured and killed. When three DEA agents attempt to go in and bring Cota and his army down, they are taken hostage, and are to be executed. During a press conference, a spokesman for the DEA explains that San Carlos's president Alcazar fears a coup and is therefore reluctant to crack down on the cartels, while his corrupt generals benefit from the drug trade and are willing to protect Cota from extradition.McCoy is parachuted into San Carlos and sent to rescue the hostages in a stealth operation, while Taylor and the rest of the Delta Force perform surveillance. Their mission is supervised by a delegate from the government of San Carlos, which has entered an agreement with the U.S. government that severely limits the scope of the mission. Meanwhile, McCoy scales a tall cliff and infiltrates Cota's mansion.Later, the government of San Carlos attempts to cancel the U.S. intervention outright by staging a massive drug raid that would make the American mission unnecessary. Upon learning of the hoax, Taylor breaks protocol and heads south of his perimeter in a heavily armed gunship, prompting the San Carlos army to send their own choppers in pursuit. The chopper lands at Cota's mansion and deploys troops to destroy cocaine storehouses and laboratories. McCoy succeeds in releasing the hostages, but is captured by Cota and placed in a chamber filled with toxic gas and isolated by a glass pane. Before the gas can kill him, however, a rocket from Taylor's gunship shatters the glass, allowing him to break through.With the help of DEA Agent Page, McCoy captures Cota in his own armored limousine and flees the mansion. Cota's bodyguards and a San Carlos attack helicopter pursue the vehicle and eventually bring it to a halt, but Taylor's gunship saves them. Cota flees on foot through the jungle during the fighting. After the drug lord kills a villager who wanted revenge for the murder of her family, McCoy arrives and beats him. Cota then tries to goad McCoy into killing him, knowing he is wanted alive.Taylor's helicopter arrives to pick up McCoy and his prisoner with ropes, as the last few of Cota's men close in. One of them swings his machete but only manages to partially cut Cota's rope before the helicopter heads out to sea to join the American carrier fleet. Hanging beneath the chopper, Cota continues to goad McCoy about his invulnerability, saying that once in court he will walk free again. However, the rope grows thinner from the machete cut, until it snaps completely. The film ends as the drug baron falls thousands of feet to his death.","delta_force_2":"Theatrical release poster","language":"English","box_office":"$6,698,361 (United States)[1]","cinematography":"João Fernandes","production_company":"The Cannon Group","directed_by":"Aaron Norris","release_dates":"August 24, 1990 (1990-08-24)|||||","Production":"Although the film is set principally in South America, most of the scenes set in the fictional South American country of San Carlos and rural Colombia were shot in Tagaytay City, Philippines. This explains the visibility of the Taal Volcano in some scenes.On May 16, 1989, during a filming in a nearby area of Batangas, Philippines, a helicopter crash on set killed four crew members and the pilot Capt. Jojo Imperial. The movie is dedicated to their memory.[3][4][5][6]","produced_by":"Golan-Globus","starring":"Chuck Norris|John P. Ryan|Paul Perri|Richard Jaeckel|Begoña Plaza|Mateo Gómez|Héctor Mercado|Billy Drago|","running_time":"111 minutes","Box Office and Reception":"Delta Force 2 made $1.85 million in its first week ranking 6th overall.[7]The critical reaction was negative. The movie was criticized for having little in common with its predecessor, a poor script, clichés, sup-par acting, and similarities to the earlier Norris vehicle Missing in Action.[8][9][10][11]","Sequel":"The film was followed by Delta Force 3: The Killing Game starring Mike Norris.","music_by":"Frédéric Talgorn","edited_by":"Michael J. Duthie","written_by":"Lee Reynolds"}