{"based_on":"Animals Are My Hobby  by Gertrude Davies Lintz","Cast":"Dane Cook cameos as a cop at the Chicago World's Fair.Buddy operated by Peter Elliott (adult Buddy), Lynn Robertson Bruce (juvenile Buddy), Peter Hurst, Mark Sealey (toddler Buddy), Michelan Sisti, Leif Tilden, Star Townsend, Robert Tygner, and Mak Wilson (facial controls)Buddy's vocal effects provided by Hector C. Gika, Gary A. Hecker, and Frank Welker.","country":"United States","distributed_by":"Columbia Pictures","screenplay_by":"Caroline Thompson","story_by":"William Joyce Caroline Thompson","Plot":"Millionaire animal lover and overall spoiled rich girl Trudy (Rene Russo) adds Buddy, a gorilla, to her family. Buddy finds life in the city very difficult to deal with. Although Trudy raises him as her own son in her mansion (which also houses a few comical chimpanzees, a kitten, a horse, a cheeky, talking green parrot, her prize-winning champion pack of Briards, a raccoon and a flock of geese), he becomes hard to control due to his strength. A particularly bad experience in the Chicago World's Fair makes things even harder for Buddy. After he goes on an aggressive rampage and nearly destroys Trudy's home, Buddy is taken to an ape sanctuary to live among his own kind in peace.","language":"English","Reception":"In spite of the film's message, animal activists still objected over the depiction of chimpanzees as docile pets, happily carrying on wearing human clothes. Among their concerns, the perpetuation of the idea of chimps as acceptable pets is often cited.Buddy received negative reviews from critics, as it holds a 25% rating on Rotten Tomatoes based on 20 reviews. The film was criticized for its unrealistic animatronics, especially when compared to the real ape performers.","box_office":"$10,113,400","cinematography":"Steve Mason","production_company":"Jim Henson Pictures American Zoetrope","directed_by":"Caroline Thompson","Production notes":"Rene Russo began rehearsals with the chimpanzees a month before principal photography even started.","release_dates":"June 6, 1997 (1997-06-06) (North America)|May 23, 1997 (1997-05-23) (New Zealand)||||","produced_by":"Fred Fuchs Steve Nicolaides","starring":"Rene Russo Robbie Coltrane Alan Cumming Irma P. Hall Paul Reubens","running_time":"84 minutes","buddy":"Canadian Theatrical release poster","music_by":"Elmer Bernstein","edited_by":"Jonathan Shaw","budget":"$19 million"}