{"country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Brad Bird Matthew Robbins Brent Maddock S.S. Wilson","story_by":"Mick Garris","Plot":"Frank and Faye Riley (Hume Cronyn and Jessica Tandy), an elderly couple who run an apartment building and café in the run-down East Village neighborhood, come under threat by a nearby property development. The development manager, Lacey, sends a hoodlum named Carlos and his gang of thugs to bribe the couple and their tenants to move out. When the tenants resist, Carlos and his thugs punch through artist Mason Baylor's (Dennis Boutsikaris) door, intimidate pregnant single mother Marisa Esteval (Elizabeth Peña) and break retired boxer Harry Noble's (Frank McRae) jar of tiles. After Frank Riley refuses to move, Carlos vandalizes the café.This assault convinces three of the tenants to move out. Mason's girlfriend, Pamela is tired of living in an old, depressing building with a guy whose art career is going nowhere. She dumps Mason, packs up and before leaving, advises Mason to quit being an artist and get a steady job. The Rileys' friends, Muriel and Sid Hogensin take Lacey's bribe and decide to move to a nice retirement home in New Jersey. Frank feels a little betrayed by the Hogensins for taking Lacey's bribe but they explain that the building and the area it's in just doesn't feel like home anymore. They advise Frank that maybe he and Faye should do the same and come live with them at the retirement home. With the assault and Faye's dementia growing, Frank contemplates giving in.Things look bleak until the appearance of a pair of small living space ships descend into the Rileys' apartment that evening, repairing many of the items that were broken. They have the ability to repair anything that's broken in a matter of seconds and even making it look brand new. Apparently, when they repair something, they don't repair just recent damage, but \"all\" of the damage. They even repair the vandalized cafe, putting Frank and Faye back in business. The two extraterrestrials take up residence in the shed at the top of the apartment building, and are dubbed \"The Fix-Its\" by the residents of the building. Carlos comes back to threaten the tenants once again, but the Fix-Its lure him to the top of the building and into the shed where they scare him away.Faye and Marisa learn that the \"female\" Fix-It is pregnant. After consuming plenty of metal and electrical objects, it gives birth to three baby Fix-Its, although one of them is stillborn. Faye buries the stillborn in a flowerpot the next day, but then Harry digs it up, takes it back to his apartment, and succeeds in reviving it by taking apart his precious television set. Frank and Faye see a boost of business in the café from the demolition crew, while the Fix-Its help in the kitchen.Mason and Marisa grow closer. Marisa finds Mason's paintings very nice, which makes Mason feel better about his artwork and not to give up on it. Marisa's baby is due in 2 or 3 months. Her boyfriend, Hector who is a traveling musician and also the father of her baby comes over. Mason leaves Marisa and Hector alone but when Mason returns, Hector is gone. Marisa explains that Hector and his band have found a steady gig in Chicago with good pay. Mason wonders why Hector would leave without her. Marisa confesses that she told Hector to go without her because their relationship just wasn't working out. But it also appears she has developed feelings for Mason. Mason has developed feelings for her as well.With Carlos unable to prove the existence of the Fix-Its that had been foiling their plans, Lacey, the development manager, is furious with the delays in evicting the tenants and moves to replace him. Desperate to see the job done and growing more unstable, Carlos breaks into the building's basement to sabotage the building's pipework and electricity, and badly damages the \"father\" machine in the process. After Harry throws him out, the tenants discover the Fix-It children are missing and go searching for them in the city while Faye stays behind with the \"mother\" machine as it fixes the \"father\". When the \"father\" machine is repaired, the now-wary Fix-It parents leave to seek out their offspring. After finding them with Harry, the machine family departs from the planet.Tired of the delays, Lacey's subordinate Kovacs sends a professional arsonist to burn down the building in a staged \"accidental fire\". Carlos discovers the plan and in a rage sabotages the arson to make the entire building explode, only to then discover that Faye is still in the building. While the arsonist flees, Carlos unsuccessfully attempts to pose as her late son Bobby to get her to leave, but succeeds in rescuing her as the fire spreads. The tenants then return to find the blazing apartment block collapsing, and Faye being loaded into an ambulance.By the next morning, the apartment block has been reduced to a smoldering wreck. To Kovacs' fury, construction is still unable to continue as Harry, sitting dejected on the steps, refuses to leave. Harry is then greeted by the mechanical family later that night, who have recruited countless other Fix-Its for repairs. By the next morning the entire building has been seamlessly restored to brand new condition, forever ending Lacey's demolition plans and resulting in his termination of Kovacs. Mason and Marisa settle into a relationship, while Carlos ironically tries to start a friendship with the Rileys, with Faye finally having come to accept her real son's passing. The story then rolls on to an undisclosed period some years later in the future, revealing that skyscraper developments have eventually been built, but this time flanking either side of the tiny apartment building, with Frank's café now doing a roaring trade as a result of the new employment brought into the area.","batteries_not_included":"original movie poster by Drew Struzan","language":"English","Reception":"The movie gained a mostly mixed reception[4][5][6][7] debuted at #4 at the box office.[8][9] It has a rating of 64% at Rotten Tomatoes.[10]","box_office":"$65.1 million","cinematography":"John McPherson","production_company":"Amblin Entertainment","directed_by":"Matthew Robbins[1]","release_dates":"December 18, 1987 (1987-12-18)|||||","Production":"Principal photography started in New York in August 1986, but location scouting began almost a year before. \"Since the story called for a solitary building amidst rubble,\" explained producer Ronald Schwary, \"we had to find a vacant lot with burned-out buildings all around it. We finally settled on an actual building on 8th Street between Avenues C and D on New York's Lower East Side (the building no longer stands, and was probably located on the site of the current Housing Bureau substation, or the building to the east, approx 40°43′27.33″N 73°58′40.49″W﻿ / ﻿40.7242583°N 73.9779139°W﻿ / 40.7242583; -73.9779139).[3] Production designer Ted Haworth designed a three-sided, four-story tenement facade and oversaw its construction on a location that covered most of a city block. In the name of authenticity, he brought 50 to 60 truckloads of rubble to cover the once vacant lot. It was so remarkably realistic that the Sanitation Department came by and took away prop garbage one morning, potential customers stopped by to eat in the diner, and the business agent for the Plumber's Local of New York visited, demanding to know why there wasn't a permit down at City Hall for the construction.\" [info from DVD Production Notes]The final scene before the end credits has an understanding of construction progress that happens around Riley's Café, without it being affected as tall skyscrapers appear, one at a time, around the tiny building. The new buildings used in the shot near the café are from the World Trade Center even though they had already existed for some time by 1987. Street traffic is seen moving as well as people walking on a foot bridge, indicating a filmed shot at the Trade Center area but the pointed black skyscrapers appear to be[original research?][citation needed] duplicated optically to contrast with the tiny café. What looks to be the U.S. Steel Building at 1 Liberty Plaza, seems to be the first to appear in the final shot. The scene itself is a non-existent location but the shot appears to be on Trinity Place, facing North with Zuccotti Park, {formerly Liberty Plaza Park} and the U.S. Steel Building both on the lower right.","produced_by":"Kathleen Kennedy Frank Marshall Ronald L. Schwary","starring":"Hume Cronyn|Jessica Tandy|","running_time":"107 minutes","music_by":"James Horner","edited_by":"Cynthia Scheider","budget":"$25 million[2]"}