{"based_on":"Detective Conan by Gosho Aoyama","country":"Japan","distributed_by":"Toho","detective_conan:_dimensional_sniper":"Theatrical poster","Plot":"Sonoko invites Conan, Agasa, Ran, Kogoro and the Detective Boys to the pre-opening ceremony and the observation deck of Bell Tree Tower, built by the Suzuki Financial Group. While they are there, a sniper shoots at one of the guests, Hiroaki Fujinami, from a nearby building. Conan, having observed the possible suspect, pursues the suspect with Masumi Sera joining later. The suspect blows up police patrol cars during the escape and despite the FBI's attempt to follow the suspect, the suspect jumps away to the Tokyo Bay. Tokyo Metropolitan Police and FBI later concludes that Timothy Hunter, an ex-Navy SEALS and former recipient of Silver Star decoration is a possible suspect. The FBI believes Hunter also attempted to murder two former American military officers, Jack Waltz and Bill Murphy, and another Japanese civilian, Hitoshi Moriyama.FBI investigation revealed that Hunter may have been supplied equipment from either Scott Grean, Kevin Yoshino or Mark Spencer, all of which are former American military officials in Japan. While the investigation is ongoing, Moriyama was sniped from great lengths, and Hunter was killed. Media speculation spread news that the recent sniping may be a random spree, creating public chaos. The same night, Murphy who was in Nikkō with Waltz was asked to come to Tokyo by letter apparently written by Mark Spencer. In an attempt to stop Murphy's assassination on the train, Conan attempted to block line of culprit's sight only to be in line of culprit itself. Sera injured herself while attempting to push Conan out of sight and was taken to hospital while Murphy were eventually killed.Fearing for his own safety and also being asked by the American military officials in Japan to end the case quietly, Jack Waltz attempted to murder the culprit in the entire case. Unbeknownst to Waltz, Waltz himself is the last target of the culprit, Kevin Yoshino. Yoshino is Hunter's student and the two help crafted the plan to revenge against Waltz and Murphy for attempting to assassinate Hunter during the Middle East operation to ensure that Hunter will not receive the Silver Star decorations. Hunter survived the attempted murder but is severely wounded and discharged from the Navy, only to face misfortune from Fujinami and Moriyama. Conan, who happened to realize that Waltz is about to be murdered, push Waltz away, causing Yoshino who is sniping from Bell Tree Tower to switch target. While under fire, a mysterious sniper Subaru Okiya shot to Yoshino, causing Yoshino to shock as the range of fire is greatly excesses his ability or Hunter's. Yoshino take cover in the observation deck of Bell Tree Tower and took Ayumi hostage. While Yoshino is fighting with FBI, Okiya attempted to take down Yoshino from afar, but being blocked from clear line of sight and lack of lighting to guide the target. Conan, having realized Okiya's plan, kicked the ball from his position which exploded into fireworks, causing night vision Yoshino is wearing to blind and Okiya is able to shoot and disable Yoshino's weapon, making way for Ran and FBI to take him to custody. Okiya later answered call by James Black, the chief of FBI team in Japan, with Shuichi Akai's voice.","language":"Japanese","Reception":"The film has grossed ¥4 billion in Japan.[2]","box_office":"¥4 billion","cinematography":"Ikuyo Fujita Kazuki Kosuda","production_company":"TMS Entertainment","directed_by":"Kobun Shizuno","japanese":"名探偵コナン　異次元の狙撃手スナイパー","release_dates":"April 19, 2014 (2014-04-19)|||||","hepburn":"Meitantei Konan: Ijigen no Sunaipā","produced_by":"Michihiko Suwa","starring":"Kappei Yamaguchi Minami Takayama Wakana Yamazaki Rikiya Koyama Megumi Hayashibara Naoko Matsui Ikue Ohtani Wataru Takagi Chafurin Atsuko Yuya Miyuki Ichijou Shūichi Ikeda Kiyoyuki Yanada Noriko Hidaka Ryotaro Okiayu Sota Fukushi Patrick Harlan","running_time":"110 minutes","music_by":"Katsuo Ono Aki Yokoyama Masakazu Yokoyama Hisako Ono Takao Kondo","edited_by":"Terumitsu Okada","written_by":"Kazunari Kochi"}