{"based_on":"Novel: Jack Finney","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Stuart Gordon Dennis Paoli Nicholas St. John","story_by":"Raymond Cistheri Larry Cohen","Plot":"Steve Malone, an agent from the Environmental Protection Agency, is sent to a military base in Alabama to test possible effects on the surrounding ecological system caused by military actions. With him is his teenage daughter from his first marriage, Marti, his second wife Carol, and Marti's half brother Andy. On their way to the base, they stop at a gas station. In the restroom, Marti is threatened by an MP member with a knife. When he notices her fear, he lets go of her, satisfied that she shows an emotional response. Before she leaves the room, he warns her, \"they get you when you sleep\".Steve and his family move into their new home on the base, and Marti makes friends with the base commander's daughter Jenn. On his first day in day care, Andy runs away because he is recognized as an outsider among the other somehow conformist children. He is picked up and brought home by helicopter pilot Tim. Marti and Tim quickly feel attracted to each other. Meanwhile, while examining soil samples, Steve is approached by medical officer Major Collins, who asks him about psychological effects particularly narcophobia (the fear of sleep) and their possible relation to toxication of the environment. Steve believes that a physiological reaction would be more likely.In the evening, Marti and Jenn go to the bar attended by the station's military personnel, where they meet not only Tim but also the MP who threatened Marti at the gas station. He denies that they ever met before. That night, a group of soldiers can be seen picking giant pods from the river running by the base. When Andy wakes up and enters his mother's room, Carol crumbles to dust, while a soulless double emerges from the closet. Nobody believes Andy's story that his real mother is dead and the person pretending to be Carol is only an impostor.The following night, Marti and her father are nearly \"taken over\" too by duplicates emerging from the giant pods. Carol attempts to convince Steve that the takeover is a good thing, claiming that it ends confusion and anger. She also claims that there's no place to go, as the invasion is not an isolated incident. Steve is almost shocked and saddened into compliance, but Marti and Andy drag him out the door. Carol emits a shrill and mechanical scream that alerts other \"pod people\" to the presence of a human being. Now the majority in numbers, they swarm over the base chasing the remaining humans.After hiding Marti and Andy in a warehouse, Steve enters Major Collins' office. The hysterical Major tries to call for help, but the line is blocked. While swallowing sleep-prevention pills Collins announces that it is too late to run; all they can do is fight. Their conversation is interrupted by the arrival of a group of pod people, led by base commander General Platt. While Steve hides, the pod people try to convince the Major that the individual is not important, and that only conformity can solve the world's problems. The Major shoots himself rather than live in such a world.Steve returns to his children and tells them to follow him, claiming to have found a way out. They drive aimlessly through the military base, as loudspeakers shout out instructions for spreading the invasion by carrying out pods in trucks. Realizing that her father was replicated while he was away, Marti swerves the car to the side and tries to escape with her brother. Tim, who escaped his former comrades who tried to turn him into one of them, enters the scene. Marti takes his gun and shoots the person pretending to be her father. The father duplicate shrinks into a mass of seething, bloody goo.Tim manages to get hold of a helicopter gunship, but Marti and Andy are taken away by the pod people. They sedate both of them and take them to the base infirmary where the remaining human beings are systematically duplicated by pods. Tim is able to rescue Marti, and although Jenn and Andy (now duplicates themselves) try to stop them, Tim and Marti manage to escape in the helicopter.The ending of the film is an ambiguous one. Tim destroys the trucks filled with pods with the helicopter's rockets, while Marti confesses her profound hatred in a voice-over narration, thereby hinting at a loss of humanitarian quality. While they land on another base, the words of Marti's stepmother earlier in the film can be heard, suggesting that the phenomenon may have already spread beyond the army base: \"Where you gonna go, where you gonna run, where you gonna hide? Nowhere... 'cause there's no one like you left.\"","language":"English","Reception":"Body Snatchers was shown in competition at the 1993 Cannes Film Festival, receiving very positive reviews from some critics. Roger Ebert considered it superior to the previous adaptations of Finney's famous novel and in his review (February 25, 1994) gave it four stars out of four, praising it for psychological realism and social criticism. Ebert stated \"as sheer moviemaking, it is skilled and knowing, and deserves the highest praise you can give a horror film: It works\".[2] Nick Shager of the horror film review site Lessons of Darkness said in his review of the film, \"this economical horror show still offers a few stunning moments of paranoia-laced terror\".[3] Blake Davis of KFOR Channel 4 News said of the film: \"One of the creepiest and most overlooked horror movies made in the past decade, featuring a strong, scary turn by Meg Tilly\".[4][5]However, some critics panned the film — Richard Harrington of the Washington Post (February 18, 1994) called it \"a soulless replica of Don Siegel's 1956 model and Philip Kaufman's 1978 update\".[6] Owen Gleiberman noted in Entertainment Weekly (February 11, 1994), \"[the] notion of a military base as a symbol of mindless conformity isn't exactly revelatory, and the characters remain sketchy and underdeveloped.\"[7]The film currently has a \"fresh\" 71% rating on Rotten Tomatoes.[4]","box_office":"Domestic $428,868","cinematography":"Bojan Bazelli","body_snatchers":"Theatrical film poster","directed_by":"Abel Ferrara","release_dates":"January 28, 1993 (1993-01-28)|||||","produced_by":"Robert H. Solo","starring":"Gabrielle Anwar Meg Tilly","running_time":"87 minutes","Background info":"Warner Brothers released Body Snatchers to only a few dozen theaters, and consequently its domestic gross was a mere $428,868.[1]The film marked director Ferrara's first venture into the science fiction genre. Producer Robert H. Solo had already produced its 1978 predecessor Invasion of the Body Snatchers.The largest difference in this version of the story is that it takes place on an army base in Alabama, unlike a small California town in the original novel and the first adaptation filmed in 1956, or in San Francisco like in the 1978 remake. While the first two films portrayed the tightly organised, conformist \"pod society\" invading a free civil society, Ferrara's film, according to Chicago Sun-Times film critic Roger Ebert, made a connection between \"the Army's code of rigid conformity, and the behavior of the pod people, who seem like a logical extension of the same code\".[2]Body Snatchers is the film which departs the farthest from the original novel, compared to the 1956 and 1978 versions. While Steve Malone, like the doctors Bennell in the earlier films, also has a medical/scientific profession, the main character in this film is his daughter Marti. The character of Becky/Elizabeth (Bennell's love interest and his companion during his escape attempt from the invaders) is dropped completely, as are Bennell's acquaintances and later antagonists Dr. Kaufman/Kibner and the Belicecs. Re-invented, however, are two elements which had been dropped from the 1978 version: A young boy (named Jimmy Grimaldi in the 1956 version, here Marti's half brother Andy) claims that his mother is not his \"real\" mother. Also, the film features a voice-over narration by the main character. Two ideas invented by the 1978 version are picked up here again: The mortal remains of the \"original\" human beings are picked up by garbage trucks, and the duplicates utter an outworldly scream when they discover a genuine human, thereby calling assistance from other pod people.","music_by":"Joe Delia","edited_by":"Anthony Redman"}