{"based_on":"East of Eden (1952 novel)  by John Steinbeck","Cast":"Lois Smith is the last surviving credited cast member.","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Paul Osborn","Themes and character motivations":"The underlying theme of East of Eden is a biblical reference to the brothers Cain and Abel. Cal is constantly struggling to earn his father's approval. The relationship between Cal and his father is a stressful one and is not resolved until late in the story, after his father suffers a paralyzing stroke. In his paralyzed state and with the help of Julie Harris' character, Abra, Cal's father finally expresses his suppressed love for the boy.[6]Other themes touched upon in the film include anti-German xenophobia, specifically as wrought against a local German immigrant as resentment about United States entry into World War I grew. The themes of young love and sibling rivalry are also present in the film, as Aron's girlfriend finds herself increasingly drawn to the more rebellious Cal. Mental illness is also considered with Cal's character, though still young, displaying many characteristics of Borderline Personality Disorder, a sometimes genetic condition likely inherited from his mother.","Plot":"The story is set during 1917 and 1918, leading into American involvement in World War I, in the central California coastal towns of Monterey and Salinas. Cal (James Dean) and Aron (Richard Davalos) are the sons of a modestly successful farmer and wartime draft board chairman, Adam Trask (Raymond Massey). Cal is moody and embittered by his belief that his father favors Aron. Although both Cal and Aron had long been led to believe that their mother had died \"and gone to heaven,\" the opening scene reveals Cal has apparently learned that his mother is still alive, owning and running a successful brothel in nearby Monterey.After the father's idealistic plans for a long-haul vegetable shipping business venture end in a loss of thousands of dollars, Cal decides to enter the bean-growing business, as a way of recouping the money his father lost in the vegetable shipping venture. He is advised that if the United States enters the war, the price of beans will skyrocket. Cal hopes this will finally earn him the love and respect of his father. He goes to his mother Kate (Jo Van Fleet) to ask to borrow the capital he needs. Though she remains hostile toward Adam for inflicting his \"purity\" on her and her sons, Kate reluctantly lends him $5,000.Meanwhile, Aron's girlfriend Abra (Julie Harris) gradually finds herself attracted to Cal, who seems to reciprocate her feelings.Later on, Cal goes to the carnival and sees Abra alone, waiting for Aron. To accompany her, they soon go together on several rides and play games, increasing their ongoing attraction for each other. On a Ferris wheel, they kiss, but Abra in tears admits that she still loves Aron. Afterwards, there is a fight between the townspeople and Aron regarding the Germans. Cal climbs down from the Ferris wheel and engages in the fight to help Aron. Although his intentions were pure, Aron sees this deed as just an act to impress Abra, also noticing that Abra is holding Cal's jacket. Aron grabs Cal by his shirt, then in a fit of rage Cal strikes Aron 4 times.Cal's business goes well, and he decides to give the money to his father at a surprise birthday party for him, which he and Abra plan together. As the party gets under way, Aron, who is jealous at what Cal and Abra have done for Adam, suddenly announces that he and Abra are engaged. While Adam is openly pleased with the news, both Abra and Cal are uneasy, having recently discovered their emerging mutual attraction despite their suppressed feelings. Aron has stolen Cal's thunder and once again triumphs as the favorite.Cal makes a surprise birthday present of the money to his father. However, Adam refuses to accept any money earned by what he regards as war profiteering. Cal does not understand and sees his father's refusal to accept the gift as another emotional rejection. When the distraught Cal leaves the room, Abra goes after him to console him. Aron sees them through the branches of a tree and orders Cal to stay away from her.Angry, Cal takes his brother to see their mother, then returns home alone. The shock drives Aron to get drunk and board a troop train to enlist in the army. When his father demands to know where his brother is, Cal tells him. As Sam (Burl Ives), the sheriff, brings the news, Adam rushes to the train station in an attempt to dissuade him, but can only watch helplessly as his son steams away from him, smashing the rail car window with his head and maniacally laughing at him. **The sheriff tells Cal he should leave like in the story of Cain and Abel and go East of Eden and live in the land of nod.**Because of the stress, Adam suffers a stroke, leaving him paralyzed and unable to communicate. Cal and Abra enter the bedroom. Cal tries to talk to him, but gets no response and dejectedly departs the bedroom, leaving Abra alone with Adam. Abra pleads with Adam to show Cal fatherly love he wants so desperately and let Cal \"do\" something for him before it is too late. She persuades Cal to go back into the room. When Cal makes his last bid for acceptance before leaving town, his father manages to speak. He tells his Cal to dismiss a self-absorbed, obnoxious nurse and not to replace her, but to stay & take care of him himself. Cal embraces Abra and they share their first kiss free from Aron's shadow; and he pulls up a chair to sit next to his father. The film ends with Abra leaving the room and Cal sitting by Adam's bedside.","language":"English","box_office":"$5 million (rentals)[1]","cinematography":"Ted D. McCord","production_company":"Warner Bros.","directed_by":"Elia Kazan","Awards and honors":"WinsNominations","east_of_eden":"theatrical release poster","release_dates":"March 9, 1955 (1955-03-09) (NYC)|||||","Production":"Director Elia Kazan first toyed with the idea of casting Marlon Brando as Cal and Montgomery Clift as Aron, but at 30 and 34 years old, respectively, they were simply too old to play teenage brothers. Paul Newman, who was one year younger than Brando, was a finalist for the part of Cal, which eventually was played by James Dean, who was six years younger than Newman.Newman and Dean, who were up for the part of Cal, screen tested together for the parts of the rival brothers. In the end, Richard Davalos got the part of Aron. This was his screen debut.Julie Harris was cast as Abra James. Executive producer Jack L. Warner was opposed to her casting, because she was ten years older than her character.Principal photography of East of Eden lasted ten weeks. Before filming began, Kazan sent Dean off to Palm Springs to gain some weight and get some sun so that he looked like a \"real\" farm boy. Dean hated getting a tan, having his hair cut, and drinking a pint of cream a day to put on pounds.When they first arrived in Los Angeles to begin production, Kazan accompanied Dean to visit his estranged father, who was living there at the time. He witnessed first hand how badly the father treated Dean and how much the boy wanted to please him. As he got to know Dean better, Kazan saw how this relationship had instilled in him a great deal of anger because of frustrated love, the key to the character of Cal. \"It was the most apt piece of casting I've ever done in my life.\"Kazan denied rumours that he didn't like Dean: \"You can't not like a guy with that much pain in him....You know how a dog will be mean and snarl at you, then you pat him, and he's all over you with affection? That's the way Dean was.\" Kazan did intervene sternly, however, when Dean started to feel his power as a hotly emerging star and treated crew members disrespectfully.[5]When Kazan introduced Dean to Steinbeck, the author exclaimed that he was the perfect choice for Cal Trask. Steinbeck himself enjoyed the final film very much.Shooting in the fairly new CinemaScope process proved to be a challenge for Kazan, but he was lucky to have a good working relationship with longtime Warner Brothers cinematographer Ted D. McCord. The studio camera department gave him instructions up front to keep the camera at least six feet from the actors, which rankled Kazan. So he and McCord made some tests to see how close they could push in. It caused the side edges of the screen to appear a bit curved, but Kazan decided to use that distortion for dramatic expression. McCord suggested that, as long as they were distorting anyway, they should tip the camera angle in certain shots. This technique was used a few times, most prominently in the tense dinner table scene in which Cal and his father fight over the boy's antagonistic reading of Bible passages.Kazan was proud of his use of CinemaScope to get what he thought was the best shot in the film, the train pulling away with all the lettuce on it. In the carefully calibrated shot, the train disappears behind the railroad station and then reappears much smaller, going off toward the distant mountains. \"It's a perfect shot because it shows that their hope is going off,\" he said. \"It's sentimental and still emotional.\" Kazan also liked the shot of Cal and Abra after his father's rejection, standing behind the willow tree, audible but with only their feet showing.Kazan noted that Dean's tension and shyness always manifested itself physically, so he allowed the actor to use contorted, awkward postures to convey the character. \"It was almost psychotic. He was exactly like the people you see in insane asylums.\"It was Dean's idea to do the little running dance in the bean field, and Kazan said he kissed him for that valuable contribution. He also noted that the far more contained Brando would never have been able to do a scene like that, \"but Dean was actually like a kid.\"Davalos said the most difficult scene for him was when Dean as Cal hits him after an argument. Dean didn't really hit him, of course, but the emotions felt so real Davalos believed Dean really did hate him. He left the set after the take and cried \"for about four hours\" until Harris had to calm him down.Several cast members reported that Dean's emotions overtook him so strongly he would frequently cry. Kazan usually just let those moments pass before resuming shooting, but he did leave one of Dean's breakdowns in—the scene in which Cal is crushed by his father's rejection of the money he earned for him.Dean would provoke Raymond Massey off-camera so that the elder actor would hate him and he could get into character easier. Kazan did nothing to dispel the tension between the two, as it was so right for their characters in the film. In the scene where Adam refuses to accept Cal's money, the script called for Cal to turn away in anger from his father. It was Dean's instinct to embrace him instead. This came as a surprise to Massey, who could think of nothing to do but say, \"Cal! Cal!\" in response.The conflict between James Dean and Raymond Massey came to a boiling point in the scene where Cal angers his father because of the way he reads from the Bible. Elia Kazan, who found Massey to be a rather rigid and unemotional \"stiff\" off screen and on, wasn't happy with the way it was going, so he took Dean aside and whispered some suggestions. Dean came back and read the Old Testament passages interlaced with the most offensive curses and crude sexual expressions. Massey became incensed, storming off the set and threatening to call his lawyers. But before the outburst, Kazan was able to capture the heightened anger he was going for.Despite the annoyances and difficulties he faced making East of Eden, Massey called the role of Adam Trask one of the best parts he ever had on screen and one of the few three-dimensional characters he played in movies. Even though he appreciated the tension that came through on the screen, Elia Kazan later said he didn't do justice to the character of Adam by hiring Raymond Massey, who he said \"had only one colour.\"On the last day of shooting, Harris went to Dean's trailer to say goodbye because she was not sure she would attend the wrap party. She found Dean crying because the production was over. She said: \"It was so moving. It was his first picture [sic], it meant so much, and now it was over.\"","produced_by":"Elia Kazan","starring":"James Dean Julie Harris Raymond Massey","running_time":"117 minutes","music_by":"Leonard Rosenman","edited_by":"Owen Marks","Critical reaction":"Dave Kehr of the Chicago Reader praised the adaptation by Kazan and the \"down-to-earth\" performances of James Dean and Richard Davalos.[7] Bosley Crowther, writing for The New York Times, described the film as having \"energy and intensity but little clarity and emotion\"; he notes:In one respect, it is brilliant. The use that Mr. Kazan has made of CinemaScope and color in capturing expanse and mood in his California settings is almost beyond compare. His views of verdant farmlands in the famous Salinas \"salad bowl,\" sharply focused to the horizon in the sunshine, are fairly fragrant with atmosphere. The strain of troubled people against such backgrounds has a clear and enhanced irony.For the stubborn fact is that the people who move about in this film are not sufficiently well established to give point to the anguish through which they go, and the demonstrations of their torment are perceptibly stylized and grotesque.[8]Bosley Crowther called Dean's performance a \"mass of histrionic gingerbread\" which clearly emulated the style of Marlon Brando.[8]Fifty years later, film critic Kenneth Turan of the Los Angeles Times, was much more positive, saying East of Eden is \"not only one of Kazan's richest films and Dean's first significant role, it is also arguably the actor's best performance.\"[9] The film's depiction of the interaction between Dean and Massey was characterized by Turan as \"the paradigmatic generational conflict in all of American film.\"[9]"}