{"country":"United States","distributed_by":"New Line Cinema Allied Vision","communion":"Special Collector's Edition DVD cover","Plot":"In 1985, New York based author Whitley Strieber (Walken) lives with his wife and child in Manhattan and seems to be successful. However he is woken at night by paranoid dreams that someone else is in the room.On a trip to the family cottage in the woods, on the first night the intruder alarm is triggered and Strieber sees a face watching him from the doorway. Bright light fills the cottage windows and wakes his son and two other family friends but his wife remains asleep.Disturbed by this they all return to New York and life seemingly returns to normal but Strieber finds that his work and personal life are becoming affected by recurring nightmares and visions of strange alien beings including greys, blue doctors and bugs. This upsets his son and puts strain on his marriage.After an incident at their cottage in which Strieber is so convinced that there are alien beings inside the home that he pulls his gun out and almost shoots his wife, and signs that his son is beginning to have the same visions, he is finally convinced to see a psychiatrist specialising in hypnotic regression therapy (Sternhagen).The therapy confirms that he has possibly been abducted by unknown beings and experiments have been performed on him however he is still sceptical about it and reluctancly attends a group therapy session of fellow 'abductees'.Eventually he realises he has to confront his visions, real or not, and returns to the cottage where most of the incidents seem to occur. He interacts with the alien beings and realises he has been in contact with them his whole life and it was passed on from his father and he will, in turn, pass it on to his son.Making up with his family Strieber comes to accept the alien visitors as part of his life and in the last scene he sits in his office and embraces the face of a 'grey' alien.","language":"English","box_office":"$1.92 million","cinematography":"Louis Irving","directed_by":"Philippe Mora","Music":"The score was composed by Eric Clapton. No soundtrack album was ever released.In 2010, the Main Theme and End Credit theme were released by film composer and former Oingo Boingo guitarist Steve Bartek.","release_dates":"November 10, 1989 (1989-11-10)|||||","produced_by":"Philippe Mora","starring":"Christopher Walken|Lindsay Crouse|Frances Sternhagen|Terry Hanauer|Andreas Katsulas|Joel Carlson|","running_time":"105 min.","music_by":"Eric Clapton Allan Zavod","edited_by":"Lee Smith","Release":"It received a mostly negative critical reaction due to Walken's performance and was panned by Strieber himself due to its non-factual portrayal of him. The film was considered a box office failure. It has subsequently picked up a moderate cult following.","written_by":"Whitley Strieber"}