{"based_on":"Doubt: A Parable  by John Patrick Shanley","Cast":"In order of credits:","country":"United States","distributed_by":"Miramax Films","screenplay_by":"John Patrick Shanley","Plot":"Set in 1964 at a Catholic church in The Bronx, New York, the film opens with the jovial Father Flynn (Philip Seymour Hoffman) giving a sermon on the nature of doubt, noting that like faith, doubt can be a unifying force. The next evening, Sister Aloysius Beauvier (Meryl Streep), the strict principal of the parish school, discusses the sermon with her fellow nuns, the Sisters of Charity of New York. She asks if anyone has observed unusual behavior that would inspire Father Flynn to preach about doubt, and instructs them to keep their eyes open should any such behavior occur in the future.Sister James (Amy Adams), a young and naive teacher, observes the closeness between Father Flynn and Donald Miller, an altar boy and the school's only black student. One day during class, Sister James receives a call asking for Donald Miller to meet Father Flynn in the rectory. When he returns, Donald is distraught and Sister James notices the smell of alcohol on his breath. Later, while her students are learning a dance in the gymnasium, she sees Father Flynn placing a white shirt in Donald's locker. She decides to report her suspicions to Sister Aloysius.Under the pretext of discussing the upcoming school Christmas pageant, Sisters Aloysius and (to a lesser extent) James voice their suspicions that Father Flynn's relationship with Donald may be inappropriate. Several times, Father Flynn asks them to leave the matter alone as a private issue between the boy and himself, but Sister Aloysius persists. Finally, he is pressured into admitting that Donald had been caught drinking altar wine, and he had promised Donald not to tell anyone about the incident. Having now been forced to break that promise and reveal the truth, he will need to dismiss Donald as an altar boy, which he had been trying to avoid. Before leaving, Father Flynn tells Sister Aloysius he is displeased with her handling of the situation. His next sermon regards gossip and how it is easily spread.Initially, Sister James is relieved and convinced of Father Flynn's innocence, but Sister Aloysius' belief that Flynn has behaved inappropriately with Donald is unshakable. Later, Sister James asks Father Flynn about the shirt he put in Donald's locker, an observation she had hidden from Sister Aloysius. Flynn explains that the boy had left the shirt in the sacristy, and that he had put it back in the locker himself, instead of giving it back to him directly, to spare the boy additional embarrassment. Flynn goes on to explain that it is he, not Sister Aloysius, that really cares about the boy, and that Sister James shouldn't let others tell her that the light in her is wrong. Flynn reminds Sister James that their savior taught love, and Sister James who has just received a letter from her sick brother appears to interpret Flynn's love for Donald as fraternal. Sister James tells Flynn that she doesn't believe the allegations.Sister Aloysius meets with Donald Miller's mother regarding her suspicions. Mrs. Miller (Viola Davis) shocks Sister Aloysius with her lack of interest in the alleged misconduct on Father Flynn's part. As far as she is concerned, Donald need only last to the end of the school year, as graduation from a prestigious church school would increase his chances of going to a decent high school. It is hinted that Donald is homosexual and revealed that his father is abusive, with the dialogue between them indicating that the father's anger is fueled by his son's effeminacy. Mrs. Miller begs that Sister Aloysius drop the matter, feeling that Father Flynn is a source of inspiration to Donald and a shield from the abuse he receives at home. She becomes angry when Sister Aloysius refuses to compromise and threatens to throw Donald out of the school. Mrs. Miller believes that Donald would be punished for a thing of which he was not the cause.Despite having no evidence and no support from anyone, Sister Aloysius again confronts Father Flynn and demands that he tell her the truth. Otherwise, she will go to the Bishop. Father Flynn is adamant that there is no illicit relationship, but Sister Aloysius claims that she has learned that he has a history of problems, having moved to three different parishes in the last five years. She tells him that she has contacted a nun from one of his prior churches (she refuses to say whom), who corroborated her suspicions. Father Flynn is furious that she has contacted a nun rather than the church pastor, which is proper church protocol. Sister Aloysius tells him he doesn't deserve to wear the collar, and asks for his resignation. Unable to stand up to her, he succumbs to her demands.Following his final sermon, Father Flynn steps down from the pulpit and shakes hands with the members of the congregation. Some time later, Sisters Aloysius and James are sitting together in the church garden. Sister Aloysius tells Sister James that although Father Flynn resigned, the bishop has appointed him to pastor at a larger church with a parochial school, in essence promoting him to a more prestigious position and perpetuating the same issue with Father Flynn. She then admits she lied about speaking to a nun at Father Flynn's former church, and thus drove him out with no more than her suspicions. Her justification is that if Father Flynn truly were innocent of wrongdoing, he would not have resigned. Repeating a line from earlier in the film, Sister Aloysius says that \"in the pursuit of wrongdoing, one steps away from God.\"Sister Aloysius concludes that she has paid a price in pursuing the wrongdoing of Father Flynn. While discussing her inability to fully expose Father Flynn and have him dismissed from the diocese as a whole, she reflects upon her larger faith in the Church as she breaks down in tears and says to Sister James: \"I have doubts...I have such doubts.\" The film ends with Sister James comforting Sister Aloysius as the church plays The First Noel.","doubt":"US Theatrical release poster","language":"English","Reception":"Based on 203 reviews collected by Rotten Tomatoes, the film has a 78% approval rating. The site reported in a consensus that \"Doubt succeeds on the strength of its top-notch cast, who successfully guide the film through the occasional narrative lull.\"[4] Another review aggregator, Metacritic, gave the film a 68/100 approval rating based on 36 reviews.[5] Critic Manohla Dargis of The New York Times concluded that \"the air is thick with paranoia in Doubt, but nowhere as thick, juicy, sustained or sustaining as Meryl Streep's performance.\"[6] Meryl Streep's performance as the stern, intimidating and bold principal Sister Aloysius Beauvier gave her critical acclaim. Philip Seymour Hoffman and Amy Adams' performances also received universal acclaim.Viola Davis's performance as Mrs. Miller drew her critical raves. Salon magazine declared that Davis's character Mrs. Miller was acted with \"a near-miraculous level of believability ... Davis, in her small, one-scene role, is incredibly moving—I can barely remember a Davis performance where I haven't been moved ... [she] plays her character, an anxious, hardworking woman who's just trying to hold her life and family together, by holding everything close. She's not a fountain of emotion, dispensing broad expression or movement; instead, she keeps it all inside and lets us in.\"[7]National Public Radio called Davis's acting in the movie \"the film's most wrenching performance ... the other [actors] argue strenuously and occasionally even eloquently, to ever-diminishing effect; Davis speaks plainly and quietly, and leaves [no] doubt that the moral high ground is a treacherous place to occupy in the real world.\"[8]Roger Ebert, who thought Davis's performance worthy of an Academy Award, gave the film four stars, his highest rating, and praised its \"exact and merciless writing, powerful performances and timeless relevance. It causes us to start thinking with the first shot,\" he continued, \"and we never stop.\"[9] Ebert goes on to say, \"The conflict between Aloysius and Flynn is the conflict between old and new, between status and change, between infallibility and uncertainty. And Shanley leaves us doubting.\"[10]The film and the cast earned numerous awards and nominations including five Academy Award nominations for Best Actress for Streep, Best Supporting Actor for Hoffman, Best Supporting Actress for both Adams and Davis, and Best Adapted Screenplay for Shanley.The scholar Daniel S. Cutrara, in his book on sex and religion in cinema, has commented that the film works as a metaphor for worldwide uncertainty over priests accused of pedophilia—specifically through Father Flynn's resignation as an indication of guilt and then Sister Aloysius' subsequent doubt.[11]Doubt received five Academy Awards nominations on January 22, 2009, for its four lead actors and for Shanley's script.","box_office":"$50,907,234[1]","cinematography":"Roger Deakins","production_company":"Scott Rudin Productions","directed_by":"John Patrick Shanley","release_dates":"October 30, 2008 (2008-10-30) (AFI Fest)|December 12, 2008 (2008-12-12) (United States)||||","Production":"Production began on December 1, 2007.[2] The film, which concentrates on a Bronx Catholic school, was filmed in various areas of the Bronx, including Parkchester, St. Anthony's Catholic School, and the College of Mount Saint Vincent, as well as Bedford-Stuyvesant, Brooklyn.[3] The \"garden\" exterior scenes were shot at the historic Episcopal Church St. Luke in the Fields on Hudson Street in New York's Greenwich Village. The associated St. Luke's School was also heavily featured. The film is dedicated to Sister Margaret McEntee, a Sister of Charity nun who was Shanley's first-grade teacher and who served as a technical adviser for the movie, after whom Shanley modeled the character of Sister James.","produced_by":"Scott Rudin","starring":"Meryl Streep|Philip Seymour Hoffman|Amy Adams|Viola Davis|","running_time":"103 minutes","music_by":"Howard Shore","edited_by":"Dylan Tichenor","budget":"$20 million"}