{"backdraft":"Theatrical release poster","country":"United States","distributed_by":"Universal Pictures","Plot":"Two firefighters of Engine 17 of the Chicago Fire Department, are brothers. Lt. Stephen \"Bull\" McCaffrey, the elder, is experienced, while Brian has labored under his brother's shadow all his life. The younger brother returns to firefighting after a number of other careers falter, though Stephen has doubts that Brian is fit to be a firefighter. In 1971, Brian witnessed the death of their firefighting father, Captain Dennis McCaffrey, when he accompanied him on a call.The longest serving of all the men at Engine 17, John \"Axe\" Adcox, served under the McCaffreys' father in the department and was like an uncle to the boys when their father died. He attacks fires head on, but is concerned about Stephen's unorthodox methods and disregard for safety procedures. Helen McCaffrey is Stephen's estranged wife and the mother of their son, Sean. Helen has grown fearful of Stephen's dedication to firefighting and the risks he takes. While they were still in love, she separated from Stephen to protect herself and Sean.Martin Swayzak is an alderman on the Chicago City Council. Swayzak hopes to be elected mayor, but has had to make a number of budget cuts to the fire department. Many of the rank and file firemen believe that the cuts are endangering firefighters' lives. Jennifer Vaitkus is Brian's ex-girlfriend and works in Swayzak's office. As she begins to reconnect with Brian, her loyalties are torn between her job and him.CFD Captain Donald \"Shadow\" Rimgale is a dedicated arson investigator and veteran firefighter. He is called in because a number of recent fires appear to be like fires committed by pyromaniac Ronald Bartel, who has been imprisoned for many years. Brian is soon reassigned as his assistant after a falling out with Stephen. Rimgale manipulates Bartel's obsession with fire to ensure Bartel's annual parole application is rejected. It is revealed during an investigation that Swayzak was paid off by contractors to shut down firehouses so they could be converted into community centers, with the contractors receiving contracts for the construction.When 17 answers a call in a highrise, Stephen urges them to move in quickly to take out the fire despite Adcox's advice to wait for back-up. Brian's friend and fellow \"probationary fireman\" trainee Tim Krizminski, under Stephen's wing, accidentally opens a door only to be met by a backdraft. His face is burned beyond recognition, but he survives. Adcox and Brian both blame Tim's condition on Stephen's reckless tactics.Rimgale and Brian go to Swayzak's home to confront him but interrupt a masked man about to set the place alight. The latter attacks them with a pipe but is burned by an electrical socket on his back. Rimgale saves both Brian and Swayzak from the house but is injured in an explosion. In his hospital bed, Rimgale tells Brian to visit Ronald again. Ronald helps Brian to realize that only a firefighter would be so careful to not let the backdraft fires rage out of control.Brian initially suspects Stephen, though he later spots a burn in the shape of an electrical socket on Adcox's back and reveals his suspicions to his brother just before an alarm. When Brian realizes Adcox has heard their exchange he jumps aboard Truck 46 after borrowing some turnout gear. Stephen confronts Adcox about the deadly backdrafts during a multiple-alarm fire at a chemical plant. Adcox admits that he set the fires to kill associates of Swayzak because Swayzak was benefiting from the deaths of firefighters. When an explosion destroys the catwalk they are on, Stephen grabs Adcox's hand while hanging on to the remains of the catwalk. Adcox requests Stephen let go of him, but Stephen loses his grip on the catwalk. Adcox is killed and Stephen is mortally wounded. Brian, having been injured by Adcox, rushes to help other firefighters reach his brother. Stephen dies on the way to the hospital with Brian at his side, his final request being that Brian not reveal that Adcox was behind the fires.After Stephen and Adcox's funeral, Brian and Rimgale, with the help of the police, interrupt Swayzak at a press conference. Rimgale questions Swayzak on a fake manpower study that led to the deaths of several firemen, including Stephen and Adcox. They also state that Swayzak engineered the downsizing of the Chicago Fire Department along with Cosgrove, Seagrave and others. This effectively destroys Swayzak's mayoral ambitions. Jennifer also loses her job with Swayzak.Brian decides to continue as a firefighter despite the loss of his father and brother. The last scene involves him giving advice to a rookie firefighter on how to properly don his turnout coat as Stephen once did for him as Engine 17 races to a fire.","language":"English","box_office":"$152.3 million","cinematography":"Mikael Salomon","production_company":"Imagine Films Entertainment Trilogy Entertainment Group","directed_by":"Ron Howard","release_dates":"May 24, 1991 (1991-05-24) (United States)|||||","Production":"According to the article in Entertainment Weekly, rubber cement from Petronio Shoe Products was used to create some of the fire effects. Industrial Light & Magic created many of the visual effects.[5]The oil painting seen at the beginning of the bar scene depicting several dogs playing poker in a firehouse is painted by Chicago artist and retired firefighter Lee J. Kowalski.Fire fighting professionals have noted that most real structure fires differ from what is shown in the movie by having smoke conditions that obscure vision inside the building almost completely.The pictures of firefighters searching in movies like Back Draft do not really show what it is like to search in a fire. Firefighters are shown advancing through fully involved structure fires while not wearing the complete compliment of protective gear (Nomex hoods, radios, PASS devices). Most scenes display firefighting without the use of SCBA [self contained breathing apparatus]. Realism in our case would make a very bad movie because the fact is that in almost every fire the smoke conditions completely obscure all vision.[6]\"The movie ... came pretty close at times, but it also suffered from the very same, all too common shortcomings that any visual presentation was bound to encounter (...) Smoke, steam and other miscellaneous factors usually combine to obscure almost everything that is taking place\".[7]Furthermore, fire investigation professionals have dismissed the methods shown in the movie as unscientific, in particular the portrayal of fire as a living entity.[8]","produced_by":"Richard B. Lewis John Watson Pen Densham Brian Grazer","starring":"Kurt Russell|William Baldwin|Scott Glenn|Jennifer Jason Leigh|Rebecca De Mornay|Donald Sutherland|Robert De Niro|","running_time":"137 minutes","music_by":"Hans Zimmer","edited_by":"Daniel P. Hanley Mike Hill","Release":"Backdraft received mixed reviews, generating from somewhat favorable to extremely negative reception from critics with much praise for the special effects and performances while much criticism was thrown towards the story being poorly rendered.[9] [10][11][12] The film currently holds a 71% 'Fresh' rating on Rotten Tomatoes, with the consensus \"It's not particularly deep, but Backdraft is a strong action movie with exceptional special effects.\"[13]The film grossed $77,868,585 in the US (ranking 14th in box-office for 1991), and $74,500,000 in foreign markets.[14][15]The film received three Academy Award nominations (Sound Effects Editing, Visual Effects and Best Sound - Gary Summers, Randy Thom, Gary Rydstrom and Glenn Williams).[16] It also received two nominations at the first annual MTV Movie Awards.[citation needed]","written_by":"Gregory Widen","budget":"$75 million[1]"}