{"based_on":"Alice's Adventures in Wonderland  by Lewis Carroll","Cast":"In Alice's English version:","country":"Czechoslovakia Switzerland United Kingdom West Germany Soviet Union","distributed_by":"First Run Features","Plot summary":"Alice appears to be in her own bedroom, when a taxidermically stuffed rabbit comes to life and breaks out of its glass case. Alice follows the rabbit through the drawer of a desk into a cavern. She subsequently falls through a bucket and seemingly down an elevator shaft. Wonderland itself is a mix of drab household-like areas with incongruous relationships of space and size. The Queen's execution sentences are carried out by the White Rabbit with a pair of scissors. At the film's end, Alice wakes in her room, discovers that the rabbit is still missing from his glass case, and finds a secret compartment where he keeps scissors. She ponders whether or not she will cut his head off. The film is ambiguous about whether this room is Alice's real world or \"Wonderland\".","screenplay_by":"Jan Švankmajer","alice":"Czechoslovak theatrical release poster","language":"Czech","cinematography":"Svatopluk Malý","production_company":"Channel Four Films Condor Films","directed_by":"Jan Švankmajer","Home media":"The film with original Czech audio and English subtitles was unavailable on home video until 2011 when the British Film Institute released the film on DVD and Blu-ray.[6][7]","release_dates":"3 August 1988 (1988-08-03) (United States)|1 November 1990 (1990-11-01) (Czechoslovakia)||||","Production":"Jan Švankmajer, who had been making short films since the mid-1960s, says he got the confidence to make a feature-length film due to finishing the shorts Jabberwocky and Down to the Cellar. He described Lewis Carroll's Alice's Adventures in Wonderland, a work which had followed him since he was a child, as \"one of the most important and amazing books produced by this civilisation.\"[1] He argued that other film adaptations of the story had interpreted it as a fairy tale, but that Carroll had written it like a dream, and that was what he wanted to transmit: \"While a fairy tale has got an educational aspect – it works with the moral of the lifted forefinger (good overcomes evil), dream, as an expression of our unconscious, uncompromisingly pursues the realisation of our most secret wishes without considering rational and moral inhibitions, because it is driven by the principle of pleasure. My Alice is a realised dream.\"[1] Despite the film's heavy usage of stop motion, and unlike most other traditional stop motion films, the movie does not utilize any miniature sets to portray its special effects.","produced_by":"Peter-Christian Fueter","starring":"Kristýna Kohoutová","running_time":"84 minutes","edited_by":"Marie Zemanová","Release":"The film first premiered in the United States, where it was released on 3 August 1988. It played at the 1989 Annecy International Animated Film Festival where it received the prize for best feature film.[2] In Czechoslovakia it premiered on 1 November 1990.[3] The English dubbed version features the voice of Camilla Power.In The New York Times, Caryn James wrote that although Švankmajer \"strips away all sweetness and light, he does not violate Lewis Carroll's story\", and called Alice an \"extraordinary film [which] explores the story's dark undercurrents\". James described the animation as \"remarkably fluid\" and held forward the dynamics of the film, which contrasts visually captivating elements with superficiality: \"Mr. Švankmajer never lets us forget we are watching a film in which an actress plays Alice telling a story\", although, \"with its extreme close-ups, its constant motion and its smooth animation, the film is so visually active that it distracts us from a heavy-handed fact - this is a world of symbols come alive.\"[4] Upon the British home-media release in 2011, Philip Horne reviewed the film for The Daily Telegraph. Horne called it \"an astonishing film\", and wrote: \"This is no cleaned up version approved by preview audiences or committees of studio executives – my youthful fellow-spectator declared quite aptly at one point, 'She's rather a violent young girl, isn't she?' – but its glorious proliferation of magical transformations works like a charm on anyone who values the imagination.\"[5] The review aggregator Rotten Tomatoes has Alice with a \"Fresh\" rating of 100% based on 18 reviews."}