{"based_on":"A Streetcar Named Desire  by Tennessee Williams","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Tennessee Williams","Differences from the play":"The play was set entirely at the Kowalski apartment. The movie was opened up to include places only briefly mentioned or non-existent in the play, such as the train station, the streets of the French Quarter, the bowling alley, the pier of a dance casino, and the machine factory.Dialogue was abbreviated or cut in some scenes, when Blanche was trying to convince Stella to leave Stanley, for example, or when Mitch confronted Blanche about her past.The name of the town where Blanche was from was changed from Laurel, Mississippi, which is a real place, to Auriol, Mississippi, a fictitious place.The play's themes were controversial, causing the screenplay to be modified to comply with the Hollywood Production Code. In the original play, Blanche's husband had committed suicide after he was discovered having a homosexual affair. This reference was removed from the film; Blanche says instead that she showed scorn at her husband's sensitive nature, driving him to suicide.At the end of the play, Stella, distraught at Blanche's fate, mutely allows Stanley to console her. In the movie, this is changed to a \"Hollywood ending\" in which Stella blames Stanley for Blanche's fate, and resolves to leave him.[4]Other scenes were shot but cut after filming was complete to conform to the Production Code and later, to avoid condemnation by the National Legion of Decency.In 1993, after Warner Brothers discovered the censored footage during a routine inventory of archives,[5] several minutes of the censored scenes were restored in an 'original director's version' video re-release.[6]Close tight photography altered the dramatic qualities of the play, for example in the lengthy scenes of escalating conflict between Marlon Brando and Vivien Leigh, or when Karl Malden shines the light on Leigh to see how old she is, or when the camera hovers over Leigh, collapsed on the floor, with her head at the bottom of the screen, as though she were turned upside down.In the movie, Blanche actually rode the streetcar, only mentioned in the play. By the time the film was in production however, the Desire streetcar line had been converted into a bus service and the production team had to gain permission from the authorities to hire out a streetcar with the \"Desire\" name on it.[7]The music score, by Alex North, was written in short sets of music that reflected the psychological dynamics of the characters. For his work on the film, North was nominated for an Academy Award for Best Music Score, one of two nominations in that category that year.","Plot":"Under mysterious circumstances, Blanche DuBois, an aging high school teacher, leaves her home in Auriol, Mississippi to travel to New Orleans to live with her sister, Stella Kowalski. She arrives on the train and boards a streetcar named \"Desire\" and reaches her sister's home in the French Quarter where she discovers that her sister and brother-in-law, Stanley Kowalski, live in a cramped and dilapidated two-room apartment in an old New Orleans tenement. Blanche and Stella are all that remain of an old aristocratic family. Blanche discloses that the family estate, Belle Reve, has been lost to creditors, and that she wants to stay with Stella and Stanley for a while. Blanche seems lost and broke, with nowhere to go. Stella welcomes her with an open heart.From the start, Blanche and Stanley are wary of each other. Blanche imitates a soft-spoken manner; Stanley is rough and loud. His mere presence seems to threaten her, while her behavior and manner arouse suspicion in him. She is especially adroit at patronizing and criticizing Stella from the start. When interrogated about her past, struggling to be polite, Blanche says that she was married and widowed at a young age. She says that she has taken a leave of absence from her job due to her nerves. To satisfy Stanley's skepticism about the loss of the estate, Blanche hands over her papers pertaining to Belle Reve. But Stanley grabs at some of her private papers that she is holding back, and they cascade to the floor. Weeping, she gathers them all back, saying that they are poems from her dead husband. He defends himself by saying that he was just looking out for his family, and then announces that Stella is going to have a baby.Soon after her arrival, Stanley has a poker night with his friends where Blanche meets Mitch. His courteous manner sets him apart from Stanley's other friends. They like each other right away. This is the start of their romance. Stanley explodes in a drunken rage, striking Stella, and sending his friends running, while Blanche and Stella flee to the upstairs neighbor, Eunice. When his anger subsides, Stanley cries out remorsefully for Stella to come back. \"Stella, Stella, hey Stella,\" he bellows, until she comes down, and Stanley carries her off to bed. In the morning, Blanche tells Stella that she is married to a subhuman animal. In an emotional monologue, she urges her sister to leave Stanley. Stella disagrees with her sister's bluntness and assures Blanche that all is well, and that she does not want to leave.As the weeks pass into months, the tension rises between Blanche and Stanley. But Blanche has hope in Mitch, telling Stella that she wants to go away with him and not be anyone's problem. She is on the verge of mental collapse, anticipating a marriage proposal from Mitch. Finally, he tells her that they need each other and should be together. But Stanley, still skeptical, begins to research her past and discovers a closet full of skeletons. He tells Stella what Blanche has been concealing from them, that she has a reputation for mental instability and that she was fired from her teaching job in Auriol for having sexual relations with a minor and practically run out of town. He then says that Mitch will not be coming around anymore. Stanley has informed Mitch about Blanche's past and the news of her promiscuity has turned Mitch off from her. Stella erupts in anger that Stanley has ruined Blanche's chances with Mitch. But the fight is cut short, as she tells Stanley to take her to the hospital; the baby is coming.As Blanche waits at home for news of the baby, Mitch arrives and confronts her with the stories that Stanley has told him. At first, she denies everything. Then, she breaks down in confession, describing, in a lengthy monologue, her troubled past. As she speaks to Mitch, she gives up the Southern belle façade; her voice grows weary and deep; her face becomes drawn and old; she pleads for his forgiveness, but Mitch is hurt and humiliated and rejects her. Blanche starts screaming, and Mitch runs away. Later that night, while Stella's labor continues, Stanley returns from the hospital to get some sleep, only to find Blanche dressed up in a tattered old gown pretending to be departing on a trip with an old admirer. She disdainfully antagonizes him, asserting her sense of superiority over him, spinning tale after tale about her plans for the future. He sees that she is delusional but he feels no pity for her. Instead, he seeks to destroy her illusions. They become engaged in a struggle which ends in rape.Weeks later, at another poker game at the Kowalski apartment, Stella and her neighbor, Eunice, are packing Blanche's belongings. Stella and Eunice have told Blanche that she is going on a vacation; but, in truth, Blanche is being committed to a mental hospital. She has suffered a complete mental breakdown. She has told Stella what happened, but Stella cannot believe Blanche's story. Stella, under obvious stress, does not know what to do. An older gentleman and lady come to the door; it is the doctor and nurse come to take Blanche away. Blanche does not recognize them and resists going; she collapses on the floor seized with total confusion. Mitch, present at the poker game, breaks down in tears. The doctor approaches and helps Blanche up. He offers his arm gently to her, and she goes willingly with him, saying, \"Whoever you are, I have always depended upon the kindness of strangers.\" As the car drives away with Blanche, Stella takes the baby upstairs to Eunice's, and says she is never coming back to Stanley again.","language":"English","Reception":"Upon release, the film drew very high praise. The New York Times critic Bosley Crowther stated that \"inner torments are seldom projected with such sensitivity and clarity on the screen\" and commending both Vivien Leigh's and Marlon Brando's performances. Film critic Roger Ebert has also expressed praise for the film, calling it a \"great ensemble of the movies.\" The film currently has a 98% rating on Rotten Tomatoes, based on 50 reviews.[8]A Streetcar Named Desire won four awards at the 24th Academy Awards.[9] The film set an Oscar record when it became the first film to win in three acting categories. The awards it won were for Actress in a Leading Role (Leigh), Actor in a Supporting Role (Malden), Actress in a Supporting Role (Hunter), and Art Direction.[10]American Film Institute recognition","box_office":"$8 million (North America)[1]","a_streetcar_named_desire":"Theatrical release poster by Bill Gold","cinematography":"Harry Stradling","directed_by":"Elia Kazan","Cast (in order of appearance)":"As of January 2015, Wright King and Mickey Kuhn are the last surviving cast members.","release_dates":"September 18, 1951 (1951-09-18)|||||","produced_by":"Charles K. Feldman","starring":"Vivien Leigh|Marlon Brando|Kim Hunter|Karl Malden|","running_time":"122 minutes","music_by":"Alex North","External links":"Best Actress and Best Supporting Actress","edited_by":"David Weisbart","budget":"$1.8 million[1]"}