{"976-evil":"DVD cover","country":"United States","Pop culture":"Alternative metal band Deftones has a song on their album Diamond Eyes named after the film.","distributed_by":"New Line Cinema1","Plot":"The movie centers around cousins Spike (Patrick O'Bryan) and Hoax (Stephen Geoffreys), both teenagers who live with Hoax's overtly religious mother Lucy (Sandy Dennis). While Spike is the neighborhood motorcycle bad boy, Hoax is an introverted nerd. Even though Spike genuinely cares for his cousin and protects him from bullies, Hoax is filled with resentment that he cannot stand up for himself or get the girl he wants (both of which Spike does effortlessly).Both boys stumble upon 976-EVIL, which on the surface is just a novelty phone line that gives creepy-themed fortunes for a few dollars. However, the line is actually used by Satan to subtly corrupt mortals into his bidding. Spike loses interest in the line quickly, but Hoax soon discovers the true nature of the line and uses it to get revenge on everyone who has wronged him.Soon Hoax's spirit is almost entirely consumed by Satan, who possesses Hoax to cause death and destruction, culminating in an opening to Hell appearing before their house. Spike confronts Hoax, but is quickly overpowered. In a desperate last ploy, he calls earnestly to his cousin, reminding him of the plans they had to take a vacation that summer.Hoax's fleeting soul resurfaces briefly, and realizes his horrible mistake and embraces Spike, begging for help. Spike, realizing Hoax is lost and cannot be separated from the demonic presence, betrays his cousin and throws him into the pit of Hell.","language":"English","Critical reception":"976-EVIL received a negative critical reception and currently has an approval rating of 9% on review aggregator website Rotten Tomatoes, based on 11 reviews.[4] The Washington Post wrote \"From start to finish, 976-EVIL is a sorry, wrong number.\"[5] Allmovie however defended the film, calling it \"underrated\".[6]","box_office":"$2,955,917 (USA)","cinematography":"Paul Elliott","directed_by":"Robert Englund","production_companies":"CineTel Films Horrorscope Productions","release_dates":"December 9, 1988 (1988-12-09) (UK)|March 24, 1989 (1989-03-24) (U.S.)||||","produced_by":"Lisa M. Hansen Paul Hertzberg","starring":"Stephen Geoffreys|Jim Metzler|Maria Rubell|Pat O'Bryan|Sandy Dennis|","running_time":"92 minutes (Theatrical) 105 minutes (VHS)","Sequel":"A direct-to-video sequel, entitled 976-EVIL II: The Astral Factor, was released in 1992, featuring 'Spike (Patrick O'Bryan) .","music_by":"Thomas Chase Steve Rucker","edited_by":"Stephen R. Myers","Release":"The film was released theatrically in the United States by New Line Cinema in March 1989. It grossed $2,955,917 at the box office.[3]The film was released on home video by RCA/Columbia Pictures Home Video the same year. VHS, and laserdisc versions of the film are uncut and contain footage previously unseen in its original theatrical release.The film was released on DVD by Sony Pictures Home Entertainment in 2002. The DVD version as well as the Crackle version are the theatrical cut.","written_by":"Rhet Topham Brian Helgeland"}