{"based_on":"Canto dos Malditos  by Austregésilo Carrano Bueno","country":"Brazil|Italy[1]|","distributed_by":"Columbia TriStar|RioFilme|","screenplay_by":"Luiz Bolognesi","brainstorm":"Theatrical release poster","Plot":"The film opens as Mr. Wilson reads a letter he has received from his son Neto, in which Neto declares his contempt for his father. It is followed by a flashback to explain the story; Neto, a São Paulo middleclass teenager, has a troubled relationship with his father and his mother, Meire.One day, Neto travels with his friend Lobo to Santos without informing his parents. They go to an apartment where they swim and eat food; Neto leaves the place when Lobo suggests that they reciprocate for the food by letting the men there caress them. Alone in downtown, Neto begs for money, and he is helped by a woman called Leninha. She takes him home to have lunch with some friends; after it, Neto and Leninha have sex. Later, at night, he is arrested for doing graffiti, and his parents pick him up at the police station. The following day, Neto is in his bedroom and his father finds a marijuana cigarette in his jacket. Neto's sister advises his parents to send him to a mental institution.Wilson tricks Neto and brings him to a hospital where he is forcibly admitted without any examination to verify its necessity. Neto is sedated by a nurse before receiving the diagnosis of Dr. Cintra. When he wakes up, Neto encounters Ceará, a hyperactive man, and finds out the hospital is decaying and careless. He also meets Rogério, an injectable drugs user committed by his family, who tells him it is impossible to escape and that if he were to try he would be drugged with haloperidol or electrocuted. Rogério also tells him not to consume the medications administered by nurses because it awakes the appetite in order to make patients look healthier. Meanwhile, Cintra has a conversation in which he discusses that if necessary he could easily admit more people, mostly homeless, to avoid losing the government subsidy.After some time, Neto's parents and sister visit him, and are deceived by the doctor who says Neto requires months of treatment. Neto begs his parents to take him with them and they refuse. Days later, Neto tries to escape but is captured and receives electric shock treatment. Suddenly, in another day, his father visits him to say he and Meire are missing him; Neto asks to leave the place and Wilson takes him away. At home, his mother asks a downcast Neto if he wants to return to school or to work as a salesman; he decides to work. The mother of one of his friends forbids Neto to see him, and he discovers Leninha is a married woman. Then, he becomes distressed to the point of leaving a client in the midst of a sale. To unwind, Neto goes to a party at night, where he mixes Coca-Cola and cachaça. Drunk, he carries his friend Bel to the bathroom and they start to kiss each other. However, he goes berserk and starts to damage the place. The police are called and send him to another psychiatric hospital.In this new institution, Neto angers the nurse Ivan after reporting to the hospital's superior that the nurse overreacted while trying to calm a patient. The nurse has it out for him, and when Ivan sees Neto faking to take a pill, he injects the drug through a syringe. That night, Neto, after doping a nurse, goes to the hospital stockroom and asks the inmate Biu[note 1] to set fire to a stack of drugs. When Ivan discovers this, Neto receives solitary confinement. After being released from solitary, Neto writes a letter to his father and silently gives it to him when he visits. After refusing to have his hair cut, Neto is locked in solitary once again. He sets fires to the cage and is rescued by the nurses. After reading the letter, Wilson takes him from the clinic. The films ends as Wilson cries while he and Neto are seem seated side by side curbside.","language":"Portuguese","Release and reception":"Brainstorm had its premiere in October 2000, when it was selected for and screened at the 2nd Rio Film Festival.[28][29] Late in the month, it was also exhibited at the 24th São Paulo International Film Festival, where it was the only Brazilian film—out of eleven—to be chosen by the public as one of the twelve best films of the festival.[28][30] It was also the most awarded film at the 33rd Brasília Film Festival, where it won seven awards out of thirteen,[31] and at the 5th Recife Film Festival, where it won nine out of eleven awards.[28][32] In early 2001, the film was screened in public square during the Tiradentes Film Festival in Minas Gerais; 11% of the two thousand people audience gave the film a rating of \"Good,\" and 89% of them gave it an \"Excellent.\"[28]It was released in the commercial circuit of theaters on June 22, 2001.[33][34] Brainstorm grossed R$2,184,514 and was watched by 401,565 people in the 50 Brazilian theaters in which it was released.[3] In addition, the film won several national awards; it was the most awarded film at the 1st Grande Prêmio BR de Cinema Brasileiro, winning seven out of thirteen awards: Best Film, Best Director, Best Screenplay, Best Score, Best Editing, Best Actor (Santoro), and Best Supporting Actor (Othon Bastos).[35] The APCA Throphy awarded the film Best Film, Best Director, Best Screenplay, and Best Actor (Santoro).[36] Santoro also received a Best Actor Award from the National Conference of Bishops of Brazil,[37] and the Social Service of Commerce.[38]In August 2001, Brainstorm was featured at the 54th Locarno International Film Festival,[1] where it won the Young Jury's Award.[39] It subsequently won several international awards, inlcluding Best Film at the 2001 Biarritz Film Festival, Best First Film at the 2001 Trieste Film Festival, and Best First Film and Best Actor at the 2002 Cartagena Film Festival.[39] The film was awarded by the French Minister of Youth Affairs and Sports Jury's Award at the 24th Créteil International Women's Film Festival.[40] It also entered into competition for Best Film at the 2001 Stockholm International Film Festival.[41] Moreover, the film paved the way for new thinking about psychiatric institutions in Brazil which led to a law approved by Congress that forbade such institutions.[42]Domestic reception was generally positive. Folha de S.Paulo's deemed it \"a portrait of hell in motion,\" \"painted with such passion, competence and integrity\" which makes it \"both a torment and a pleasure.\" The newspaper commented that all Bodanzky's choices are \"unerring\", that the documentary tone \"amplifies the incisiveness of history\" and the natural dialogue, and that \"the absence of proselytism facilitates the entry of the viewer in the universe of characters.\"[43] Ivan Claudio of IstoÉ Gente praised all of the cast, including the extras whose \"wandering like zombies in the courtyards of the asylum ... contribute to the realistic climate of the film.\" He, however, highlighted Santoro, stating that the joint effort of the cast would be meaningless without his performance.[9] Similar comments on the cast were woven by Veja magazine, which also commended \"the feeling of terror.\"[44] Santoro and Camilo, as well as the other patient actors, were praised by Marcelo Forlani of Omelete who said, \"It's hard to believe that the actors here are not really crazy.\" Forlani praised the photography and the sound editing as factors that differentiate it from other films.[45] Furthermore, O Estado de S. Paulo dubed it \"the best Brazilian film since retomada.\"[46]In contrast, international critics were not so favorable. Derek Elley of American magazine Variety said that with \"an unattractive palette of cold, blue-green hues, pic does little to build sympathy for its protagonist or any of the other characters, and flashy visual effects for Neto's mental dislocation add to the viewer's own alienation.\"[1] The Hindu's Gautaman Bhaskaran dubbed it \"extremely gripping\", \"disturbing\"; ultimately, he declared it has a \"morbidity\" and a \"sense of truth, bitter and brutal\".[47] Writing for Indian magazine Outlook, Namrata Joshi praised it as \"stylishly shot, alternating between a cinema verite view of the Brazilian family life and MTV images of the underground Sao Paolo [sic] youth culture.\" Joshi, however, criticized it for its \"excessive[ness] in the portrayal of the traumas of Neto which are evoked in the fashion of a radical, nihilistic music video,\" and the fact he found the reason to intern Neto \"never convincingly grounded in the narrative.\"[48] Similarly, Neue Zürcher Zeitung, a Swiss newspaper, criticized it for relying too much on special effects and for not presenting a deeper insight in the emotional conflict.[49] The World Socialist Web Site stated the film has a point in its subject \"but the simplistic and outraged tone spoils the film\" as \"Anyone not already convinced that such institutions are monstrous will legitimately dismiss the work as intemperate propaganda.\"[50]","box_office":"R$2,184,514[3]","cinematography":"Hugo Kovensky","production_company":"Buriti Filmes Dezenove Som e Imagens Produções Gullane Filmes Fabrica Cinema","directed_by":"Laís Bodanzky","release_dates":"October 2000 (2000-10) (Rio Film Festival)|June 22, 2001 (2001-06-22) (Brazil)||||","Production":"Laís Bodanzky read the biographical book Canto dos Malditos by Austregésilo Carrano Bueno for the first time in 1996,[6] when she was signed to assist with the direction of a documentary on the subject.[7] She found the book after entering a discussion and research group on mental health in Brazil.[6][8] Impressed by its narrative, she asked Luiz Bolognesi to adapt it, as she knew he had a similar worldview and would have the respect necessary to work on the subject.[6] Bolognesi was reluctant as he considered it a complicated subject; he was close to giving up until he read and was touched by Paulo Leminski's presentation of the book.[8]The Bodanzky's main concern was transposing the story's setting from the 1970s to current day because she wanted to cause an impact.[6] She felt audiences would believe the situations in the film were unlikely if it was set in the past.[7] She wanted to show that the end of Brazilian military government was not the end of what she dubbed \"concentration camps\".[9] To achieve this goal, she also used a documentary-like film style to generate further impact.[7] She filmed in actual hospitals that were disabled because of reports of mistreatment, and added extras to improve the realistic climate.[9]The original title of the film—Bicho de Sete Cabeças—is based on the song of the same name by Zé Ramalho and Geraldo Azevedo. Bodanzky declared that it was necessary to replace the book title because the film was not exactly the transposition of the book to cinema, but an adaptation inspired on it.[4] This title can be translated to \"seven-headed beast;\" \"fazer um bicho de sete cabeças\" (\"to make a seven-headed beast\") is an expression in Brazil commonly used to describe an overreaction that can be compared to the English expression \"to make heavy weather.\"[10][11]The first version of the script was written in June 1997 during a trip for the project Cine Mambembe,[12] which screens Brazilian films around the country in places where the people cannot pay for or do not have access to movie theaters.[13] The trip and the screenings helped Bolognesi to write the screenplay as he \"learned that the slightest loss of attention could be mortal and irreversible.\"[12] The script needed to be rewritten five times in two years as it was analyzed by Bodanzky and other collaborators.[12] Because of costs, producers suggested the removal of several parts that helped Bolognesi make the film flow faster. Another important group of critics were five teenagers who suggested making Neto a graffiti writer, for example. Lastly and most fundamental was Carrano's approval a few months before the start of filming.[14]In adapting the book, Bolognesi considered the work as his inspiration but felt free to create situations or characters and to modify the personality of the characters. Carrano accepted Bodanzky and Bolognesi's offer as they stated that their wish was to keep the base of the story while adapting it when necessary for the general public or to keep the efficacy of cinematic storytelling.[16] Bolognesi wrote Neto as a shyer character than Carrano did, and made him not the leader of the class but a common student. His objective was to create a character that would reflect the regular viewer rather than \"a hero.\"[17] He also softened some scenes and removed others that he thought the public would find unbelievable.[8]In addition to the central theme—the violence of institutions against the people outside the norms—Bolognesi felt the necessity of a parallel, \"complementary\" discussion.[8][17] First, he tried to put Neto in a love story, but he could not write something satisfying. Making it a story of love and hate, Bolognesi decided to explore another theme he considered a taboo: the father-son relationship. He based the \"atmosphere\" of the relation on Franz Kafka's Letter to His Father. He used words from a letter by Lupicínio Rodrigues to a woman to open the film, as he wanted its feelings to guide the story.[18]Bodanzky considered the screenplay a key-element on the production of Brainstorm; it was her only way of attracting a good cast and staff because it was her first feature film.[6] It aroused interest of lead actors Santoro, Bastos, Kiss, and the producers Sara Silveira, Caio and Fabiano Gullane.[4] Marco Muller, Italian producer of Fabrica Cinema, was also lured by the script, and the film became a Brazil-Italy co-production.[4][19]Santoro was recommended by Paulo Autran, who acted along with him in the TV series Hilda Furacão. After seeing Santoro's acting, he was Bodanzky's first choice for Neto's role; \"I never even thought of another person. ... When I saw him, I was impressed with his giving of himself to the role/character. I knew that Neto was him.\"[20] Santoro read the book and was \"shocked,\" which led him to contact Carrano; after talking to the author, he was convinced to take the role.[9] He found the story \"very moving, but kind of over the top,\" and was worried about overacting and making the character \"fake.\"[21] To prepare himself for the role, he talked with interns and watched productions on the subject, among them the film One Flew Over the Cuckoo's Nest by Miloš Forman.[9]Sérgio Penna, a theatrical director and a theater guest professor at University of São Paulo, coordinated the cast preparation. His primary aim was to deconstruct the \"superficial figure, stereotyped and crystallized by prejudice\" image about psychiatric hospitals and the people who live there. The idea was to create another vision that would contain the first, but focus on \"more humane and deep aspects.\" Former psychiatric institution patients from the theatrical groups Pazzo a Pazzo and Teatral Ueinzz, both directed by Penna, appeared as guests. They, however, did not play characters that were interned but supporting characters who remained outside of the hospital.[22]Filming took place in the city of São Paulo between February and April 2000, with a budget of R$1,5 million ($700,000).[2] The biggest difficult Bodanzky faced while producing the film was to find funders.[7] She was helped by Ministry of Culture's incentive laws; however, the most companies did not want associate its brand to the theme. In addition to the Brazilian distributor Riofilme, half of the film cost was gathered by European resources: Italian studio Fabrica Cinema, Italian network RAI and Swiss Fondation Montecinemaveritá.[2]Bodanzky and Bolognesi spent four months in Trieste, Italy editing the film along with Italian editors Jacopo Quadri and Letizia Caudullo.[23] However, the film was \"dreamed, written and filmed\" for Brazilian people, so they then returned to Brazil to listen to their opinions. After some screenings in Brazil, they felt the film was not working as they wanted. On the airplane back to Italy, they rewrote the screenplay; they focused more on Neto and removed minor characters and subplots, while emphasizing the son-father relationship.[24] When they arrived they had a long discussion with the Italian producers before finally agreeing and finishing the film.[25] The film was finalized in October at the Cinecittà studio in Rome, using the THX mixing technology and the standard Dolby Digital.[2]When Bolognesi was re-writing the screenplay, Bodanzky suggested that he listen to Arnaldo Antunes' music. According to the writer, he found some songs that seemed to be composed for the film. He then wrote some scenes and characters to fit the compositions and integrate them into the narrative.[26] The soundtrack consists of songs by Atunes, with lyrics by André Abujamra. In addition, it features singer Décio Rocha, Zé Ramalho, Geraldo Azevedo and Zeca Baleiro, the rap band Zona Proibida and the punk rock band Infierno.[27]","produced_by":"Maria Ionescu|Sara Silveira|Caio Gullane|Fabiano Gullane|Luiz Bolognesi|Marco Muller|","starring":"Rodrigo Santoro|Othon Bastos|Cássia Kiss|","running_time":"74 minutes","music_by":"André Abujamra","edited_by":"Jacopo Quadri|Letizia Caudullo|","budget":"R$1.5 million ($700,000)[2]"}