{"Cast":"Michael Shannon and Neil Flynn make appearances as a van driver and a police officer, respectively.","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"J. F. Lawton Michael Bortman","story_by":"Arne L. Schmidt Rick Seaman Josh Friedman","Plot":"Eddie Kasalivich (Keanu Reeves) is a student machinist working with a team from the University of Chicago to obtain clean energy from water by efficiently splitting the hydrogen and oxygen atoms from the water molecules. While working at home, Eddie inadvertently discovers the secret. The machine is perfected the next day in the lab and everything appears to be working and stable. To celebrate, a party is thrown in the lab. That night after the party, project physicist Dr. Lily Sinclair (Rachel Weisz) tries to leave the lab but her car battery is dead. Eddie offers to take her home by taxi; but, later says they took a bus. Back in the lab, Drs. Alistair Barkley and Lu Chen are on their computers preparing to upload their discovery to the Internet so the world can share in this new discovery, speaking Chinese. Meanwhile, a van is seen driving toward the lab. Chen hears a noise and goes to investigate, but is kidnapped by unknown assailants as Alistair also comes under attack.Meanwhile, Lily and Eddie arrive at her house and after making sure she is okay, Eddie heads back to the lab to get his motorcycle. As he arrives at the lab, he sees a van leaving and hears alarms coming from the lab. He runs inside to find Alistair with a plastic bag over his head and Chen nowhere to be found. The hydrogen reactor is dangerously unstable and Eddie is unable to shut it down. Realizing the reactor is going to overload, he speeds away on his bike as a concealed detonator triggers a massive hydrogen explosion that destroys the lab and surrounding streets. As rescue crews arrive, Eddie is questioned by the police and later the FBI about what happened the night of the blast. Upon returning with Lily to their homes, they realize that they are being framed as fake evidence is planted in both of their houses.Both go on the run and head to an observatory belonging to Maggie McDermott, an old friend of Eddie's. After resting up, they contact Paul Shannon (Morgan Freeman), the man funding the project (along with DARPA), but they're almost caught in the process and barely manage to escape. As Eddie and Lily are evading more police, Paul meets with Lyman Earl Collier (Brian Cox) at C-Systems Research complex to discuss the current events. It becomes apparent that the plot to destroy the lab and frame Eddie and Lily for it was orchestrated by the company, and that Lyman is responsible. Despite some disagreement, Paul and Lyman decide to continue the hunt for Eddie and Lily, a task made easier when Eddie sends a coded message to Paul requesting another place to meet. At this new rendezvous, Paul reveals he was involved, but wants to talk somewhere else. The meeting ends in an ambush, and Lily is captured as Eddie barely escapes.By tracing the license plate on the van used in the ambush, Eddie is able to track them to the C-Systems Research facility where Lily and Chen are being held. When C-Systems' test reactor fails again, Paul, the scientists, and the prisoners all leave the room, so Eddie takes the opportunity to \"fix\" the system. The next morning, one of the other scientists discovers the working reactor and everyone celebrates. Paul is suspicious, and immediately obtains a download of the working data, and secretly gives it to his assistant, Anita, for safekeeping. He then finds Eddie at a computer in the company boardroom. There, Eddie demands to be let go in exchange for making the reactor work. Paul agrees but Lyman refuses, believing that the process already works, so Eddie sets the reactor to explode while sending proof of his innocence to the FBI and blueprints of the reactor to \"hopefully a couple thousand\" international scientists. Lyman responds by shooting Chen dead, then leaving both Eddie and Lily to die in the explosion as he, Paul, and their staff flee the site, setting lockdown doors on the way.Paul shoots Lyman for overstepping the bounds of the program, leaving his body in an elevator to be incinerated in the ensuing inferno. During his own escape, Paul deactivates the containment, letting Eddie and Lily escape, and Lyman's remains to be destroyed. As he is doing this, Eddie and Lily struggle with one of Lyman's henchmen over an ascending construction lift, ending in Eddie and Lily climbing aboard it, moments before a blast wave sweeps into the tunnel. Both Eddie and Lily survive the shockwave to be met by FBI now convinced of their innocence, who take them to safety. Paul departs the scene via chauffeured sedan. He is last seen dictating a memo to Anita. The memo informs the Director of CIA that C-System is \"...no longer a viable entity. Will be in contact.\"","language":"English","Reception":"Chain Reaction received mostly negative reviews. It holds a 16% rating on Rotten Tomatoes based on 32 reviews.[3] Roger Ebert gave the film two and a half stars out of four, writing: \"By movie's end, I'd seen some swell photography and witnessed some thrilling chase scenes, but when it came to understanding the movie, I didn't have a clue.\"[4] Jeff Millar of the Houston Chronicle wrote: \"The narrative is very complex, but what's on the screen is little more than generic, non-narrative-specific, guy-being-chased stuff\".[5] Conversely, Edward Guthmann of the San Francisco Chronicle felt the film was one of the summer's best movies, writing: \"[Chain Reaction] has better acting, better writing, more spectacular chase sequences and more genuine drama than all of this summer's blockbusters.\"[6]Chain Reaction and its cast were nominated for only one award, with Keanu Reeves being nominated for the Razzie for Worst Actor, which he lost to both Tom Arnold and Pauly Shore.[7]Despite the mostly negative reception, Chain Reaction was a minor financial success, making approximately USD$ 60,000,000 worldwide.[8]","box_office":"US$60,209,334","cinematography":"Frank Tidy","production_company":"The Zanuck Company Chicago Pacific Entertainment","Scientific accuracy":"In the film's plot, a scientific process supposedly extracts hydrogen from water, then burns the hydrogen to generate power, and leaves only water as a residue, essentially a chemical perpetual motion. The movie never clarifies how the hydrogen is extracted from the water, nor how water is still left over. The character Dr. Shannon makes contradictory statements: one time he says this is accomplished with a laser with millions of degrees, another time he says frequencies of sound and sonoluminescence. At one point, the movie shows a bubbling container reminiscent of cold fusion electrolytic cells. A character in the film claims that a glass of water could power Chicago for weeks, but no clear explanation is ever given. The film's title is also misleading, since \"chain reaction\" is related to nuclear fission, not fusion.[9]The film is based around the premise that free energy suppression is real. The main character is told that his discovery is too disruptive: energy would suddenly be cheap, oil would no longer be necessary, oil companies would go bankrupt, and that such sudden economic changes would throw society into chaos. Unfortunately, this is only explained in the last minutes of the film, and it is unlikely that his discovery would have such an effect in economy. Most of the film revolves around action scenes in the style of 1990s blockbusters, and the topic of conspiracy theories is not adequately explored.[10]","directed_by":"Andrew Davis","release_dates":"August 2, 1996 (1996-08-02)|||||","Production":"Large portions of the film were shot on location in and around Chicago, Illinois, including the University of Chicago, Argonne National Laboratory, the Museum of Science and Industry, the Field Museum of Natural History, Michigan Avenue,and the James R. Thompson Center (Atrium Mall). Additional scenes were shot at Yerkes Observatory in Williams Bay, Wisconsin, on Geneva Lake in southern Wisconsin, interiors of the U.S. Capitol were shot at the Wisconsin State Capitol, in Madison, Wisconsin and at Inland Steel (now known as MITTAL Steel) in East Chicago, Indiana. Because of the cold Great Lakes winter and filming taking place during record breaking winter weather besides, unique challenges were present for the cast and crew. Morgan Freeman noted that \"It was difficult for everyone, particularly for me because I'm tropical,\" he said. \"I don't do cold weather. This is Chicago...in the winter. I was ill and in bed four days at a crack. It was really rough.\"[1] Among the extras in the film were U.S. Rep. (and current U.S. Senator) Tammy Baldwin (D-Wis.) [2]","produced_by":"Arne L. Schmidt Andrew Davis","starring":"Keanu Reeves Morgan Freeman Rachel Weisz Fred Ward Kevin Dunn Brian Cox","running_time":"107 minutes","chain_reaction":"Theatrical release poster","music_by":"Jerry Goldsmith","edited_by":"Don Brochu Dov Hoenig Mark Stevens Arthur Schmidt","budget":"USD$ 50 million"}