{"country":"United States Germany Australia","distributed_by":"Warner Bros. Pictures","screenplay_by":"Ellory Elkayem Jesse Alexander","story_by":"Ellory Elkayem Randy Kornfield","Plot":"In the quiet mining town of Prosperity, Arizona, an accident involving a rabbit causes a barrel of toxic waste to land in a reservoir. An exotic spider farmer named Joshua Taft (Tom Noonan) has been making regular visits to the site, where he collects crickets for his spiders. Joshua shows Mike (Scott Terra), a local boy, his collection, which include Jumping spiders, Tarantulas, Trapdoor spiders, male orb-weaver spiders, and a female orb-weaver named Consuela. After Mike leaves, Joshua is bitten by an escaped tarantula and accidentally knocks down the spider cages, causing him to be killed by the spiders. After devouring him, the spiders grow to even bigger proportions.On his way home, Mike is accosted by his mother, Sheriff Sam Parker (Kari Wührer) and Deputy Pete Williams (Rick Overton) pulling the toxic barrel out of the pond. Wade (Leon Rippy), the Mayor of Prosperity, is holding a town meeting in the mall about whether they should sell the mines and relocate. Chris McCormick (David Arquette), whose father owned the mines before he died ten years ago, shows up and stands against Wade's proposition. Chris also sparks a romance with Sam.Meanwhile, Harlan Griffiths (Doug E. Doug), an eccentric extraterrestrial enthusiast, is broadcasting his theory that various missing animals around town have been abducted by extraterrestrials. Inevitably his theory is dismissed as the product of a deranged imagination. Mike sneaks out on foot to find Joshua, but finds the farm covered in webbing and the spiders missing, along with Joshua's remains. Although he saw a silhouette of an enormous spider in the mines and tells Chris and Sam about the spiders grown to enormous sizes (based on a giant spider leg he found at the mine entrance), they disbelieve his story. Moreover, the mines have reopened with the miners searching for a famous stash of gold.One miner is eaten by a gigantic spider, whose clan have made the mines their home. Seeing as the entire town is connected in some way to the mines, spiders show up in many different places. Pete's cat has a fight with a spider in the air vents before being eaten, and some of the ostriches on Wade's farm are devoured by trapdoor spiders. After Sam's daughter Ashley (Scarlett Johansson) breaks up with her boyfriend, Wade's step-son Bret (Matt Czuchry), and he and his motorcyclist friends are chased by jumping spiders. Bret manages to get away, and the explosion of a gasoline truck cuts off the telephone line as he becomes trapped in the mine. Chris finds out that his Aunt Gladys (Eileen Ryan) and her dog have been abducted by a male orb-weaver in their basement, and then runs to the Parker's house for help.Sam is convinced Mike was right all along when she witnesses a giant male orb-weaver attempting to abduct Ashley. While Chris tries to hold it off with a chair, Sam runs to retrieve something from a glass case. Chris ends up pinned to the wall by webbing as well and the spider prepares to abduct them when it is distracted by Sam, she blasts it partially to bits with a shotgun. Meanwhile, Bret, still wandering the mines, finds the main part of the mine, where the now-giant Consuela is now living.Sam contacts Pete and tells him to bring all of the guns in the police force's possession and after killing several jumping spiders, they escape to Harlan's trailer, knowing he has a radio station inside. As Sam broadcasts the threat over the radio, a giant tarantula, the \"tank\" of the horde, assaults the trailer, but they manage to escape. The townspeople initially refuse to take Sam's warnings seriously, but soon change their tune when the spiders begin to swarm the town. In the chaos, many are attacked, eaten or taken captive by the spiders, Chris tries to convince Harlan that the spiders are extraterrestrial to make him happy, and Sam demands for everybody to evacuate to the mall.Many townspeople escape and barricade themselves in the mall, but Wade flees into the mines and locks the gate before the attack. The unarmed residents seize whatever they can use to defend themselves and briefly hold their own against the horde when the giant tarantula from before breaches the gates, and they are eventually forced to retreat to the basement. Meanwhile, Harlan and Chris climb onto the roof and ascend the radio mast to try to get a signal so they can call the army, but they are believed to be pranksters. After the tarantula breaks open the gates and lets the spiders enter the mall, Harlan jumps from the roof and lands in some bushes, where he meets up with Pete. The two run from spiders as Chris gathers the remaining townsfolk into the basement. Meanwhile, Bret encounters the cowardly Wade before his abduction.While the townsfolk are in the basement, Bret arrives on a forklift that brings down the locked gate, and they all head to through the mines straight to the front entrance, discovering the methane-filled tunnels. After losing Norman (David Earl Waterman) the janitor, and freeing Wade, Chris goes to look for Gladys in the mines and finds her and the gold his father was searching for, but is confronted by the gigantic Consuela. He uses perfume to distract the spider and then escapes using Bret's motorcycle. Chris then blows up the spiders and the mines using Gladys' cigarette lighter due to the high concentrations of methane gas. The police finally arrive. They had not believed the reports of the spiders but believed Harlan's theory that the assailants were extraterrestrial in nature, until Pete tells them that the assailants were \"just spiders, that had ingested extremely high levels of toxic waste.\" He attempts to prove this by removing his hat, showing that he is bald. He runs his hand back and forth over his head saying; \"All new growth, just look at this, all new growth!\"As the story ends, Harlan is heard making a radio report about the spiders. He concludes that the town has decided to cover up the whole incident, but have let Harlan continue broadcasting anyway, knowing nobody will believe him. He also mentions Chris reopening the gold mines and putting everyone back to work, but tells his listeners \"that is another story altogether.\" As the camera zooms in close on his mouth, it is clear that he now has three gold teeth.","language":"English","Reception":"Eight Legged Freaks was met with mixed reviews. It currently holds an approval rating of 48% on Rotten Tomatoes stating: \"This homage to the B-movies of the '50s has a promising first half, but runs out of ideas in the second\".[2]","box_office":"$45,867,333[1]","cinematography":"John S. Bartley","production_company":"Centropolis Entertainment Village Roadshow Pictures Electric Entertainment","directed_by":"Ellory Elkayem","release_dates":"July 17, 2002 (2002-07-17)","Production":"Director Ellory Elkayem got the idea from his 1997 short film, Larger Than Life, which also handled a spider-fighting storyline.The film was originally titled Arac Attack (under which it was released in some parts of Europe and other countries around the world) but the similarity to 'Iraq Attack' made the title seem inappropriate near the start of the Iraq War.[citation needed]The title, \"Eight Legged Freaks\", is a line that Arquette ad-libbed in the movie: \"Get back, you eight-legged freaks!\"[citation needed]","produced_by":"Dean Devlin","starring":"David Arquette Kari Wührer Scott Terra Doug E. Doug Scarlett Johansson","running_time":"100 minutes","Sequel":"On January 5, 2003, the news-website Moviehole reported that Eight Legged Freaks 2 was in development saying \"Oh the Horror! Despite the first film only being a modest success, Producer Dean Devlin is in talks for an \"Eight Legged Freaks 2\", a sequel to the David Arquette starring Spidey piece of 2002. According to the Producer, a sequel was always a possibility, hence the ‘open for a sequel’ ending of the first film. David Arquette will return and the originals lenser New Zealand Director Ellory Elkayem is in talks to direct the follow-up.\"[3]","music_by":"John Ottman","eight_legged_freaks":"Theatrical release poster","edited_by":"David Siegel","budget":"$30 million"}