{"country":"United States","distributed_by":"20th Century Fox","Novelization":"A novelization of the story was released in conjunction with the film. The novel was written by American fantasy and science fiction author Suzanne Weyn.[citation needed]","Plot":"Madeline Rose \"Maddy\" Phillips (Kristen Stewart) is 12-year-old girl who loves to climb. Her father Tom (Sam Robards) has climbed Mount Everest so it runs in the family. Several years earlier, Tom fell more than 100 feet during a climb and because her parents Tom and Molly (Jennifer Beals) are afraid she might hurt herself, they have ordered Maddy not to climb. Tom had some internal injuries from that earlier fall which he did not know about and now the injury has paralyzed him from the neck down. There is an experimental operation costing $250,000 which can save him, but insurance will not pay for the operation and the family does not have the money. Harderbach Financial's president Brisbane (Michael Des Barres) refuses to loan the amount and does so by putting loopholes in a contract Molly signed (he is really trying to avoid loaning any money at all). When asked if he has a heart, Brisbane coldly responds \"This is not an emotional issue, Mrs. Phillips. A bank has no heart. Only paper in a vault\". That is when Maddy first gets the idea to rob the bank.Maddy steals three go-carts from her father's race course (Tom has a race track where people race in go-carts) and convinces her two friends Gus (Max Thieriot) and Austin (Corbin Bleu) to help her. They remain hesitant, so she tells both of them that she loves him and does not care for the other and gives half of her friendship necklace to each of them, claiming she has the other half. They break into Harderbach Financial (a bank in which Molly had begun to work for, designing a security system). They manage to break in, but with her mother at the hospital visiting their father, she is forced to babysit her younger brother Max. She and Gus progress to a room with thousands of security deposit boxes while Austin keeps the guards away from them. Maddy has to free climb to get to the exit when her hook gets caught in a crack when using the handhelds. She cracks the code (finding it is Madeline) and they flee the room, unintentionally setting off the alarm as they forgot to type the exit code. While escaping from the guard dogs at which point Austin demonstrates his dog-training skills, the trio is caught by Gus' brother, Chad, who tasers his partner (and then himself, though accidentally) after understanding the situation. However, just before escaping, Gus and Austin find out that Maddy played them after seeing each other's necklaces and leave her, but later come back for her.The three hop into their go-carts, trailed by the police, but Austin holds all the cash in his cart, suddenly starts running out of gas. He then leaps into Gus' cart, and they escape to the hospital. They rejoin with Maddy in time to disable police cruisers by popping the tires with jacks. When Mrs. Phillips arrives, Brisbane attempts to pass all the blame on her. But ultimately, he is rejected by Francois, a Frenchman, who says Brisbane's irresponsibility of having a party with an untested security system is stupid. Meanwhile, the kids make it to the hospital. However, they are caught up to by Maddy's mother, the bank security, the police, and the press. Maddy's mother then takes responsibility, saying that this was an authorized test for the bank's security. As they leave, reporters outside the hospital mention about the incident and how it was motivated when the insurance company wouldn't help the Phillips family.The following morning, Mrs. Phillips says what Maddy did was wrong, but apologizes as it was her over-protection that started all the trouble in the first place. The press sympathizes with them, allowing them to hold a fundraiser the day after earning enough money for Maddy's father's surgery. Even a friend named Mr. Hartmann (John Carroll Lynch) gives a \"consultation fee\" of $50,000. As Brisbane's irresponsibility got him fired, Hartmann is now the president of the bank. At the go cart rally after the operation, Gus and Austin make Maddy decide who she loves. She sniffs both of them and causes a debate between them. While they do so, she backs away and they run after her, asking who is a better boyfriend and the movie ends.","language":"English","Reception":"On Rotten Tomatoes, the film received a rating of 12%, based on 86 reviews, with an average score of 3.8/10. The site's critical consensus reads: \"An unimaginative heist movie aimed strictly at the preteen set.\"[2] On Metacritic, the film holds a score of 33 out of 100, based on 27 critics, indicating \"generally unfavorable reviews\".[3]Critics overall expressed dislike the film's questionable morals and lack of originality, comparing it unfavorably to the Spy Kids trilogy. Despite these negative reviews, Roger Ebert of Ebert & Roeper and the Chicago Sun Times gave Catch That Kid \"thumbs up\", stating that it is as much fun as Spy Kids, Kim Possible and more fun than Agent Cody Banks.","box_office":"$16.9 million[1]","cinematography":"Julio Macat","directed_by":"Bart Freundlich","release_dates":"February 6, 2004","Box office":"Catch That Kid opened at #6 in the weekend of February 6, 2004 raking in $5,824,860 in its first opening weekend. The film spent two weeks at the U.S. box office top ten. The film was a Box office flop, making only $10.million in the United States against a budget of $12.million.","catch_that_kid!":"Theatrical release poster","produced_by":"Andrew Lazar Uwe Schott","starring":"Kristen Stewart Corbin Bleu Max Thieriot Jennifer Beals Sam Robards","running_time":"91 minutes","music_by":"George S. Clinton","edited_by":"Stuart Levy","written_by":"Michael Brandt Derek Haas","budget":"$12 million[1]"}