{"country":"United States","distributed_by":"Cinerama Releasing Corporation (USA) 20th Century Fox (UK)","language":"English","Reception":"The film appeared at the same time as Jesus Christ Superstar. It failed as an arthouse film, was retitled \"Santa Fe Satan\", and reissued as a drive-in exploitation film.[9]Critical reviews of Catch My Soul were generally negative, Time Out's reviewer describing it as\"Hampered all the way by McGoohan's languorous direction, which lets each appalling moment of this uncomfortable hybrid of grade-school Shakespeare and grade-school religion sink wincingly in.\"[10]Leslie Halliwell was equally scathing, his description being\"A rock and country musical version of Othello, in which the tragic original is trivialized to the point of boredom\"[11]AllMovie's Craig Butler was able to say that \"some of the musical performances, especially from Richie Havens and Tony Joe White are quite good, and much of the music is worth hearing ... removed from the movie.\" Nevertheless, his overall assessment is \"a train wreck of a movie that inspires awe and that makes one appreciate a time when awful movies could be so bad in such an interesting way.\"[5]","cinematography":"Conrad Hall","production_company":"Metromedia Productions","directed_by":"Patrick McGoohan[1]","catch_my_soul":"Promotional poster","Soundtrack":"A soundtrack album was issued by Metromedia to tie-in with the film.[12] The New York Times reviewer, in line with others, commented \"Forget the movie and get the soundtrack album.\"[8]","release_dates":"March 22, 1974 (1974-03-22) (New York City)|||||","Production":"Shakespeare's tragedy of revenge and racism had been retitled for the London stage and relocated from Venice to Piccadilly; for the film, the location of the drama was moved to the New Mexico desert; filming took place in Española and Santa Fe. The title comes from Act III, Scene III of Shakespeare's play, in which Othello declares his love for Desdemona, \"Perdition catch my soul, but I do love thee; and when I love thee not, chaos is come again.\"[2]Although much of the plot remains intact, Othello, the \"noble Moor\" becomes the pacifist leader of a hippie commune,[3] Iago appears to be the Devil incarnate who \"fits all the negative stereotypes of dropouts with his scruffy beard and unwashed look\"[4] and Desdemona becomes a \"white round-faced girl with granny glasses\".[4]Patrick McGoohan had earlier starred in the successful 1962 modernisation of the Othello story, All Night Long, which had been moved to 1960s London and fuelled by jazz music. AllMovie's reviewer points out that \"perhaps he thought lightning would strike twice in moving it to a gospel show in the Southwest. He was terribly wrong.\"[5] Catch My Soul would be the only film to be directed by McGoohan,[6] although he later directed some episodes of Columbo.[7] In an interview with Premiere magazine in 1995, McGoohan gave some insight into why the film had failed:Of the cast, Richie Havens was well-known from his appearance at Woodstock Festival, but this was his first acting role; Lance LeGault had some experience, but not playing major roles; likewise Season Hubley and Susan Tyrrell. Tony Joe White was already fairly well known as a musician. Allmovie's Craig Butler was moved to comment \"Laughable also describes every dramatic performance, as do horrible and unbelievable.\"[5]","produced_by":"Jack Good Richard M. Rosenbloom","starring":"Richie Havens Lance LeGault Season Hubley Tony Joe White Susan Tyrrell","running_time":"97 minutes","music_by":"Tony Joe White, Emil Dean Zoghby","edited_by":"Richard A. Harris","written_by":"William Shakespeare (play) Jack Good (musical)"}