{"Cast":"The film gives very little clue to the complete identity of the characters. Very few names are used and the characters are referred to by either their first name or surname only or by an alternative term. Terms such as the Guv’nor (boss), Bellman (alarm disabler), Peterman (safebreaker) and Wheelman (getaway driver) are used to hide the identity of the characters.First billed cast:","country":"United Kingdom","distributed_by":"Independent Television (U.K.) Island Pictures (U.S.A.) Production: Christopher Neamendmade Films","Plot":"Hiller (Hill) arrives at Paddington station with The Boy (O’Brien) following a stay in Torquay. As they arrive they do not realise they are being followed by Gort (Bones) who tails them as they check in to a hotel near the station. A few days later The Boy is kidnapped by Gort and Hiller is also captured and taken to a derelict house in central London where he meets up with Salto (Hope). It transpires that Hiller is a former computer programmer who stole a computer tape for Salto containing details of the security system at a bank near Heathrow Airport. The Boy is Hiller’s wife’s son and he looks after him after The Boy’s mother ran away with another man.Hiller and The Boy are kept captive in the house while Hiller is forced to decode the information on the tape. When he succeeds Salto realises that he has all the information he needs to rob the bank. Salto obtains the necessary finance for the robbery and recruits The Guv’nor (Newark) to mastermind the robbery. During the planning stages, The Bellman (Howell) identifies that the alarm system for the bank is very sophisticated and that it has a number of safeguards to prevent it being interfered with. Hiller is able to advise on how to beat the countermeasures and is recruited as the new Bellman for the robbery. The gang decide that they will rob the bank just before Christmas when it will hold one of the largest amounts of cash in its vaults.On the night of the robbery the gang intentionally trigger the alarm to fool the guards sent to investigate that the bank has been broken into. The guards assume the call is false whilst the gang actually use a small window of time to enter the bank allowing The Peterman (Whybrow) to determine how to access the basement area. They utilise the fact that after the fourth callout, the guards will remain in the bank with the alarm disabled until the following morning whilst the gang are in the basement breaking into the vault.The gang use a thermic lance to cut through the vault door and steal approximately 13 million pounds in cash. They leave the bank by releasing tear gas canisters to disorientate the guards and escape in a getaway car driven by The Wheelman (Dowdall). They manage to escape to a changeover point where they abandon the car and change to a van. On the journey to an unspecified location they hear that the security guard dog handler has died. The Guv’nor is frightened that he has broken a criminal code of conduct that no one gets hurt and he is afraid that the identity of the gang will be made known to the police. He changes his plans and the gang travel to the beach next to Dungeness power station. Salto later arrives with The Boy.At the beach The Guv’nor informs Hiller that The Boy and others will leave to travel abroad in a private plane and that Hiller will stay in the UK while it is arranged for him to have plastic surgery. The Guv’nor actually intends to kill Hiller but before he can do so Hiller steals a gun and runs into a nearby building where he earlier created an Improvised Explosive Device using a propane gas cylinder which blows up after he has escaped. The explosion kills the Guv’nor and the others in the gang and Hiller escapes in the van with Salto driving. They make it to the plane pick-up point but Salto was mortally wounded after he was shot following the explosion and dies in a pillbox by the beach.The plane sent to pick them up does not land and Hiller and The Boy use the van to take them to Heathrow Airport. They use the false passports intended for their getaway and arrive for a flight to Rio de Janeiro already booked for them. On board the plane Hiller is tense and thinks he is likely to be arrested when he sees policemen come aboard the flight. It transpires that the plane is being used to transport human organs for transplant and the film ends with the plane taking off.","language":"English","bellman_and_true":"Theatrical release poster","cinematography":"Ken Westbury","directed_by":"Richard Loncraine","Remakes":"The plot was used in the 1993 film The Real McCoy starring Kim Basinger, Val Kilmer and Terence Stamp. Richard Loncraine directed Firewall, an Australian-American film revolving around a bank robbery involving a member of bank staff starring Harrison Ford and made for an American audience. The plot of Firewall differs significantly.","release_dates":"1987","Production":"Filming took place mostly in locations in London. The opening scenes were filmed in and around Paddington Station and the hotel where Hiller stays is near Praed Street. The scene where Hiller is being chased was filmed in Bayswater with Redan Place and the then closed Whiteleys department store visible in shots. The scene where the Guv’nor threatens Hiller by the side of the motorway was filmed on the M25 between junctions 14 and 15 next to the Colnbrook bypass overbridge. The scenes following the robbery were filmed at Dungeness Beach next to Dungeness Power Station. The closing scenes were filmed in Terminal 4 of Heathrow Airport.The film was produced jointly by Handmade Films and Euston Films, the drama making subsidiary of Thames Television. The production was originally a three part series made for television with an approximate run time of 150 minutes. The film version has been edited to 112 minutes.","produced_by":"George Harrison Christopher Neame Denis O'Brien Michael Wearing","starring":"Bernard Hill|Derek Newark|Richard Hope|Ken Bones|Frances Tomelty|Kieran O'Brien|","running_time":"112 minutes","Home Media Release":"The 112 minute film version is available on DVD.","music_by":"Colin Towns","edited_by":"Paul Green","written_by":"Desmond Lowden (from his novel)"}