{"country":"United States","distributed_by":"Paramount Pictures","story_by":"Peter Barsocchini Tony Griffin Guy Manos","Plot":"Aboard a commercial airliner, U.S. Marshals Terry (Malcolm-Jamal Warner) and Pete Nessip (Wesley Snipes), are escorting computer expert Earl Leedy (Michael Jeter) to a high security prison. When an apparent terrorist hijack attempt blows a hole in the (Boeing 747) airliner, Terry is sucked out to his death, and the terrorists parachute out of the same hole, taking Leedy with them.Renegade skydiver and former DEA agent Ty Moncrief (Gary Busey) is the mastermind behind the attack, which culminated in the first ever parachute jump from a commercial jet at 30,000 feet. Ty plans to use Leedy to hack into the DEA mainframe computer in Washington DC so Ty can auction off the names of undercover agents to drug cartels worldwide. Ty has scheduled this to be accomplished during an Independence Day parachute exhibition and fireworks display, which is the one day every year when security is loosened around the airspace above Washington DC.Pete believes that the assault may have been an elaborate prison break meant to free Leedy. However, the FBI declares that sneaking a parachute through airport security is impossible, and that parachuting at the jet's altitude and speed is not survivable. A devastated Pete is blamed for overreacting to the incident, and forced to turn in his badge.Undeterred, Pete consults a U.S. Navy High-altitude military parachuting instructor who confirms that he and his team have parachuted from that height and speed, but also states that the high-density metal rings in the parachutes would not pass airport metal detectors and that the operation required either rare skills or suicidal recklessness. The instructor believes the world class skydiver Dominic Jagger (Luca Bercovici) could perform the jump, but does not know his current whereabouts. Pete is instead referred to Jagger's reckless ex-wife, ex-con Jessie Crossman (Yancy Butler) - who is unaware that Jagger is part of Ty's crew. Jessie agrees to train Pete how to skydive, if he will sponsor her team for the parachute exhibition.When Jessie's parachuting friend Selkirk (Corin Nemec) is severely injured after using a faulty parachute that Ty had intended for Jessie to use, Pete is appointed to take Selkirk's place. Soon after, Jagger is found dead, tangled in some high voltage power lines. Jesse breaks into the police impound to examine Jagger's parachute, declares that his death was a murder engineered by Ty, and swears revenge. Pete inquires as to the parachute's lack of metal, which Jesse explains is a custom \"smuggler's rig\" made with high density fabrics to deter radar.When Pete discovers Ty's plan to hack into the DEA mainframe, the rest of the parachuting team agrees to help Pete with the situation. On the night of the Independence Day exhibition, Jessie sneaks into Ty's parachuting aircraft, holding them at gunpoint in order to determine an explanation for Jagger's death. But Ty's men kick her outside and then parachute out. Jessie, managing to grab hold of the aircraft door bar, lets go on a free fall just as Pete and the parachuting team arrive and rescue her, floating down safety to the roof of the DEA mainframe office building where Ty has already arrived.Pete tries to find access to the DEA mainframe control room, eliminating Ty's men one by one, with the help of the parachuting team. He breaks in and holds Leedy (who has already started downloading the identities) as hostage. Ty, having kidnapped Jessie, appears and threatens to kill her unless Pete releases Leedy. A fight breaks out between Pete and Ty that results with both of them go falling out the building window. Luckily, Pete opens his emergency parachute as Ty tumbles to his death. Pete lands safely on the ground and is escorted away by paramedics, but spots Leedy wearing a DEA jacket leaving the scene. One of the team members, Swoop (Kyle Secor), leaps from the building, parachuting down onto Leedy and stopping him in his tracks. Pete tells Jessie jokingly that he would try skydiving again in forty or fifty years.","In popular culture":"The Paramount Parks (now owned by Cedar Fair) featured drop tower amusement rides called Drop Zone: Stunt Tower, which were based on the film. The attractions are now named Drop Tower: Scream Zone.The musical sting that plays when Swoop races to help the stricken skydiver has been frequently used in film trailers, most notably The Mask of Zorro (1998), Pirates of the Caribbean: The Curse of the Black Pearl (2003).","language":"English","Reception":"Drop Zone received a mixed reaction from reviewers. Film critic Lisa Schwarzbaum in Entertainment Weekly, however, said, \"There’s something deafening and reckless and hotdogging about Drop Zone, and I mean that as a compliment. This macho action fantasy from subculture specialist John Badham (Saturday Night Fever (1977), WarGames (1983)) is set in the daredevil society of sky divers, where Pete Nessip (Wesley Snipes), an unlikely federal marshal who is the last man around you’d expect to see pulling a rip cord, throws in with a band of professional plane leapers based in swampy Florida.\"[2]Roger Ebert noted: \"Drop Zone\" is one of those thrillers where the action is so interesting that you almost forgive (or even forget) the plot. The movie is virtually one stunt after another, many of them taking place in mid air, and during the pure action sequences you simply suspend your interest in the story and look at the amazing sights before you.\" [3]Film critic Chris Hicks saw one major problem, \"As the film moves along, however, plotting becomes more and more illogical - and late in the film there are bits of business that remove the story so far from reality that audience goodwill is stretched to breaking point. Suspension of disbelief is one thing, but this film asks us to abandon it altogether.\"[4]The review in the Washington Post accentuated the positives before dissecting \"a bad movie idea\" and its predictable improbability.[5] Drop Zone currently holds a 35% rating on Rotten Tomatoes based on 20 reviews.Drop Zone had a modest debut[6] and experienced a 52% drop in its second weekend.[7] Drop Zone ultimately grossed $28 million domestically, failing to recoup its $45 million budget.","box_office":"$28,735,315","cinematography":"Roy H. Wagner","production_company":"Paramount Pictures Nicita/Lloyd Productions","directed_by":"John Badham","Home media":"The Drop Zone DVD was released in Region 1 on May 25, 1999 and Region 2 on June 5, 2000. The home media versions were distributed by Paramount Home Entertainment.","release_dates":"December 9, 1994 (1994-12-09)|||||","Production":"Drop Zone was one of two skydiving action films released in December 1994; the other was Terminal Velocity. The original idea came from two professional skydivers, Tony Griffin and Guy Manos. One of the film's screenwriters, Peter Barsocchini, would later write High School Musical. Steven Seagal was originally intended to star (for a rumored $15 million).The insurance policies of Wesley Snipes and most of the cast precluded them from skydiving. However, Michael Jeter actually performed the tandem jump. The green Douglas C-47 Skytrain used in the skydiving scenes is currently on display at the Valiant Air Command air museum in Titusville, Florida.","produced_by":"D. J. Caruso Lauren Lloyd Wallis Nicita","starring":"Wesley Snipes Gary Busey Yancy Butler Michael Jeter Kyle Secor Luca Bercovici","running_time":"101 minutes","drop_zone":"Theatrical release poster","music_by":"Hans Zimmer","edited_by":"Frank Morriss","written_by":"Peter Barsocchini John Bishop","budget":"$45 million"}