{"based_on":"the novel After Dark, My Sweet  by Jim Thompson","country":"United States","distributed_by":"Avenue Pictures","screenplay_by":"James Foley Robert Redlin","after_dark,_my_sweet":"Theatrical release poster","Plot":"Ex-boxer Kevin \"Kid\" Collins is a drifter and an escapee from a mental hospital. In a desert town near Palm Springs he meets Fay Anderson, a widow, who convinces him to help fix up the neglected estate her ex-husband left. She nicknames him \"Collie\" and lets him sleep in a trailer out back, near her dying date palms.Her acquaintance \"Uncle Bud\" shows up. Calling himself an ex-cop, he has long been hatching a scheme to kidnap a rich man's child and needs somebody like Collie to help carry it out.Reluctant in the beginning, Collie tries to leave and encounters Doc Goldman, who immediately can tell the young man needs to be under medical observation. Doc takes a personal interest in Collie that might include a physical attraction as well. He intrudes on Collie's relationship with the alcoholic Fay.Resenting this interference, Collie is persuaded by Uncle Bud to execute the kidnap plan. But things go wrong from the very beginning, including Collie snatching the wrong kid. It goes downhill from there, with tragic consequences for all involved.","language":"English","Reception":"Film critic Roger Ebert put this on his \"great movies list\" and wrote in his Chicago Sun-Times review: \"After Dark, My Sweet is the movie that eluded audiences; it grossed less than $3 million, has been almost forgotten, and remains one of the purest and most uncompromising of modern film noir. It captures above all the lonely, exhausted lives of its characters.\"[4]A review in Variety magazine also received the film favorably: \"Director-cowriter James Foley has given this near-perfect adaptation of a Jim Thompson novel a contempo setting and emotional realism that make it as potent as a snakebite...Lensed in the arid and existential sun-blasted landscape of Indio, Calif, the pungently seedy film creates a kind of genre unto itself, a film soleil, perhaps.\"[5]Writer David M. Meyers praised the script: \"The screenplay, which hews closely to Jim Thompson's heartless novel, is unusually tight, spare, and well constructed.\"[6]Peter Travers of The Rolling Stone wrote: \"Patric is sensational as Collie; the pretty-boy actor ... is unrecognizable behind Collie's coarse stubble, slack jaw and haunted stare. Patric occupies a complex character with mesmerizing conviction. Like Thompson's prose, his performance is both repellent and fascinating.\"[7]When the video was released in 1991, Entertainment Weekly film critic Melissa Pierson wrote: \"Fittingly, director James Foley (At Close Range) puts style over story, capturing the gritty, long-shadowed tone of his source material. After Dark, My Sweet looks simultaneously crisp and drenched in the yellow light of a strange dream, an effect that becomes especially haunting on video. In this alluring tour through unsettled emotional territory, Jason Patric (The Lost Boys) gives an exceptionally sharp performance as an ex-boxer with one screw loose and another turned down tight. He's drawn into a kidnapping scheme concocted by a former cop (Bruce Dern) and a sultry widow (Rachel Ward, for whom acting apparently means gesticulating). Together, they visit a place where desire and pain are indistinguishable, and everything goes twistingly awry.\"[8]In an interview with Robert K. Elder for his book The Best Film You've Never Seen, director Austin Chick praises the movie for its cinematography, stating: \"It's beautifully shot ... every frame and every camera move is clearly thought out and brilliantly, beautifully executed.\"[9]The review aggregator Rotten Tomatoes reported that 82% of critics gave the film a positive review, based on 17 reviews.[10]","box_office":"$2,678,414","cinematography":"Mark Plummer","production_company":"Avenue Pictures","directed_by":"James Foley","release_dates":"May 17, 1990 (1990-05-17) (Cannes Film Market)|August 24, 1990 (1990-08-24) (United States)||||","Production":"Filming took place in Mecca, California,[2] part of the Coachella Valley.[3]","produced_by":"Ric Kidney Robert Redlin","starring":"Jason Patric|Rachel Ward|Bruce Dern|George Dickerson|","running_time":"114 minutes","music_by":"Maurice Jarre","edited_by":"Howard E. Smith","budget":"$6 million"}