{"distributed_by":"Atlantic Releasing Corporation","Plot":"LAPD detective Sgt. Lloyd Hopkins (Woods) discovers the brutal murder of a young woman. Her body hangs over her bed, and her blood is splattered all over her apartment. Hopkins notices a great deal of feminist literature with titles like Rage in the Womb on her bookshelf. He also sees two classified ads for anonymous sexual encounters. When he returns home, his 8-year old daughter wakes up and begs him for a story. He launches into a profane description of one of his cases, much to the girl's delight. His wife orders him to stop, and they have an argument over the inappropriateness of his stories. Frustrated, he calls up his buddy Dutch Pelz (Durning), and they go on a stakeout, which culminates with Hopkins shooting the suspect. Hopkins asks Dutch to stay at the scene and file the paperwork so that he can take the suspect's voluptuous girlfriend home and have sex with her.Hopkins tracks down Joanie Pratt (Brooks) through the classified ads at the victim's apartment. Pratt is a washed-out actress who sells drugs and works as an escort to get by. She also hosts swinger parties, and the victim was planning on attending one of the parties to research a book. Back at the station, Hopkins opens a letter that was sent to the victim. It is a poem written in blood, which refers to \"all the rest\", making Hopkins think he is hunting a serial killer. He asks Dutch to get him all the files for unsolved murders of single women in the past 15 years.When he returns home, he finds a note from his wife explaining that she has taken their daughter and left. Pratt phones Hopkins, and he goes over to her place to have sex. After narrowing down the unsolved murders to a few cases, Hopkins summons Deputy Sheriff Delbert \"Whitey\" Haines (Haid) to a meeting and brusquely interrogates him about two suicides that took place on June 10 a year apart on his beat. Hopkins goes to Haines' apartment and discovers a wiretap which has captured Haines dealing drugs.In the process of canvassing feminist bookstores for leads, Hopkins visits one run by Kathleen McCarthy (Warren) who agrees to accompany him to a party at Dutch's house. Over the course of the evening, culminating in a long conversation back at McCarthy's house, she reveals a high school trauma where she was gang raped by a group of boys who were hostile towards her feminist poetry club. She reveals to Hopkins that an anonymous suitor has sent her flowers and a poem every year. Looking through her old yearbook, Hopkins is stunned to find a picture of Whitey and a male prostitute nicknamed Birdman whose name was mentioned on the surveillance tapes made at Whitey's apartment.When Birdman turns up dead in a motel room, the wall is smeared with blood, and the motto from McCarthy's high school is written in the stains. Hopkins returns to Whitey's apartment and surprises him as he comes home, carrying Birdman's police file. Whitey claims Birdman is his snitch, but Hopkins knows that Whitey was running drugs and male prostitutes through Birdman. He puts a gun to Whitey's head and gets him to confess to raping McCarthy with Birdman in high school. Whitey offers information on police corruption to get off the hook. Then, he tries to surprise Hopkins with a shotgun, but Hopkins kills him.Dutch tells Hopkins to lay low while the mess he has created is sorted out. Pratt invites Hopkins over for sex, but when he gets there, she has been murdered and placed on the stove in the position that she last had sex with Hopkins. At the station, Hopkins and Dutch get McCarthy to go through the yearbook against a cross-reference of suspects. They are interrupted by their superior who suspends Hopkins. When Hopkins returns to the interrogation room, he sees that McCarthy has run to a phone booth across the street. She calls Bobby Franco, who was in the poetry club with her, warning him that Hopkins is dangerous and will suspect that he is the killer. She realized Franco has sent her the poems every year, and she refuses to believe that he could be a murderer. When Hopkins grabs the phone, she hears Franco threaten him and realizes that he is in fact the killer. Franco and Hopkins agree to meet at the high school, where they have a shootout in the gym. When Franco runs out of bullets, he taunts Hopkins, believing that he has to arrest him because he is a cop. Hopkins tells Franco \"Well there's some good news and there's some bad news. The good news is you're right I'm a cop and I have to take you in. The bad news is I've been suspended and I don't give a fuck!\", and he shoots Franco three times.","language":"English","Critical reception":"The film opened to poor receipts and reviews.Linda Rasmussen of Allmovie gave the film three out of five stars and described the film as a \"grim, brutally violent, darkly humorous modern-day film noir,\" whilst noting the film's \"violent and exciting conclusion\". Rasmussen also noted \"Cop is completely absorbing because of Woods' chillingly effective performance. Few actors can make an amoral, clever, sardonic, and vicious character as appealing as Hopkins. As Hopkins, Woods combines complex contradictions with ease, showing the various sides of his character's personality. Cop, while singularly unpleasant is always insightful and fascinating.\"[2]Roger Ebert gave the film three out of four stars, writing \"Anyone without a history of watching James Woods in the movies might easily misread \"Cop.\" They might think this is simply a violent, sick, contrived exploitation picture, and that would certainly be an accurate description of its surfaces. But Woods operates in this movie almost as if he were writing his own footnotes. He uses his personality, his voice and his quirky sense of humor to undermine the material and comment on it, until \"Cop\" becomes an essay on this whole genre of movie. And then, with the movie's startling last shot, Woods slams shut the book. It's as if Woods and Harris watched a Dirty Harry movie one night and decided to see what would happen if Harry were really dirty.\"[3]The film was broadcast on February 10, 1989, on American TV and The Madison Courier gave the film a two out of four star rating in their film listings.[4] The film was also broadcast on February 21, 1992, on American TV and Ludington Daily News gave the film a two out of four star rating in their listings.[5]Jay Boyar of Orlando Sentinel gave the film three out of five stars, under the conclusive headline \"Cop is Dirty Harry with a human touch.\"[6]Janet Maslin, writing for the New York Times, did not care for the movie, giving an overall mixed review, noting that \"the plot leaves a lot to be desired, especially since it devotes no more than 30 seconds' thought to the killer's motive or his history,\" and that aspects were not believable, including some of the police work, all the scenes of Woods with his family, and those of Charles Durning professing feminist views. She felt the directing was \"workmanlike and somewhat flat.\" She did praise Lesley Ann Warren for being \"charming in an idiotic role,\" and James Woods for being \"far and away the best thing\" in the movie.[7]Rob Salem for Toronto Star reviewed the film upon its release, stating \"The best thing that can be said of Cop is that it reunites three veteran screen cops - Woods, Charles Durning and Charles Haid, who previously served together (under happier circumstances) in The Choirboys over a decade ago. Of course, the performances aren't the problem here. No one could make sense of the movie's confused message - if in fact there is a message here to make sense of.\"[8]The Atlanta Journal-Constitution gave a favorable review and described the film as a \"crackling good mystery-thriller, powered by the live-wire presence of James Woods in the title role.\"[9] Los Angeles Times gave the film a favorable review too and stated \"Cop represents a career high for James B. Harris, best known as Stanley Kubrick's early producer, who's directed infrequently but always provocatively over the years - if not always with success. Contributing to \"Cop's\" crisp, understated style is a standout supporting cast headed by Charles Durning, Michel Colombier's ominous, plaintive score and Gene Rudolf's carefully detailed realistic production design. \"Cop\" stirs up such a strong visceral appeal one can only hope that audiences will think about it after the lights go up.\"[10]USA Today gave the film a mixed review and stated \"Despite lapses into predictability, Cop boasts brisk pacing and intriguing performances by Woods - is he getting more handsome? - and Lesley Ann Warren, who deserves better than the bizarro she plays here.\"[11] Newsday (Long Island) also gave the film a favorable review.","box_office":"$1,884,315 (USA)","cinematography":"Steve Dubin","directed_by":"James B. Harris","release_dates":"January 8,[1] 1988 (U.S. release)","produced_by":"James B. Harris James Woods","starring":"James Woods Lesley Ann Warren Charles Durning Charles Haid Raymond J. Barry","running_time":"110 min.","music_by":"Michel Colombier","edited_by":"Anthony Spano","written_by":"Novel: James Ellroy Screenplay: James B. Harris","budget":"$2,500,000 (estimated)"}