{"based_on":"From A to Z  by Thomas Monroe and Billy Wilder","ball_of_fire":"theatrical release poster","country":"United States","distributed_by":"RKO Radio Pictures","screenplay_by":"Charles Brackett|Billy Wilder|","Plot":"A group of (mainly bachelor) professors have lived together for some years in a New York City residence, compiling an encyclopedia of all human knowledge. The youngest, Professor Bertram Potts (Gary Cooper), is a grammarian who is researching modern American slang. The professors are accustomed to working in relative seclusion at a leisurely pace with a prim housekeeper named Miss Bragg (Kathleen Howard) keeping watch over them. Their impatient financial backer Miss Totten (Mary Field) suddenly demands that they finish their work soon.Venturing out to do some independent research, Bertram becomes interested in the slang vocabulary of saucy nightclub performer \"Sugarpuss\" O'Shea (Barbara Stanwyck). She is reluctant to assist him in his research until she needs a place to hide from the police, who want to question her about her boyfriend, mob boss Joe Lilac (Dana Andrews). Sugarpuss takes refuge in the house where the professors live and work, despite Bertram's objections and their housekeeper's threat to leave because of her. In the meantime, Lilac decides to marry her, but only because as his wife she cannot testify against him.The professors soon become enamored of her femininity, and she begins to grow fond of them. She teaches them to conga and demonstrates to Bertram the meaning of the phrase \"yum yum\" (kisses). She becomes attracted to Bertram, who reciprocates with a vengeance by proposing marriage to her. She avoids giving an answer to the proposal, and agrees to Lilac's plan to have the professors drive her to New Jersey to marry Lilac. After a series of misadventures, including a car crash, Sugarpuss realizes that she is in love with the Professor, but is forced to go ahead with her marriage to Lilac to save the professors from Lilac's henchmen. Bertram, meanwhile, unaware of Sugarpuss' love for him, prepares to resume his research, sadder but wiser, until he discovers her true feelings.The professors eventually outwit Lilac and his henchmen and rescue Sugarpuss. She decides she is not good enough for Bertram, but his forceful application of \"yum yum\" convinces her to change her mind.","language":"English","Reception":"The film was a big hit at the box office. However, because of the terms of Sam Goldwyn's deal with RKO, RKO recorded a loss of $147,000 on it.[5]","box_office":"$2.2 million (US rentals)[1]","cinematography":"Gregg Toland","production_company":"Samuel Goldwyn Productions","directed_by":"Howard Hawks","Awards and honors":"Ball of Fire was nominated for Academy Awards for Best Actress in a Leading Role (Barbara Stanwyck), Best Music, Scoring of a Dramatic Picture, Best Sound, Recording (Thomas T. Moulton) and Best Story.[6]In World War II, a total of 12 servicemen were pen-pals with Stanwyck; two of them asked for a poster of her in the Ball of Fire outfit for their mess hall.[7]American Film Institute ListsIn a 1999 AFI poll, stars Gary Cooper and Barbara Stanwyck were both ranked #11 on the male and female lists of the greatest American screen legends.It currently holds a 100% on Rotten Tomatoes with 24 reviews.[8]","Music":"Martha Tilton provided Barbara Stanwyck's singing voice for the song \"Drum Boogie\".[2] Drummer and bandleader Gene Krupa performed the song with his band. In an unusual twist, he also played it on a matchbox with matches for drumsticks. Krupa band member and historically significant trumpeter Roy Eldridge received a brief on-camera spot during \"Drum Boogie\". At one point the professors also perform an a capella version of the 1869 song \"Sweet Genevieve\".","References":"NotesBibliography","release_dates":"December 2, 1941 (1941-12-02) (US)|||||","Production":"The script was written by Charles Brackett, Thomas Monroe, and Billy Wilder from a short story written by Wilder while he was still in Europe, and based in part on the fairy tale Snow White. The professors themselves were based on the dwarfs from Walt Disney's animated film Snow White and the Seven Dwarfs. Although Ball of Fire was directed by the by now well-established Howard Hawks, Wilder had already decided that he needed to direct his screenplays to protect them from studio and other director's interference. Hawks was happy to let Wilder study his directing on the set and Wilder thereafter directed his own films. The film was the second feature of 1941 to pair Cooper and Stanwyck, following Meet John Doe.Wilder reveled in poking fun at those who took politics too seriously. At one point, \"Sugarpuss\" points to her sore throat and complains \"Slight rosiness? It's as red as the Daily Worker and just as sore\". Later, she gives the overbearing and unsmiling housekeeper the name \"Franco\" just before she knocks the woman out. Wilder also worked in a reference to Cooper's Academy Award-winning performance in Sergeant York by having Dan Duryea's character Duke Pastrami say \"I saw me a movie last week\" just before wetting the sights of his pistol and aiming it.Ginger Rogers and Carole Lombard turned down the role of Katherine \"Sugarpuss\" O'Shea, while Lucille Ball almost won the role until Gary Cooper recommended Stanwyck.[3][4]","produced_by":"Samuel Goldwyn","starring":"Gary Cooper|Barbara Stanwyck|","running_time":"111 minutes","music_by":"Alfred Newman","edited_by":"Daniel Mandell"}