{"distributed_by":"Buena Vista Distribution","Plot":"The film begins as a stage play presented by Mother Goose and her talking goose, Sylvester, about Mary, Mary, Quite Contrary and Tom the Piper's Son, who are about to be married. The miserly and villainous Barnaby hires two crooks, dimwitted Gonzorgo and silent Rodrigo. They are to throw Tom into the sea and steal Mary's sheep, depriving her of her means of support, to force her to marry Barnaby. Mary is unaware that she is the heir to a fortune, but Barnaby is aware and wants it all for himself. Gonzorgo and Roderigo decide to sell Tom to the Gypsies instead of drowning him, in order to collect a double payment.Gonzorgo and Roderigo return and tell Mary, Barnaby, and the citizens of Mother Goose Land that Tom has accidentally drowned. They show Mary a forged letter in which Tom tells her that he is abandoning her and that she would be better off marrying Barnaby. Mary, believing she is destitute, reluctantly accepts the proposal from Barnaby. Barnaby unknowingly arranges for the same gypsies that have Tom to provide entertainment for the wedding. Tom, disguised as the gypsy Floretta, reveals himself and Barnaby pursues the frightened Gonzorgo and Roderigo, furious at their deception. One of the children who live with Mary informs her of some sheep tracks leading into the Forest of No Return.The children sneak away into the forest to search for the missing sheep. The trees of the forest awake and capture them. Tom and Mary follow and find the children in the forest, where they tell stories about the live trees. The trees seem just like ordinary trees to Tom and Mary. Tom, Mary and the children camp for the night. In the morning the trees once again come to life and explain that they are now in custody of the Toymaker in Toyland. Tom, Mary and the children happily continue on, escorted part of the way by the trees.Through the windows of the Toymaker's house they watch the Toymaker's brilliant apprentice, Grumio, present a new machine that makes toys without any manual labor. Overjoyed, the Toymaker speeds up the machine to such a high rate that it explodes, destroying every toy in the factory. Tom, Mary and the children offer to help make more toys in time for Christmas.Grumio presents another invention, a shrinking \"gun\" that reduces everyday objects to toy size. He warns that if it is used on anything more than once, the shrunken object disappears completely. The Toymaker is at first delighted at the idea of producing toys by shrinking life-sized objects, but then Tom points out the impossibility of finding enough everyday objects to shrink down into the large quantity of toys needed for Christmas. The Toymaker berates Grumio for his stupidity and throws the shrinking gun out the window in disgust.Barnaby, who has been spying on them, takes the discarded shrinking gun and uses it to shrink the Toymaker and Tom. When Barnaby's henchmen see him threatening to shoot Tom a second time, they abandon Barnaby. They try to flee, but Barnaby shoots them and locks them up with Tom in a birdcage.Barnaby forces Mary to marry him by threatening to destroy Tom, and he threatens to destroy the Toymaker if he refuses to preside over the wedding ceremony. While the Toymaker draws out the ceremony, Gonzorgo and Roderigo rescue Tom, and the three of them sneak away and return with an army of toy soldiers to fight Barnaby. Barnaby easily demolishes the toy soldiers. He is about to obliterate Tom with another dose from the shrinking gun, but Mary destroys it with a toy cannon. The liquid splatters all over Barnaby and shrinks him to toy size. Tom challenges him to a duel with swords. Tom stabs Barnaby, who falls from a great height into an empty toybox.Grumio presents another new invention, one that returns shrunken people to their original size. He immediately uses it on Tom, the Toymaker, Gonzorgo and Roderigo, but not on Barnaby. Tom and Mary are married and everyone lives happily ever after.","language":"English","box_office":"$4.6 million (US/ Canada rentals) [2]","cinematography":"Edward Colman","production_company":"Walt Disney Productions","babes_in_toyland":"Theatrical release poster","directed_by":"Jack Donohue","release_dates":"December 14, 1961 (1961-12-14)|||||","Production":"Walt Disney announced the film in 1955 as an animated movie.[4]Walt Disney said he wanted to create a film of the standard of Wizard of Oz.[1] \"It's like a Disney cartoon only with live actors,\" said one Disney executive.[5]Jack Donohue was signed to direct off the back of his success on Broadway directing Top Banana and Mr Wonderful and his work on TV spectaculars for Dean Martin and Frank Sinatra.[6]Dean Jones was originally announced for the lead.[7] It marked the first time Ray Bolger had played a villain.[8] Gene Sheldon was best known for the TV series Zorro.[9] Sheldon's Zorro co-star, Henry Calvin appeared in the film alongside him.The movie featured a 15-minute animated sequence.[1]Shooting started 13 March 1961 and went for three months.[1]Tommy Kirk says he enjoyed making the movie because of working with Ed Wynn:I thought he was delightful and so did everyone else. You couldn't not like him. He was completely crazy and he was just as crazy offscreen as he was on. But it was all, of course, an act. He was a very serious, religious man in his own way, but he loved playing Ed Wynn, the perfect fool, the complete nut. And he was good at it. Actually I think the movie is sort of a klunker, especially when I compare it to the Laurel and Hardy Babes in Toyland. It's not a great film but it has a few cute moments. It's an oddity. But I'm not embarrassed about it like I am about some other movies I've made.[10]","produced_by":"Walt Disney","starring":"Ray Bolger|Tommy Sands|Annette Funicello|Ed Wynn|","running_time":"106 min.","music_by":"Victor Herbert|George Bruns|Mel Leven (new lyrics)|","edited_by":"Robert Stafford","Release":"The release of the film was accompanied by a TV show on Walt Disney's program called Backstage Party.[11]","written_by":"Lowell S. Hawley|Ward Kimball|Glen MacDonough (operetta)|Joe Rinaldi|","budget":"$3 million[1]"}