{"country":"Italy","distributed_by":"Lux Film","Plot":"A Roman small-time crook, Cosimo, is arrested for the attempted theft of a car. After he is convicted and put in prison, he starts haranguing his girlfriend and former accomplices by telling them that he has a plan for a heist but that he needs their help to be freed. In order to assure his release, they find an acquaintance named Peppe (Vittorio Gassman) with a clean criminal record to take the blame for the theft in the hope that the police will release Cosimo. They instead have both of them jailed. While Peppe is in jail, Cosimo tells him the plans for the heist of a safe in a pawnshop. Peppe then reveals that he got off merely with probation, leaving him free to pursue the heist without Cosimo, much to his chagrin.The heist entails the following: as the pawnshop is adjacent to a vacant apartment, they must first break into a small courtyard, climb onto the roof of another small apartment, and break in through a window of the vacant home. To accomplish this, they enlist the help of another local thief (Totò) that is an expert on safes who tells them of a plan to silence the alarm of the safe that they may break into it safely. While everything is planned, they discover that the vacant apartment has just become occupied by two spinsters and their young, attractive maid. Peppe learns from the young maid, with whom he flirts, that the two women never leave their apartment but for a day a week, on Thursday, when they go and visit a country cottage they own, spending the night there and not being back until Friday noon. After arranging a date with the girl on this particular day, the group is distressed to learn that she has quit her job and the women may in fact be there on Thursday night.Meanwhile, a number of misfortunes are incurred by the group: Cosimo, who had since been released from jail, dies in a botched robbery; Mario, another of the group, bails on the plan in favor of a legitimate life for the sake of a beautiful girl, while another of the group is partially crippled after being attacked by the man whose camera he stole earlier for the purpose of daytime reconnaissance of the pawnshop. Despite this, they proceed with the plan anyway after learning that the women will not be in the apartment. Notwithstanding a number of bumbling entries, they gain entry into the apartment. After first boring a hole through a water pipe, they are forced to staunch the flow of water while remaining quiet after a night porter enters the apartment to make a call. After these obstacles, they bore another hole, this time knocking out a portion of the wall, revealing another room in the same apartment as the flat was remodeled since the arrival of the new tenants while the men acted on the basis of the previous rooms' arrangement. After they realize their plan was miscalculated, they leave the apartment dejected - albeit as free men. Peppe then decides to find legitimate work, much to the surprise of an elderly member of the group. The film ends with a newspaper article recounting a robbery by unknown persons of an apartment for food (which the men had eaten after their plan had crumbled.)","language":"Italian","directed_by":"Mario Monicelli","Awards":"The film was nominated for the Best Foreign Language Film at the 31st Academy Awards.[2]","Remakes":"Two remakes of the film were shot in the United States: the 1984 film Crackers by Louis Malle (set in San Francisco), and the 2002 film Welcome to Collinwood by Anthony Russo and Joe Russo (set in Cleveland).","release_dates":"30 June 1958 (1958-06-30)|||||","produced_by":"Franco Cristaldi","starring":"Vittorio Gassman Totò Claudia Cardinale Marcello Mastroianni Renato Salvatori Carlo Pisacane Memmo Carotenuto Tiberio Murgia","running_time":"111 minutes","Sequels":"A sequel directed by Nanni Loy followed in 1960, reuniting the entire cast aside from Totò and Mastroianni, entitled Audace colpo dei soliti ignoti (released in English as Hold-up à la Milanaise). A further sequel was directed by Amanzio Todini titled I Soliti ignoti vent'anni dopo (1987). It was released on DVD in the United States as Big Deal On Madonna Street - 20 Years Later by Koch Lorber.","music_by":"Piero Umiliani","big_deal_on_madonna_street_(i_soliti_ignoti)":"Italian film poster","written_by":"Age & Scarpelli Suso Cecchi d'Amico Mario Monicelli"}