{"based_on":"Hinger Kochuri   by Bibhutibhushan Bandopadhyay and Nishi Padma (Bengali Film)","country":"India","screenplay_by":"Arabinda Mukherjee Ramesh Pant (dialogue)","Legacy":"After film's success, Rajesh Khanna-Sharmila Tagore pair which had already achieved success in Aradhana (1969), worked again in Yash Chopra's Daag (1973), Basu Bhattacharya's Avishkaar (1973), besides films like Chhoti Bahu (1971), Maalik (1972) Raja Rani (1973) .[27] Today, they are still considered leading on-screen romantic couples in the 100 years of India cinema.[35][36] Rajesh Khanna's dialogue \"Pushpa, I hate tears\",which appeared five times in the film, was not only parodied over the years,[1] but also went on to become one of the epic dialogues of Indian cinema.[37] Apart from her work with Satyajit Ray, lead actress Sharmila Tagore films with Samanta including Amar Prem defined her screen image for her career.[38] The film's success also affect the fashion trends of the time, the puff sleeves blouses, which were first seen on Devika Rani in the 1950s were revived again after Sharmila Tagore's character Pushpa's wore them through the film.[39]In July 2009, after Samanta's death in April of the same year, Amar Prem was inaugural film of a retrospective on Shakti Samanta Films organized in Delhi.[40]","Plot":"Pushpa (Sharmila Tagore) is expelled from her house by her husband and his new wife. When she refuses to leave, he beats her and throws her out. She goes to her mother for help but her mother too, disowns her. When she tries to commit suicide, she is sold to a brothel in Calcutta by her village-uncle, Nepal Babu (Madan Puri). On her audition at the brothel, Anand Babu (Rajesh Khanna), a businessman seeking love, is attracted by her singing. Anand Babu is unhappily married and lonely and becomes her regular and exclusive customer as love blossoms.Later a widowed man with his family, from the same village as her, moves in close to Pushpa's place. The new neighbour's son, Nandu, does not get any love at home, as his father works all the time and his stepmother does not care about him. Nandu's father learns about Pushpa's new life and forbids her from interacting with him and his family as he fears what people would say. However, Pushpa starts treating Nandu as her own son when she realises that he is mistreated at home, and often goes hungry. Nandu also comes to love Pushpa and starts to regard her as his mother. He visits her every day and comes upon Anand Babu who also becomes fond of him becoming a father figure, calling him Pushpa's son, seeing the way Pushpa loves the child.One day, Anand Babu's brother-in-law comes to see Pushpa and demands that she tell Anand Babu to stop visiting her. With great reluctance, Pushpa agrees and she turns Anand Babu away when he comes to see her. It is then that businessman realises that he is in love with Pushpa. When Nandu suffers from fever and his treatment is too expensive, Pushpa asks Anand Babu for help and he secretly finances the treatment and does not let anybody know. When the doctor asks him why is he so keen on helping Nandu, he replies some relationships have no names. However, when Nandu's father asks the doctor who paid for the treatment, the doctor says that his mother did. Then Nandu's father discovers that it was Pushpa who saved her son's life and he thanks her and gives her the sari that he had bought for his wife, telling her that it was gift from a brother to a sister. A touched Pushpa accepts.Nandu's family has to move to the village and Nandu plants a sapling of nigh-flowering jasmine (Harsingaar or Parijat) at Pushpa's home, making her promise to always take care of it. Pushpa cries and agrees.Several years later, Nandu grows up to become a government engineer posted in the same town. Anand Babu meets Pushpa, now working as a maid servant who is ill-treated and they both reconcile. Nandu unsuccessfully searches for her and gives up after inquiring in the neighborhood. Nandu's son gets sick and they go to the same doctor. Meanwhile, having met Pushpa, Anand Babu decides to catch up with all his old friends and meets the doctor. During conversation, he reveals he has stopped drinking and visiting brothels once he left Pushpa. He also tells him that he is now divorced/separated due to his wife's partying ways but is finally at peace and is happy with Pushpa's love and affection in his heart. They talk about Nandu and the Doctor informs him that Nandu is in town. Nandu meets Anand Babu when he comes to meet the doctor to ask regarding the medicine, who takes him to meet Pushpa. Both of them, unable to see Pushpa ill-treated, stand up for her and in the end Nandu takes Pushpa home with him, like a son who is reunited with his long lost mother with Anand babu looking on, crying happily.[3]","Themes and allusions":"Amar Prem takes forward the popular genre of self-sacrificing mother or woman prevalent in the decade as seen in Aradhana (1969) and Kati Patang (1971), though seen as early as in 1957 in Mother India, though here it places a wronged wife Pushpa in the narrative. When her husband marries the second time, due to her apparent infertility, she is kicked out of her home, her mother and community both abandon her, subsequently she is tricked into prostitution.[11][12] Thus the fallen women ends up as courtesan, with a heart of gold; though the original version Nishi Padma (1970), clearly portrays her as a common prostitute, in Samanta's version she is a tawaif who sings to her customer for a living,[13] as Pushpa is introduced to the audience singing a genteel mystic Meera Bai-like bhajan, Raina Beeti Jai, Shyam Na Aaye (Night is passing, Shyam (Krishna) hasn't arrived), calling on to Krishna; however in many part of the film she is treated by her environment as common prostitute. This blurring in representation of a courtesan and a common prostitute has been recurrent feature in mainstream Bollywood cinema, just as the theme of the fallen woman is.[13][14][15] However, things were changing rapidly, only a few years later, Sharmila Tagore herself portrayed a far more realistic and feisty prostitute, in Gulzar directed, Mausam (1975),[14] meanwhile B.R. Ishara had already made, bold film Chetna (1970), with Rehana Sultan, clearly ringing in the end of monochromatic filmi-version of prostitutes and courtesans, which was seen in films like Bimal Roy's Devdas (1957), B. R. Chopra's Sadhna (1958) and even in Guru Dutt's classic Pyaasa.[16][17]As the film evolves, Pushpa is no longer the fallen woman; she is not just redeemed — Anand Babu tells her, Tumne is kamre ko mandir bana diya (You have turned this room into a temple) - but in the end is deified, as she chooses to relinquish her profession and makes a living washing utensils, quietly suffering societal and psychological abuses all through the film, instead of fighting back or standing up for herself. This is also conveyed with the use of symbolism like the handful of mud being taken from Pushpa's brothel grounds to make goddess Durga idols prior to the annual Durga Puja festival, a popular festival of goddess worship. Further towards the end of the film her purity is compared with that of the Ganges itself by Anand Babu, when she finally visits the banks of Hooghly river, a distributary of the sacred Ganges River to break her bangles after her ill-treating husband dies; and in the very end, the juxtaposition of home-coming of Durga idols used in Durga Puja festival just as Nandu is taking Pushpa home. This makes her a veritable model for womanhood, although conservative and affirming patriarchal traditions. The fallen woman, solely longs to marry the man, but in vain, Pushpa too is reunited with Anand Babu in the end, however this only momentary meeting, Anand Babu suggests she goes home with her foster son, Nandu as a mother.[13] This genre was in direct contrast with similar maternal melodrama of 1930s Hollywood where the abandoned mother often disappeared into oblivion and destitution; it continued in Hindi cinema for another decade, before the \"avenging heroine\" marked her entry and the women narratives began to change.[11][12]The film also deals with the theme of urban melancholy, of the bhadralok, the gentlefolk, through Anand Babu, a businessman trapped in a bad marriage, whose wife is constantly busy in beauty-parlours and parties, and seeks company in Pushpa and alcohol. Pushpa herself lonely, fulfills her maternal instincts through Nandu, a young boy in the neighbourhood, often ill-treated by his step mother. Thus three lonely people become surrogate for each other and create their own family unit, even though briefly, as Anand Babu defines it, \"Koi agar apna na hoke bhi bahut apna ho, toh ise kya kehte hain? Bahut pyara rishta, na?\" (If someone is bound to you in spite of not being related to you, isn't that a lovely relationship?)[1][15][18] Also through his song, Kuch To Log Kahenge, Anand Babu mocks society's moral judgement and hypocrisy, as he consoles a despondent Pushpa by singing, \"Sita bhi yahan badnaam hui\" (Even Sita (King Rama's wife in Ramayana) was insulted here) relating to an episode in epic, where in Sita having returned from captivity of demon king Ravana, she had to prove her purity, and was even then was banished by Rama to the forest.[19]","Accolades":"The film went on to receive several awards and nominations. At the 1973 Filmfare Awards, Arabinda Mukherjee won the award for Best Screenplay,[31] while Ramesh Pant won the award for Best Dialogue.[32] Also Jehangir Nowrojee won the award for Best Sound.[33][34] The film also won nomination in Best Actor category for Rajesh Khanna, Best Lyricist for Anand Bakshi - Chingari Koi Bhadke and Best Singer Male nomination for Kishore Kumar again for Chingari Koi Bhadke. The film also received nomination for Best Music, along with Pakeezah, Shor, however the award went to Be-Imaan which made a clean sweep at the award that year, by also winning Best Film, Best Director and Best Actor, a category for which Rajesh Khanna had won two nominations that year, for Amar Prem and Dushman, however he lost out to Manoj Kumar. Incidentally in the same year, Meena Kumari lost out the Best Actress Award to Hema Malini in Seeta Aur Geeta.[29]","language":"Hindi","Reception":"Prior to the release of the film, a special show was organized in Delhi, where Gen Sam Manekshaw invited the cast, however the next day a blackout was declared, as the Indo-Pakistani War of 1971 had begun.[27] The film was commercial released in January 1972.Though 1972 was a year of big films, Pakeezah, Dushman and Beimaan[28] upon its release, Amar Prem was eighth amongst Khanna's top releases in the year.[29] Samanta achieved a hattrick of hits with Rajesh Khanna, which started with Aradhana (1969) and Kati Patang (1971).[30] The music by R. D. Burman proved one of the best scores of his career,[30] with hits like Chingaari Koi Bhadke sung by Kishore Kumar which reached 5th position at the year end toppers list, Binaca Geetmala annual list 1972, while another song, Yeh Kya Hua also sung by him reached the 9th position.","cinematography":"Aloke Dasgupta","directed_by":"Shakti Samanta","Music":"The score and soundtrack for film was composed by R.D.Burman, with lyrics by Anand Bakshi. Burman who was entering the most prolific period of his career was often criticized as a \"Western composer\" throughout his career, gave a surprising Indian classical music feel to the soundtrack, and established his versatility as a mature composer, thus silencing his harshest critics.[20] The score was melody based, which gave Lata Mangeshkar her finest classical solo of the decade, Raina Beti Jaaye, set in an unusual blend of two Ragas, Todi in mukhara or the opening verse and Khamaj in the antara. Burman had heard his father, music composer S. D. Burman sing, Bela Boye Jaye, which he said was on his mind, while composing the song. Bakshi's lyrics, created a Meera bhajan like idiom for the song, employing the Krishna-Radha motif.[7][15] With Amar Prem, Kishore Kumar also got an opportunity to establish himself with a generation of listeners used to Mohammed Rafi, as establishing his faith in Kumar capabilities to handle classical-based melodies, Burman gave him three songs, \"Chingari Koi Bhadke\" set to Raga Bhairavi, \"Kuchh Toh Log Kahenge\" in Khamaj and \"Yeh Kya Hua\" with a hint of Raga Kalavati.[7][21] These three hits, along with the songs of Kati Patang including \"Yeh Shaam Mastani\" and \"Pyar Deewana Hota Hai\", released in 1971, Burman effectively and single-handedly ended Rafi's decade long reign as the top playback singer of the industry.[22]However, when it came to \"Bada Natkhat hai Re Krishna Kanhaiyya\", things took a different turn when his father, veteran music director, S. D. Burman intervened and asked Burman to redo the tune. Burman was given the brief of \"usual bhajan situation\" by Samanta, later as he was giving final touches to the tune, his father heard the tune, and asked for the precise description of situation. On listening to the situation, he expressed his dismay as not doing justice to the situation,[23] as R.D. Burman recounted in a later interview, \"But where's the composer in you in this tune, Pancham (Burman's nickname)?\" and went on to explain, \"..For Sharmila here is something more than the nautch-girl she plays. Her motherly instincts have been aroused by that kid. Your tune therefore must communicate all the agony of the nautch-girl wanting to be the mother she can never be. Do it again, your way, but with the moving human situation in mind.\"[24] Thus R.D. Burman made a tune in Raga Khamaj, which Lata Mangeshkar too sang with marked emotional clarity and abandon, who is usually prone let her technical dexterity outshine. The song became a classic,[7][25] and later Burman called it, \"his best lesson in music\" from his father.[24]Finally, Burman roped in his father, S. D. Burman to sing \"Doli Mein Bithai Ke Kahaar\" in his typical bardic voice, and the song which appears twice in the film, was to become one of the most memorable songs of his career as a playback singer.[26]","release_dates":"28 January 1972","Production":"After making entertainers like China Town (1962), Ek Raaz (1963), Kashmir Ki Kali (1964), Sawan Ki Ghata (1966) and An Evening in Paris (1967) through the 1960s, with Aradhana (1969) and Kati Patang (1971), Samanta had entered the phase of emotional dramas in his career.[5] Nishi Padma (Night Flower, 1970), for nightflowering-jasmine, was made by Arabinda Mukherjee with Uttam Kumar and Sabitri Chatterjee as leads. When Samanta saw the film, he was so impressed by the performance of Uttam Kumar, that he decided to remake it. However he decided to make some changes in the script.[6] The original film was based on the Bengali short story Hinger Kochuri, written by Bibhutibhushan Bandopadhyay, . The title derives its name from a typical Bengali late afternoon snack, kachori, made with of fried dough stuffed with lentils, and hing (asafoetida).[7]The story was first published in Bandopadhyay's short story collection, Galpa Panchashat (Fifty Stories, 1956).[8] His stories had previously been adapted by Satyajit Ray as Pather Panchali (1955) and the Apu Trilogy. Shakti Samanta asked Mukherjee who also wrote Nishi Padma's screenplay to write a Hindi version, with Ramesh Pant, a longtime-collaborator with Samanta penning the Hindi dialogues.[1] The famous dialogue, \"Pushpa, I hate tears\" though also there in the original, was merely part of a dialogue, Samanta decided to use it to great effect, delivered in Rajesh Khanna's trademark style.[6] Later both the writers of the film, won Filmfare Awards in their respective categories.Once the script was ready Samanta approached Sharmila Tagore with whom he had done a string of films, like Kashmir Ki Kali (1964), An Evening in Paris (1967) and most recently Aradhana (1969) with Rajesh Khanna. Tagore found her character Pushpa, \" a very strong role in the iconic mould of Mother India\", and instantly agreed, thus it was one of the first films she signed on after the birth of her son Saif Ali Khan. For the role Anand, actor Raaj Kumar was Samanta's first choice, as he believed Khanna who had become a super star after the hit Aradhana, wouldn't be interested in doing a film that focussed on the female lead. However, Khanna convinced Samanta that would do justice to the role. Though, Khanna changed the character's name from Ananta to Anand to draw connection to his character in Hrishikesh Mukherjee's critically acclaimed, Anand (1971).[1]The film was shot in Eastmancolor, entirely at Natraj Studios in Mumbai, including the famous song, Chingari koi bhadke, which was set on a boat on the Hooghly River, with Howrah Bridge of Kolkata in the background. Earlier authorities in Kolkata didn't give the film crew permission to shoot under the bridge, as it would crowd problem. Thus the song was shot in a water tank in the studio, with the crew filming in knee-deep water.[1][9] Samanta has been using music directors like O. P. Nayyar and Shankar-Jaikishen, but chose R. D. Burman once again after Kati Patang (1971), who also laboured to produce one of his best scores, later in an interview Samanta recalled, \"Pancham (R. D. Burman) would go into his room and work from 9 o'clock in the morning till 9 o'clock in the night for Amar Prem.\"[10]","produced_by":"Shakti Samanta","starring":"Sharmila Tagore, Rajesh Khanna, Vinod Mehra Abhi Bhattacharya Madan Puri","music_by":"Rahul Dev Burman Anand Bakshi (lyrics)","External links":"","edited_by":"Govind Dalwadi"}