{"based_on":"Beasts of No Nation  by Uzodinma Iweala","country":"United States","distributed_by":"Bleecker Street|Netflix|","screenplay_by":"Cary Joji Fukunaga","Plot":"A civil war is breaking out in an unspecified West African country. A young boy, Agu, lives in a small village with his parents, older brother, and two younger siblings. Agu's village is in a \"buffer zone\" enforced by ECOMOG troops. Agu's father is a local leader, and aids refugees from the surrounding areas by letting them stay on his land.The village is informed that the government has fallen, with military-aligned rebels seizing control of the country. With rebel forces headed towards the village, many people flee to the country's capital for safety. Agu's father is able to buy safe transport for his wife and youngest child, but has to stay behind himself with Agu and his eldest son. Rebel and government forces fight in and around Agu's village, the rebel soldiers flee and the government forces round up the remaining villagers thinking they are rebels. As they are about to be executed, Agu's father tells his sons to run, just before being shot.The two boys try to escape, but Agu's brother is killed. Agu evades capture and escapes into the jungle. After wandering for an unspecified amount of time, he is caught up in a guerrilla skirmish. The NDF, a rising rebel faction in the country, adopts Agu into their ranks. Agu's battalion is led by the Commandant, who takes Agu under his wing. After undergoing a brutal initiation process, Agu becomes a fully-fledged member of the militia.Agu befriends another young NDF child soldier, Strika, who never speaks. One night, the Commandant summons Agu to his quarters, and rapes him. Strika, another of the Commandant's raping victims, comforts him. Preacher, an older soldier, gives Agu brown-brown to lift his mood. Agu and Strika take part in a number of bloody battles and ambushes. The battalion's success in the taking of several towns, killing hundreds of men, women and children, gains them a summons to the rebel HQ, where the Commandant, accompanied by Agu, Strika, and a few other members of the battalion, go to meet with the NDF leader. They spend an entire night in the waiting area, infuriating the Commandant. When they finally meet the Supreme Commander, he informs the Commandant that he is not being promoted, as he had expected, and is in fact being removed from command. The Commandant's lieutenant will take control of the battalion, and the Commandant will be given a staff position under the rebel leader. The Commandant views this as an insult, and leaves to \"celebrate\" his lieutenant's promotion at a brothel. While the soldiers (except for Agu and Strika) spend the night with the brothel's women, one of them (the women) shoots the lieutenant. The lieutenant is badly wounded and the Commandant accuses the prostitute of trying to kill the Lieutenant. The prostitute pleads with the Commandant and says she shot the lieutenant by accident, but the Commandant and his men shoot the women and leave the city with the battalion.Now on the run from their own faction, as well as the UN and government forces, the battalion suffers heavy losses. Airstrikes and supply shortages kill many of them, with Strika being killed by a gunshot during an ambush. The remaining members of the battalion take shelter at a gold mine for several months, hoping to find gold to pay for supplies. Ammunition runs out, leaving the group with no way to defend themselves from encroaching enemy forces. Agu informs the Commandant of this, and he tells Agu that he must take care of him, as all sons must protect their fathers. As they speak, Preacher, now the new lieutenant, rallies the soldiers to abandon their posts and surrender to the UN, as they will surely starve or be killed if they stay. The Commandant at first refuses to let them go, but relinquishes when Agu says they should surrender. The soldiers all depart, leaving the raving Commandant alone. Shortly after, they are detained by UN troops. The younger members of the battalion are sent to a missionary school in a safe part of the country. Agu stays away from the other children, who play games and enjoy the comfort and safety of the school. Agu is tormented by what has happened, and has nightmares about it.After much time has passed, Agu tells the school's counselor that he has done some terrible things but he won't go into detail. He is afraid the counselor will think he is some kind of \"beast.\" Instead he tells how he used to be a good boy, from a good family, and that his family had loved him. The final scene shows Agu finally joining the other boys as they swim and play in the ocean.","language":"English|Twi|","cinematography":"Cary Joji Fukunaga","directed_by":"Cary Joji Fukunaga","beasts_of_no_nation":"Theatrical release poster","production_companies":"Red Crown Productions Primary Productions Parliament of Owls","release_dates":"September 3, 2015 (2015-09-03) (Venice)|October 16, 2015 (2015-10-16) (Worldwide)||||","Production":"Cary Fukunaga directed his own script, after having worked on it for seven years.[3] It was not until after six years of research on the Sierra Leone Civil War that Fukunaga came across the Beasts of No Nation novel. He told Creative Screenwriting, \"I read through the novel and I loved the elegant and concise way that Uzodinma Iweala told the story. I felt that would be the best way to enter the subject.\"[11]On August 20, 2013, Idris Elba joined the cast of the film adaptation.[3] On June 6, 2014, Ghanaian actors Ama K. Abebrese, Grace Nortey and David Dontoh joined the film.[9] Later, Opeyemi Fagbohungbe also joined the cast.[10]Red Crown Productions was the financier and producer, along with Primary Productions and Parliament of Owls.[3] On May 17, 2014, Participant Media, along with Mammoth Entertainment, came on board to co-finance the film, initially budgeted at $4.3 million but which ultimately cost about $6 million.[2]On June 5, 2014, principal photography was underway in the Eastern Region of Ghana.[9][12][13] The film was shot at locations in Koforidua and Ezile Bay at Akwidaa.[14] Dan Romer scored the film.[15]","produced_by":"Amy Kaufman|Cary Joji Fukunaga|Daniela Taplin Lundberg|Riva Marker|Jeffrey Skoll|Daniel Crown|Idris Elba|Uzodinma Iweala|","starring":"Idris Elba|Abraham Attah|Kurt Egyiawan|Jude Akuwudike|Emmanuel \"King King\" Nii Adom Quaye|","running_time":"137 minutes[1]","music_by":"Dan Romer","edited_by":"Mikkel E. G. Nielsen|Pete Beaudreau|","Release":"Netflix bought the worldwide distribution rights for around $12 million. The film was simultaneously released theatrically and online through its subscription video on demand service on October 16, 2015,[16] with Bleecker Street handling the theatrical release.[17] Considering the online release a violation of the traditional 90-day release window of exclusivity to theatres, AMC Cinemas, Carmike Cinemas, Cinemark, and Regal Entertainment Group—four of the largest theater chains in the United States—announced that they would boycott Beasts of No Nation, effectively downgrading it to a limited release at smaller and independent theatres.[8][18] The film was also theatrically released in the UK on October 16, 2015, in Curzon Cinemas.[19]Beasts of No Nation has received critical acclaim, with particular praise for the performances of Elba and Attah. On Rotten Tomatoes, the film has a rating of 92%, based on 112 reviews, with an average rating of 7.8/10. The site's critical consensus reads, \"Beasts of No Nation finds writer-director Cary Fukunaga working with a talented cast to offer a sobering, uncompromising, yet still somehow hopeful picture of war's human cost.\"[20] On Metacritic, the film has a score of 79 out of 100, based on 30 critics, indicating \"generally favourable reviews\".[21] Idris Elba won the SAG award for his supporting performance becoming the first movie actor to win a SAG award without being nominated for an Oscar.[22]Fukunaga has been accused of appropriating without credit the work of Irish artist Richard Mosse for the visually-arresting sequence when Agu takes a hallucinatory drug during an attack.[23] Mosse is known for his 2013 infra-red photography and video work of young soldiers in the Democratic Republic of Congo,[24] much of which was recreated shot-for-shot by Fukunaga in Beasts of No Nation, as evidenced by Artnet's side-by-side comparison.[23] Mosse said that Fukunaga contacted him and quizzed him about technical aspects of his infra-red photography.[23]","budget":"$6 million[2]"}