{"based_on":"Nightmare of Ecstasy  by Rudolph Grey","Cast":"The film also includes cameos from actors who worked with Wood on Plan 9 from Outer Space, Gregory Walcott and Conrad Brooks.","ed_wood":"Theatrical release poster","country":"United States","distributed_by":"Buena Vista Pictures Distribution","Plot":"In 1952, Ed Wood is struggling to join the film industry. Upon hearing of an announcement in Variety magazine that producer George Weiss is trying to purchase Christine Jorgensen's life story, Ed wants to meet Weiss. Weiss explains that Variety's announcement was a news leak, and it is impossible to purchase Jorgensen's rights. The producer decides to fictionalize the film, titled I Changed My Sex!. Ed tries to convince Weiss that he is perfect to direct the film because he is a transvestite, but is unsuccessful since Weiss wants a director with experience. Ed meets his longtime idol Bela Lugosi and the two become friends. Wood persuades Weiss to let him direct the film by convincing him that having a star in the film would sell tickets, and they could sign Bela for a low price.Ed and Weiss argue over the film's title and subject matter: Weiss has the poster printed, which Ed changes to Glen or Glenda and writes the film about a transvestite rather than a sex change. Weiss allows Ed to shoot whatever he wants as long as the film meets the required length. Ed takes to film production with an unusual approach; shooting only one take per scene, giving actors very little direction and using stock footage to fill in gaps. The movie is released to critical and commercial failure. Because of this, Ed is unsuccessful in getting a job at Screen Classics, but Ed's girlfriend, Dolores Fuller, tells him that he should try financing his next film independently. Ed is unsuccessful in finding money for Bride of the Atom, but is introduced to the psychic The Amazing Criswell who gives him advice on how to sell himself better.Ed meets Loretta King, who he thinks has enough money to fund Bride of the Atom and ends up casting her as the lead instead of Dolores as planned. Filming begins, but is halted when it is revealed that Loretta is actually poor, and Ed has no money to continue production. Ed convinces meat packing industry tycoon Don McCoy to take over funding the film, who agrees as long as the film stars his son Tony as the leading man and the film ends with an explosion. The filming finishes with the title being changed to Bride of the Monster, but Dolores breaks up with Ed after the wrap party because of his circle of friends, his work, and transvestism. Bela attempts to conduct a double suicide with Ed after the government cuts off his unemployment, but is talked out of it. Bela checks himself into rehab, and Ed meets Kathy O'Hara, who is visiting her father there. Ed takes her on a date and reveals to her his transvestism, which she accepts.Ed shoots a film with Bela outside his home. When Ed and company attend the premiere for Bride of the Monster, an angry mob chases them out of the theater. Bela passes away, leaving Ed without a star. Ed convinces a church leader named Reynolds that funding Ed's script for Grave Robbers from Outer Space would result in a box office success, and generate enough money for Reynolds' dream project. Dr. Tom Mason, Kathy's chiropractor, is chosen to be Bela's stand-in for resembling Lugosi. Ed and the Baptists have conflicts over the title and content of the script which they want to have changed to Plan 9 from Outer Space, along with Ed's B movie directing style, his casting decisions and his transvestism. Ed leaves the set to go to the nearest bar, where he encounters his idol, Orson Welles. Filming for Plan 9 finishes with Ed taking action against his producers. Plan 9 is premiered and Ed and Kathy go to Las Vegas to get married.","language":"English","Reception":"Ed Wood had its limited release on September 30, 1994. When the film went into wide release on October 7, 1994 in 623 theaters, Ed Wood grossed $1,903,768 in its opening weekend.[32] The film went on to gross $5,887,457 domestically,[32] much less than the production budget of $18 million.[33]Ed Wood ironically received positive reviews from critics and has a rating of 92% on Rotten Tomatoes based on 60 reviews with an average score of 8 out of 10. The consensus states \"Tim Burton and Johnny Depp team up to fete the life and work of cult hero Ed Wood, with typically strange and wonderful results.\"[34] The film also has a score of 70 out of 100 on Metacritic based on 19 reviews.[35]Roger Ebert gave a largely positive review: \"What Burton has made is a film which celebrates Wood more than it mocks him, and which celebrates, too, the zany spirit of 1950s exploitation films, in which a great title, a has-been star and a lurid ad campaign were enough to get bookings for some of the oddest films ever made.\"[36] Ebert and Gene Siskel gave the film 'Two Thumbs Up' on Siskel and Ebert, with Siskel calling it \"a tribute to creative passion and friendship\" and \"one of the year's very best\".Peter Travers of Rolling Stone presented Burton's decision with positive feedback on not making a direct satire or parody of Wood's life. \"Ed Wood is Burton's most personal and provocative movie to date,\" he wrote. \"Outrageously disjointed and just as outrageously entertaining, the picture stands as a successful outsider's tribute to a failed kindred spirit.\"[37]Janet Maslin, writing in The New York Times, thought Johnny Depp \"proved\" himself as an established \"certified great actor\". \"Depp captures all the can-do optimism that kept Ed Wood going, thanks to an extremely funny ability to look at the silver lining of any cloud.\"[38] Todd McCarthy from Variety called Ed Wood \"a fanciful, sweet-tempered biopic about the man often described as the worst film director of all time. Always engaging to watch and often dazzling in its imagination and technique, picture is also a bit distended, and lacking in weight at its center. The result is beguiling rather than thrilling.\"[39]Richard Corliss, writing in Time magazine, gave a negative review. \"The script by Scott Alexander and Larry Karaszewski posits Wood as a classic American optimist, a Capraesque hero with little to be optimistic about, since he was also a classic American loser. That's a fine start, but the film then marches in staid chronological order.\" Corliss continued, \"One wonders why this Burton film is so dishwatery, why it lacks the cartoon zest and outsider ache of Beetlejuice, Edward Scissorhands or Batman Returns.\"[40]Ed Wood was nominated for three Golden Globes: Best Musical or Comedy, Johnny Depp for Best Actor in a Musical or Comedy and Martin Landau for Best Supporting Actor.[41] Landau won in his category, while Depp lost to Hugh Grant (for \"Four Weddings and a Funeral\").[42] Landau and Rick Baker won Academy Awards for their work on the film.[43][44] Landau also won Best Supporting Actor at the first Screen Actors Guild Awards. Scott Alexander and Larry Karaszewski were nominated for Best Screenplay Written Directly for the Screen by the Writers Guild of America, which was a surprise as few predicted that it would be considered.[45] The film was also nominated for the prestigious Grand Prix of the Belgian Syndicate of Cinema Critics.[46]","box_office":"$5.9 million (North America)[1]","Historical accuracy":"When describing the film's accuracy, Burton explained, \"it's not like a completely hardcore realistic biopic. In doing a biopic you can't help but get inside the person's spirit a little bit, so for me, some of the film is trying to be through Ed a little bit. So it's got an overly optimistic quality to it.\"[7] Burton acknowledged that he probably portrayed Wood and his crew in an exaggeratedly sympathetic way, stating he did not want to ridicule people who had already been ridiculed for a good deal of their life. Burton decided not to depict the darker side of Wood's life because his letters never alluded to this aspect and remained upbeat. To this end, Burton wanted to make the film through Wood's eyes.[11] He said in an interview, \"I've never seen anything like them, the kind of bad poetry and redundancy– saying in, like, five sentences what it would take most normal people one [...] Yet still there is a sincerity to them that is very unusual, and I always found that somewhat touching; it gives them a surreal, weirdly heartfelt feeling.\"[19]The scenes of Bela Lugosi used for Plan 9 from Outer Space were not filmed outside his own house, as the film depicts. They were, in fact, filmed outside Tor Johnson's house. Additionally, Lugosi was not prone to fits of swearing, particularly in front of women and did not perform his own water stunt in Bride of the Monster.[20] Lugosi is also depicted as dying alone and miserable. Lugosi's wife of twenty years, Lillian, did leave him in 1953, but he remarried in 1955 to Hope Lininger. They were together until his death a year later. This, plus any reference to Lugosi's teenage son, Bela G. Lugosi, were omitted,[21] as is any mention of Lugosi's role in the 1956 United Artists film The Black Sleep. Also, when Ed Wood talks to George Weiss about making I Changed My Sex!, Weiss mentions Chained Girls, implying that Chained Girls was made before Glen or Glenda, when in fact Chained Girls was made afterwards.The scene where Bela is seen walking towards his house after Ed drops him off, he mentions how Hollywood has changed its horror films and how they aren't what they used to be back in the 1930s. He mentions movies about giant bugs (Them!), giant spiders, (Tarantula) and giant grasshoppers (Beginning of the End), however these movies came out after when the scene was supposed to be set and after the release of Glen or Glenda.According to Bela G. Lugosi (his son), Forrest Ackerman, Dolores Fuller and Richard Sheffield, the film's portrayal of Lugosi is inaccurate: In real life, he never used profanity, owned small dogs, or slept in coffins. And contrary to this film, Bela did not struggle performing on The Red Skelton Show.[22][23]Burton biographer Ken Hanke criticized the depiction of Dolores Fuller. \"The real Fuller is a lively, savvy, humorous woman,\" Hanke said, \"while Parker's performance presents her as a kind of sitcom moron for the first part of the film and a rather judgmental and wholly unpleasant character in her later scenes.\"[21] During her years with Wood, Fuller had regular TV jobs on Queen for a Day and The Dinah Shore Show, which are not mentioned. Fuller criticized Parker's portrayal and Burton's direction, but still gave Ed Wood a positive review. \"Despite the dramatic liberties, I think Tim Burton is fabulous. I wished they could have made it a deeper love story, because we really loved each other. We strove to find investors together, I worked so hard to support Ed and I.\"[21]","cinematography":"Stefan Czapsky","production_company":"Touchstone Pictures","directed_by":"Tim Burton","release_dates":"September 23, 1994 (1994-09-23) (New York Film Festival)|September 30, 1994 (1994-09-30) (United States)||||","Production":"Writers Scott Alexander and Larry Karaszewski conceived the idea for a biopic of Ed Wood when they were students at the USC School of Cinematic Arts.[7] Alexander even proposed making a documentary about Wood, The Man in the Angora Sweater in his sophomore year at USC.[8] However, Karaszewski figured, \"there would be no one on the planet Earth who would make this movie or want to make this movie, because these aren't the sort of movies that are made.\"[8] Irritated at being thought of solely as writers for family films for their work on Problem Child and Problem Child 2, Alexander and Karaszewski wrote a 10-page film treatment for Ed Wood and pitched the idea to Heathers director Michael Lehmann, with whom they attended USC film school.[7] The basis for their treatment came from Rudolph Grey's Nightmare of Ecstasy,[9] a full-length biography, which draws on interviews from Wood's family and colleagues.[10] Lehmann presented their treatment to his producer on Heathers, Denise Di Novi. Di Novi had previously worked with Tim Burton on Edward Scissorhands, Batman Returns and The Nightmare Before Christmas, and a deal was struck with Lehmann as director and Burton and Di Novi producing.[7]Burton began reading Nightmare of Ecstasy and some of Wood's letters. He was taken by how he \"wrote about his films as if he was making Citizen Kane, you know, whereas other people perceived them as, like, the worst movies ever\".[10] Burton admits to having always been a fan of Ed Wood, which is why the biopic is filmed with an aggrandizing bias borne of his admiration rather than derision of Wood's work.[11] The relationship between Wood and Lugosi in the script echoes closely Burton's relationship with his own idol and two-time colleague, Vincent Price. He said in an interview, \"Meeting Vincent had an incredible impact on me, the same impact Ed must have felt meeting and working with his idol.\"[12] Meanwhile, Burton had been asked to direct Mary Reilly for Columbia Pictures with Winona Ryder in the title role.[7]However, Burton dropped out of Mary Reilly over Columbia's decision to fast track the film and their interest with Julia Roberts in the title role instead of Ryder. This prompted Burton to becoming interested in directing Ed Wood himself, on the understanding it could be done quickly.[7] Lehmann said, \"Tim wanted to do this movie immediately and direct, but I was already committed to Airheads.\"[4] Lehmann was given executive producer credit. Alexander and Karaszewski delivered a 147-page screenplay in six weeks. Burton read the first draft and immediately agreed to direct the film as it stood, without any changes or rewrites.[7] Ed Wood gave Burton the opportunity to make a film that was more character-driven as opposed to style-driven. He said in an interview, \"On a picture like this I find you don't need to storyboard. You're working mainly with actors, and there's no effects going on, so it's best to be more spontaneous.\"[13]Initially, Ed Wood was in development with Columbia, but when Burton decided he wanted to shoot the film in black-and-white, studio head Mark Canton would not agree to it unless Columbia was given a first look deal.[14] Burton said black-and-white was \"right for the material and the movie, and this was a movie that had to be in black-and-white\". He insisted on total creative control, and so in April 1993, a month before the original start date, Canton put Ed Wood into turnaround. The decision sparked interest from Warner Bros., Paramount Pictures and 20th Century Fox in optioning the film rights, but Burton accepted an offer from Walt Disney Studios, who had previously produced The Nightmare Before Christmas. Similar to Nightmare, Disney released Ed Wood under their Touchstone Pictures banner. With a budget of $18 million, Disney did not feel the film was that much of a risk, and granted Burton total creative autonomy. Burton also refused a salary, and was not paid for his work on Ed Wood. Principal photography began in August 1993,[15] and lasted 72 days.[3] Despite his previous six-film relationship with Danny Elfman, Burton chose Howard Shore to write the film score. Under the pressure of finishing the score for Batman Returns, the relationship between the two strained[16] and Burton admitted he and Elfman experienced \"creative differences\" during The Nightmare Before Christmas[17]The movie was filmed at various locations in and around the Los Angeles area.[18]","produced_by":"Denise Di Novi|Tim Burton|","starring":"Johnny Depp|Martin Landau|Sarah Jessica Parker|Patricia Arquette|Jeffrey Jones|Bill Murray|","running_time":"127 minutes","music_by":"Howard Shore","edited_by":"Chris Lebenzon","Release":"Ed Wood had its premiere at the 32nd New York Film Festival at the Lincoln Center.[24] The film was then shown shortly after at the 21st Telluride Film Festival[25] and later at the 1995 Cannes Film Festival, where it was in competition for the Palme d'Or.[26][27]The DVD edition of Ed Wood initially had difficulty reaching store shelves in North America due to unspecified legal issues. The initial release had a featurette on transvestites — not relating to the film or its actors in any way — which was removed from subsequent releases. An initial street date of August 13, 2002 was announced[28] only to be postponed.[29] A new date of February 3, 2003 was set,[30] only for it to be recalled again without explanation, although some copies quickly found their way to collectors' venues such as eBay. The DVD was finally released on October 19, 2004.[31]","written_by":"Scott Alexander Larry Karaszewski","budget":"$18 million[1]"}