{"based_on":"Alone in the Dark  by Infogrames","country":"Canada Germany United States","distributed_by":"Concorde Filmverleih (Germany) Lions Gate Films (US)","language":"English","Reception":"Alone in the Dark grossed $2,834,421 in its opening weekend, ranking at #12; by the end of its run, the film had grossed $10,442,808 and was a box office bomb, considering its $20 million budget.[1]Rotten Tomatoes ranked the film 15th of the 100 worst reviewed films of the 2000s[citation needed] with a rating of 1% based on 117 reviews. The site's Critical Consensus reads, \"Inept on almost every level, Alone in the Dark may not work as a thriller, but it's good for some head-slapping, incredulous laughter.\" At Metacritic, it has a score of 9/100. Many reviewers harshly criticized the awful acting, several plot holes, a near complete lack of connection to the video games, and the poor quality of the special effects. Numerous editing mistakes were also highlighted, such as a scene showing a female soldier killed, only for her to lift her head once the camera crew moves away. Several also slammed the long introduction text. Scott Brown of Entertainment Weekly gave the film an F grade, commenting that the film was \"so bad it's postmodern.\"[7]In one of the film's only positive reviews, Michelle Alexandria of Eclipse Magazine wrote \"Alone in the Dark isn't going to set the world on fire, but it largely succeeds with what it has to work with. Just don't take it seriously and you'll have a fun time.\"[8]","box_office":"$10.4 million[1]","cinematography":"Mathias Neumann","production_company":"Boll KG Entertainment Herold Productions Brightlight Pictures Infogrames Entertainment","directed_by":"Uwe Boll","Plot synopsis":"Edward Carnby (Slater) is a detective who specializes in the occult & other paranormal subjects. He was apparently the subject of strange experiments when he was a child, leaving him with heightened abilities as well as a \"sixth sense\" that allows him to sense the paranormal. Throughout the film, we also learn that Carnby used to work for Bureau 713, a secret government organization that seeks to protect the world from paranormal dangers.In his spare time, Carnby investigates the disappearance of the Abkani, an ancient Mayan-like civilization that worshipped demonic creatures from another dimension. Central to the plot are several artifacts un-earthed in 1967 and now on display at the city's Museum of Natural History, at which Carnby's ex-girlfriend Aline (Reid) is the assistant curator. While working on a missing-child case, Carnby soon finds himself investigating the very scientist who conducted experiments on him as a child. He also finds himself working with Aline and former protégé (now rival) Commander Burke, his replacement at Bureau 713, to stop an invasion of the Alien-like demonic creatures who are pouring through a portal opened by the Abkani artifacts.","Home Media":"The film was released on DVD on May 10, 2005.An Unrated Director's Cut was released in Germany, France, and Australia and was #1 on the German DVD market for three weeks.[4] It was released on DVD in North America on 25 September 2007.[5] In the newest version of the film, virtually all of the scenes with Tara Reid in them have been removed by Boll himself.[6]","alone_in_the_dark":"Theatrical release poster","Soundtrack":"The 2-disc soundtrack was released by Nuclear Blast, with Wolfgang Herold as executive producer. The German band Solution Coma's contribution was the title song. Finnish symphonic metal band Nightwish had a music video of \"Wish I Had an Angel\" directed by Uwe Boll, with clips from the film.","release_dates":"28 January 2005 (2005-01-28) (United States)|24 February 2005 (2005-02-24) (Germany)||||","Alternative versions":"Blair Erickson came up with the first drafts of the script for Alone in the Dark. According to Erickson, Uwe Boll changed the script to be more action packed than a thriller. Erickson stated his disgust and his working relationship towards Boll on Somethingawful.com.The original script took the Alone In the Dark premise and depicted it as if it were actually based on a true story of a private investigator in the northeastern U.S. whose missing persons cases begin to uncover a disturbing paranormal secret. It was told through the eyes of a writer following Edward Carnby and his co-worker for a novel, and depicted them as real-life blue-collar folks who never expected to find hideous beings waiting for them in the dark. We tried to stick close to the H. P. Lovecraft style and the low-tech nature of the original game, always keeping the horror in the shadows so you never saw what was coming for them.Thankfully Dr. Boll was able to hire his loyal team of hacks to crank out something much better than our crappy story and add in all sorts of terrifying horror movie essentials like opening gateways to alternate dimensions, bimbo blonde archaeologists, sex scenes, mad scientists, slimy dog monsters, special army forces designed to battle slimy CG dog monsters, Tara Reid, \"Matrix\" slow-motion gun battles, and car chases. Oh yeah, and a ten-minute opening back story scroll read aloud to the illiterate audience, the only people able to successfully miss all the negative reviews. I mean hell, Boll knows that's where the real scares lie.[3]","produced_by":"Uwe Boll Wolfgang Herold Shawn Williamson","starring":"Christian Slater Tara Reid Stephen Dorff","running_time":"96 minutes","Original film and game tie-in concept":"Originally, the film version of Alone in the Dark was to be released with Alone in the Dark 5, the fifth title in the series; however, the creators of Alone in the Dark, Eden Games, delayed the game and reworked it entirely from scratch. This appears to be one of the causes for the public backlash from gamers on how the film version of Alone in the Dark appeared to deviate from the Alone in the Dark game franchise save for the fact that the film was in some ways a sequel to Alone in the Dark: The New Nightmare. Uwe Boll stated his disappointment on the region 1 DVD commentary but also said that Atari had face shots of Christian Slater for the newest game - Alone in the Dark 5, which was released on June 26, 2008.","music_by":"Reinhard Besser Oliver Lieb Bernd Wendlandt Peter Zweier","edited_by":"Richard Schwadel","written_by":"Elan Mastai Michael Roesch Peter Scheerer","budget":"$20 million[1]"}