{"country":"France|Italy|","distributed_by":"UGC Distribution","a_prophet":"Theatrical release poster","Plot":"Malik El Djebena, a 19-year-old French youth of Algerian descent, is sentenced to six years in prison for attacking police officers. Alone and illiterate upon his arrival, he falls under the sway of Corsican mobsters, led by Cesar Luciani, who enforces a brutal rule.The prison is divided between two main factions: the Corsicans and the Muslims. Malik keeps to himself. When Luciani forces him to be the unwilling assassin of Reyeb, a Muslim witness in a trial, Malik gains the protection of the Corsicans in spite of his Arab origin. Malik serves as a low-level servant to the Corsicans, who treat him with disdain. All the while, he is haunted by visions of the murdered Reyeb. When the bulk of the Corsicans are transferred or released, Luciani is forced to give Malik more responsibility. Having secretly learned Corsican, Malik acts as Luciani's eyes and ears in the prison. When Malik earns the privilege of day-long furloughs outside the prison, Luciani relies on him to conduct his criminal business outside.Ryad, a Muslim friend, teaches Malik to read and write, and the two become close. Ryad teaches Malik about his own heritage, introducing him to two other Muslims, Tarik and Hassan, and increasing his power within the prison. Malik also becomes involved with a prison drug dealer, Jordi. When Ryad gains an early release due to testicular cancer, the three partners organize a drug-running enterprise to sell hashish. But when Ryad is kidnapped by the drug dealer Latif, Malik tracks down Latif's relative inside the prison. He kidnaps the relative's family and forces Latif's gang to release Ryad.When Luciani discovers that Malik is using his day-releases for his own personal enterprise, he punishes him. Malik is sent to meet Brahim Lattrache in Marseille, another Muslim, who is involved in a deal between Luciani and the Lingherris, an Italian mafia group. Lattrache is bitter toward the Corsicans for the murder of Reyeb and holds Malik at gunpoint. When Malik spots a deer warning sign, he remembers a recent dream of deer running in the road. He tells his kidnappers that they are in danger of hitting wild animals, and they suddenly strike a deer. Lattrache is impressed by Malik, calling him a prophet and agreeing to do criminal business with him instead of Luciani, even though Malik admitted that he killed Reyeb.Luciani believes there is a \"mole\" in his organization and decides to use Malik to assassinate Jacky Marcaggi, the Don of the Corsican mafia, for secretly dealing with the Lingherris. But Malik and Ryad have their own plan for Marcaggi: they kill his bodyguards and dump him in a van with his Corsican enemy Vettori, Luciani's henchman. Malik takes refuge at Ryad's house with his wife and young son. Ryad's cancer has returned; his decision against more chemotherapy leaves him just six months to live. He gets Malik to promise to take care of his family when he's gone.Upon Malik's return to the prison, he joins the Muslim faction in the yard. When Luciani tries to approach him, two Muslims intercept and beat him.On the day of his release, Malik is met by Ryad's wife and son outside the prison. They walk off together, followed by a vehicle convoy carrying Malik's new associates.","language":"French|Arabic|Corsican|","Reception":"A Prophet received widespread critical acclaim. Review aggregator Rotten Tomatoes reports that 97% of critics have given the film a positive review based on 147 reviews, with an average score of 8.3/10, making the film a \"Certified Fresh\" on the website's rating system. Its critical consensus states that \"Featuring an impressive star turn by newcomer Tahar Rahim, A Prophet is a French gangster film filled with arresting, immediate details.\" [6] At Metacritic, which assigns a weighted mean rating out of 100 to reviews from mainstream critics, the film received an average score of 90, based on 31 reviews, which indicates \"Universal acclaim\".[7]Reception of the film after its debut screening at 2009 Cannes Film Festival at the competition was good. A Prophet was picked as the best film of the festival by a group of sixteen English-language critics and bloggers polled by the daily independent film news site indieWIRE.[8]Karin Badt at The Huffington Post called it \"refreshingly free\".[4] Jonathan Romney of Screen International said that the film \"works both as hard-edged, painstaking detailed social realism and as a compelling genre entertainment.\"[9]Luke Davies of The Monthly criticized some of the film's stylistic methodology and content, asserting that the prophetic themes could have been stretched out, but he celebrated the film's central character and his well-executed \"improbable rise from invisibility to dominance\", describing \"what gives [the film] such dynamic energy is the seamlessness with which this transition unfolds\". Davies described the film's main achievement as conveying a character as \"someone we care about and gun for,\" who started life on screen as a blank slate.[10]The film was the submission of France for the 82nd Academy Awards for Best Foreign Film.[11] On February 2, 2010, when Academy Award nominations were announced, A Prophet received a nomination for Best Foreign Language film. The other four films in the category were Ajami, The Milk of Sorrow and The White Ribbon, and the eventual winner, El secreto de sus ojos.[12]A Prophet won the Grand Prix at the 2009 Cannes Film Festival.[13] At the 53rd London Film Festival, it won the Best Film Award.[14][15] It won the Prix Louis Delluc 2009.[16] At the 63rd British Academy Film Awards, it won a BAFTA for Best Film Not in the English Language. It was nominated for 13 César Awards, tying it with three other films for the most nominations of any film in César history. It won 9 Césars at the ceremony, including Best Film, Best Director, Best Actor and Best Supporting Actor.[17] The film was nominated for the Grand Prix of the Belgian Syndicate of Cinema Critics. The film also won London's Favourite French Film award in 2010, as well as Best Foreign Film at the 13th annual British Independent Film Awards, which were held in London at the Old Billingsgate on December 5, 2010.[18]A Prophet was also nominated for Best International Film at the 8th Irish Film and Television Awards, an award that went to The Social Network.In 2010 Empire magazine ranked it at number 63 in its \"The 100 Best Films Of World Cinema\" list.[19]","box_office":"$17.9 million[2]","cinematography":"Stéphane Fontaine","directed_by":"Jacques Audiard","release_dates":"16 May 2009 (2009-05-16) (Cannes)|26 August 2009 (2009-08-26) (France)||||","Production":"Audiard had been thinking about making a film set in prison after he had attended a screening of one of his films in prison and found himself shocked by the conditions. The film's screenplay was submitted to them by a producer and reworked by Audiard and Thomas Bidegain.[4][5]Audiard cast Niels Arestrup as the Corsican crime boss César Luciani, after featuring him in his previous film, The Beat that My Heart Skipped. He met Tahar Rahim, who plays Malik, when they shared an automobile ride from another film set. To ensure the authenticity of the prison experience, Audiard hired former convicts as advisors and extras.[5]","produced_by":"Martine Cassinelli|Antonin Dedet|","starring":"Tahar Rahim|Niels Arestrup|Adel Bencherif|","running_time":"155 minutes[1]","music_by":"Alexandre Desplat","edited_by":"Juliette Welfling","written_by":"Jacques Audiard|Thomas Bidegain|Abdel Raouf Dafri|Nicolas Peufaillit|","budget":"$13 million[2]"}