{"based_on":"Black Mass  by Dick Lehr and Gerard O'Neill","country":"United States","distributed_by":"Warner Bros. Pictures","screenplay_by":"Jez Butterworth|Mark Mallouk|","Plot":"In 1975, James \"Whitey\" Bulger, leader of the Irish-American Winter Hill Gang, controls most organized crime within South Boston, along with his right-hand man Stephen Flemmi, newcomer Kevin Weeks, and callous hitman Johnny Martorano. Bulger lives with common-law wife Lindsey Cyr and their young son Douglas.Bulger's supremacy is challenged by the North End Angiulo Brothers, a rival gang, part of the New England Mafia family. FBI agent John Connolly returns to the area – he grew up in South Boston as a friend of Whitey and his brother William \"Billy\" Bulger, the Massachusetts State Senate President. Connolly tries infiltrating the Angiulo Brothers, and attempts to get Whitey to work with the FBI. Although Whitey hates the idea of being a rat, he understands the protection he would have for himself, his gang, and his family. When the Angiulo Brothers murder a Winter Hill member, Whitey becomes an informant.Although Connolly is supported by his co-worker John Morris, their boss, Charles McGuire, is suspicious. Whitey increasingly exploits the FBI informant relationship, using Connolly's \"protection\" as a cover for his crimes. Connolly demands information on the Angiulos' racketeering locations. Finally, Whitey gets pictures of the rival gang's hideouts, allowing the FBI to wiretap the Angiulos. The FBI arrests them, thus eliminating underground opposition to Whitey's power. Connolly, blinded by his past, grows closer to Whitey and the gang, even inviting them to his house for a cookout. His wife, Marianne, sees negative changes in her husband as his agent-informant relationship with Whitey grows.Cut out of an embezzlement scheme from World Jai Alai, Whitey orders Martorano to murder his rivals Roger Wheeler and John Callahan. An associate, Brian Halloran, goes to the FBI to report Whitey's involvement, much to Connolly's displeasure, who then tells Whitey of Halloran's accusation, thereby resulting in the murders of Halloran and an unnamed accomplice. Due to Whitey's increasingly violent and unpredictable behavior, his informant relationship deteriorates.A \"bulldog\" prosecutor, Fred Wyshak, becomes an assistant U. S. Attorney in Boston. Connolly attempts to make friends and to perhaps divert his attention from Bulger, but Wyshak bluntly refuses, demanding that the FBI arrest Whitey. John McIntyre, an informant within the Winter Hill Gang, informs on an attempt by Whitey to smuggle weapons for the IRA. Connolly tells Whitey, who murders McIntyre. Wyshak and McGuire investigate Connolly's management of Whitey's informant role. They discover that most of what Connolly called Whitey's tips were already obtained from other sources. Morris tells the Boston Globe about Connolly's and Whitey's relationship and a front-page story exposes the FBI's links to organised crime.In the final scenes, Connolly, Flemmi, Weeks, and Martorano are arrested. Whitey goes on the run, but not before giving Billy a final goodbye from a pay phone. Morris turns state's evidence and testifies against Connolly in return for immunity. Connolly's and the other characters' sentences are listed, and a concluding sequence shows a now-elderly Whitey being caught by the FBI in 2011.","language":"English","Reception":"Black Mass grossed $62.6 million in North America and $37.2 million in other territories for a worldwide total of $99.8 million, against a budget of $53 million.[7]In its opening weekend, the film was projected to earn $26–27 million from 3,188 theaters. It grossed $8.8 million on its opening day, including $1.4 million from its early Thursday showings, and in its opening weekend, earned $22.6 million, finishing second at the box office behind fellow newcomer Maze Runner: The Scorch Trials ($30.3 million).[83]On Rotten Tomatoes the film has a rating of 75% based on 236 reviews and an average rating of 6.7/10. The site's critical consensus reads, \"Black Mass spins a gripping yarn out of its fact-based story – and leaves audiences with one of Johnny Depp's most compelling performances in years.\"[84] On Metacritic, the film has a rating of 68 out of 100 based on 43 critics, indicating \"generally favorable reviews\".[85] Audiences polled by CinemaScore gave the film an average grade of \"B\" on an A+ to F scale.[83]Johnny Depp's portrayal of Whitey Bulger received critical acclaim. Critics from The Hollywood Reporter, Variety, and TheWrap called it one of his best performances to date.[86][87][88] The Hollywood Reporter's Todd McCarthy, in addition to praising the film, called Depp's performance \"fully convincing and frightening\", saying it to is \"very welcome at this point in his career and one of his best.\"[86]Similarly, Indie Wire's Eric Kohn praised the cast and highlighted Depp's performance and Cooper's directorial efforts to depict \"the haunting legacy of Bulger's criminal deeds, and the lingering sense that no justice can erase their impact.\"[89] Admiring Black Mass as an \"elegantly understated crime drama\", Variety's Scott Foundas positively compared Depp's performance in the film to his earlier roles with Tim Burton.[87]TheWrap's Alonso Duralde praised Depp's performance, but was less positive towards the film's pacing and short onscreen appearances of some supporting characters.[88] BBC Culture's Nicolas Barber found some of the subplots to be unnecessary (specifically mentioning Benedict Cumberbatch as Billy Bulger), and argued that \"the film is never bad, but, given the gob-smacking true story, it's disappointing that it's not great\".[90] In a negative review, CraveOnline's Fred Topel labeled Black Mass as a \"black mess\". He criticized the screenwriting and argued that the film borrows too heavily from Goodfellas, writing: \"...it's clear that the filmmakers wanted to turn this into Goodfellas and tried to shoehorn this story into a similar kind of seductive, funny, shocking gangster tale. ...Several scenes seem to want to be like the 'how am I funny?' scene in Goodfellas, but it's blatant\".[91]Many people believed Depp deserved an Academy Award for Best Actor nomination for his performance as Bulger and many were surprised when his name was left off the list of nominees.[97] Some believe it was because Depp commented that he didn't want to win an Oscar if nominated for one.[98]","box_office":"$99.8 million[7]","black_mass":"Theatrical release poster","cinematography":"Masanobu Takayanagi","production_company":"Cross Creek Pictures RatPac-Dune Entertainment","directed_by":"Scott Cooper","Soundtrack":"The soundtrack, written by Tom Holkenborg, was released on September 11, 2015.2015 Watertower Music (61:26)","release_dates":"September 4, 2015 (2015-09-04) (Venice)[3]|September 18, 2015 (2015-09-18) (United States)[4]||||","Production":"An idea for a film adaptation of Black Mass: The Irish Mob, The FBI and a Devil's Deal garnered interest intermittently since 2000. Even before its published release, the book's film rights had already been sold to Miramax, when Harvey Weinstein was still part of the company. According to co-author Dick Lehr, Weinstein had never exercised the film option for unknown reasons, and the rights expired.[16][17] At one point afterwards, in 2002, filmmaker Robert Greenwald had planned to adapt Black Mass into a 4-hour miniseries for USA Network, but the project was never developed.[18] Eventually in 2006, film producers Brian Oliver , acquired the film rights for Black Mass, and was set to produce the adaptation with CP Production partners Michael Cerenzie and Christine Peters.[17][19]After Oliver's acquisition, Jim Sheridan was attached to direct the film. In 2009, Sheridan had finished writing a draft of the adapted screenplay with Nye Heron, and principal photography was reportedly scheduled to begin in April 2010.[20][21] However, in December 2010, while discussing the troubled production of his 2011 film Dream House, Sheridan hinted at his detachment from the Black Mass project.[22] Oliver's then-newly founded Cross Creek Pictures film production company took over financing for Black Mass, and Sheridan's exit was confirmed when Russell Gewirtz was hired in 2011 to write another draft for the adaptation, and Barry Levinson was attached to direct instead.[17][23][24] The finished version of Black Mass was scripted by Mark Mallouk and Jez Butterworth, and has been billed as the \"true story of Whitey Bulger, FBI agent John Connolly and the FBI's witness protection program that was created by J. Edgar Hoover.\"[25]Later in January 2014, Scott Cooper was attached to re-write and direct the film.[26] On February 27, 2014, Warner Bros. picked up the film's worldwide distribution rights, eyeing an October 2015 release, and the studio co-financed the film with Cross Creek.[27]Johnny Depp's involvement with Black Mass dates back to February 2013, when he was attached to star in the film, while Barry Levinson was still slated to direct and principal photography was scheduled to begin in May 2013. Depp briefly exited the project shortly after its sale at the 66th annual Cannes Film Festival, because of a salary dispute with Cross Creek Pictures. He later rejoined at around the same time Scott Cooper was attached to replace Levinson as director, and his signing for the film was made official in February 2014.[26][28][29][30][31] Jesse Plemons and Juno Temple joined the cast to play as Kevin Weeks (a cohort of Bulger) and Deborah Hussey, one of Bulger's victims, respectively, around April 2014. Plemons reportedly prepared for his role by hiring a dialect coach and studying video of the actual Kevin Weeks.[32][33]Benedict Cumberbatch replaced Guy Pearce as William \"Billy\" Bulger on May 22, 2014.[8] On June 10, it was announced that Jeremy Strong would co-star in the film.[14] On June 14, James Russo joined the cast of the film to play Scott Garriola, one of the FBI agents who took down Bulger.[15] On June 26, Kevin Bacon was added to the cast to play Charles McGuire, the FBI Special Agent in charge of the Boston field office and John Connelly's boss.[10] On July 1, David Harbour was added to the cast of the film to star as John Morris, a corrupt FBI agent along with Connolly.[12]The roles of Connolly - who was Whitey Bulger's FBI handler - and his first wife Marianne, were filled by Joel Edgerton and Julianne Nicholson, respectively. Scott Cooper chose Nicholson for the part after her performance as Sally in Sam Shepard's off-Broadway play Heartless (before Claire van der Boom succeeded her for the play's two-week extension). Edgerton developed his portrayal of Connolly by studying past footage of the FBI agent before his imprisonment, some of which include his appearances in talk shows and in courtrooms. In an interview with the Wall Street Journal, Edgerton stated that he declined trying to meet with the actual Connolly, reasoning that Connolly \"has one version of events and the film has a different version\".[34][35][36][37] Edgerton originally dropped out of the project when Depp agreed to return, and Tom Hardy was in early talks for the role.[31] However Edgerton returned in the role.In preparing for his role, Depp similarly studied surveillance and police audio footage involving Bulger. The actor was adamant in depicting the Boston gang leader's criminal and personal life as would be ultimately portrayed in the film. To achieve that, Depp had attempted to meet with Bulger himself, but was declined a meeting and instead consulted Jay Carney, Bulger's attorney. Carney appeared on the set during filming a few times to provide feedback on Depp's performance.[36][38][39][40]Principal photography commenced on May 19, 2014 in Boston;[27][41] actors were seen filming scenes in Dorchester.[42] On May 23, some shots were also filmed at Polish American Club (altered to recreate West Broadway's Triple O's Lounge, Whitey's infamous South Boston hangout), on Cambridge Street in Cambridge.[43][44] On May 27, filming was taking place in East Boston, where Johnny Depp and Jesse Plemons were seen together on the set.[45] Next day on May 28, Joel Edgerton was seen during filming of a scene on Silver Street in South Boston.[46][47] On June 4, Depp was spotted in Lynn during a recreation of the 1982 murders of Brian Halloran and Michael Donahue by Bulger.[48] On June 6–7, Depp was seen filming scenes at Copley Square in Boston.[49]On June 9, Depp's 51st birthday, he was filming scenes on location in Quincy,[50][51] where actress Dakota Johnson was in Back Bay, playing Whitey Bulger's longtime former girlfriend, Lindsey Cyr.[52] On June 11, shooting was underway in Lynn, where the crew was filming scenes in which Bulger and Stephen Flemmi pick up a prostitute named Deborah Hussey (played by Juno Temple) from the police station. Temple was seen on the set.[53][54] On June 16, Depp and Plemons were spotted on the set of the film in South Boston.[55]On June 20, news posted some photos from the set of the film, which features classic cars from the film set in South Boston.[56] On June 23, Cumberbatch and Depp were spotted during a re-creation of Saint Patrick's Day parade scenes in Lynn.[57][58] On June 24, scenes were shot at the Harvard Club in Boston.[59] On June 26, Cumberbatch was spotted with crew while filming around Ashmont Grill in Dorchester.[60] On June 29, the pavement outside South Boston High School had graffiti readings of \"Stop Forced Busing\" and \"Press Print the Truth.\"[61]On July 2, Depp and Cumberbatch were together filming some scenes in Boston.[62] On July 7–8, filming was set to take place on Gilson Road in Quincy.[63] A four-story building on 6 Gilson Road was transformed to resemble the Princess Eugenia apartments in Santa Monica, California, where FBI agents arrested Bulger on June 22, 2011. Arrest scenes were filmed there on July 7 and 8, and Sienna Miller was spotted dressed as Catherine Greig.[64][65] From July 8–10, scenes were filmed on Revere Beach, so that a portion of Revere Beach remained closed. Between July 11–12, Revere Beach Boulevard remained closed for shooting.[66] Revere Beach was transformed into Miami Beach, Florida, as live palm trees had been planted in the sand and a pizza restaurant was transformed into a Cuban cafe on Revere Beach Boulevard across the street from Beach.[67] Depp as Whitey Bulger and Miller as Catherine Greig were spotted on the Black Mass set on the Revere Beach on July 10, 2014.[68]On July 15, Cumberbatch wrapped filming for his part in Boston.[69] On July 21, Depp filmed some scenes at the former Anthony's Hawthorne restaurant, located at Oxford Street and Central Avenue in Lynn.[70] Depp's wife Amber Heard visited Depp on the set of the film on July 21, the last day of filming for Depp's role.[71]In July, director Cooper told The Boston Globe that filming had to take place for two more weeks in Boston, focusing on the FBI's role in the Bulger story.[71] On July 25, Kevin Bacon was in Boston, filming some remaining scenes for the film.[72] According to The Boston Globe, filming for Black Mass wrapped up on Friday, August 1, 2014, in Boston.[73][74]Sienna Miller was cast and filmed scenes as Catherine Greig, Bulger's companion while a fugitive, but her scenes ended up getting cut from the film due to \"narrative choices\".[75][76] Erica McDermott was cast as Mary Bulger, wife of Billy Bulger, but the majority of her scenes were cut out.[77]","produced_by":"Scott Cooper|John Lesher|Patrick McCormick|Brian Oliver|Tyler Thompson|","starring":"Johnny Depp|Joel Edgerton|Benedict Cumberbatch|Rory Cochrane|Kevin Bacon|Jesse Plemons|Corey Stoll|Peter Sarsgaard|Dakota Johnson|","running_time":"122 minutes[5]","music_by":"Tom Holkenborg[1]","edited_by":"David Rosenbloom[2]","Release":"On June 30, 2014, Warner Bros. set the film for a September 18, 2015 worldwide release.[78] It was selected to be shown in the \"Fuori Concorso\" section of the Venice Film Festival. It was also shown at the Telluride Film Festival the next day, and in the Special Presentation section of the 2015 Toronto International Film Festival.[79]On April 23, 2015, the first trailer for the film was released, followed by a second trailer on May 22.[80][81] A third trailer was released on July 30.[82]Black Mass was released on DVD and Blu-ray on February 16, 2016.","budget":"$53 million[6]"}