{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer","Plot":"Two friends and convicts, Joe (Bruce Willis) and Terry (Billy Bob Thornton), break out of Oregon State Penitentiary in a concrete mixing truck and start a bank robbing spree, hoping to fund a dream they share. They become known as the \"Sleepover Bandits\" because of their modus operandi: they kidnap the manager of a target bank the night before a planned robbery, then spend the night with the manager's family; early the next morning, they accompany the manager to the bank to get their money. Using dim-witted would-be stunt man Harvey Pollard (Troy Garity) as their getaway driver and lookout, the three successfully pull off a series of robberies that gets them recognition on the FBI's Ten Most Wanted list, and ultimately the reward for information leading to their capture is increased to $1 million.When Kate, a housewife with a failing marriage (Cate Blanchett), decides to run away, she ends up in the hands of the criminals. Initially attracted to Joe, she also ends up in bed with Terry and a confused love triangle begins.The three of them go on the lam and manage to pull off a few more robberies, but after a while the two begin to fight over Kate, and she decides to leave them. The two criminals then decide to pull off one last job.The story is told in flashbacks, framed by the story of the pair's last robbery of the Alamo Bank, as told by Criminals at Large, a fictional reality television show, with which they taped an interview stating that Kate was only a hostage, not a participant. The show tells the story of their last job, which is known to be a failure when Kate tips off the police and the two are caught in the act. The two then begin to argue when Joe tells the police \"You won't take us alive!\" and the argument gets to the point where the two of them shoot each other dead.At the end of the film the real story behind the last job is revealed: Harvey used some of his special effects to make it seem as though Terry and Joe were shooting each other. Harvey and his girlfriend then ran in dressed as paramedics and placed the stolen money, Terry, and Joe in body bags while Kate (who was in on the plan) distracts the police by pretending to pass out in shock upon seeing the \"bodies.\" In the ambulance, Harvey used electronics to blow out his tires which sent the ambulance into a junkyard. Under his jumpsuit, Harvey was wearing a fire suit. He lit himself on fire and rigged a bomb to go off. Harvey, Harvey's girlfriend, Terry, and Joe fled the scene, leading officials to believe the bodies were burned beyond recovery. Kate received the $1 million reward for having turned them in.Reunited, Joe, Terry, Harvey and Kate make it to Mexico to live out their dream. The last scene shows Harvey getting married in Mexico and Kate kissing Joe and Terry passionately.","language":"English","Reception":"On the review aggregator website Rotten Tomatoes, Bandits holds a 65% \"fresh\" rating based on 139 reviews, with an average rating of 6.1/10.[1] Metacritic assigned the film a weighted average score of 60 out of 100, based on 32 critics, indicating \"mixed or average reviews\".[2]In 2007 in New York, individuals were prosecuted and convicted for crimes imitative of this film's plot.[3]In its opening weekend, the film opened at #2, earning $13 million.[4] The film grossed $67.6 million worldwide, against a budget of $75 million.[5]","box_office":"$67.6 million","cinematography":"Dante Spinotti","production_company":"Hyde Park Entertainment Empire Pictures Cheyenne Enterprises","directed_by":"Barry Levinson","bandits":"Theatrical release poster","release_dates":"October 12, 2001 (2001-10-12)|||||","produced_by":"Barry Levinson Michael Birnbaum","starring":"Bruce Willis Billy Bob Thornton Cate Blanchett","running_time":"123 minutes","music_by":"Christopher Young","edited_by":"Stu Linder","written_by":"Harley Peyton","budget":"$75 million"}