{"based_on":"2010: Odyssey Two  by Arthur C. Clarke","Cast":"Arthur C. Clarke appears as a man on a park bench outside the White House (which is out-of-frame in the pan-and-scan version, but visible in the letterboxed and widescreen versions). In addition, a Time magazine cover about the American–Soviet tensions is briefly shown, in which the President of the United States is portrayed by Clarke and the Soviet Premier by the 2001 producer, writer, and director, Stanley Kubrick.","country":"United States","distributed_by":"Metro-Goldwyn-Mayer","screenplay_by":"Peter Hyams","Plot":"After the mysterious failure of the Discovery One mission to Jupiter in 2001, which resulted in the deaths of four astronauts and the disappearance of David Bowman, the fiasco was blamed on Dr. Heywood Floyd, who resigned his position as head of the National Council for Astronautics. While an international dispute causes tensions between the United States and the Soviet Union, both nations prepare space missions to determine what happened to the Discovery. Although the Soviet ship, the Leonov, will be ready before the American spacecraft Discovery Two, the Soviets need American astronauts to help board the Discovery and investigate the malfunction of the ship's sentient computer, HAL 9000, which caused the disaster. The US government agrees to a joint mission when it is determined that Discovery will crash into Jupiter's moon Io before Discovery Two is ready. Floyd, along with Discovery designer Walter Curnow and HAL 9000's creator Dr. Chandra, joins the Soviet mission.Upon arriving at Jupiter, the crew detect signs of life on Jupiter's seemingly barren moon Europa. They send an unmanned probe down to Europa to investigate the unusual readings, but just as it finds the source, a mysterious energy burst destroys the probe and its data. The \"burst\" then flies toward Jupiter. The Soviets believe the burst was simply electrostatic build-up, but Floyd suspects it was a warning to stay away from Europa.After surviving a dangerous braking maneuver around Jupiter's upper atmosphere, the Leonov crew find the abandoned Discovery floating in space. Curnow reactivates the ship and Chandra restarts HAL, who had been deactivated by Dave Bowman before his disappearance nine years earlier. Also nearby is the giant alien Monolith that the Discovery was originally sent to investigate. Cosmonaut Max Brailovsky travels to the Monolith in an EVA pod, at which point the Monolith briefly opens with a burst of energy, sending Max's pod spinning off into space. On Earth, Dave Bowman, now an incorporeal being that existed inside the Monolith, appears on his wife's television screen and wishes her farewell. He also visits his terminally ill mother just before she dies.On the Discovery, Chandra discovers the reason for HAL's malfunction: The National Security Council ordered HAL to conceal from Discovery's crew the fact that the mission was about the Monolith; this conflicted with HAL's basic programming of open, accurate processing of information, causing him to suffer the computer equivalent of a paranoid mental breakdown. Although the order bears his signature, Floyd is outraged that this was done without his knowledge.On Earth, tensions between the USA and the USSR escalate to a state of war. The Americans are instructed to leave the Leonov and move to the Discovery, with both crews ordered not to communicate with each other. Both crews plan to leave Jupiter separately when a launch window opens in several weeks; however, Bowman appears to Floyd and says it is imperative that everybody leave within two days. Stunned by Bowman's appearance, Floyd returns to the Leonov to confer with Captain Tanya Kirbuk, who remains skeptical. The Monolith then suddenly disappears, and a growing black spot appears on Jupiter itself. The spot is actually a vast group of Monoliths that are constantly multiplying. The Monoliths begin shrinking Jupiter's volume, increasing the planet's density, and modifying its chemical composition. This convinces the two crews that they must leave soon. Since neither ship can reach Earth with an early departure, they work together to use the Discovery as a booster rocket for the Leonov, though it means the Discovery's and HAL's destruction. Bowman's voice is heard once again as he speaks to HAL and tells him that they will soon be together after he transmits one final message to Earth:ALL THESE WORLDS ARE YOURS EXCEPT EUROPA ATTEMPT NO LANDING THERE USE THEM TOGETHER USE THEM IN PEACEThe Monoliths engulf Jupiter, causing nuclear fusion that transforms the planet into a small star. Discovery is consumed in the blast after the Leonov breaks away to safety. The new star's miraculous appearance inspires American and Soviet leaders to seek peace. Europa gradually transforms from an icy wasteland to a humid jungle covered with plant life. A Monolith stands in the primeval Europan swamp, waiting for intelligent life forms to evolve.","2010":"Theatrical release poster","language":"English","Reception":"Critical reaction to 2010 was generally positive, with the film holding a rating of 66% of Rotten Tomatoes, based on 32 reviews.[17] Roger Ebert gave 2010 three stars out of four, writing that \"It doesn't match the poetry and the mystery of the original film, but it does continue the story, and it offers sound, pragmatic explanations for many of the strange and visionary things in 2001\". Ebert also wrote it \"has an ending that is infuriating, not only in its simplicity, but in its inadequacy to fulfill the sense of anticipation, the sense of wonder we felt at the end of 2001\". He concluded, however: \"And yet the truth must be told: This is a good movie. Once we've drawn our lines, once we've made it absolutely clear that 2001 continues to stand absolutely alone as one of the greatest movies ever made, once we have freed 2010 of the comparisons with Kubrick's masterpiece, what we are left with is a good-looking, sharp-edged, entertaining, exciting space opera\".[18]James Berardinelli also gave the film three stars out of four, writing that \"2010 continues 2001 without ruining it. The greatest danger faced by filmmakers helming a sequel is that a bad installment will in some way sour the experience of watching the previous movie. This does not happen here. Almost paradoxically, 2010 may be unnecessary, but it is nevertheless a worthwhile effort.\"[19] Vincent Canby gave 2010 a lukewarm review, calling it \"a perfectly adequate though not really comparable sequel\" that \"is without wit, which is not to say that it is witless. A lot of care has gone into it, but it has no satirical substructure to match that of the Kubrick film, and which was eventually responsible for that film's continuing popularity.\"[20]2010 was nominated for five Academy Awards:[21][22]The film was also nominated for three Saturn Awards; Best Science Fiction Film, Best Costumes (Patricia Norris), and Best Special Effects (Richard Edlund).[23]2010 won the Hugo Award for Best Dramatic Presentation in 1985.[24]","box_office":"$40.4 million (North America)[3]","cinematography":"Peter Hyams","directed_by":"Peter Hyams","release_dates":"December 7, 1984 (1984-12-07)|||||","Production":"When Clarke published his novel 2010: Odyssey Two in 1982, he telephoned Stanley Kubrick, and jokingly said, \"Your job is to stop anybody [from] making it [into a movie] so I won't be bothered.\"[4] Metro-Goldwyn-Mayer subsequently worked out a contract to make a film adaptation, but Kubrick had no interest in directing it. However, Peter Hyams was interested and contacted both Clarke and Kubrick for their blessings:I had a long conversation with Stanley and told him what was going on. If it met with his approval, I would do the film; and if it didn't, I wouldn't. I certainly would not have thought of doing the film if I had not gotten the blessing of Kubrick. He's one of my idols; simply one of the greatest talents that's ever walked the Earth. He more or less said, 'Sure. Go do it. I don't care.' And another time he said, 'Don't be afraid. Just go do your own movie.'[4]While he was writing the screenplay in 1983, Hyams (in Los Angeles) began communicating with Clarke (in Sri Lanka) via the then-pioneering medium of e-mail using Kaypro II computers and direct-dial modems. The two would discuss the planning and production of the film on an almost daily basis using this method, and their informal, often humorous correspondence was published in 1984 as The Odyssey File. As it focuses on the screenwriting and pre-production process, the book terminates on February 7, 1984 just before the movie is about to start filming, though does include 16 pages of behind-the-scenes photographs from the film.[5][6]Principal photography on the film began in February 1984 for a 71-day schedule. The majority of the film was shot on MGM's soundstages in Culver City, California with the exception of a week of location work in Washington DC, Rancho Palos Verdes, California, and at the Very Large Array in New Mexico.[7] Originally, Hyams had intended to film the opening scene at the Arecibo Observatory in Puerto Rico, home of the world's largest radio telescope, but after visiting there in 1983, he told Clarke that the site was \"truly filthy\" and unsuitable for filming.[5]The special effects for 2010 were filmed on 65mm film (the live action scenes were filmed on 35mm) and, due to the differences in film size and ratio, there is a noticeable \"cut off\" area at the side of the picture during the space scenes when the film is viewed in widescreen. The effects were produced by the Entertainment Effects Group (EEG), the special effects house created by Douglas Trumbull. However, Trumbull himself did not work on the film, and the effects were supervised by Richard Edlund, who had just left Industrial Light & Magic. After completing 2010, EEG would become a part of Edlund's own effects company Boss Film Corporation.Early in the production of 2010, Hyams had learned that all of the original large spacecraft models from \"2001\", including the original 50-foot model of the \"Discovery One\", had been destroyed following the filming, as ordered by Kubrick, as had all of the original model-makers' designs for building the \"Discovery One\". Consequently, the model-makers at EEG had to use frame-by-frame enlargements from a 70mm copy of \"2001\" to recreate the original large \"Discovery One\" model. The \"Leonov\" spacecraft, as well as several of its interior crew areas and other elements of the spacecraft's advanced technology, were designed by the noted conceptual artist Syd Mead.Although computer-generated imagery (or CGI) was still in an early phase of development in 1984, the special effects team of 2010 used CGI to create the dynamic-looking cloudy atmosphere of the planet Jupiter, as well as the swarm of monoliths that engulf the planet and turn it into a Sun for the planet Europa. Digital Productions would use data supplied by the Jet Propulsion Laboratory to create the turbulent Jovian atmosphere. This was one of the first instances of what the studio would later refer to as \"Digital Scene Simulation\", a concept they would take to the next level with The Last Starfighter.In order to maintain the realism of the lighting in outer space, in which light would usually come from a single light source (in this case, the Sun), Edlund and Hyams decided that blue-screen photography would not be used for shooting the space scenes. Instead, a process known as front-light/back-light filming was used. The models were filmed as they would appear in space, then a white background was placed behind the model and the first pass was repeated. This isolated the model's outlines so that proper traveling mattes could be made. All of this processing doubled the amount of time that it took to film these sequences, due to the additional motion-control pass that was needed to generate the matte. This process also eliminated the problem of \"blue spill\", which is the main disadvantage of blue-screen photography. In this, photographed models would often have blue outlines surrounding them because a crisp matte was not always possible to achieve.Blue-screen photography was used in the scene in which Floyd uses two pens to demonstrate his plan to dock the two spaceships together for the film's climax. Initially, the scene was filmed with Roy Scheider attaching the pens to a piece of movable glass that was placed between him and the camera but this proved unworkable. Scheider then performed the scene without the pens actually being present, and the pens were filmed separately against a blue screen using an \"Oxberry\" animation stand that was programmed to match Scheider's movements.Initially, Tony Banks (keyboardist for the band Genesis) was commissioned to do the soundtrack for 2010. However, Banks' material was rejected[8] and David Shire was then selected to compose the soundtrack, which he co-produced along with Craig Huxley. The soundtrack album was released by A&M Records.Unlike many film soundtracks up until then, the soundtrack for 2010 was composed for and played mainly using digital synthesizers. These included the Synclavier by the New England Digital company and a Yamaha DX1. Only two compositions on the soundtrack album feature a symphony orchestra. Shire and Huxley were so impressed by the realistic sound of the Synclavier that they placed a disclaimer in the album's liner notes stating \"No re-synthesis or sampling was employed on the Synclavier.\"[9]Andy Summers, guitarist for the band The Police, performed a track entitled \"2010\", which was a modern new-wave pop version of Richard Strauss's Also Sprach Zarathustra (which had been the main theme from 2001: A Space Odyssey). Though Summers' recording was included on the soundtrack album and released as a single, it was not used in the film. For the B-side to the single, Summers recorded another 2010-based track entitled \"To Hal and Back\", though this appeared in neither the film nor the soundtrack album.[10][11]","produced_by":"Peter Hyams","starring":"Roy Scheider|John Lithgow|Helen Mirren|Bob Balaban|Keir Dullea|","running_time":"116 minutes[1]","music_by":"David Shire","edited_by":"James Mitchell|Mia Goldman|","Release":"2010 debuted at number two at the North American box office, taking $7,393,361 for its opening weekend.[12] It was held off from the top spot by Beverly Hills Cop, which became that year's highest grossing film in North America. During its second week, 2010 faced competition from two other new sci-fi films; John Carpenter's Starman and David Lynch's Dune,[13] but ultimately outgrossed both of them by the end of its domestic theatrical run. It finished with just over $40 million at the domestic box office and was the 17th highest grossing film in North America to be released in 1984.[14]In 1984, Marvel Comics published a 48-page comic book adaptation of the film by writer J. M. DeMatteis and artists Joe Barney, Larry Hama and Tom Palmer. It was published both as a single volume in Marvel Super Special #37[15] and as a two-issue limited series.[16]2010 was first released on home video and laserdisc in 1985, and on DVD (R1) in 1998 by MGM. The film's distribution rights were transferred to Warner Bros. in 1999. It was re-issued (with different artwork) in September 2000. Both releases are presented with the soundtrack remastered in Dolby 5.1 surround sound and in the original 2.35:1 aspect ratio, though a packaging error appears on the 2000 Warner release, claiming that the film is presented in anamorphic widescreen when, in reality, it is simply 4:3 letterboxed and not anamorphic (the MGM version of the DVD makes no such claim). The R1 and R4 releases also include the film trailer and a 10-minute behind-the-scenes featurette \"2010: The Odyssey Continues\" (made at the time of the film's production), though this is not available in other regions.The film was released on Blu-ray Disc on April 7, 2009. It features a BD-25 single-layer presentation, now in high definition 16:9 (2.40:1) widescreen with 1080p/VC-1 video and English Dolby TrueHD 5.1 Surround audio. In all regions, the disc also includes the film's original \"making of\" promotional featurette (as above) and theatrical trailer in standard definition as extras.","budget":"$28 million[2]"}