{"country":"United States","distributed_by":"New Line Cinema1","Background":"The movie is set in the fictional town of Mount Rose, Minnesota. The accents portrayed in the movie are that of the North Central American dialect found in the Midwest, notably Minnesota.[3]The film was shot throughout the Carver County area, mainly in Waconia, Minnesota, although names of real Minnesota communities were shown on the sashes of contestants later in the movie.The fictional town of Mount Rose may have been based on Montrose, Minnesota or Rosemount, Minnesota.News reporter Diane Sawyer is mentioned throughout the film as Kirsten Dunst's character Amber Atkins' idol as she was a former beauty pageant winner. Her other idol includes her beauty pageant mother that raised her alone in a trailer park and the previous years winner that is hospitalized for anorexia. Competing in the beauty pageant for a scholarship is juxtaposed against the opportunities that boys have in leaving \"Mount Rose\" such as hockey scholarships and prison.Two Melissa Manchester songs are featured in the film as songs used in the talent portion by contestants. Mary lip-syncs \"Don't Cry Out Loud\", while Janelle sings and signs \"Through the Eyes of Love\". Fanfare for the Common Man is played to introduce the parade for the rigged competition and the plight of Hank. \"Are we on Cops again?\" is used throughout the movie when the \"mockumentary\" film crew is spotted. Strauss' \"Sunrise\" inspired by Friedrich Nietzsche's Thus Spoke Zarathustra is played when the Minnesota state pageant is interrupted by the violent illness of the contestants (except for Amber) that ate shellfish.","Plot":"In 1995, Mount Rose is preparing for its annual beauty pageant. Amber Atkins (Kirsten Dunst) is an optimistic teenager who signs up to compete in the pageant so she can follow in the footsteps of her idols, Diane Sawyer, and her mother, a former contestant. Amber and her mother, Annette Atkins (Ellen Barkin), live in a small trailer near their friend Loretta (Allison Janney), in stark contrast to fellow contestant Rebecca Leeman (Denise Richards), the daughter of the richest man in town, and her mother, Gladys Leeman (Kirstie Alley), who is the head of the pageant organizing committee and also a former winner. Various business connections between the Leeman Furniture Store and the judges of the pageant cause many to speculate that the contest will be rigged or fixed.Many odd events occur around town during the run-up to the pageant, including the death of a contestant, the athletic and competitive Tammy Curry, who is killed when her tractor explodes. Amber decides to pull out of the pageant after her mother is injured in an explosion at their mobile home but reconsiders and decides to compete to follow her dreams and make her mother proud. At the dress rehearsal, fellow contestant Jenelle Betz swaps numbers with Amber. When Jenelle walks on stage at the beginning of rehearsal, a stage light falls and hits her in the head, knocking her unconscious and rendering her deaf. Luckily, Jenelle is a master of sign language so she claims that despite dropping out of the pageant, she has never been happier.At the pageant, Amber's dance costume mysteriously goes missing. Amber blames Becky and the two get into a catty fight. Amber's best friend and fellow contestant Lisa Swenson (Brittany Murphy) tears them apart. After comforting a crying Amber, Lisa drops out of the pageant in order to give her own costume to her. Amber then performs her tap-dance number to a standing ovation, while Rebecca sings a cringe-worthy rendition of \"Can't Take My Eyes Off You\" and dances with a life-size Jesus doll on a crucifix, both amusing and horrifying the audience. Amber is named first runner up to Rebecca, however, during the victory parade the next day, Rebecca is riding in an elaborate float made in Mexico and is killed in a freak accident involving gasoline and fire that causes a huge explosion. The grief-stricken Gladys flies into a blind rage and admits to killing Tammy and to being responsible for all the attempts against Amber in the run-up to the pageant, and is immediately arrested. Rebecca's tragic death and Gladys' antics leave Amber as the new pageant winner.At the State Competition, Amber wins the Minnesota American Teen Princess title by default after all the other contestants fall ill with seafood-related food poisoning, and Amber gets an all-expenses-paid trip to the national Sarah Rose American Teen Princess Pageant. Upon arrival, Amber and the other contestants are devastated to find that the company has been shut down by the IRS for tax evasion, sending all the contestants except for Amber on a rampage, vandalizing and destroying the property.A few years later, Gladys escapes from prison and is sniping from the top of the Mount Rose supermarket, declaring revenge on Amber. During the six-hour police standoff, a television reporter doing a live report at the scene is hit by a stray bullet. Amber quickly picks up her mic and takes over, impressing the news station with her poise and confidence. The film closes with Amber as co-anchor of the evening news for Minneapolis–St. Paul television station WAZB-TV, thus living her dream of possibly becoming the next Diane Sawyer.","language":"English","Reception":"The movie received a mixed to negative reception. Rotten Tomatoes gives the film a score of 45% based on 65 reviews.[4] Metacritic gives the film 28% based on reviews from 28 critics, indicating generally unfavorable reviews.[5] Many critics liked the modern interpretation of the pageant world although just as many people disliked the film as a whole. Actress Amy Adams was also praised for her performance, as well as actress Denise Richards.[6][7][8] Roger Ebert liked the idea of the film, but wrote that the script failed to translate into screenplay and is never quite funny enough, due to subtle miscalculations of production and performance.[9]The film has gained new fans with time and is now regarded as a cult film. In 2011, Allison Janney stated in an interview that she is approached by more fans of this film than for her Emmy-winning tenure on The West Wing.[10]","box_office":"$10.5 million[1]","drop_dead_gorgeous":"Theatrical release poster","cinematography":"Michael Spiller","directed_by":"Michael Patrick Jann","release_dates":"July 23, 1999 (1999-07-23)|||||","produced_by":"Gavin Palone","starring":"Kirstie Alley Ellen Barkin Kirsten Dunst Denise Richards Allison Janney Sam McMurray Mindy Sterling Brittany Murphy Amy Adams Will Sasso","running_time":"98 minutes","edited_by":"Janice Hampton","written_by":"Lona Williams","budget":"$10–15 million[1][2]"}