{"country":"United States, Germany","distributed_by":"Universal Pictures","screenplay_by":"Lizzy Weiss John Stockwell","story_by":"Lizzy Weiss","Plot":"Anne Marie (Kate Bosworth), Eden (Michelle Rodriguez), and Lena (Sanoe Lake) are best friends. They raised Anne Marie's 14-year-old sister, Penny (Mika Boorem), ever since their mother took off to Las Vegas with a boyfriend who was uncomfortable with the idea of having the two girls come along. While Penny is at school, Anne Marie, Eden, and Lena work as maids at a large resort hotel, but more importantly, they are surfers. Anne Marie rises every morning before dawn to train for her surfing comeback and was once considered a rising star in women's surfing and competed as a youth, but an extreme wipeout and near-drowning incident temporarily halted her career and left her with deep-seated fears. Her friends, especially Eden, have encouraged her to try it again.Anne Marie has been invited to join in an upcoming surf competition at the famed North Shore surf spot, Pipeline. She hopes to gain the attention of sponsors and get herself and her friends out of the near-poverty they are living in. As the Pipeline competition gets closer, she struggles to keep Penny under control and deal with her own personal issues.At work, Anne Marie meets and catches the eye of Matt Tollman (Matthew Davis), a National Football League quarterback in Hawaii for the Pro Bowl (it is hinted that he plays for the Minnesota Vikings). Matt is there with several of his rowdy teammates and instantly becomes attracted to the surfer. Through a series of \"chance\" encounters, she agrees to teach him how to surf for $150 per hour and brings Lena, Eden, and Penny along for the ride. When she goes to Matt's hotel room to get the money, they kiss as a call comes and Anne suspects that it is his wife but he promises it is his niece. Later they sleep together. Her acceptance of a non-local begins to cause friction between her and many of the young men in her surfing social circle. Anne Marie faces more problems when she and Eden argue about Anne Marie's lack of dedication to training for the Pipeline contest due to the sudden appearance of Matt. She also has to hear demeaning comments from several of the other football players' wives and girlfriends staying at the hotel about how she is undergoing the \"Matt Tollman makeover\" while attending a luau at the resort.Anne Marie confronts Matt about their situation, and soon resolves to step up her game as she finally commits herself to the Pipeline Masters. On the day of Pipeline, Anne Marie wipes out during her first heat, but advances to the next heat after narrowly beating pro surfer Kate Skarratt. She is shaken, but Matt tells her a story about his first game as an NFL quarterback and helps her regain her wavering confidence. Determined, but still afraid, Anne Marie returns to the water. Competing in the same heat is Keala Kennelly, one of the first professional female surfers, playing herself. While Keala surfs the first few sets of waves without wipe-outs, Anne Marie still has inhibitions about riding one, visions of another near-drowning incident holding her back. Keala finishes her turn, then paddles out and takes Anne Marie under her wing and encourages her to take the best wave of the day, on which Anne Marie manages to score perfectly. Although she does not advance to the next heat, she has regained her lost confidence, but more importantly, attracted the notice of sponsors, one of which includes an offer to join the Billabong women's surf team.","language":"English","Reception":"According to Rotten Tomatoes, 61% of critics thought the movie was \"fresh\" with the general consensus that \"The surfing sequences are exhilarating, but the plot is pretty forgettable and trite.\"The film opened on 3,002 screens in the United States on August 18, 2002. It grossed $14.2 million and placed 3rd that opening weekend. It went on to gross $40.4 million in the U.S., and a total of $51.8 million worldwide. The film's estimated budget was $25 million.[2] The film received mixed to positive reviews.Blue Crush was the first film to use Hawaii’s Act 221, a progressive local tax incentive that called for a 100 percent state tax credit for high-tech investments meeting the requirements for qualified high-tech business, while also allowing local investors to receive tax credits for investments in film or television productions.[3][4] Universal Studios used the legislation for the Blue Crush production, receiving approximately $16 million in a deal with local investors who, in exchange, received the film's high-tech tax credits. The agreement also involved marketing rights for the Hawaii Visitors and Convention Bureau whereby the studio would cross-promote the film and the State of Hawaii. Entertainment executive April Masini, who helped produce Baywatch Hawaii, Pacific Blue, and the Miss Universe Pageant, brought the tax incentives to the attention of Universal Studios,[5] and along with producer Adam Fields advised the state in its negotiation.[3]","box_office":"$51,843,679","cinematography":"David Hennings","production_company":"Imagine Entertainment","directed_by":"John Stockwell","blue_crush":"Theatrical release poster","release_dates":"August 16, 2002","produced_by":"Brian Grazer","starring":"Kate Bosworth Michelle Rodriguez Matthew Davis Sanoe Lake Mika Boorem","running_time":"104 minutes","music_by":"Paul Haslinger","edited_by":"Emma E. Hickox","budget":"$25 million"}