{"based_on":"Some Other Love play  by William Fairchild","country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Richard L. Breen Milt Rosen","Plot":"American couple Mike and Janet Harper (Rod Taylor and Doris Day) move to England for Mike's work, a company that deals in textiles and fashions. Mike wants them to live in a flat in the heart of London, but Janet, who is not a big-city girl, instead finds them a house thirty miles outside London in Kent, which means that Mike has to commute into town by train. For convenience, Mike often stays in one of the company's flats in town rather than go home. This commuting situation makes Janet feel even more neglected than she already did.Janet believes Mike may be having an affair with his assistant, Claire Hackett (Maura McGiveney). Janet's beliefs are fueled by the Harpers' busybody landlady, Vanessa Courtwright (Hermione Baddeley), who thinks Janet can play Mike's game by entering into an affair of her own, whether it be real or made-up. It has the potential to be real with the arrival of Frenchman Paul Bellari (Sergio Fantoni), an antiques dealer Janet hires to decorate the house. Although neither Mike nor Janet had any initial thoughts of cheating on the other, Claire and Paul may have thoughts of their own, especially when all four are thrown into one compromising position after another.[4]","language":"English","Reception":"The film had admissions of 10,730 in France.[6]","do_not_disturb":"Theatrical release poster","box_office":"$8,000,000[2]","cinematography":"Leon Shamroy","directed_by":"Ralph Levy George Marshall","release_dates":"December 22, 1965 (1965-12-22)","Production":"During filming Ralph Levy came down with a virus and George Marshall had to step in as director. This caused the film to finish behind schedule.[5]","produced_by":"Martin Melcher Aaron Rosenberg","starring":"Doris Day Rod Taylor","running_time":"102 minutes","music_by":"Lionel Newman Alexander Courage","edited_by":"Robert L. Simpson","budget":"$3.89 million[1]"}