{"based_on":"Black Narcissus  by Rumer Godden","country":"United Kingdom","distributed_by":"General Film Distributors","Plot summary":"A group of Anglican nuns travel to a remote location in the Himalayas (the Palace of Mopu, near Darjeeling) to set up a school and hospital for the local people, only to find themselves increasingly seduced by the sensuality of their surroundings in a converted seraglio high up in the mountains, and by the local British agent Mr Dean (David Farrar). Clodagh (Deborah Kerr), the Sister Superior, is attempting to forget a failed romance at home in Ireland. Tensions mount as Dean's laid-back charm makes an impression on Clodagh, but also attracts the mentally unstable Sister Ruth (Kathleen Byron), who becomes pathologically jealous of Clodagh, resulting in a nervous breakdown and a violent climax. In a subplot, 'the Young General' (Sabu), heir to the throne of a princely Indian state who has come to the convent for his education, becomes infatuated with Kanchi, a lower caste dancing girl (Jean Simmons).While much of the film's dialogue is taken verbatim from the novel, the film does not follow the novel exactly. In particular the film does not include Mr Dean's rejection of Sister Clodagh's design for the chapel, in favour of his own design of an open-sided building without door, located at the top of the ridge, above the Holy Man. Additionally, (the imminently departing) Sister Philippa is not replaced by Sister Adela, a stern nun who is horrified at the dereliction of duty by the original nuns.","Critical response and influence":"Black Narcissus achieved acclaim for its pioneering technical mastery and shocked audiences at the time of release with its vibrant colour and the themes of the film. Audiences gasped at some of the scenes, notably the shot of the vibrant pink flowers, which shown on the big screen was a spectacle at the time.[13] The film's clever use of lighting and techniques have had a profound impact on later film makers, notably Martin Scorsese who used the extreme close-ups of the nuns for Tom Cruise's character around the pool table in Color of Money.[13] Martin Scorsese has said that the film is one of the earliest erotic films, in the last quarter of the film in particular.[13] The film was one of his favourites as a boy, and Scorsese has stated that one of the greatest experiences he has had with film is viewing Black Narcissus projected on a massive screen at the Director's Guild in 1983. In Michael Powell's own view this was the most erotic film he ever made. \"It is all done by suggestion, but eroticism is in every frame and image from beginning to end. It is a film full of wonderful performances and passion just below the surface, which finally, at the end of the film, erupts\".In The Great British Picture Show, the writer George Perry stated, \"Archers films looked better than they were – the location photography in Technicolor by Jack Cardiff in Black Narcissus was a great deal better than the story and lifted the film above the threatening banality\". In contrast, the critic Ian Christie wrote in the Radio Times in the 1980s that \"unusually for a British film from the emotionally frozen forties the melodrama works so well it almost seems as if Powell and Pressburger survived the slings and barbs of contemporary criticism to find their ideal audience in the 1980s\".[14] Marina Warner, introducing the film on BBC2 (on a nun-themed film evening, with Thérèse), called it a masterpiece:The suggestions continually hover on the brink of hyperbole. The film achieves its extraordinary impact by daring so much against all bounds of decorum, far in excess of realism. The crimson lipstick Sr. Ruth applies turns her into a kind of werewolf, the kittenish wiles of Jean Simmons also convey, in a different mode, a fantasy of female sexual appetite. The crazed and sometimes cruel flapping of Angu Ayah adds yet another flourish to the portrait of female hysteria. In this convent, this house of women, all the women are mad. [...] Again and again Powell submits Sr. Clodagh to visitants from the world of chaos and passion she has foresworn in order to touch her, shake her, break her down. First and foremost David Farrar's Mr. Dean, all bare, hairy legs, insolence and roguish eyes, erupts into her convent, the spirit of maleness embodied. The holy father in the grounds issues a mute challenge to her faith. Luxury, desire, pleasure, humiliation all thrust in upon her in the forms of the young General with his emeralds and perfumes, and of Kanchi, the young Jean Simmons in dark panstick with a jewel in her nose, and Kathleen Byron's famous pent up, ravening portrayal of Sr. Ruth finally holds up a mirror of the abyss into which Sr. Clodagh too might fall, and indeed only just escapes in more ways than one. As in Clarissa, Samuel Richardson's classic novel about prolonged seduction and embattled virtue, Powell pits the chaste and steely Deborah Kerr against all these assailants and watches her thrash about with relish. While Lovelace had to rape Clarissa to achieve his end, Powell only has to show that Mr. Dean was right and Sr. Clodagh was mistaken. The ending of Black Narcissus vindicates the world against the cloister, libido against superego, male against female.","Awards and honours":"The filmmakers were recognised with several awards for their work on Black Narcissus:[16]","screenplay_by":"Michael Powell Emeric Pressburger","language":"English","black_narcissus":"Poster","cinematography":"Jack Cardiff","directed_by":"Michael Powell Emeric Pressburger","Home media":"A DVD was released in the UK on 26 September 2005. A restored version was released on Blu-ray in the UK on 23 June 2008 by ITV DVD. It is also available in Region 1 DVD from the Criterion Collection, who released a Blu-ray version on 20 July 2010.[15]A Blu-ray was released in the UK from Network Distributing on 14 July 2014 [1]","release_dates":"26 May 1947 (1947-05-26)|||||","Production":"Of the three principal Indian roles, only the Young General was played by an ethnic Indian; the roles of Kanchi and the Old General were performed by white actors in makeup. The role of Kanchi was a change indeed for 'the demure Miss Simmons.' Kanchi, 17, is described by Rumer Godden as \"a basket of fruit, piled high and luscious and ready to eat. Though she looks shyly down, there is something steady and unabashed about her; the fruit is there to be eaten, she does not mean it to rot.\" On landing the part Simmons told her mother she had been given a part in which she had to have 'oomph'.[5] The Indian extras were cast from workers at the docks in Rotherhithe.[6]The film was made primarily at Pinewood Studios, but some scenes were shot in Leonardslee Gardens, West Sussex, the home of an Indian army retiree which had appropriate trees and plants for the Indian setting.[7][8] The film makes extensive use of matte paintings and large scale landscape paintings to suggest the mountainous environment of the Himalayas, (credited to W. Percy Day) as well as some scale models for motion shots of the convent. Powell said later, 'Our mountains were painted on glass. We decided to do the whole thing in the studio and that's the way we managed to maintain colour control to the very end. Sometimes in a film its theme or its colour are more important than the plot.'For the costumes, Alfred Junge, the art director, had three main colour schemes. The nuns were always in the white habits that he designed from a medley of medieval types. These white robes of heavy material stressed the nuns' other-worldliness amid the exotic native surroundings. The chief native characters were robed in brilliant colours, particularly the General and his young nephew, in jewels and rich silks. Other native characters brought into the film merely as 'atmosphere' were clad in more sombre colours, with the usual native dress of the Nepalese, Bhutanese and Tibetan peoples toned down to prevent overloading the eye with brilliance.According to Robert Horton, Powell set the climactic sequence, a murder attempt on the cliffs of the cloister, to a pre-existing musical track, staging it as though it were a piece of visual choreography. Also, on a note of personal tension that existed behind-the-scenes, was the fact that Kerr was the director's ex-lover, and Byron his current one. \"It was a situation not uncommon in show business, I was told,\" Powell later wrote, \"but it was new to me.\"The version of the film originally shown in the United States had scenes depicting flashbacks of Sister Clodagh's life before becoming a nun edited out at the behest of the Catholic Legion of Decency.[9][8]Originally, the film was intended to end with an additional scene in which Sister Clodagh sobs and blames herself for the convent's failure, to Mother Dorothea. Mother Dorothea touches and speaks to Sister Clodagh welcomingly as the latter's tears continue to fall. When they filmed the scene with the rainfall on the leaves in what was to have been the penultimate scene, Powell was so impressed with it that he decided to designate that the last scene and to scrap the Mother Dorothea closing scene. It was filmed but it is not known whether it was printed.[10]","Box office":"According to trade papers, the film was a \"notable box office attraction\" at British cinemas in 1947.[12]","produced_by":"Michael Powell Emeric Pressburger","starring":"Deborah Kerr Sabu Jean Simmons David Farrar Flora Robson","running_time":"100 minutes","music_by":"Brian Easdale","edited_by":"Reginald Mills","Historical context":"Black Narcissus was released only a few months before India achieved independence from Britain in August 1947. Film critic Dave Kehr has suggested that the final images of the film, as the nuns abandon the Himalayas and proceed down the mountain, could have been interpreted by British viewers in 1947 as 'a last farewell to their fading empire'; he suggests that for the filmmakers, it is not an image of defeat 'but of a respectful, rational retreat from something that England never owned and never understood'.[11] The story in the film quite closely follows that of the book, which was written in 1939.","budget":"£280,000 (or $1.2 million[1])"}