{"based_on":"Brighton Rock 1938 novel  by Graham Greene","country":"United Kingdom","distributed_by":"Charter Film Productions","Plot":"This drama film centres on a gang of assorted criminals led by a psychopathic teen-aged hoodlum known as \"Pinkie.\" The film's real-life theme was the race-track gangs of the 1930s, which fought public battles with straight razors in their competition to control crime at racecourses in southern England. One of these racecourses was at Brighton, a popular seaside resort.Greene and Terence Rattigan wrote the screenplay for the 1947 film adaptation, produced and directed by John and Roy Boulting, with assistant director Gerald Mitchell. The climax of the film takes place at the Palace Pier, which differs from the novel, the end of which takes place in the nearby town of Peacehaven.In the story, Pinkie is the strong arm for a small gang that operates at Brighton's race track. After a newspaper reporter named Fred writes a story that gets the gang leader killed by rivals, Pinkie takes over leadership and tracks Fred down, murdering him on an amusement park ride. The police think it a heart attack or suicide. But Pinkie still wants to cover his tracks and gets one of his gang members, Spicer, to take care of the matter. But Spicer accidentally leaves a clue that could unravel the murder—a clue that a waitress named Rose discovers. So Pinkie murders Spicer. He also courts and marries Rose so she can’t testify against him. But then, with self-appointed amateur sleuth Ida Arnold asking a lot of questions about Fred's murder, and the larger rival gang taking over racetrack racketeering, Pinkie decides he needs to kill Rose, too, before leaving town. So he convinces her that he will soon be caught and go to the gallows, and therefore the two should commit suicide together. He gives Rose a gun with which to kill herself, promising he’ll kill himself next. Out of love for Pinkie she reluctantly agrees and almost follows through. But a member of Pinkie's gang turns on him and helps the police stop her just in time before Pinkie commits suicide by throwing himself off the pier. But afterwards Rose persists in believing that Pinkie really loved her.","language":"English","Reception":"At the time of its release, Brighton Rock received critical acclaim. The film currently scores 100% on Rotten Tomatoes.Trade papers called the film a \"notable box office attraction\" in British cinemas in 1948.[4]The film was banned in New South Wales.[5]","box_office":"£190,147 (UK)[1]","cinematography":"Harry Waxman","directed_by":"John Boulting","Revival":"The original film had a run at Film Forum in New York City 19–26 June 2009, and The New York Times previewed the revival, saying \"both [Greene's] Catholicism and his movie-friendliness are in full cry in John Boulting's terrific 1947 gangster picture.\"[8]","release_dates":"December 1947","produced_by":"Roy Boulting","starring":"Richard Attenborough Hermione Baddeley William Hartnell Carol Marsh","running_time":"92 min","New adaptation":"A new adaptation of the novel, written and directed by Rowan Joffé, was released in the United Kingdom on 4 February 2010. Joffe has moved the setting from the 1930s to the 1960s, during the mods and rockers era.[6][7]","music_by":"Hans May","edited_by":"Peter Graham Scott","written_by":"Graham Greene Terence Rattigan"}