{"country":"United States","easy_a":"Theatrical release poster","distributed_by":"Screen Gems","Plot":"Olive Penderghast, a 17-year-old girl living in Ojai, California lies to her best friend Rhiannon Abernathy about going on a date in order to get out of camping with Rhiannon's hippie parents. Instead, she hangs around the house all weekend listening to Natasha Bedingfield's \"Pocketful of Sunshine\", which is played by a greeting card she was sent. The following Monday, pressed by Rhiannon, Olive lies about losing her virginity to a college guy. Marianne Bryant, a prissy and strictly religious Christian at their school, overhears her telling the lie and soon it spreads like wildfire. The school's conservative church group run by Marianne decides Olive will be their next project. Olive confides the truth to her friend Brandon, and he explains how others bully him because of his homosexuality. He later asks Olive to pretend to sleep with him so that he will be accepted by everyone as a 'straight stud'.Brandon convinces Olive to help him and they pretend to have sex at a party. After having a fight with Rhiannon over Olive's new identity as a \"dirty skank\", Olive decides to counteract the harassment by embracing her new image as the school tramp. She begins to wear more provocative clothing and stitches a red \"A\" to everything she wears. Boys who usually have had no luck with girls in the past beg Olive to say they have had sex with her in order to increase their own popularity, in exchange for gift cards to various stores, in turn increasing her reputation. Things get worse when Micah, Marianne's 22-year-old boyfriend, contracts chlamydia from sleeping with Mrs. Griffith, the school guidance counsellor, and blames it all on Olive. Olive agrees to lie to cover up the affair so that the marriage of her favorite teacher, Mr. Griffith, would be spared.Marianne's religious clique, which now includes Rhiannon, begins harassing Olive in order to get her to leave school. After an ill-fated date with Anson, a boy who wants to pay her to actually sleep with him and not just pretend she did, Olive reconnects with Todd, her old crush, who is also the school's mascot. Todd then tells her that he does not believe the rumors because he remembers when she lied for him when he was not ready for his first kiss years ago. Olive then begins to ask everyone she lied for to help her out by telling the truth, but Brandon and Micah have abruptly left town and everyone else is enjoying their newfound popularity and do not want the truth to get out. Mrs. Griffith also refuses to tell the truth and when Olive threatens to expose her, Mrs. Griffith rebuffs her, saying no one would believe her.Olive, out of spite, then immediately tells Mr. Griffith, who believes her and separates from Mrs. Griffith. After a friendly talk with her eccentric, open-minded mother Rosemary, Olive comes up with a plan to get everything finally out in the open. She then does a song and dance number at a school pep rally to get people's attention to watch her via web cam, where she confesses what she has done (the web cam is the framing device of the film). The various boys whose reputations Olive helped improve are also shown watching. Later, Olive texts Rhiannon, apologizing for lying to her. When she is finishing up her web cast, Todd comes by riding a lawnmower and tells her to come outside. She signs off by saying she may lose her virginity to Todd, and proudly declares it's nobody's business (much to Marianne's disgrace). She goes outside to meet him, they kiss and the two are shown riding off on the lawnmower.","language":"English","Reception":"The film opened on September 17, 2010 and grossed $6,787,163 on its opening day and $17,734,040 in its opening weekend, placing second behind The Town on both figures, and already making back more than double the film's slim $8 million budget. This was in line with expectations from Sony of an opening weekend take of around $15 million.[2] The film has grossed a total of $58,401,464 in the United States and Canada plus $16,550,841 in international markets for a worldwide total of $74,952,305, earning its budget back more than nine times, making it a huge financial success.[3]The film received very positive reviews from critics, with many praising Stone's performance. Review aggregation website Rotten Tomatoes gives the film a \"Certified Fresh\" rating of 85% based on 175 reviews, with an average score of 7.1/10 and the consensus being, \"It owes a huge debt to older (and better) teen comedies, but Easy A proves a smart, witty showcase for its irresistibly charming star, Emma Stone.\"[10] Another review aggregator, Metacritic, assigned the film a weighted average score of 72 based on 34 reviews from mainstream critics, indicating \"generally favorable reviews\".[11] In his review, Chicago Sun-Times film critic Roger Ebert awarded the film three and a half out of four stars, writing, \"Easy A offers an intriguing middle ground to the absolute of sexual abstinence: Don't sleep with anybody, but say you did. It's a funny, engaging comedy that takes the familiar but underrated Emma Stone and makes her, I believe, a star.\"[12] Richard Corliss of Time Magazine named Emma Stone's performance one of the Top 10 Movie Performances of 2010, saying \"Stone lends winning maturity and a gift for making sassy dialogue sound natural. This 22-year-old is an actress-personality — a star — around whom Hollywood could build some pretty good movies\".[13] John Griffiths from Us Weekly gave the film two and a half stars out of four; he praised Stone, stating that \"With her husky voice and fiery hair, Stone is spectacular, echoing early Lindsay Lohan\", but also added that \"The story is thin, and the laughs meager\".[14]","box_office":"$75 million[3]","cinematography":"Michael Grady","production_company":"Olive Bridge Entertainment","directed_by":"Will Gluck","Soundtrack":"The soundtrack was released by Madison Gate Records on September 14, 2010 and is available via iTunes. It features tracks from Jessie J, Lenka, Natasha Bedingfield, Kardinal Offishall, and Cary Brothers. Other songs in the film but not on the soundtrack album are from OneRepublic, The Dollyrots, Death Cab for Cutie, and The Pussycat Dolls.[21]","release_dates":"September 11, 2010 (2010-09-11) (TIFF)|September 17, 2010 (2010-09-17) (United States)||||","Production":"Screenwriter Bert V. Royal claims to have written the entire screenplay, except for the last ten pages, in five days.[4] Royal's plan was to adapt three classic works into films and to set them at the same high school, so that some characters would appear in multiple films. Besides The Scarlet Letter, which was the source material for Easy A, Royal wanted to adapt Cyrano de Bergerac and The Mystery of Edwin Drood.[4] Natasha Bedingfield's song \"Pocketful of Sunshine\", which becomes a running joke in the film, was not in Royal's original script. He envisioned \"Olive\", a track from Ken Nordine's 1966 album Colors, to play during Olive's weekend montage (which introduces the song).[4] Gluck's favorite film is Ferris Bueller's Day Off and has multiple homages to it in the film (Olive's shower Mohawk, \"never had one lesson\"), among many other John Hughes references.[5] According to Royal, although the word \"fuck\" appeared 47 times in the original draft, which was written as an R-rated comedy, all occurrences were cut from the final film. However, director Will Gluck shot two versions of many scenes, both with and without the coarser language.[4] Although the film was cut down for a wider audience, the film still obtained a 15 rating in the United Kingdom.[6]Gluck credits Stone with improvising the line about being a \"Gossip Girl in the Sweet Valley of Traveling Pants\".[7] The entire film was shot in Ojai, California using the Panavision's Genesis and later filmized. Not a single film set was used; even the houses in the film belong to Ojai residents. The school used as \"Ojai North High School\" in the film is Nordhoff High School, also located in Ojai, California.","produced_by":"Zanne Devine|Will Gluck|","starring":"Emma Stone|Penn Badgley|Amanda Bynes|Dan Byrd|Thomas Haden Church|Patricia Clarkson|Cam Gigandet|Lisa Kudrow|Malcolm McDowell|Aly Michalka|Stanley Tucci|","running_time":"92 minutes[1]","music_by":"Brad Segal","edited_by":"Susan Littenberg","Release":"Easy A had its world premiere at the 2010 Toronto International Film Festival.[8]Easy A was released on DVD and Blu-ray Disc on December 21, 2010.[9] The DVD features a gag reel, Emma Stone's audition footage, an audio commentary with director Gluck and Stone, and previews. Blu-ray exclusive bonus features include: The Making of Easy A, The School of Pop Culture: Movies of the '80s, Vocabulary of Hilarity and a trivia track.","written_by":"Bert V. Royal","budget":"$8 million[2]"}