{"based_on":"Deadpool  by Fabian Nicieza Rob Liefeld","Cast":"Additionally, Karan Soni portrays Dopinder, a taxi driver,[26] and Jed Rees portrays a Weapon X recruiter.[13] X-Men co-creator Stan Lee and Deadpool co-creator Rob Liefeld make cameo appearances as a strip club MC and a patron of Weasel's bar, respectively.[27][28] Rob Hayter briefly appears as Bob, a recurring character alongside Deadpool's comic appearances.[28] The film does not reference Bob's comic history as an agent of Hydra, due to rights issues with Marvel Studios.[29]","country":"United States","distributed_by":"20th Century Fox","deadpool":"Theatrical release poster","Plot":"Wade Wilson, a former Special Forces operative moonlighting as a mercenary in New York City, meets an escort named Vanessa at a local bar. What begins as a one-night stand blossoms into a relationship, and after a year Wilson proposes to Vanessa. Shortly after she accepts, Wilson is diagnosed with terminal cancer. While Vanessa remains loyal, Wilson abandons her, not wanting her to see him wither and die.\"Agent Smith\", a recruiter from a covert organization, approaches Wilson with the opportunity to become a superhero, promising abilities that will cure Wilson's cancer. Wilson accepts the offer and is taken to a remote laboratory where he meets Ajax and Angel Dust. Ajax injects a mutation-activating serum into Wilson and subjects him to daily torture to prompt a mutation. Annoyed with the lack of results and Wilson's defiant attitude, Ajax seals him in an oxygen chamber, which periodically asphyxiates and resuscitates him. Wilson develops an accelerated healing ability, but suffers burn-like scars over the entirety of his body. Ajax reveals to Wilson the true purpose of the laboratory is to create mutants to sell to wealthy clients as slaves. Wilson escapes and battles Ajax, who mocks Wilson with promises of curing his disfigurement, before escaping.Wilson escapes the laboratory and attempts to return to Vanessa, but leaves, afraid of her reaction to his appearance. After consulting his best friend Weasel, Wilson begins tracking down Ajax to cure his disfigurement. He becomes a masked vigilante \"Deadpool\" and resides with an elderly blind woman, Al. Following a string of leads, Wilson tracks Ajax to a convoy of cars on an expressway. He destroys the convoy and corners Ajax, demanding the cure he hinted at, but is interrupted by Colossus and Negasonic Teenage Warhead, who attempt to recruit Wilson into the X-Men. Ajax escapes, and angered by their meddling, Wilson abandons Colossus and Negasonic.Ajax and Angel Dust travel to Weasel's bar and learn about Vanessa. Weasel warns Wilson that Vanessa is in danger, and together they go to the strip club where Vanessa works. Ajax and Angel Dust lure Vanessa into an alley and abduct her, and contact Wilson, demanding he meet them at a decommissioned helicarrier in a scrapyard. Wilson contacts Colossus and Negasonic, and persuades them to help him. The trio travel to the scrapyard and do battle with Ajax, Angel Dust, and their team of mercenaries. As Colossus and Negasonic battle Angel Dust, Wilson kills the mercenaries and battles Ajax atop the helicarrier. During their battle with Angel Dust, Colossus and Negasonic accidentally destroy the equipment stabilizing the helicarrier, tipping it over and scattering Ajax and Wilson across the yard. As Colossus carries Negasonic and Angel to safety, Wilson saves Vanessa and beats Ajax into submission. Wilson demands his cure, and Ajax reveals there is none. Wilson kills him in response. Angry with Wilson for abandoning her, Vanessa reconciles with him upon understanding why he stopped seeing her.In a post-credits scene, Deadpool announces a sequel featuring Cable.","language":"English","Reception":"Deadpool grossed $363.1 million in North America and $417.4 million in other territories for a worldwide total of $780.5 million, against a budget of $58 million.[4] Worldwide, it is the fifth highest-grossing film of 2016,[92] the highest-grossing R-rated film of all time (surpassing The Matrix Reloaded's $742 million),[93][94] the highest-grossing X-Men film (surpassing X-Men: Days of Future Past's $747.9 million),[95] and the highest grossing Century Fox film not directed by James Cameron or George Lucas.[96] It had a worldwide opening of $264.9 million from 62 markets, which was the biggest of 2016 (now the third biggest), the biggest for an R-rated film, and the second biggest for Fox, only behind Star Wars: Episode III – Revenge of the Sith ($303.9 million).[97][98] It recorded the biggest IMAX 2D worldwide opening of all time with $27.4 million from 606 IMAX theaters, eclipsing The Dark Knight Rises ($23.8 million).[99][100] The film became a massive box office blockbuster hit and a very profitable production for the studio, a surprise to some considering that the film was rated R, was not released in China, and was only shown in 2D and IMAX format in contrast to most superhero films also shown in 3D.[93][101]In the United States and Canada, pre-release tracking originally suggested the film would open to $55–65 million from 3,557 theaters in its opening weekend, and up to $75 million over the four-day Presidents' Day weekend, outstripping the projections for fellow newcomers Zoolander 2 and How to Be Single. Tracking also showed that the film would do well with both males and females.[107] However, once the film approached its opening day, estimates rose to as high as a $100+ million three-day opening, and going as high as a $120 million for the four-day opening.[108][109] However, Fox was being conservative, projecting a three-day opening similar to other superhero movies such as Guardians of the Galaxy ($94.3 million) and Captain America: The Winter Soldier ($95 million).[110] The film has the added benefit of playing across 374 IMAX screens and 475 premium large format screens.[2] It made $12.7 million from its Thursday night previews from 2,975 theaters, setting records for the biggest R-rated and February previews, beating The Hangover Part II ($10.4 million) and Fifty Shades of Grey ($8.6 million), respectively.[111][112] Of that, $2.3 million came from IMAX showings, for a per screen average of $6,200, which is the sixth biggest IMAX preview ever.[111] This broke the record for the biggest February IMAX preview and the biggest R-rated IMAX preview.[112]Buoyed by good word of mouth, it exceeded expectations on its opening day, earning $47.4 million, breaking the records for the biggest R-rated opening day and the biggest February opening day. It also became the biggest R-rated single day and the second-biggest opening and single day ever for a 20th Century Fox film, behind the $50 million Thursday debut of Star Wars: Episode III – Revenge of the Sith.[113] 14% of its Friday gross came from PLF screens, which grossed $6.4 million, of which Cinemark XD made $1.6 million.[114] While some films witness a drop of at least a third in their second day, Deadpool dropped just -10% on its second day, to $42.61 million,[114] and rose +0.2% on its third day ($46.68 million).[115] Earning a total of $132.4 million in its opening weekend, it broke the record for the biggest R-rated opening of all time, the biggest February opening, the biggest opening for Fox, and the biggest opening of Reynolds' career.[116] PLF screens represented 13% or $17.6 million of that gross from 465 screens, a new record.[114] Furthermore, it scored the second biggest opening ever for the first installment of a superhero property, behind Disney/Marvel's The Avengers ($207.4 million), the second biggest non-sequel opening, behind The Hunger Games ($152.5 million),[117] or third biggest if Marvel's The Avengers is included,[118] the third biggest pre-summer season (which starts in May) opening, behind The Hunger Games ($152.5 million) and Furious 7 ($147.2 million),[114] the fifth-biggest for a Marvel property film,[119] the seventh-biggest comic book adpatations opening,[120] and the eighth-biggest long holiday opening (irrespective of the number of days with four days in terms of Deadpool).[118] It became the 36th film to open above $100 million, and is the first R-rated film to do so.[113]It is also the earliest film in a year to open with over $100 million. The previous record holder Alice in Wonderland opened with $116.1 million in the first weekend of March 2010.[121] $18.4 million came from 374 IMAX plays, setting records for February as well as for R-rated openings. This is also the biggest 2D IMAX opening, behind The Dark Knight Rises and the fourth biggest of all time.[100][114] Males comprised a bulk of the audience demographics during its opening weekend, with 62%, while females comprised 38%, with 47% of the audience being under the age of 25.[100] For its 4-day President's Day weekend, it earned $152.19 million, breaking records for the biggest 4-day President's Day opening as well as single weekend gross, breaking the $93 million made by Fifty Shades of Grey in 2015.[122] Its four-day holiday opening weekend alone made it the biggest R-rated comic book superhero movie (surpassing Wanted), the biggest R-rated costumed superhero comic book movie (surpassing Watchmen), and the second biggest R-rated comic book adaptation of all time (behind 300).[118][120] It also did exceptionally well in IMAX and premium large formats screens, with 31% or $46.9 million (of the $152.1 million) coming from the said formats. It earned around $27.4 million (18%) in IMAX and about $19.5 million (13%) in PLF auditoriums.[117]Following its record breaking openings, Deadpool scored the biggest February Monday by earning $19.76 million,[123] and the biggest February Tuesday ever with $11.56 million (breaking The Vow's record)[123] and in just five days surpassed the lifetime total of X-Men, X-Men: First Class and The Wolverine,[124] and in one week surpassed X-Men Origins: Wolverine.[125] On its ninth day of release, it passed the $200 million mark, becoming the fastest R-rated film to cross that mark. By comparison, the previous record holder The Matrix Reloaded took 11 days.[126][127][128] It topped the box office for the second weekend after falling by 57.4% to $56.4 million from 3,722 theaters (an additional 164 theaters from its opening amount) and scored the second-biggest second weekend gross for an R-rated film, only behind the $64.6 million second weekend of American Sniper.[129] The 57.4% drop was in line with the 59.4% drop of Avengers: Age of Ultron,[129] and the 59.8% drop of The Matrix Reloaded.[130] In just ten days, it became the highest-grossing X-Men film (surpassing X-Men: The Last Stand) as well as becoming the highest-grossing R-rated comic book film of all-time (beating 300).[129] By its second weekend, Forbes reported that the film was on pace to dethrone The Passion of the Christ ($370 million) as the highest-grossing R-rated film of all time as it was already $74.8 million ahead of The Passion of the Christ.[131] It was able to top the box office for the third weekend in a row after adding $31.5 million from 3,856 theaters (an additional 134 theaters from its second weekend amount),[132][133] before being dethroned by Zootopia and London Has Fallen in its fourth weekend.[134][135] On March 5, its twenty-third day of release, it became the third R-rated film to pass $300 million in ticket sales and the fifty-seventh film overall.[136]Outside North America, Deadpool was released in a total of 80 countries.[78] It began its international rollout on February 9 in Hong Kong and expanded to 7 additional markets on February 10, where it earned $12 million.[78] The Hollywood Reporter called it \"no small feat\" considering that it is the first Marvel superhero film to be rated R.[137] On its opening day – which varies among different countries – it had the biggest Fox opening day ever for a 15-rated movie, the 5th highest opening day for a Marvel film, the biggest IMAX Wednesday opening ever (behind Spectre) in the United Kingdom and Ireland ($3.4 million),[78] the biggest February opening of all time in Australia ($2.1 million), the biggest Fox opening day ever, the biggest IMAX opening of all time in Taiwan, with $1.4 million ($1.7 million including previews), Fox's biggest Chinese New Year single day ever in Hong Kong ($650,000), the biggest opening day ever for an R-rated film in the Philippines ($357,000), the biggest superhero opening day ever in Belgium ($270,000), and Fox's biggest opening day ever for an M18 rated film in Singapore ($205,000).[78] Through Sunday, February 14, it earned an opening-weekend total of $132.1 million from 61 countries (which is 80% of its total international marketplace), and opened at No. 1 in 59 of them, with the exceptions of Poland and Malaysia (behind The Mermaid). It scored the second biggest R-rated international opening weekend of all time, only behind the $156 million opening of Fifty Shades of Grey.[138] IMAX comprised $7.9 million of the weekend's gross from 232 IMAX screens, with records set for the biggest February and R-rated openings in numerous markets, including Hong Kong, Taiwan, the Netherlands, Sweden, France, and the UK.[138] It fell 47% in its second weekend, after adding 17 new markets for a total of $84.7 million from 77 markets and opening at No. 1 in all the newly added markets.[139] It topped the box office outside of North America for three consecutive weekends,[140] before slipping to No. 3 behind Ip Man 3 and Zootopia in its fourth weekend.[141]It had the biggest opening for the studio in 13 markets including Australia, Taiwan, Brazil, Hong Kong, and Malaysia, the biggest R-rated (or equivalent) opening weekend of all time in 11 markets, and the biggest February opening in the United Kingdom, Ireland, and Australia.[138] Its highest international tallies were witnessed in the United Kingdom and Ireland ($20.2 million), Mexico ($18.7 million), Russia ($13.1 million), South Korea ($11.9 million), Australia ($10.65 million), France ($8.9 million), Taiwan ($8.18 million), Germany ($7.3 million), Brazil ($6.3 million), Hong Kong ($3.9 million), Spain ($3.87 million), Italy ($3.39 million) and the Philippines ($3 million).[138][139][142] In the UK, Ireland and Malta, it earned £13.73 million ($20.2 million) in its opening weekend from 543 screens, including £3.76 million ($5.3 million) from previews, which is the biggest debut ever for a film released in February. This is on par with the £13.71 million ($19.5 million) opening of Iron Man 3 in 2013.[138][143] In Russia and the CIS, it scored the biggest opening weekend of all time, with $13.1 million on an estimated 1,119 screens, breaking the previous record set by Star Wars: The Force Awakens two months prior.[138][144] It topped the UK,[145] Germany, and Brazil box office for three consecutive weekends[140] and Australian box office for four consecutive weekends.[141] In terms of total earnings, its largest markets are the UK and Ireland ($53.5 million), Australia ($28.9 million) and France ($28.2 million).[146][147] It opened in its last market, Japan on June 3, 2016[139] and scored the biggest X-Men opening there with $6.5 million.[148]Deadpool received generally positive reviews from both critics and audiences.[149] Review aggregator website Rotten Tomatoes gives the film a rating of 84%, based on 264 reviews, with an average rating of 6.9/10. The site's critical consensus reads, \"Fast, funny, and gleefully profane, the fourth-wall-busting Deadpool subverts the superhero film formula with wildly entertaining – and decidedly non-family-friendly – results.\"[150] Metacritic, another review aggregator, assigned the film a weighted average score of 65 out of 100, based on 49 critics, indicating \"generally favorable reviews\".[151] Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale.[152] PostTrak demographic polling of North American audiences showed that the film's audience was 64% male. 90% of men and 86% of women polled gave the film a positive score.[153]Peter Travers of Rolling Stone said the film is \"party time for action junkies\" and that Reynolds may have found the role that defines his career.[154] In his review for TheWrap, Alonso Duralde called Deadpool \"a funny, bloody comedy [that] is the Marvel Universe's biggest breath of fresh air since Guardians of the Galaxy\", praising it, among other things, for its self-aware wit.[155] Christy Lemire also praised the film for being \"beyond meta\" and \"up its ass and back out its own mouth again\".[156] Conversely, Richard Roeper of the Chicago Sun-Times gave the film 2.5 out 4 stars, praising Reynolds' performance but saying the film gets bogged down by its origin story, and all too often becomes like the films it spoofs.[157] Kenneth Turan of the Los Angeles Times found the movie lacking, noting that protagonist \"is not an individual who wears particularly well\" and that the jokes \"eventually get wearing, but Reynolds is quite good at [them]\". He also commended Baccarin on her performance but ultimately noted that the movie is \"rife with standard-issue elements.\"[158] In 2016, The Hollywood Reporter ranked the film 13th on their \"All 44 Marvel Movies Ranked Best to Worst\" list.[159]","box_office":"$780.6 million[4]","cinematography":"Ken Seng","directed_by":"Tim Miller","production_companies":"TSG Entertainment Marvel Entertainment Kinberg Genre The Donners' Company","Music":"Junkie XL, under his legal name Tom Holkenborg, composed the score for Deadpool, using synthesizers made popular in the 80s that \"were perceived as very serious [at the time, but] now, in hindsight, when you play them back, they're very funny.\" For Deadpool's primary 'riffs', Holkenborg utilizes the ARP 2600 synth and a Synclavier, while an Oberheim was used for emotionally-focused scenes. A complete orchestra was used for the X-Men to give them a \"noble\" feeling and to honor the previous X-Men films.[69] The film's soundtrack also incorporates several songs, including \"Deadpool Rap\" by YouTube personalities TeamHeadKick, inspired by the 2013 video game, but was revised to fit the movie's events instead.[70] The soundtrack album was released digitally on February 12, 2016, and physically through Milan Records, on March 4, featuring both Holkenborg's score and songs from other artists that are used in the film.[71]On April 27, a secondary soundtrack was released titled, Deadpool Reloaded: More Music From the Motion Picture which featured more tracks and remixes.[citation needed]","release_dates":"February 8, 2016 (2016-02-08) (Le Grand Rex)|February 12, 2016 (2016-02-12) (United States)||||","Production":"\"There's definitely a sort of overall plan that we've all been talking about for the X-Men universe now, and Deadpool obviously fits into that. So yeah, I guess I would say it's part of certainly an overall timeline and thought process that goes into these films.\"Artisan Entertainment announced a deal with Marvel Entertainment to coproduce, finance, and distribute a film based on Deadpool in May 2000,[31] while New Line Cinema attempted to produce a Deadpool film in February 2004, with David S. Goyer working on the script and Ryan Reynolds in the title role;[32][33] Reynolds became interested in the character after discovering that Deadpool refers to his own appearance as \"Ryan Reynolds crossed with a Shar-Pei\" in Cable & Deadpool.[34][35] By August, Goyer lost interest in favor of other projects.[36] In March 2005, after New Line put Deadpool in turnaround, 20th Century Fox became interested in the project.[37]Fox began moving on a Deadpool spin-off early in the development of X-Men Origins: Wolverine, which had Reynolds as Deadpool in its cast,[32] and after the opening weekend success of that film announced that it was lending Deadpool out to writers, with Lauren Shuler Donner producing the project.[38] Donner wanted the film to reboot the character of Deadpool, ignoring the version in X-Men Origins: Wolverine and including attributes that the character has in the comics, such as breaking the fourth wall.[39] Rhett Reese and Paul Wernick were hired to write the script in January 2010,[40] and in a month an early draft leaked online,[41] garnering a positive response from fans that prompted Fox to grant a small budget for test footage.[42] Robert Rodriguez was sent another early draft of the screenplay in June 2010,[43] but negotiations fell through, and Tim Miller was eventually hired as director, in April 2011.[44] Adam Berg was also in the running to direct at one point.[45]In July 2014, the test footage for the film, which had been created with visual effects in 2012 and starred Reynolds through motion capture, was leaked online.[46][47] Blur Studio, the company that created the test footage, subsequently released it officially.[48] The footage received an overwhelmingly enthusiastic response online,[47] and in September 2014, Fox gave Deadpool a release date of February 12, 2016.[49] Kinberg confirmed a month later that Deadpool would be part of the X-Men shared cinematic universe.[50] Over the years of development, Reese and Wernick wrote additional versions of the script, including a PG-13 version. During the writing process, both James Cameron and David Fincher read early versions of the script, and each of them went to Fox and told them they needed to greenlight the movie, helping to get it out of development hell.[51] Reese felt that ultimately, \"about seventy percent\" of the initial draft ended up in the final film.[52] Changes during rewrites include the removal of the Marvel characters Garrison Kane and Cannonball from the film, due to budgetary concerns over the required CGI for his cybernetic arms, and the perception of a \"stupid hick character\", respectively.[13] Wyre, initially an additional villain, was also cut,[53] with the three replaced by Angel Dust.[54] Plans to have the Marvel superhero Cable appear were halted when it was decided that he would work better in a potential sequel.[53]Reynolds \"100 percent\" attributed Fox's greenlighting of the film for production to the test footage leak, stating, after being asked who had leaked it, \"I would have, if I had known it would have caused that!...Now, we get to make the movie. We don't get to make it with the budget of most superhero movies, but we get to make it the way we want to make it.\"[55] Reese admitted that about $7 million was deducted from the budget ostensibly last-minute, forcing further rewrites.[54] Miller, who made his directorial debut with Deadpool,[44] has been credited by both Reynolds and motion capture supervisor Greg LaSalle with making efficient use of the budget, for example waiting to work on the CGI for Colossus until after the film was edited, cutting down on the cost of post-production.[56][57]In December 2014, Reynolds was confirmed to reprise his role as Wade Wilson / Deadpool.[58] The next month, T. J. Miller and Ed Skrein were in talks to appear in the film;[59] in February 2015, Gina Carano was cast as Angel Dust, Miller was confirmed for an unspecified role, and so was Morena Baccarin.[8][17] Taylor Schilling, Crystal Reed, Rebecca Rittenhouse, Sarah Greene, and Jessica De Gouw were also considered for Baccarin's role.[60] In March, Miller's role was revealed to be Weasel,[15] while Baccarin's was revealed to be Vanessa Carlysle.[9][61] Brianna Hildebrand was cast as Negasonic Teenage Warhead,[21] and a month later Skrein revealed that he would play Ajax.[12] Leslie Uggams revealed she would portray Blind Al in July,[19] and Tim Miller revealed that Jed Rees would portray the Recruiter in August.[13] Stefan Kapičić voiced Colossus,[23] replacing Daniel Cudmore, who played the character in previous X-Men films. Cudmore was asked to return for Deadpool, but declined as his voice was always intended to be replaced.[13][62]Talking about the make-up used to depict the scarring on Wilson's body, Tim Miller said, \"There was some discussion about how horrible we could make it, and I firmly planted my flag in 'fucking horrible', because if it isn't, nobody's going to excuse him for being such a dick and being so angry. If it's just a few scars we're not going to have any sympathy for him. To Fox's credit they were like, 'Go for it.' But that said, we didn't want to make him a zombie, which some of the comics go pretty far with. I'm all for authenticity but you can't have a main character who's leaking pus. You don't want to see inside his mouth when he's chewing, that's a bridge too far. I think he looks suitably hideous. And that's not the only stage of the make-up: when we first see him in the workshop it's pretty raw.\" Elaborating on the initial make-up scene in the workshop, Miller stated that it took 6 hours to apply Reynolds' full-body make-up.[13] Also, visual effects supervisor Jonathan Rothbart discussed the practical costume created for Deadpool, noting that it was difficult to replicate later in CGI for the visual effects: \"The costume is made of this mesh so all the dirt would get into the gutters and the cracks and crevices of the costume. Then all the ridges of the mesh would stay nice and clean, so anytime sun would be on it and the light hits it, it still takes that orangey hue but as soon as it goes in the shadow it dropped to this more blueish of the dirt.\"[24]Principal photography commenced on March 23, 2015, in Vancouver, British Columbia, Canada,[64] and ended on May 29, 2015.[65] Ken Seng served as director of photography on the film, while Robert Alonzo and Philip Silvera supervised and coordinated the film's stunts, respectively.[24] The production hired over 2,000 local people as actors, extras, and crew members.[66] Reynolds stated that inspiration for the fight between Deadpool and Ajax in the latter's laboratory came from the sauna showdown in David Cronenberg's Eastern Promises.[67]Visual effects for Deadpool were produced by Digital Domain, Atomic Fiction, Blur Studio, Weta Digital, Rodeo FX, Luma Pictures, and Image Engine, with many of the effects tools provided from Adobe Systems. While the vendors mostly worked on individual areas of the film, there was some collaboration, particularly in the final battle sequence which takes place in the wreckage of a helicarrier, and in which Luma created the climactic fight between Deadpool and Ajax; Digital Domain created the majority of the Colossus effects, except for when he is damaged later on, for which he was created by Blur Studio; Digital Domain also created the effects for Negasonic Teenage Warhead's abilities as well as parts of the deck of the helicarrier; Rodeo contributed matte paintings for the background; and Weta provided the facial animation for Deadpool. Additionally, when Deadpool is stabbed in the head during the fight and hallucinates \"cartoon characters that dance around his face\", Miller found a \"French animation artist who had a unique style and did all the 2D work\" which the visual effects team then composited into the shots.[24][68]For the earlier freeway battle, expanded from the similar sequence in the test footage, Atomic Fiction created a freeway environment with a city backdrop, based on plates shot in Detroit, along with all the vehicles, with vehicle interiors and some character actions filmed on a greenscreen stage. Elements of Chicago and Vancouver were also included in the city environment, while some of the live-action stunts filmed for the sequence include a stuntman lying on a treadmill to simulate being dragged by a vehicle, and stuntmen riding greenscreen rigs to simulate the riding of motorcycles. For the film's opening title sequence, Blur Studio used assets from Atomic to create \"a constant pullback inside the car that reveals all the thugs Deadpool is fighting, and he's pulling a wedgie on one of the guys, putting his fingers into the eyes of another dude.\" The sequence is described as an \"85 second full CG frozen moment mid-freeway crash that's populated with such titles as 'Directed by an overpaid tool' and 'Produced by asshats'\".[24]Concerning Colossus, Miller felt, as a fan of the comics' character, that the \"dude with the shiny skin\" from the previous X-Men films was \"not fucking Colossus...He should be this monstrous guy, and they actually let me ['change the look of him' and] make him seven-and-a-half feet tall.\"[13] Digital Domain ultimately created the completely CGI character using the facial performance of motion capture supervisor Greg LaSalle and the body motion performance of T. J. Storm, replacing on-set performer Andre Tricoteux, who often \"wore platform shoes or an extra hat-piece or be on a platform to be even taller\" meaning \"he couldn't move too athletically\", especially during fight sequences. For the character's metallic finish, the visual effects team sought out specific reference to avoid making him look too \"chromey\", visiting a metal company with \"a whole bunch of different samples of different types of steels.\" Cold rolled steel was settled on as the primary look, with the much darker hot rolled steel chosen for his hair. To keep Colossus's ridges and lines always perfectly straight, as in the comic books, the animators were able to move them rather than have them 'locked' to the animated model, which was causing them to \"get all squiggly and strange\" as the character moved. Digital Domain's Colossus asset was also used by Blur Studio, who created the character for a scene in which he is in a cab as well as providing the damaged version of the character for the final battle sequence.[24]Rather than animate every shot of Deadpool to show the character \"emoting\", deemed necessary due to the amount of Reynolds' emotion coming through the bottom of the Deadpool mask while a \"solid shell\" was formed from the upper lip up (an effect described as 'chinwagging'), which would not have been feasible considering the film's budget, Weta Digital instead warped each shot of Deadpool based on facial references provided by Reynolds, which was called an \"ingenious 2D-ish solution\". Image Engine used a similar process for the film's promotional materials. For the character's initial transformation, where a \"horrifying skin scar effect\" is used, Rodeo FX referenced rotting fruit and maggot-eaten meat. Rodeo also augmented the practical fire and environment used in the sequence, with Rodeo FX visual effects supervisor Wayne Brinton noting that rather than just layering on more fire as the scene goes along, the vendor made more things burn, to show a progression in the burning down of the building and to avoid the fire looking \"flat\". Additionally, when the character rips off his burning clothes, Rodeo added a CGI penis to Reynolds, which \"wasn't meant to be comedic – it was one of those things that's when it's there it looks so natural that you don't even notice it. When it wasn't there it looked really weird.\"[24]Deadpool relied heavily on practical, make-up, and digital effects to create its R-rated blood and gore, with Luma Pictures one of the main vendors responsible for this. Visual effects were used for the more complex blood and gore, while footage of pressurized PVC piping 'spewing out' practical blood and gore was also composited into the film for some sequences. For the scene where Deadpool cuts off his own hand, Digital Domain did not want to be \"outdone\" by Luma, and so had \"buckets of blood pouring out\". Luma also created the regrowing hand, which was based on the hand of a fetus.[24]","produced_by":"Lauren Shuler Donner|Ryan Reynolds|Simon Kinberg|","starring":"Ryan Reynolds|Morena Baccarin|Ed Skrein|Gina Carano|T.J. Miller|Leslie Uggams|Brianna Hildebrand|Stefan Kapičić|","running_time":"108 minutes[1]","Sequel":"In September 2015, Kinberg commented on the possibility of a sequel for Deadpool: \"we were talking about the sequel while we were making the movie just because when you make a film like this that's from a serialized source material, you hope that it's the first of many\".[163] Fox gave the green-light to the film's sequel, with Reese and Wernick returning to write, and Miller being looked at to return as director.[164] In April 2016, Fox confirmed the sequel's development, with Miller, Reese, Wernick and Reynolds returning.[165] Kinberg and Miller have also talked about the possibility of a crossover featuring Spider-Man.[166] Kinberg hopes the sequel will begin filming in early 2017.[167]","music_by":"Tom Holkenborg","edited_by":"Julian Clarke","Release":"Deadpool made its world premiere at the Grand Rex in Paris on February 8, 2016.[72] Deadpool was released on February 10, 2016 in the United Kingdom and February 12, 2016 in North America.[49][73] The film was released in various formats such as IMAX, DLP, premium large formats and D-Box.[74] However, it was denied a theatrical release in China and Uzbekistan due to its content, for violence, nudity and graphic language.[75][76] In India, it received an \"A\" certificate by the Central Board of Film Certification after seven cuts.[77] It opened Tuesday, February 9, in Hong Kong, and in 7 additional markets on Wednesday, February 10, including the United Kingdom and Ireland, France, Taiwan, the Philippines, Belgium and Singapore. 39 other markets, including Australia, Argentina and Brazil, opened on Thursday, February 11, and 23 more markets bowed on Friday, February 12, including the United States and Canada and India.[78] The film also opened in South Korea, Italy, Spain, and Japan in the following weekends.[78]In July 2015, director Miller and several cast members attended the 2015 San Diego Comic-Con to present the trailer of the film, which received a standing ovation from attendees who requested that it be played again.[79] Graeme McMillan of The Hollywood Reporter opined that Deadpool \"looks like the first movie that talks to the fan audience in their own language\", and praised the meta humor of the trailer,[80] while Business Insider's Joshua Rivera gave the trailer a positive review for being \"faithful to the source material\", as well as for its humor and action.[81]In December 2015, Fox launched a viral marketing campaign titled \"The 12 days of Deadpool\", which consisted of one website posting new info about the film each day, with the culmination of a new trailer released on Christmas Day.[82] The general marketing campaign for the film has garnered a positive reaction in the media;[83][84] two particular items noted as effective were a campaign to feign Deadpool as a Valentine's Day romance film,[85] and a billboard only containing the emoji \"💀💩L\" which journalists called \"dumb, yet hilarious\".[86]On January 19, 2016, two supposed screenings of yet unseen footage in New York and Los Angeles turned out to be surprise screenings of the entire film;[87] Screen Rant noted that fan reactions to the film were \"overwhelmingly positive\".[88]Reynolds promoted the film's DVD release with a guest appearance on the YouTube channel Screen Junkies, which makes \"Honest Trailers\" of films, costumed and characterized as Deadpool. The newspaper The Guardian described it as \"Deadpool cheerfully pop[ping] up to offer wisecracking commentary on Honest Trailer's wisecracking commentary … on his own wisecracking commentary in the movie itself\". Reynolds commented that he is a fan of the web series, and that the custom credits at the beginning of the film were taken from a similar section of those videos.[89]Deadpool was released on digital HD on April 26, 2016.[90] Reynolds announced on Twitter that the movie will be released on DVD and Blu-ray on May 10, 2016.[91]","written_by":"Rhett Reese|Paul Wernick|","budget":"$58 million[2][3]"}