{"country":"United States","de-lovely":"Theatrical release poster","distributed_by":"Metro-Goldwyn-Mayer","Plot":"As he is about to die, Porter's life flashes before him in the form of a musical production staged by the archangel Gabriel in the Indiana theater where the composer first performed on stage.He immediately calls to mind the start of his story - the night he met his wife, Linda Lee Thomas - Paris' latest divorcee and stunning beauty. From the start, they \"click\" and become a devoted couple. Linda is well aware of Cole's gay identity and activities; her \"ex\" was the same but violent with her. Cole is completely different, she declares on their wedding day - he loves and adores her and shows it, so she tolerates his dalliances. Her love for and devotion to him are strong enough for her to overlook his romantic flings outside their marriage. With Linda his fun with music turns into a top international career. Their lavish lifestyle is enviable worldwide. At film's end he tells her the songs were all about her - \"not all\" she corrects - but enough of them. The leaders in music praise his work and his amazing shows begin. Linda begins a tradition for his show opening nights - a Cartier cigarette case custom designed and engraved to commemorate each show, but almost misses one of his openings herself due to miscarriage and they remain childless.To cheer Linda, the couple move the showbiz, by invitation, to Hollywood. Great excitement, a new extravagant home, but trouble: his flings get too overt and indiscreet and it creates tension. Cole is photographed in an amorous embrace with another man in a public restroom of a gay nightclub, and both he and Linda are blackmailed into paying a heavy settlement to suppress publication of the pictures. When he shrugs off the blackmail, she finally goes to Paris, leaving him bereft.Not until he is injured in a horseback riding accident that seriously cripples him does she return to his side, willing to forgive but still finding difficulty in coping with his extramarital affairs. Eventually Linda is diagnosed with emphysema, and as she prepares them both for her impending death, she introduces him to her decorator and estate advisor, in an attempt to give Cole a new partner once she's gone. The match is successful.Linda dies in 1954, and Cole is devastated. But he continues his work until 1958, when degeneration of the bad leg finally requires amputation, affecting his creative output. He never writes again, but works in productions of his earlier works, dying in 1964 at age 73.[1][2]","language":"English","Reception":"The film grossed $13,337,299 in the US and $5,059,083 in other markets for a total worldwide box office of $18,396,382.[4]Critically, the film had a mixed reception. It garnered a score of 53 from Metacritic[5] and a 48% rating from review aggregator Rotten Tomatoes.[6] Roger Ebert gave the film 3.5 out of a possible four stars. He wrote, for his review in the Chicago Sun-Times, that De-Lovely \"...brings [...] a worldly sophistication that is rare in the movies\".[7]Larry King said: \"Far and away the best musical biography ever made.\"In his review in The New York Times, Stephen Holden called the film \"lethally inert\" and \"lifeless and drained of genuine joie de vivre\" and added, \"It didn't have to be like this. In their highly stylized ways, All That Jazz (Bob Fosse's morbidly manic screen autobiography), Ken Russell's surreal portraits of composers or any of Federico Fellini's libidinous self-explorations have delved deeply into the muck of artistic creativity. Sadly, the daring and imagination required to go below the surface are nowhere to be found in De-Lovely.\"[8]Ruthe Stein of the San Francisco Chronicle said, \"The movie never gels - despite Kline's nuanced performance, the stars' exquisite period clothes designed by Armani, and, of course, Porter's great songs. Director Irwin Winkler's highly stylized technique is difficult to connect with emotionally. His film also suffers from shockingly sloppy editing for a studio production. If nothing else, the composer . . . deserves a movie that has rhythm. But De- Lovely lurches along like a car with a missing spark plug.\"[9]In Rolling Stone, Peter Travers rated the film three out of a possible four stars and commented, \"In voice, manner, patrician charm and private torment, Kevin Kline is perfection as legendary composer Cole Porter . . . At its best, De-Lovely evokes a time, a place and a sound with stylish wit and sophistication.\"[10]Steve Persall of the St. Petersburg Times graded the film C- and observed, \"The movie is actually an ugly compilation of clashing cinematic styles occasionally salvaged by musical numbers that essentially are part of the problem. You can't make a good movie about a 1930s composer using a 1970s film conceit while hiring 21st century recording artists to perform Porter's classic songs. A tribute CD, maybe, but not a movie . . . [it] plays like a cabaret review rather than a motion picture, a sublime collection of songs linked by scripted banter barely scratching the surface of its subject. Not delightful, not delicious, just disappointing.\"[11]Billboard reported that the film \"has inspired a Cole Porter renaissance on Top Jazz albums\". By the end of July 2004, the film's soundtrack reached 4-3 on Top Soundtracks and 77-58 on The Billboard 200. The film also boosted chart numbers for the then-recently released compilations albums: The Very Best of Cole Porter, Ultra Lounge: Cocktails With Cole Porter, and It's De Lovely - The Authentic Cole Porter Collection.[12]","box_office":"$18,396,382","cinematography":"Tony Pierce-Roberts","production_company":"Winkler Films","directed_by":"Irwin Winkler","Soundtrack":"A soundtrack album of music from the film was released on June 15, 2004.","release_dates":"July 2, 2004 (2004-07-02)|||||","Production":"Although Porter was a passable singer at best, director Irwin Winkler cast Kevin Kline, winner of two Tony Awards and two Drama Desk Awards for his musical performances on Broadway, as the composer. He stayed in character by limiting his vocal range. Most of his singing was recorded live on the set, and the actor played the piano himself in the scenes where Porter plays.According to Winkler's commentary on the DVD release of the film, he had considered numerous actresses for the role of Linda when Ashley Judd's agent advised him she was interested in the part. Winkler was certain her salary demand would exceed that allowed by the budget, but the actress was so anxious to portray Linda she was willing to lower her usual asking price. Judd is twenty years younger than Kline, although the composer's wife was eight years older than he.Filming locations included Chiswick House and Luton Hoo.The film premiered at the 2004 Cannes Film Festival.[3] It was shown at the CineVegas International Film Festival, the Sydney Film Festival, and the San Francisco International Lesbian and Gay Film Festival before going into limited release in the US.","produced_by":"Irwin Winkler Charles Winkler Rob Cowan","starring":"Kevin Kline Ashley Judd Jonathan Pryce Kevin McNally Sandra Nelson Allan Corduner Peter Polycarpou","running_time":"125 minutes","music_by":"Cole Porter","edited_by":"Julie Monroe","written_by":"Jay Cocks","budget":"$15 million"}