{"country":"United States","distributed_by":"Sony Pictures Classics","Plot":"Newly transferred college student Lily becomes friends with Violet, Heather and Rose, a clique who run the campus' suicide prevention centre. Over the course of the film, the four girls date less attractive men in order to help the men's confidence; they try to clean up the \"unhygenic\" Doar Dorm; they clash with the editor of the campus newspaper The Daily Complainer who wants to close down the \"elitist\" Roman letters fraternities; and finally they try and start a new dance craze, called The Sambola!","language":"English","Reception":"The film currently holds a 75% approval rating on review aggregator Rotten Tomatoes. The consensus reads, \"Damsels in Distress can sometimes feel mannered and outlandish, but it's redeemed by director Whit Stillman's oddball cleverness and Greta Gerwig's dryly funny performance.\"In festival screenings, the film has been enthusiastically received by critics. In Variety, Leslie Felperin wrote, \"a film that raises laughs even with its end credits, Whit Stillman's whimsical campus comedy Damsels in Distress is an utter delight.\"[8] In Time, critic Richard Corliss wrote, \"Innocence deserted teen movies ages ago, but it makes a comeback, revived and romanticized, in this joyous anachronism.\"[9] Andrew O'Hehir of Salon praised Gerwig's \"powerful and complicated performance\" and said that \"it's both a relief and a delight to discover that Stillman remains one of the funniest writers in captivity.\" He concluded, \"I laughed until I cried, and you may too (if you don’t find it pointless and teeth-grindingly irritating). Either way, Whit Stillman is back at last, bringing his peculiar brand of counterprogramming refreshment to our jaded age.\"[10] Jordan Hoffman of World Film gave the film four stars out of five, calling Gerwig \"a massive, multi-faceted talent\" and the film a \"love it or hate it movie. Personally, I think the ones who aren't charmed to pieces by its endless banter and preposterous characters very much need our help to expand their tastes and accept a more enlightened purview of what, indeed, is refined and acceptable motion picture entertainment.\"[11]","box_office":"$1,220,699[2]","cinematography":"Doug Emmett","directed_by":"Whit Stillman","Music":"The film features original score by Mark Suozzo. The song \"Sambola!\" is written by Mark Suozzo, Michael A. Levine and Lou Christie. [7]","release_dates":"September 10, 2011 (2011-09-10) (Venice)|April 6, 2012 (2012-04-06) (United States)||||","Production":"The movie was filmed on location in New York City on Staten Island at the Sailors' Snug Harbor Cultural Center.Filming finished on 5 November 2010.[5]Stillman has said that the film was cut between its festival and theatrical runs:I felt the MPAA helped us out there. I'd hoped to get a PG-13 even with the Venice cut, but in the first viewing they thought it was R. So we looked at it, the editor [Andrew Hafitz] and I, and we saw immediately some things that would make it pretty clearly PG-13, and we felt would help the movie. There could've been a little heaviness of talking a little too much about what was going on, and it would delay the laugh until later - which I think is always good. We were really happy with the small changes we made. We made tiny changes in two scenes: we took out the text for what the ALA stood for... I think it gave it a Lubitschean vagueness and delayed the laugh.[6]","Development":"The film was Stillman's first produced feature since The Last Days of Disco. In August 1998 he had moved from New York to Paris with his wife and two daughters. In that time he wrote a novelisation of The Last Days of Disco plus several original film scripts which were not made, including one set in Jamaica in the 1960s. He resolved to make a lower budgeted film in the style of his debut, Metropolitan. In 2006 he met with Liz Glotzer and Mart Shafter at Castle Rock Entertainment, who had financed his second and third films. Shafer:Whit said, ‘I want to write a movie about four girls in a dorm who are trying to keep things civil in an uncivil world.’ It took him a year to write 23 pages. Six months later, a few more dribbled in. He just doesn’t work very fast. Finally we had a draft. When we started production he said, ‘I think 12 years is the right amount of time between movies.’[5]Castle Rock ended up providing most of the $3 million budget.[5]","produced_by":"Martin Shafer Liz Glotzer","starring":"Greta Gerwig Adam Brody Analeigh Tipton Megalyn Echikunwoke Carrie MacLemore Hugo Becker Ryan Metcalf","running_time":"99 minutes","music_by":"Mark Suozzo","edited_by":"Andrew Hafitz","written_by":"Whit Stillman","budget":"$3,000,000[1]"}