{"country":"United States","distributed_by":"Warner Bros.","Plot":"Cagney plays a truck driver named Danny Kenny, who starts as a New York boxing contender. Ann Sheridan plays his girlfriend, Peggy. Being successful as a boxer, Danny decides to financially help his brother Eddie (Arthur Kennedy) to become a professional musician. Peggy on the other hand, loses her heart to Murray Burns (Anthony Quinn), a professional dancer, and she turns down Danny's proposal in order to go for a dancing career. Embittered by Peggy's refusal, Danny continues to work as a boxer and eventually gets blinded by his opponent during a fight, who has placed some rosin dust onto his gloves. Now blind, Danny works as a newspaper stand operator, while Peggy's career as a dancer did not materialize. The movie ends with Eddie becoming a successful composer who dedicates his first major symphony at Carnegie Hall to his brother, who is listening to the concert on the radio from his newsstand.","language":"English","cinematography":"James Wong Howe Sol Polito","directed_by":"Anatole Litvak Jean Negulesco (uncredited)","city_for_conquest":"Theatrical release poster","DVD":"City for Conquest was released to DVD by Warner Home Video on July 18, 2006 as a Region 1 fullscreen DVD and also on October 12, 2010 as a part of the 'TCM Greatest Gangster Films Collection: James Cagney' with City for Conquest on the first disc of a four-disc set.","release_dates":"September 21, 1940 (1940-09-21)|||||","Production":"George Raft was meant to appear opposite Cagney but was unable due to scheduling reasons.[3]The tramp who \"hosts\" the film is played by Frank Craven as a sort of parody of his role as The Stage Manager in Our Town, which he had filmed just prior to this picture.","produced_by":"William Cagney Anatole Litvak Hal B. Wallis (uncredited)","starring":"James Cagney Ann Sheridan Arthur Kennedy Frank Craven Anthony Quinn Elia Kazan","running_time":"104 minutes","music_by":"Max Steiner","written_by":"Aben Kandel (novel) John Wexley (screenplay)"}