{"country":"United States","distributed_by":"Universal Pictures","Plot":"LAPD Sgt. Joe Friday's nephew and namesake (Aykroyd), whose anachronistic views reflect those of his late uncle, is involuntarily assigned a smart-alecky, streetwise new partner, Pep Streebek (Hanks). Their contrasting styles clash at first, Friday disapproving of his young partner's attitude, hair, and wardrobe, but they gradually bond over their first case as a team, an investigation of a series of bizarre thefts involving items as disparate as a tanker full of chemicals; police, fire and paramedic vehicles; a wedding dress; a wood tree bat; an anaconda; a lion's mane; and the entire monthly print run of Bait, a pornographic magazine owned by Jerry Caesar (Dabney Coleman).They follow the trail to an Orange County-based cult calling itself P.A.G.A.N. (People Against Goodness And Normalcy). After further investigation, Friday and Streebek focus on one of the cult's henchmen, a brutish limousine driver for Jerry Caesar named Emil Muzz (Jack O'Halloran), who then reveals to Friday and Streebek the location of the next P.A.G.A.N. gathering during a gruesome interrogation by Streebek and a table drawer.Friday and Streebek disguise themselves as P.A.G.A.N. thugs (Streebek as Muzz) and sneak into the secret P.A.G.A.N. ceremony. There they witness the masked leader attempting to sacrifice a virgin, Miss Connie Swail (Alexandra Paul). They see the masked leader, while making a ritual speech, release the bat and throw the lions' manes that were stolen from the zoo into a pit of water below. He then throws the Virgin Connie Swail wearing the stolen wedding dress into the same pit with the anaconda that was also stolen from the zoo. Friday and Streebek disrupt the ceremony and save Swail by poisoning the anaconda with some prescription narcotic drugs given to them to try to fit in. In the process, Swail and Friday discover a mutual attraction. They report the incident to Capt. Gannon (Harry Morgan) and urge him to return to the site of the ritual. Upon arriving to the site with Police Commissioner Jane Kirkpatrick (Elizabeth Ashley), they find no evidence of any ritual held there the previous night. Friday and Streebek are removed from the case by Kirkpatrick.After exhausting all of their leads, Streebek contacts a friend in the Narcotics Division in which Streebek started. The informant tells them that a local milk factory is the only site that he knows of that can be used by the P.A.G.A.N.s to mass-produce a toxic gas made from the chemicals they stole. Friday and Streebek commandeer a police tank and the SWAT team to use for a raid on the factory. The milk factory turns out to be producing only milk; the real gas factory is next door. The team decides to follow orders and stop the investigation. Streebek follows Friday to his house to find out what his partner does during his time off. He is met at the door by Friday and his maternal grandmother Grace Mundy (Lenka Peterson), whom Friday is treating to a birthday dinner at her favorite restaurant, \"The Brown Derby\". Streebek decides to tag along. At the restaurant, Friday tells his grandmother about inviting the Virgin Connie Swail to join them. Granny Mundy expresses how proud she is of Friday.During dinner, Connie identifies a fellow patron, the televangelist Jonathan Whirley (Plummer), as the P.A.G.A.N. leader who threw her into the pit. Whirley, a highly respected community leader, is dining with Capt. Gannon and Commissioner Kirkpatrick. Despite Streebek's warnings, Friday sees the perfect opportunity to arrest Whirley while waiting for him to come out of the bathroom stall. Friday brings Whirley in handcuffs over to Gannon and Kirkpatrick's table where Kirkpatrick orders Friday to remove the cuffs immediately from Whirley. She then relieves Friday from duty and leaves the restaurant with Whirley. Outside the restaurant, Gannon takes Friday's gun and badge and orders Streebek to stay away from Whirley.While waiting for valet, Granny Mundy mentions that she is still hungry and agrees to chili dogs with Streebek. The two leave on his bike, leaving Friday and Swail to drive home alone. While on the way, they decide to park on a hill to discuss the events of the evening. In midkiss, Connie and Friday are kidnapped by Muzz and taken to the Griffith Observatory where Whirley is waiting. They are tied up while Whirley divulges to them his plan to use the Bait Magazine Reunion party at Caesar's mansion to kill Caesar and the mayor, using the stolen chemicals.Friday leads a SWAT team on a raid on Caesar's mansion. During the ensuing shootout between the P.A.G.A.N.s and the police, Whirley takes Connie to the airport, where he escapes in his private Learjet. His getaway ends when the now reinstated Friday pursues him in a Northrop T-38 police jet, forcing him to return to Los Angeles and land.An epilogue reveals that Friday is still working with Streebek and dating Connie.","language":"English","Reception":"The film received mixed reviews from critics according to Rotten Tomatoes, as Dragnet has a 46% composite score based on 28 reviews with the consensus: \"While it's sporadically funny and certainly well-cast, Dragnet is too clumsy and inconsistent to honor its classic source material\".[7]Dragnet performed well at the box office, grossing $57.4 million domestically with an additional $9.3 million internationally, for a total of $66.7 million worldwide.","box_office":"$66,673,516[2]","cinematography":"Matthew F. Leonetti","directed_by":"Tom Mankiewicz","dragnet":"Theatrical poster","release_dates":"June 26, 1987 (1987-06-26)|||||","Production":"The script had been written by Dan Aykroyd and Alan Zweibel. Tom Mankiewicz, who had a deal at Universal, was brought in to work on it with them. Ted Kotcheff was originally attached to direct, but did not like the draft the three writers had come up with, so Frank Price at Universal suggested Mankiewicz direct.[3][4]Aykroyd originally wanted Jim Belushi to play opposite him, but he was unavailable and Tom Hanks was cast, instead.[3]Aykroyd starred as Friday in a Saturday Night Live parody of Dragnet in 1976.The title credits featured an update to the series' original theme music by the British group Art of Noise.[5] They set the Dragnet theme against a electronica/new wave style breakbeat with soundbites such as Friday's \"Just the facts, ma'am\" timed to the music. The theme won the 1987 Grammy Award for Best Rock Instrumental Performance.[6]The soundtrack includes an original song, \"City of Crime\". The track features a hip-hop style collaboration between Aykroyd and Hanks that is performed with bassist/vocalist Glenn Hughes and guitarist Pat Thrall. The track is played over the film's closing credits.[5]","produced_by":"Bernie Brillstein David Permut Robert K. Weiss","starring":"Dan Aykroyd|Tom Hanks|Christopher Plummer|Harry Morgan|Alexandra Paul|Dabney Coleman|","running_time":"106 minutes","music_by":"Ira Newborn","edited_by":"William D. Gordeon Richard Halsey","written_by":"Dan Aykroyd Alan Zweibel Tom Mankiewicz","budget":"$20 million[1]"}