{"chasers":"Theatrical release poster","distributed_by":"Warner Bros.","Plot":"Eddie Devane (William McNamara) is a young sailor who has carried out a number of inventory-related scams along with his partner-in-crime Howard (Crispin Glover) and made a lot of money during his service. A day before his discharge, Eddie is assigned to escort a prisoner from the marine base at Camp Lejeune along with the authoritarian, no-nonsense Chief Petty Officer Rock Reilly (Tom Berenger). Eddie is of course not pleased with this development. When Howard sees a grumpy-looking Eddie being escorted from his superior's office by a couple of other seaman, he thinks Eddie has been found out and arrested for his scams. In order to destroy evidence, he goes to Eddie's desk and finds the money, the existence of which Eddie had concealed from him.Eddie and Rock's personalities clash many times during the trip to Camp Lejeune. When they reach their destination, they discover that the prisoner they are transporting is a pretty young woman, Toni Johnson (Erika Eleniak). However, they soon discover that taking her back is no easy job when she attempts to escape disguised as a waitress at a diner but is caught. Later, she feigns the onset of her period and puts tampons inside the van's gas tank which leads to the van being stalled in the road. While walking, the trio come across an abandoned mine and accidentally fall down the shaft. They try to get out standing on each other's shoulders. Toni gets out first, ditches them and runs away but has a change of heart later and comes back for them.They stay for the night in a motel while their van is being repaired. They converse and bond in a diner where it is revealed that Toni had first gone AWOL to visit her delinquent, drug-addicted brother in a hospital. When the authorities attempted to arrest her, she resisted and made more attempts to escape, leading to her current sentence. Her brother died while she was in prison. This makes them see her in anew light and understand the motivations behind her actions. Later in the night, Eddie finds out that Howard has taken all the money as well as the new car Eddie was planning to buy. He calls Howard, who says he was tired of being used, but says if Eddie answers a riddle he will turn around \"How do you talk to the fish?\", which Eddie cannot answer. Distressed, he gets drunk. When he returns to the motel, Toni mentions \"Drop them a line\", answering Howard's riddle, revealing she had accidentally listened in on the conversation when he was talking to Howard and that she realizes he embezzled $150,000 from the Navy. She seduces him and the two have sex.Next morning, Eddie wakes up and sees Toni run away. She steals the car of the man who picked her up (director Dennis Hopper in a cameo). While giving her chase, Eddie and Rock's van accidentally climbs up an artificial volcano in an amusement park and falls down but they both escape unhurt. They catch up with Toni only to discover that her brother's funeral is soon and she is running away with the intention of being present there. Frustrated with the situation, Rock and Eddie have a fistfight. Then they journey to their base and hand Toni over.Eddie realizes that he is in love with Toni and wants to rescue her. Rock is of agreement. When Toni is being transported to the prison to begin her sentence, Eddie and Rock sabotage the van in the same way as she had sabotaged their van earlier. Eddie impersonates a tow truck driver and takes the van away, only for the drivers to realize too late Toni is inside.In the epilogue set one year later, Eddie and Toni are living it up \"somewhere south of the border\" and Rock has begun a relationship with a waitress he met at the diner before.","language":"English","box_office":"$1,596,687","cinematography":"Ueli Steiger","production_company":"Morgan Creek Productions","directed_by":"Dennis Hopper","release_dates":"April 22, 1994 (1994-04-22)|||||","produced_by":"Gary Barber","starring":"Tom Berenger William McNamara Erika Eleniak Dean Stockwell Crispin Glover Dennis Hopper","running_time":"102 min.","music_by":"Dwight Yoakam Pete Anderson","edited_by":"Christian Wagner","written_by":"Joe Batteer John Rice Dan Gilroy","budget":"$15 million"}