{"country":"United States","distributed_by":"Freestyle Releasing","story_by":"Greg Robbins","c_me_dance":"Theatrical release poster","Plot":"The story centers around a teenage girl named Sheri, whose desire is to join the Pittsburgh Ballet Theatre. At 17, fulfilling her dream, she discovers she has a rare blood disease. Sheri rebels against her father and God, causing her father to seek to keep his daughter close to God, to soften her heart, and to live out her dream before dying, all while he anguishes over losing his daughter so young. While praying to God to ask for strength and clear direction for her remaining days, God blesses Sheri so she is able to bring people to Christ.[5]","language":"English","cinematography":"Robert J. Sommer","production_company":"Uplifting Entertainment","directed_by":"Greg Robbins","release_dates":"April 3, 2009 (2009-04-03)|||||","Filming":"It was created, produced and filmed by Uplifting Entertainment in October on Carnegie streets, at Carlynton High School, the United Methodist Church of Carnegie, at Cefalo's Restaurant and the Carnegie Performing Arts Center.[6]","starring":"Greg Robbins Christina DeMarco Laura Romeo Peter Kent","running_time":"89 minutes","music_by":"Stephen Tammearu","edited_by":"David Kosor","Release":"On April 3, 2009, C Me Dance released in at least 150 theaters[7] in twelve U.S. states: Alabama, Arkansas, Florida, Georgia, Louisiana, Mississippi, North Carolina, Ohio, Oregon, Pennsylvania, South Carolina and Tennessee.[8]The film's reviews were mostly negative. Galen Holley of the Northeast Mississippi Daily Journal, said \"C Me Dance is a darker, riskier movie that tends more toward mysticism than Christian social commentary,\" but did also say \"[C Me Dance is] creatively ambitious and bold.\"[9] Luke Thompson of the L.A. Weekly review wrote that the film \"plays like a fake Christian movie Troy McClure might end up starring in on an episode of The Simpsons, though it’s apparently for real\".[10] Gary Goldstein of the Los Angeles Times was also negative towards the film, saying \"it's fine to know your audience and cater to its entertainment needs, but even the most devout viewer subjected to Robbins' ham-fisted film might think, 'OK, now tell me something I don't already know'.\".[11] The film received a 0% from review aggregator Rotten Tomatoes based on five reviews.[12] The Huffington Post included the film in its article \"The 9 Worst Movies Ever Made.\" [13]","written_by":"Greg Robbins","budget":"$500,000[1]"}