{"based_on":"American Splendor and Our Cancer Year  by Harvey Pekar Joyce Brabner","country":"United States","Awards and nominations":"Boston Society of Film CriticsChicago Film Critics AssociationLos Angeles Film Critics AssociationNational Society of Film CriticsNew York Film Critics CircleWriters Guild of America (WGA)Academy AwardsBelgian Syndicate of Cinema CriticsChicago Film Critics AssociationGolden Globe AwardsSatellite AwardsSundance Film Festival","distributed_by":"Fine Line Features HBO Films","american_splendor":"Theatrical release poster","language":"English","Reception":"On Rotten Tomatoes, the film has a 94% approval rating, based on 181 reviews, with an average rating of 8.3/10. The site's critical consensus reads, \"Exhilarating both stylistically and for its entertaining, moving portrayal of an everyman, American Splendor is a portrait of a true underground original.\"[7] On Metacritic, the film also has a score of 90 out of 100, based on 42 reviews, indicating \"universal acclaim.\"[8]American Splendor won the Grand Jury Prize for Dramatic Film at the 2003 Sundance Film Festival, in addition to the award for Best Adapted Screenplay from the Writers Guild of America. At the 2003 Cannes Film Festival, the film received the FIPRESCI critics award.[9] It was also nominated for Best Adapted Screenplay at the 2003 Academy Awards.Columnist Jaime Wolf wrote a laudatory review of the film in Slate, also drawing attention to formal parallels with Woody Allen's Annie Hall and other Allen films.[10]Pekar wrote about the effects of the film in American Splendor: Our Movie Year.","box_office":"$7,986,084[2]","cinematography":"Terry Stacey","production_company":"Good Machine Dark Horse Entertainment","directed_by":"Shari Springer Berman Robert Pulcini","release_dates":"January 20, 2003 (2003-01-20) (Sundance)|August 15, 2003 (2003-08-15) (United States)||||","Production":"Though Shari Springer Berman and Robert Pulcini had directed documentaries before, American Splendor was their first narrative feature. Of the film's alternating of fictional portrayals with real-life appearances by Pekar and his friends and family, co-writer/co-director Pulcini recalled, \"It really was the only way that made sense to tell that story because we were handed this stack of comic strips where the main character never really looks the same because he’s drawn by so many different artists. We wondered how to stay true to the material, and that’s the concept we came up with. The structure came out of that very naturally. It wasn’t something that we labored over.\"[5] Berman added that upon meeting Pekar they felt compelled to include him in the film. \"We also got to know Harvey even before we wrote the screenplay. We actually went to Cleveland and spent time with Harvey and Joyce, and spoke to them on the phone a lot. Once we spent some time with both of them, we were like, “Oh my God, we have to put them in the movie!” That was a case where we were still using our documentary instincts and had to figure out a way to include him in it that was a natural fit for the material.\"[6]","produced_by":"Ted Hope Christine Kunewa Walker Julia King Declan Baldwin","starring":"Paul Giamatti Hope Davis Judah Friedlander","running_time":"101 minutes[1]","music_by":"Mark Suozzo","edited_by":"Robert Pulcini","written_by":"Shari Springer Berman Robert Pulcini","budget":"$2 million"}