{"based_on":"Characters  by Richard Linklater and Kim Krizan","country":"United States","distributed_by":"Sony Pictures Classics","screenplay_by":"Richard Linklater Ethan Hawke Julie Delpy","Plot":"Nine years have passed since Before Sunset. Jesse and Céline have become a couple and parents to twin girls. Jesse struggles to maintain his relationship with his teenage son, Hank, who lives in Chicago with Jesse's ex-wife. After Hank spends the summer with Jesse and Céline on the Greek Peloponnese peninsula, Jesse drops him off at the airport to fly home. Jesse is a successful novelist, while Céline is at a career crossroads, considering a job with the French government.The couple discuss their concerns about Hank, and then about Céline's choices for her career. Over dinner they talk more about love and life. Friends staying with them pay for a hotel room so they can have a night alone. While walking to the hotel, the couple reminisce about coming together. After reaching the hotel, they have a fierce argument, expressing fears about their present and future together. Among other issues, Jesse wants them to move to Chicago so he can be closer to Hank, which Céline thinks will cost her any chance of a life outside her family. In the heat of the argument, Céline tells Jesse she no longer loves him.Céline leaves their room and sits alone in the hotel's outdoor restaurant. Jesse joins her and jokes that he is a time traveler bringing her a letter from her 82-year-old self, describing this night as one of the best of their lives. Unamused, Céline says their fantasies will never match the imperfect reality. Jesse proclaims his love, saying he does not know what else she could want. After a moment, Céline joins in Jesse's joke, and the two seem to reconcile.","Accolades":"^[I] Each date is linked to the article about the awards held that year.According to Metacritic, the film appeared on the following critics' top 10 lists of 2013.[56]The A.V. Club film critics named \"The fight\" scene the Scene of the Year.[75]","language":"English Greek French","box_office":"$23,376,973[3]","cinematography":"Christos Voudouris","production_company":"Castle Rock Entertainment Venture Forth","directed_by":"Richard Linklater","before_midnight":"Theatrical release poster","release_dates":"January 20, 2013 (2013-01-20) (Sundance)|May 24, 2013 (2013-05-24) (limited)|June 14, 2013 (2013-06-14) (wide)|||","Production":"Richard Linklater, Ethan Hawke, and Julie Delpy had all discussed doing a sequel to Before Sunset (or the third in a trilogy). In November 2011, Hawke said that he, Delpy and Linklater\"have been talking a lot in the last six months. All three of us have been having similar feelings, that we're kind of ready to revisit those characters. There's nine years between the first two movies and, if we made the film next summer, it would be nine years again, so we started thinking that would be a good thing to do. So we're going to try and write it this year.\"[4][5]In June 2012, Hawke confirmed that the sequel to Before Sunset would be filmed that summer.[6] Soon after, Delpy denied filming would take place that year.[7] But by August 2012, numerous reports emerged from Messenia, Greece, that the film was being shot there.[8]The completion of filming the sequel, titled Before Midnight, was announced on September 5, 2012.[9] Linklater said that, after ten weeks of writing and rehearsing, the film was made in fifteen days for less than $3 million.[2] He intended to take it to a film festival in early 2013.[10]","produced_by":"Richard Linklater Christos V. Konstantakopoulos Sara Woodhatch","starring":"Ethan Hawke Julie Delpy","running_time":"109 minutes[1]","music_by":"Graham Reynolds","edited_by":"Sandra Adair","Release":"Before Midnight premiered on January 20, 2013, at the 2013 Sundance Film Festival.[11] It had its international premiere out of competition at the 63rd Berlin International Film Festival.[12]The film opened to general audiences on May 24, 2013, at five theaters in New York, Los Angeles, and Austin, Texas.[13] It was released wide in 897 theaters on June 14, 2013.[14]The film grossed $8,110,621 domestically and $12,626,409 overseas, for a worldwide gross of $20,737,030.[3]Like the first two films of the trilogy, Before Midnight received widespread critical acclaim. Rotten Tomatoes gives the film a score of 98% based on reviews from 180 critics, with an average rating of 8.7/10. The site's consensus is: \"Building on the first two installments in Richard Linklater's well-crafted Before trilogy, Before Midnight offers intelligent, powerfully acted perspectives on love, marriage, and long-term commitment.\"[15] Metacritic gives the film a score of 94 out of 100, based on reviews from 41 critics, indicating \"universal acclaim\". It was listed as the third-best film of the year after 12 Years a Slave and Gravity.[16] It was the second-best reviewed film of 2013 according to Rotten Tomatoes, after Alfonso Cuarón's Gravity.[17]According to Total Film's Philip Kemp,\"As with its two predecessors — and with the films of French New Wave director Éric Rohmer, presiding deity of this kind of cinema—Midnight's essentially a film about people talking. But when the talk's this good, this absorbing and revealing and witty and true, who's going to complain?\" Kemp described it as a \"more-than-worthy, expectation-exceeding chapter in one of modern cinema's finest love stories. As honest, convincing, funny, intimate and natural as its predecessors.\"[18]Perry Seibert of AllMovie also praised the film, writing: \"The screenwriting trio fill the movie with long, discursive conversations (there are only two scenes in the first 20 minutes) that feel utterly improvised when they are performed, but are far too deftly structured to be anything other than the work of consummate artists.\"[19] Eric Kohn, from Indiewire, gave the film rave reviews, adding it to his list of Top 10 Films of 2013. He wrote that \"With Before Midnight, Richard Linklater has completed one of the finest movie trilogies of all time.\"[20]","budget":"$3 million[2]"}