{"based_on":"Charlotte's Web  by E. B. White","country":"United States","distributed_by":"Paramount Pictures","story_by":"Earl Hamner Jr.","Plot":"When farmer John Arable decides to \"do away with\" the runt of a litter of piglets, his daughter, Fern, intervenes, telling him that it is absurd to kill him just because he is smaller than the others. John decides to spare him and let her raise him as a pet. She nurtures him lovingly, naming him Wilbur. Six weeks later, he, due to being a spring pig, has matured, and John tells Fern that he has to be sold (his siblings were already sold). She sadly says good-bye as he is sold down the street to her uncle, Homer Zuckerman. At Homer's farm, a goose coaxes a sullen Wilbur to speak his first words. Although delighted at this new ability, he still yearns for companionship. He attempts to get the goose to play with him, but she declines on the condition that she has to hatch her goslings. He also tries asking a rat named Templeton to play with him, but Templeton's only interests are spying, hiding, and eating. He then wants to play with a lamb, but her father says sheep do not play with pigs because it is only a matter of time before they are slaughtered and turned into smoked bacon and ham. Horrified at this depressing discovery, Wilbur reduces himself to tears until a mysterious voice tells him to \"chin up\", and wait until morning to reveal herself to him. The following morning, she reveals herself to be an spider named Charlotte A. Cavatica living on a web overlooking his pig pen. She tells him that she will come up with a plan guaranteed to spare his life.Later, the goose's goslings hatch. One of them, named Jeffrey, befriends Wilbur. Eventually, Charlotte reveals her plan to \"pay a trick on Zuckerman\", and consoles Wilbur to sleep. The next morning, Homer's farm assistant, Lurvy, sees the words, SOME PIG, spun within Charlotte's web. The incident attracts publicity among Homer's neighbors who deem the praise to be a miracle. The publicity eventually dies down, and Charlotte requests the barn animals to devise a new word to spin within her web. After several suggestions, the goose suggests the phrase, TERRIFIC! TERRIFIC! TERRIFIC!, though Charlotte decides to shorten it to one TERRIFIC. The incident becomes another media sensation, though Homer still desires to slaughter Wilbur. For the next message, Charlotte then employs Templeton to pull a word from a magazine clipping at the dump for inspiration, in which he returns the word, RADIANT, ripped from a soap box to spin within her web. Following this, Homer decides to enter Wilbur in the county fair for the summer. Charlotte reluctantly decides to accompany him, though Templeton at first has no interest in doing so until the goose tells him about all the food there. After one night there, Charlotte sends Templeton to the trash pile on another errand to gather another word for her next message, in which he returns with the word, HUMBLE. The next morning, Wilbur awakens to find Charlotte has spun an egg sac containing her unborn offspring, and the following afternoon, the word, HUMBLE, is spun. However, Fern's brother, Avery, discovers another pig named Uncle has won first place, though the county fair staff decides to hold a celebration in honor of Homer's miraculous pig, and rewards him $25 and a gold medal. he then announces that he will allow Wilbur to \"live to a ripe old age\".Exhausted from laying eggs and writing words, Charlotte tells Wilbur she will remain at the fair to die. Not willing to let her children be abandoned, Wilbur has Templeton retrieve her egg sac to take back to the farm just before she dies. Once he returns to Homer's farm, he guards the egg sac until the winter. The next spring, Charlotte's 514 children are hatched, but leave the farm causing Wilbur to become saddened to the point of wanting to run away. Just as he is about to do so, the ram points out that three of them did not fly away. Pleased at finding new friends, he names them Joy, Nellie, and Aranea. But as much as he loves them, they will never replace the memory of Charlotte.","language":"English","Voice cast":"Five members of the cast (Henry Gibson, Paul Lynde, Agnes Moorehead, Danny Bonaduce, and Dave Madden) had previously appeared on the ABC television situation comedy Bewitched (1964-1972).[2][unreliable source?] Hanna-Barbera also animated the opening credits of the show. However, Bonaduce and Madden are more well known for their roles on another ABC-TV sitcom, The Partridge Family (1970-1974), which was still in production when the film was made. Also, Ferdin and Lynde both appeared on The Paul Lynde Show, another ABC sitcom created to fill the contract of Bewitched[3] Bonaduce, Lynde, Gerber, Messick and Stephenson had previously worked for Hanna-Barbera in their television shows: Lynde appeared in The Perils of Penelope Pitstop (uncredited), Bonaduce and Gerber were stars in Partridge Family 2200 A.D., and Stephenson and Messick were Hanna-Barbera regulars who regularly lent their voices to many of their shows.","Reception":"The film received generally positive reviews. Review aggregation site Rotten Tomatoes reported that it has a 75% approval rating based on 20 reviews, with an average score of 6.6/10.[7] Craig Butler of All-Movie Guide criticized the animation and the musical score, but called it a faithful adaptation, noting that, \"no attempt has been made to soften the existential sadness at the story's core\".[8] Dan Jardine criticized the songs and the \"Saturday morning cartoon quality\" of the animation, but also says that Hamner \"retains just enough of White’s elegant prose in the dialogue and narration to keep the film from being simply a painfully well-intended experiment.\"[9] Christopher Null of Filmcritic.com stated that the animation is sometimes \"downright bad\", but that White's classic fable needs little to make it come to life.[10] When it was reissued on DVD it was awarded an Oppenheim Toy Portfolio Gold Award.[11]The American Film Institute nominated the film for its Top 10 Animated Films list.[12]According to Gene Deitch, White wrote the following words in a 1977 letter, \"We have never ceased to regret that your version of 'Charlotte's Web' never got made. The Hanna-Barbera version has never pleased either of us...a travesty...\"[13] E. B. White himself wrote of the film, \"The story is interrupted every few minutes so that somebody can sing a jolly song. I don't care much for jolly songs. The Blue Hill Fair, which I tried to report faithfully in the book, has become a Disney World, with 76 trombones. But that's what you get for getting embroiled in Hollywood.\"[14] He had previously turned down Disney when they offered to make a film based on his book.[15] According to its writer Earl Hamner Jr., White (who sometimes offered advice and suggestions to the filmmakers) would have preferred Mozart in it, rather than the music of the Sherman Brothers.[16]","box_office":"$2.4 million (rentals)[1]","cinematography":"Dick Blundell|Ralph Migliori|Roy Wade|Dennis Weaver|","production_company":"Hanna-Barbera Productions Sagittarius Productions","directed_by":"Charles A. Nichols|Iwao Takamoto|","Soundtrack":"\"Zuckerman's Famous Pig\" is the title that saves Wilbur, the pig hero, from being slaughtered in the story. It is the theme of the finale song in the film. It was composed and arranged in a barbershop quartet style by the Sherman Brothers, in keeping with the time and place of the story.[17] It was covered by the Brady Kids and was chosen for release on their first single taken from The Brady Bunch Phonographic Album by producer Jackie Mills.[18]","narrated_by":"Rex Allen","release_dates":"February 22, 1973 (1973-02-22) (Premiere-New York City)|March 1, 1973 (1973-03-01) (United States)||||","Production":"After the studio decided to make the film, Joe Barbera visited E. B. White in Maine. White highlighted parts of the book he did not want changed, and parts \"subject to discussion.\"[4]Barbera wrote that Debbie Reynolds called him and said that she was willing to join the project even without being paid.[4]White himself discussed the making of the film with Gene Deitch, a director of animation and friend of his.[5]Czech painter Mirko Hanák produced unused artwork of the film before dying of leukemia.[6]","produced_by":"Joseph Barbera|William Hanna|","starring":"Debbie Reynolds|Paul Lynde|Henry Gibson|","running_time":"94 minutes","charlotte's_web":"Theatrical release poster","Sequel":"A direct-to-video sequel entitled Charlotte's Web 2: Wilbur's Great Adventure was released in 2003. It centers on Wilbur's relationship with a lonely lamb named Cardigan, and also shows Charlotte's children as adolescents. Reviews for it were generally unfavorable, with critics panning its animation and plot.","music_by":"Richard M. Sherman|Robert B. Sherman (songs)|Irwin Kostal|","edited_by":"Larry C. Cowan|Pat Foley|","Release":"The film was released to theaters on March 1, 1973, by Paramount Pictures in the United States. It had a limited release on February 22, 1973, in New York City, and also released in West Germany on March 30, 1973, as well as August 11 in Sweden, August 25 in Japan, and September 4, 1981 in Australia.The film was first released on VHS in 1979, followed by three more releases in 1988, 1993, and 1996. It made its DVD debut in 2001. A second DVD release of it was released in 2006."}