{"based_on":"an original screenplay  by Gore Vidal","country":"Italy United States","distributed_by":"Produzioni Atlas Consorziate (P.A.C.) (Italy)[6] Analysis Film Releasing Corporation (US)[7]","Legacy":"Helen Mirren described Caligula as \"an irresistible mix of art and genitals\".[29] In 2005, artist Francesco Vezzoli produced a fake trailer for an alleged remake called Gore Vidal's Caligula as a promotion for Versace's new line of accessories; the remake was to star Helen Mirren as \"the Empress Tiberius\", Gerard Butler as Chaerea, Milla Jovovich as Drusilla, Courtney Love as Caligula, and Karen Black as Agrippina the Elder and featuring an introduction by Gore Vidal. The fake trailer was screened worldwide, including New York City's Whitney Museum of American Art's 2006 Whitney Biennial.[52] Leonardo DiCaprio has cited the film as an influence on his approach to the lead in The Wolf of Wall Street.[53]Caligula was released on DVD and Blu-Ray in an \"Imperial Edition\",[54] which featured the unrated theatrical release version and a new version featuring alternate sequencing from the original theatrical release and without the explicit sexual content shot by Guccione. This edition also includes audio commentaries featuring Malcolm McDowell and Helen Mirren, and interviews with the cast and crew.[55]","Plot":"Caligula is the young heir to the throne of the syphilis-ridden, half-mad Emperor Tiberius. One morning, a blackbird flies into his room; Caligula considers this a bad omen. Shortly afterward, the head of the Praetorian Guard, Macro tells Caligula that Tiberus, his great uncle, demands his immediate presence at Capri, where the Emperor lives with his close friend Nerva, a dim-witted relative Claudius, and Caligula's younger stepbrother Gemellus. Fearing assassination, Caligula is afraid to leave but his sister and lover Drusilla persuades him to go.At Capri, Caligula finds that Tiberius has become depraved, showing signs of advanced venereal diseases, and embittered with Rome and politics. Tiberius enjoys swimming with naked youths and watching degrading sex shows that often include children and deformed people. Caligula observes with fascination and horror. Tensions rise when Tiberius tries to poison Caligula in front of Gemellus. Nerva commits suicide and Caligula tries to kill Tiberius. Proving his loyalty to Caligula, Macro kills Tiberius instead with Gemellus as a witness.After Tiberius' burial, Caligula is proclaimed the new Emperor, then proclaims Drusilla as his equal, to the apparent disgust of the Roman Senate. Drusilla, fearful of Macro's influence, persuades Caligula to get rid of him. Caligula sets up a mock trial in which Gemellus is intimidated into testifying that Macro murdered Tiberius alone, then has Macro's wife Ennia banished from Rome. After Macro is executed in a gruesome public game, Caligula appoints Tiberius' former adviser Longinus as his personal assistant while pronouncing the docile Senator Chaerea as the new head of the Praetorian Guard.Drusilla tries to find Caligula a wife among the priestesses of the goddess Isis, the cult they secretly practice. Caligula wants to marry Drusilla, but she insists they cannot marry because she is his sister. Instead, Caligula marries Caesonia, a priestess and notorious courtesan after she bears him an heir. Drusilla reluctantly supports their marriage. Meanwhile, despite Caligula's popularity with the masses, the Senate expresses disapproval for what initially seem to be light eccentricities. Darker aspects of Caligula's personality emerge when he rapes a bride and groom on their wedding day in a minor fit of jealousy and orders Gemellus's execution to provoke a reaction from Drusilla.After discovering that Caesonia is pregnant, Caligula suffers severe fever. Drusilla nurses him back to health. Just as he fully recovers, Caesonia bears him a daughter, Julia Drusilla. During the celebration, Drusilla collapses with the same fever he suffered. Soon afterwards, Caligula receives another ill omen in the form of a blackbird. Despite his praying to Isis out of desperation, Drusilla dies from her fever. Initially unable to accept her death, Caligula suffers a nervous breakdown and rampages through the palace, destroying a statue of Isis while clutching Drusilla's body.Now in a deep depression, Caligula walks the Roman streets disguised as a beggar; he causes a disturbance after watching an amateur performance mocking his relationship with Drusilla. After a brief stay in a city jail, Caligula proclaims himself a god and becomes determined to destroy the senatorial class, which he has come to loathe. The new reign he leads becomes a series of humiliations against the foundations of Rome—senators' wives are forced to work in the service of the state as prostitutes, estates are confiscated, the old religion is desecrated and the army is made to embark on a mock invasion of Great Britain. Unable to further tolerate his actions, Longinus conspires with Chaerea to assassinate Caligula.Caligula enters his bedroom where a nervous Caesonia awaits him. Another blackbird appears but only Caesonia is frightened of it. The next morning, after rehearsing an Egyptian play, Caligula and his family are attacked in a coup headed by Chaerea. While leaving the stadium, Caligula's wife and daughter are murdered and Chaerea stabs Caligula in the stomach. With his final breath, he defiantly whimpers \"I live!\" As Caligula and his family's bodies are thrown down the stadium's steps and their blood is washed off the marble floor, Claudius is proclaimed the new Emperor.","caligula":"US film poster, featuring a coin designed by Daniel Maffia[1]","language":"English Italian","Reception":"Caligula received generally negative reviews.[40] Roger Ebert gave it zero stars, calling it \"sickening, utterly worthless, shameful trash\". Ebert wrote, \"In the two hours of this film that I saw, there were no scenes of joy, natural pleasure, or good sensual cheer. There was, instead, a nauseating excursion into base and sad fantasies.\"[41] It is also notable for being one of the few films Ebert has ever walked out of- he walked out 2 hours into its 170 minute length after feeling \"disgusted and unspeakably depressed\".[41] He and Gene Siskel selected the film as one of their \"dogs of the year\" in a 1980 episode of Sneak Previews.[42] Variety Magazine described the film as a \"moral holocaust\".[43] Rex Reed called Caligula \"a trough of rotten swill\".[22] Jay Scott, reviewing Caligula for the The Globe and Mail, said, \"Caligula doesn't really work on any level\".[44] Scott unfavourably compared Caligula with In the Realm of the Senses, describing the latter film as a better treatment of extreme sexuality.[44] Scott's review went on to say \"Rome would seem to be at least as fecund a territory for the cinematic exploration of sex, death and money, as pre-war Japan...but what's missing from Caligula, which is rife with all three, is any connective tissue (also any point of view, any thought, any meaning)\".[44] Scott concluded his review by claiming the whole film's production was \"a boondoggle of landmark proportions\".[44] New York critic David Denby described the film as \"an infinitely degraded version of Fellini Satyricon.[24] Tom Milne (Monthly Film Bulletin) stated that the film was \"by no means so awesomely bad as most critics have been pleased to report–but pretty bad all the same\" and found the film to be \"notable chiefly for the accuracy with which it reflects this anonymity.\"[45]Although Caligula is considered to be a \"cult classic\",[46] it continued to garner negative reception long after its release. It has been reappraised by some critics; review aggregate Rotten Tomatoes gives the film a score of 24%, based on 29 reviews.[40] Leslie Halliwell said Caligula was \"a vile curiosity of interest chiefly to sado-masochists\".[47] Time Out London called it \"a dreary shambles\".[48] Positive criticism of the film came from Moviehole reviewer Clint Morris, who awarded it 3 stars out of 5, calling it \"[a] classic in the coolest sense of the word\".[40] New Times critic Gregory Weinkauf gave the film 3 out of 5, calling it \"Kinda dumb and tacky, but at least it's a real movie\".[40] Arkansas Democrat-Gazette reviewer Philip Martin also gave the film 3 out of 5.[40]Writers for The Hamilton Spectator and St. Louis Post-Dispatch said Caligula was one of the worst films they'd seen.[49][50] Writing for The A.V. Club, Keith Phipps said, \"As a one-of-a-kind marriage of the historical epic and the porn film ... Caligula deserves a look. But it might be better to let Guccione's savagely unpleasant folly fade into the century that spawned it\".[51]","box_office":"$23 million[11]","cinematography":"Silvano Ippoliti","production_company":"Penthouse Films International Felix Cinematografica","directed_by":"Tinto Brass (credited as Principal Photographer) Additional Scenes: Giancarlo Lui Bob Guccione","release_dates":"August 14, 1979 (1979-08-14) (Italy)[8]|February 1, 1980 (1980-02-01) (U.S.)[9]||||","Production":"The men's magazine Penthouse had long been involved in film funding, helping invest in films made by other studios, including Chinatown, The Longest Yard and The Day of the Locust, but it had never produced a film on its own.[12] The magazine's founder Bob Guccione wanted to produce an explicit adult film within a feature film narrative that had high production values; he decided to produce a film about the rise and fall of the Roman emperor Caligula.[13] Development began under producer Franco Rossellini, the nephew of filmmaker Roberto Rossellini.[12] A screenplay was written by Lina Wertmüller, but Guccione rejected Wertmüller's script and paid Gore Vidal to write a new screenplay.[14] Vidal's screenplay had a strong focus on homosexuality, leading Guccione to demand rewrites which toned down the homosexual content for wider audience appeal. Guccione was concerned that Vidal's script contained several homosexual sex scenes and only one scene of heterosexual sex, which was between Caligula and his sister Drusilla.[14][15] Vidal was paid US$200,000 for his screenplay, which was titled Gore Vidal's Caligula.[12]Elaborate sets were built by production designer Danilo Donati, who also designed the film's costumes, jewelry, hair styles, wigs and makeup.[12] Several mainstream actors were cast, Guccione intending to make a film which he felt, like Citizen Kane, would be a landmark in cinematic history.[15] Guccione offered directing duties to John Huston and Lina Wertmüller, both of whom rejected the film.[12] After viewing scenes from the film Salon Kitty, Guccione agreed to have lunch with that film's director Tinto Brass, believing Brass would be the ideal person to direct Caligula.[15] Brass had a reputation for being difficult to deal with on film sets but Guccione thought the film's epic scope would \"keep [Brass] in line\" and that Brass understood the concept of the film enough to direct it.[12] Brass described Vidal's screenplay as \"the work of an aging arteriosclerotic\" and agreed to direct only if he was allowed to rewrite Vidal's screenplay.[15] Brass' screenplay expanded the sexual content to include orgies, decorative phalluses, and much female nudity.[15] Guccione said Brass' rewrites were done out of necessity to the film's visual narrative and did not alter the dialogue or content.[12]In an interview for Time magazine, Vidal said that in film production, directors were \"parasites\" and a film's author was its screenwriter; in response, Brass demanded Vidal's removal from the set and Guccione agreed.[12] Guccione considered film to be a \"collective effort, involving the input of a great number of artists and craftsmen\", and the director to be the leader of a \"team effort\".[12] Vidal filed a contractual dispute over the film because of Brass' rewrites;[12] Guccione said Vidal had demanded 10% of the film's profits, which Vidal said was not the case.[14] Vidal distanced himself from the production, calling Brass a \"megalomaniac\". Brass publicly stated, \"If I ever really get mad at Gore Vidal, I'll publish his script\".[16] Vidal's name was removed from the film's title; the credits were changed to state that the film was \"adapted from a screenplay by Gore Vidal\", crediting no official screenwriter.[17] Guccione said, \"Gore's work was basically done and Tinto's work was about to begin\".[12]What shall it profit a man if he should gain the whole world and lose his own soul?The film's primary theme is \"absolute power corrupts absolutely\".[19] Vidal's script presented Caligula as a good man driven to madness by absolute power;[15] Brass' screenplay envisioned Caligula as a \"born monster\".[15] In The Encyclopedia of Epic Films, author Djoymi Baker describes Brass' screenplay as \"an antiepic with an antihero, on a path of self-inflicted, antisocial descent\".[20] Guccione said this final draft was more violent than sexual, stating, \"I maintain the film is actually anti-erotic ... in every one of its scenes you'll find a mixture of gore or violence or some other rather ugly things\".[19]Renowned actors were cast in the film, including Malcolm McDowell, Helen Mirren, Peter O'Toole and Sir John Gielgud, with Maria Schneider cast as Caligula's doomed sister Drusilla.[16] Schneider became uncomfortable with appearing nude and in sexual scenes, and left the production, to be replaced by Teresa Ann Savoy, whom Brass had previously worked with on Salon Kitty.[16] Gielgud was originally offered the role of Tiberius, which he declined, as he felt Vidal's script was \"pornographic\"; however, he later accepted the role of Nerva.[21] Director Tinto Brass cast his own acquaintances as senators and noblemen, including ex-convicts, thieves and anarchists.[12][22] Guccione cast Penthouse Pets as female extras in sexual scenes.[12]Shooting began in 1976 in Rome.[12] McDowell got along well with Tinto Brass, while Peter O'Toole immediately disliked the director. John Gielgud and Helen Mirren were indifferent to Brass; they focused on their own performances.[12] O'Toole had stopped drinking alcohol before filming, but Guccione described O'Toole as being \"strung out on something\" and said the actor was not sober during the entire filming schedule.[12]During the film's production, McDowell took members of the production to dinner at an expensive restaurant to celebrate England's win in a football match against the Italian team. He left the choreographer to pay for the meal, saying he had forgotten to bring enough money.[12] At the end of the production, McDowell gave his dresser a pendant bearing her name, but it was misspelled and she gave it back to him. McDowell offered her a signet ring, a prop from the film. She refused because it belonged to the production company.[12]Brass decided not to focus much on Danilo Donati's elaborate sets, and intentionally kept the Penthouse Pets in the background during sex scenes. He focused instead on women whom Guccione considered to be unattractive.[12] Brass and Guccione disagreed about the film's approach to sexual content; Guccione preferred unsimulated sexual content that Brass did not want to film.[23]Filming concluded on December 24, 1976.[12] Guccione said Brass shot enough film to \"make the original version of Ben-Hur about 50 times over\".[12] Brass started editing the film himself but was not allowed to continue after he had edited approximately the first hour of it. His rough-cut was disassembled afterwards and the film was edited by several editors, changing its tone and structure significantly by removing and re-arranging many scenes, using different takes, a slower editing style and music other than Brass intended.[25]A few weeks after filming had concluded, Guccione and Giancarlo Lui returned to Rome with several Penthouse Pets. Guccione and Lui \"hired a skeleton crew, snuck back into the studios at night, raided the prop room\"[12] and shot hardcore sex scenes to edit into the film.[22][23] Brass ultimately disowned the film.[24]Even though there were a number of editors on the film, the names of the editors were not credited in the finished film. Instead, the credit \"Editing by the Production\" is given during the opening credits.Because the film was intended for release in English and much of the dialogue was recorded in Italian, the film's dialogue had to be dubbed.[26] Peter O'Toole was reluctant to re-record his dialogue; he stayed away from the film's producers until he finally agreed to re-record his dialogue in a Canadian recording studio.[12] The final production cost of the film was $17.5 million.[10]The film was scored by Bruno Nicolai under the name Paul Clemente.[3][4] According to Kristopher Spencer, the score \"is gloriously dramatic, capturing both the decadent atmosphere of ancient Rome and the twisted tragedy of its true story\".[4] The score also featured music by Aram Khachaturian (from Spartacus) and Sergei Prokofiev (from Romeo and Juliet).[4] In November 1980, Guccione formed Penthouse Records to release a double album soundtrack to Caligula.[27] The album featured Nicolai's score and two versions—one in a disco style—of a love theme titled \"We Are One\", which did not appear in the film.[4][28]","produced_by":"Bob Guccione Franco Rossellini","starring":"Malcolm McDowell Teresa Ann Savoy Helen Mirren Peter O'Toole John Gielgud","running_time":"156 minutes","music_by":"Paul Clemente[3][4] Musical Excerpts: Aram Khachaturian Sergei Prokofiev","External links":"","edited_by":"Nino Baragli The Production[5] Russell Lloyd (uncredited)","Release":"Guccione refused to submit Caligula to the MPAA because he did not want the film to receive a rating—even X—which he considered to be \"demeaning\".[10] Instead, Guccione applied his own \"Mature Audiences\" rating to the film, instructing theater owners not to admit anyone under the age of 18.[30] The film premiered in the United States on February 1, 1980, at the Trans Lux East Theatre, which Guccione had rented exclusively to screen the film; he changed the theater's name to Penthouse East.[9]Rather than leasing prints to exhibitors, the distributor rented theaters that specialized in foreign and art films for the purpose of screening Caligula exclusively,[31] to keep the film out of theaters that showed pornographic films.[30][31][32] In 1981, the Brazilian Board of Censors approved the establishment of special theaters to screen In the Realm of the Senses and Caligula because they were international box office hits.[33]Caligula grossed US$23 million[11] at the box office, becoming the highest-grossing pornographic film ever produced independently.[34] The film was a financial success in France, Germany, Switzerland, Belgium, the Netherlands and Japan.[27] A 105-minute R-rated version without the explicit sexual material was released in 1981.[17][35][36]In 1979, when Guccione tried to import the film's footage into the U.S., customs officials seized it. Federal officials did not declare the film to be obscene.[32] When the film was released in New York City, the anti-pornography organization Morality in Media unsuccessfully filed a lawsuit against these federal officials.[32]In Boston, Massachusetts, authorities seized the film.[32] Penthouse took legal action, partly because Guccione thought the legal challenges and moral controversies would provide \"the kind of [marketing] coverage money can never buy\".[37] Penthouse won the case when a Boston Municipal Court ruled that Caligula had passed the Miller test and was not obscene.[37] While the Boston judge said the film \"lacked artistic and scientific value\" because of its depiction of sex and considered it to \"[appeal] to prurient interests\", he said the film's depiction of ancient Rome contained political values which enabled it to pass the Miller test in its depiction of corruption in ancient Rome, which dramatized the political theme that \"absolute power corrupts absolutely\".[19] A Madison, Wisconsin district attorney declined an anti-pornography crusader's request to prevent the release of Caligula on the basis that \"the most offensive portions of the film are those explicitly depicting violent, and not sexual conduct, which is not in any way prohibited by the criminal law.\"[19]Atlanta, Georgia prosecutors threatened legal action if the film was to be screened in the city, but experts testified in court on behalf of the film, and Atlanta, too, declared that the film was not obscene.[32] Citizens for Decency through Law, a private watchdog group which protested against films which it deemed immoral, sought to prevent the film's exhibition in Fairlawn, Ohio on the grounds that it would be a \"public nuisance\", leading Penthouse to withdraw the film from exhibition there to avoid another trial.[19] CDL's lawyer advised against attempting to prosecute Penthouse for obscenity and instead recommended a civil proceeding, because the film would not be placed against the Miller test.[19] The Penthouse attorney described the Fairlawn events as being driven by conservative morality reinforced by Ronald Reagan's presidential victory, stating, \"Apparently, these extremists have interpreted a change by administration to mean a clarion call for a mandate to shackle the public's mind again.\"[19] The uncut film was granted a certificate by the British Board of Film Classification in 2008. The film was banned in Australia, where it continues to be banned in its uncut form as of 2014.[38]In 1981, Anneka Di Lorenzo, who played Messalina, sued Guccione, claiming sexual harassment. In 1990, after a protracted litigation, a New York state court awarded her $60,000 in compensatory damages and $4 million in punitive damages. On appeal, court vacated the award because the punitive damages were determined to be unrecoverable.[39]","written_by":"Tinto Brass Malcolm McDowell Giancarlo Lui Bob Guccione (all uncredited)[2]","budget":"$17.5 million[10]"}