{"country":"United States","distributed_by":"Metro-Goldwyn-Mayer (MGM)","Plot":"Irish terrorist Ryan Gaerity (Tommy Lee Jones) escapes from his cell in a castle prison in Northern Ireland, killing a guard and his cellmate in the process, after turning a toilet into a bomb.In Boston, Lt. Jimmy Dove (Jeff Bridges) is a veteran member of the police force's bomb squad, on the verge of retirement and helping to train newer recruits. Dove hides that he is really Liam McGivney, a former member of a Northern Ireland terrorist cell. Dove had been friends with Gaerity, but when Gaerity tried to set off a bomb that would have killed numerous civilians, McGivney (now Dove) interceded, ending in the death of his girlfriend, Gaerity's sister and leading to Gaerity's imprisonment. Devastated, McGivney/Dove had moved to Boston and took on the Dove identity, hoping to find atonement in defusing bombs and saving others. Only Dove's uncle Max O'Bannon (Lloyd Bridges) is aware of this past and expresses his desire for Dove to retire earlier, having clearly shown his atonement.Gaerity makes his way to Boston, taking residence in an abandoned casino boat, and tracks down Dove/McGivney. Gaerity takes a job as a janitor at the police station to learn more about Dove's present life and those of his co-workers. Gaerity sets up bombs specifically designed to kill the defusers, which kill three of Dove/McGivney's team members. Dove recognizes Gaerity's work in the bomb designs, and realizes that his wife Kate (Suzy Amis) and daughter are in danger. He explains his true past to them, and convinces them to go into hiding at a nearby beach house. Another squad member, rookie technician Anthony Franklin (Forest Whitaker), who has linked Dove/McGivney's former life to Gaerity, is safely rescued from another bomb planted by Gaerity with Dove's aid, and promises Dove any assistance he can offer.Max decides to try to stop Gaerity himself, trying to get close to him at an Irish bar, but instead ends up captured by Gaerity, and latched into a makeshift bomb. Dove tracks down Max, and goes to retrieve his tools, but Max, realizing that Gaerity created the bomb to kill both of them, intentionally triggers the bomb while Dove is away, sacrificing himself. In analyzing the bomb's debris, Dove finds a roulette ball that points to the abandoned ship, and tracks Gaerity there. Gaerity reveals that he has set up another bomb in Kate's car and activates its arming mechanism before engaging with Dove in a large melee fight throughout the booby-trapped ship, rigged to blow up in a few minutes. With Dove gaining the upper hand. Gaerity handcuffs himself to Dove, preventing him from leaving. Dove is saved by Franklin, who had followed Dove to the ship, and the two escape in time before the ship explodes.The two race back to the city, hoping to stop Kate before she starts the car. They arrive too late but are able to catch up to Kate, and Dove jumps into her car. He finds the complex bomb and manages to defuse it in time. As they recover, Franklin tells Dove he knows his past identity but will keep it a secret if he can take credit for taking down Gaerity; Dove agrees and gives Franklin his badge before leaving with Kate and his daughter.","language":"English/Irish","Reception":"Blown Away received negative reviews from critics and holds a 28% rating on Rotten Tomatoes based on 18 reviews. The film was widely criticized for the poor Irish accents of the three main Irish characters, with Tommy Lee Jones' portrayal of Ryan Gaerity particularly receiving the harshest criticism.[2]","box_office":"$30,155,037","directed_by":"Stephen Hopkins","release_dates":"July 1, 1994","Production":"It was the first action film starring Jeff Bridges.[1]","produced_by":"Pen Densham Richard Barton Lewis John Watson","starring":"Jeff Bridges Tommy Lee Jones Suzy Amis Forest Whitaker Lloyd Bridges","running_time":"121 minutes","music_by":"Alan Silvestri","Release":"The VHS of the film was released on December 14th 1994. The UK rental tape of the film notably featured a Tango Orange advertisement in the trailers at the start which was banned from television for being frightening.","written_by":"John Rice Joe Batteer Jay Roach","budget":"$50 million"}