{"alexander's_ragtime_band":"Theatrical release poster","country":"United States","Awards and nominations":"Alfred Newman won an Academy Award for Best Music, Scoring.[9] The film was also nominated for:","distributed_by":"20th Century Fox","screenplay_by":"Kathryn Scola Lamar Trotti","language":"English","Reception":"The film had its New York premiere at the Roxy Theatre on August 5, 1938, with Cuban bandleader Desi Arnaz heading the stage show.[3]Contemporary reviews from critics were positive. Frank S. Nugent of The New York Times wrote, \"With those twenty-six Berlin tunes at its disposal and with such assured song-pluggers as Alice Faye and Ethel Merman to put them over, the picture simply runs roughshod over minor critical objection and demands recognition as the best musical show of the year.\"[4] Variety wrote, \"Superlative in conception, execution and showmanship, it provides a rare theatrical and emotional experience.\"[5] Film Daily declared it \"solid entertainment that should play to big returns.\"[6] Harrison's Reports called it \"Excellent entertainment, capably directed and acted.\"[7] Russell Maloney of The New Yorker called the music \"reason enough to see the film,\" though he criticized the \"small, persistent, mosquitolike irritation of the plot\" and instances of anachronistic dialogue.[8]","Radio adaptation":"Alexander's Ragtime Band was presented on Lux Radio Theatre June 3, 1940. The adaptation starred Faye and Robert Preston.[10]","box_office":"$3.6 million (gross rental)[2]","cinematography":"J. Peverell Marley","directed_by":"Henry King","release_dates":"August 5, 1938 (1938-08-05)","produced_by":"Darryl F. Zanuck","starring":"Tyrone Power Alice Faye Don Ameche Jack Haley Ethel Merman","running_time":"106 minutes","Songs":"Alexander's Ragtime Band features several hit songs by Irving Berlin including \"Heat Wave\", \"Some Sunny Day\", \"Blue Skies\", \"Easter Parade\", \"A Pretty Girl Is Like a Melody\" and \"Alexander's Ragtime Band\". Previously released songs were re-arranged and used in conjunction with new songs written by Berlin for the film.","music_by":"Irving Berlin Alfred Newman","edited_by":"Barbara McLean","written_by":"Irving Berlin Richard Sherman","budget":"$1,200,000–$2,275,000[1]"}