{"Adaptations":"N. H. Kleinbaum wrote a novel of the same name based on the movie: Dead Poets Society. New York: Hyperion. 1989. ISBN 978-1-4013-0877-3. OCLC 71164757. The ending of the film was satirized in a Saturday Night Live sketch, \"Farewell, Mr. Bunting,\" in which a student, upon climbing onto his desk, was decapitated by a ceiling fan.[27]","country":"United States","distributed_by":"Buena Vista Pictures Distribution","Plot":"In 1959, shy Todd Anderson begins his senior year of high school at Welton Academy, an elite prep boarding school. He is assigned one of Welton's most promising students, Neil Perry, as his roommate and is quickly accepted by Neil's friends: romantic Knox Overstreet, overachiever Richard Cameron, best friends Steven Meeks and Gerard Pitts, and mischievous beatnik Charlie Dalton.On the first day of classes, they are surprised by the unorthodox teaching methods of new English teacher John Keating, a Welton alumnus who encourages his students to \"make your lives extraordinary\", a sentiment he summarizes with the Latin expression carpe diem (\"seize the day\"). Subsequent lessons include standing on their desks to teach the boys how they must look at life in a different way, telling them to rip out the introduction of their poetry books which explains a mathematical formula used for rating poetry, and inviting them to make up their own style of walking in a courtyard to encourage them to be individuals. His methods attract the attention of strict Headmaster Gale Nolan.Upon learning that Keating was a member of the unsanctioned Dead Poets Society while he was at Welton, Neil restarts the club and he and his friends sneak off campus to a cave where they read poetry and verse, including their own compositions. As the school year progresses, Keating's lessons and their involvement with the club encourage them to live their lives on their own terms. Knox pursues Chris Noel, a girl who is dating a football player and whose family is friends with his. Neil discovers his love of acting and gets the lead in a local production of A Midsummer Night's Dream, despite the fact that his domineering father wants him to go to medical school. Keating helps Todd come out of his shell and realize his potential when he takes him through an exercise in self-expression, resulting in his composing a poem spontaneously in front of the class.Charlie publishes an article in the school newspaper in the name of the Dead Poets Society demanding that girls be admitted to Welton. Nolan uses corporal punishment to coerce Charlie into revealing who else is in the Dead Poets Society, but he resists. Nolan also speaks with Keating, warning him that he should discourage his students from questioning authority.Neil's father discovers Neil's involvement in the play and tells him to quit on the eve of the opening performance. Devastated, Neil goes to Keating, who advises him to stand his ground and prove to his father that his love of acting is something he takes seriously. Neil's father unexpectedly shows up at the performance. He takes Neil home and tells him he is forcing him into military school. Unable to find the courage to stand up to his father, a distraught Neil commits suicide.Nolan investigates Neil's death at the request of the Perry family. Richard blames Neil's death on Keating to escape punishment for his own participation in the Dead Poets Society, and names the other members. Confronted by Charlie, Richard urges the rest of them to let Keating take the fall. Charlie punches Richard and is expelled. Each of the boys is called to Nolan's office to sign a letter attesting to the truth of Richard's allegations, even though they know they are false. When Todd's turn comes, he is reluctant to sign, but does so after seeing that the others have complied.Keating is fired and Nolan takes over teaching the class. Keating interrupts the class to collect personal articles; before he leaves Todd shouts that all of them were forced to sign the letter that resulted in his dismissal and that Neil's death was not his fault. Todd stands on his desk and salutes Keating with the words \"O Captain! My Captain!\". Over half the rest of the class does the same, ignoring Nolan's orders to sit down. Keating is deeply touched by their gesture and realizes his teaching has made a lasting impact. He thanks the boys and departs.","language":"English","Reception":"The worldwide box office was reported as $235,860,116, which includes domestic grosses of $95,860,116.[3] The film's global receipts were the fifth-highest for 1989, and the highest for dramas.[10]Dead Poets Society holds an 85% approval rating and average rating of 7.2/10 on Rotten Tomatoes based on 54 reviews. The site's critical consensus reads, \"Affecting performances from the young cast and a genuinely inspirational turn from Robin Williams grant Peter Weir's prep school drama top honors.\"[11] The film also holds a score of 79 out of 100 on Metacritic based on 14 reviews, indicating \"generally favorable reviews.\"[12]The Washington Post reviewer called it \"solid, smart entertainment\", and praised Robin Williams for giving a \"nicely restrained acting performance\".[13] Vincent Canby of The New York Times also praised Williams' \"exceptionally fine performance\", while noting that \"Dead Poets Society... is far less about Keating than about a handful of impressionable boys\".[4] Pauline Kael was unconvinced by the film, and its 'middlebrow highmindedness', but praised Williams. \"Robin Williams' performance is more graceful than anything he's done before [-] he's totally, concentratedly there - [he] reads his lines stunningly, and when he mimics various actors reciting Shakespeare there's no undue clowning in it; he's a gifted teacher demonstrating his skills.\"[14]Roger Ebert's review was largely negative, only giving the film two out of four stars. He criticized Williams for spoiling an otherwise creditable dramatic performance by occasionally veering into his onstage comedian's persona, and lamented that for a movie set in the 1950s there was no mention of the Beat Generation writers. Additionally, Ebert described the film as an often poorly constructed \"collection of pious platitudes [...] The movie pays lip service to qualities and values that, on the evidence of the screenplay itself, it is cheerfully willing to abandon.\"[15] On their Oscar Nomination edition of Siskel & Ebert, both Gene Siskel (who also gave the film a mixed review) and Ebert disagreed with Williams' Oscar nomination, with Ebert saying that he would have swapped Williams with either Matt Dillon for Drugstore Cowboy or John Cusack for Say Anything. On their If We Picked the Winners special in March 1990, moreover, Ebert chose the film's Best Picture nomination as the worst nomination of the year, believing it took a slot that could have gone to Spike Lee's Do the Right Thing.Dead Poets Society won the Academy Award for Best Original Screenplay (Tom Schulman). Peter Weir received a nomination for Best Director and the film itself was nominated for Best Picture of 1989. Robin Williams received his second Best Actor in a Leading Role nomination and it has since been widely recognized as one of the actor/comedian's best roles. It also won the BAFTA Award for Best Film.The film was voted #52 on the AFI's 100 Years…100 Cheers list, a list of the top 100 most inspiring films of all time.[23]","Quotes":"The film's line \"Carpe diem. Seize the day, boys. Make your lives extraordinary.\" was voted as the 95th greatest movie quote by the American Film Institute.[24]After Williams' death in 2014, fans of his work used social media to pay tribute to him with photo and video reenactments of the film's final \"O Captain! My Captain!\" scene.[25][26]","box_office":"$235.8 million[3]","cinematography":"John Seale","directed_by":"Peter Weir","production_companies":"Touchstone Pictures Silver Screen Partners IV","release_dates":"June 2, 1989 (1989-06-02)|||||","Production":"The script was written by Tom Schulman, based on his experiences at the Montgomery Bell Academy in Nashville, Tennessee, particularly with his inspirational teacher Samuel Pickering.[6][7] A scene in the original script showing Keating dying in a hospital was removed by film director Peter Weir, giving Todd's gesture of standing on his desk the meaning of standing for one's belief.[8] Filming took place at St. Andrew's School in Middletown, Delaware, and at locations in New Castle, Delaware and in nearby Wilmington, Delaware.[9]","produced_by":"Steven Haft|Paul Junger Witt|Tony Thomas|","starring":"Robin Williams|","running_time":"128 minutes[1]","music_by":"Maurice Jarre","dead_poets_society":"Theatrical release poster","edited_by":"William Anderson","written_by":"Tom Schulman","budget":"$16.4 million[2]"}