{"country":"United States","Box office and reception":"Child's Play was produced on a budget of $9,000,000. The film was released on November 9, 1988 in 1,377 theaters, opening at #1, out of the other 12 films that were showing that week, with $6,583,963.[7] The film went on to gross $33,244,684 at the domestic box office and an additional $10,952,000 overseas for a worldwide total of $44,196,684.[8]The film holds a 67% approval rating on Rotten Tomatoes based on 33 reviews; the average rating is 6.4/10.[9] Roger Ebert gave the film 3 out of 4 stars, calling it a \"cheerfully energetic horror film\".[10]","distributed_by":"MGM/UA Communications Co.","screenplay_by":"Don Mancini John Lafia Tom Holland","story_by":"Don Mancini","child's_play":"Theatrical release poster","Plot":"Detective Mike Norris (Chris Sarandon), fatally shoots serial killer Charles Lee Ray, known as the \"Lakeshore Strangler\" on November 9, 1988 in Chicago. Ray escapes to a toy store, where he transfers his soul via voodoo ritual to a \"Good Guy\" doll. The voodoo energy results in an explosion as Mike arrives, seeing Ray's body, he believes he killed him.The next day, widow Karen Barclay buys the same Good Guy doll at work from a peddler as a birthday gift for her son Andy. That night, Karen's friend Maggie Peterson comes to babysit Andy. The doll, now named \"Chucky,\" kills Maggie after she stops him from getting live updates on TV of his former accomplice, Eddie Caputo (who abandoned Charles Lee Ray the night he got shot). He does this by striking her in the head with a hammer, sending her falling to her death out an open window. The police soon arrive and Mike thinks Andy had something to do with Maggie's death, much to the fury of Karen, who orders the police to leave.The next morning, Andy, on Chucky's apparent orders, ditches school and takes Chucky to a rough part of Chicago where Eddie lives. Chucky sneaks into Eddie's home while Andy is urinating. He turns off the pilot light and turns up the gas, which explodes after Eddie shoots at it, destroying the building and killing Eddie. When Andy is again questioned by the police, he blames it on Chucky. Andy is then sent to a mental hospital, much to Karen's dismay.That night, Karen discovers Andy was telling the truth when she realizes Chucky's batteries were never placed inside, meaning Chucky has been functioning on his own power. When inspecting the doll, Chucky comes alive, curses at her in Charles Lee Ray's voice, bites her and escapes; Detective Norris finally agrees to help after Chucky almost kills him in his car. Chucky goes to a man named John, Charles Lee Ray's former voodoo teacher. When asked why he bled after being injured, John reveals to Chucky that the longer his soul remains trapped within the doll, the more human he becomes. In order to escape the doll's body, Chucky must possess the first person to whom he told about his possession, which is Andy. When John rejects Chucky's plea for help, Chucky fatally stabs John using his own voodoo doll. Chucky escapes just before Karen and Detective Norris arrive on the scene. Before dying, John tells them that although Chucky is a doll, his heart is fully human and vulnerable to fatal injury.At the mental hospital, Chucky steals the key to Andy's cell, but discovers Andy is not there. Dr. Ardmore finds Andy and unsuccessfully tries to sedate him. Chucky violently electrocutes Dr. Ardmore, then follows Andy home and knocks him unconscious with a wooden baseball bat. As Chucky begins possessing Andy, Karen and Detective Norris arrive and stop him. Chucky slashes Mike, then goes after Karen and Andy. The pair trap Chucky in the fireplace and burn him. Thinking Chucky is dead, Karen and Andy leave the room to help Mike, but Chucky follows them and attempts to kill them. Chucky is again thought to be killed when Karen shoots him, severing an arm, a leg, and his head. Jack Santos, Mike's partner, arrives at the apartment, and disbelieves the trio's story. Chucky's body then bursts through a ventilation duct and tries to strangle Jack. Karen tells Mike to aim and shoot for Chucky's heart. After Mike kills Chucky, he and Karen go to the hospital. Karen turns off the bedroom's lights and Andy looks back at Chucky before closing the door.","language":"English","Promotion":"Child's Play has been adapted into two comic book series:Child's Play was originally released on home video in North America on April 25, 1989.The film was first released on DVD by MGM in 1999. The film was presented in an open-matte full screen presentation and included a theatrical trailer and a \"Making Of\" booklet. The Australian DVD release by MGM featured the film in non-anamorphic widescreen transfer. The DVD was re-released in 2007 with a lenticular cover.A 20th Anniversary DVD was released by MGM and 20th Century Fox Home Entertainment on September 9, 2008.[16] The film is presented in its original 1.85:1 Widescreen format (for the first time in the U.S. in 20 years) enhanced for 16x9 monitors and includes an English 5.1 surround track and English, French, and Spanish 2.0 surround tracks. Special features include two audio commentaries with Alex Vincent, Catherine Hicks, Kevin Yagher, producer David Kirschner and screenwriter Don Mancini, a \"Selected Scene Chucky Commentary\", \"Evil Comes in Small Packages\" featurettes, a vintage featurette from 1988 titled \"Introducing Chucky: The Making of Child's Play\", and \"Chucky: Building a Nightmare\" featurette, theatrical trailer and a photo gallery. The film received a Blu-ray Disc release on September 15, 2009. The DVD does not feature any contributions from director Tom Holland, who claims he was not asked to contribute to it. In response, the website Icons of Fright contacted Holland and asked if he would be willing to record a commentary track that would be free for download on their website. He agreed, and the track is downloadable from here.[17]On October 8, 2013, the film was re-released again on DVD and Blu-ray in a boxset for the respective formats, containing all 6 Child's Play films.","box_office":"$44.2 million[2]","cinematography":"Bill Butler","production_company":"United Artists","directed_by":"Tom Holland","release_dates":"November 9, 1988","Production":"Child's Play was filmed in Chicago, Illinois for on-location scenes. The Chicago landmark the Brewster Apartments, located at Diversey and Pine Grove, served as the location of the apartment where Andy and Karen lived and is pictured on the film's poster. In-studio filming took place at Culver Studios in Culver City, California.[citation needed]David Kirschner produced all six movies in the Chucky series.[citation needed]During an airing of the movie on the morning of January 7, 2007, AMC claimed the creator modeled the doll after the Cabbage Patch Kids. This was confirmed by an interview with the creator, Don Mancini, which was featured on the Seed of Chucky DVD. Holland, on the other hand, affirms that My Buddy dolls played a role in Chucky's design.[4] Don Mancini stated his original script was a whodunit story which dealt with the effect of advertising/television on children. Mancini's original script was written to toy with the audience a bit longer, making them wonder whether young Andy was the killer rather than Chucky.Chucky's full name, Charles Lee Ray, is derived from the names of notorious killers Charles Manson, Lee Harvey Oswald, and James Earl Ray.[5][6]Maggie's death was originally going to be by electrocution while taking a bath. The idea was abandoned, and was later used for Tiffany's death in Bride of Chucky.[6]","produced_by":"David Kirschner","starring":"Catherine Hicks|Chris Sarandon|","running_time":"87 minutes","Controversy":"During the initial release, a large crowd of protesters formed at the main entrance of MGM calling for a ban on the film because, they claimed, it would incite violence in children. Local news reporters from two TV stations were broadcasting live from the scene. The producer, David Kirschner, was watching the demonstration on TV and was disturbed. Jeffrey Hilton, who had been working in Kirschner's office at MGM, indicated that he could quell the disturbance in 10 minutes. While Kirschner was watching from the safety of his office, Hilton spoke to the group's leader and shook his hand. The group instantly dispersed, much to the chagrin of the newscasters. Hilton did not reveal to Kirschner whether it had been a threat or simple diplomacy that saved the day.Hilton's diplomacy notwithstanding, the film's franchise was plagued with accusations of inciting violence in children. Child's Play 3 was cited as the \"inspiration\" for two murders, which took place in the United Kingdom in December 1992 and February 1993 respectively: the murder of Suzanne Capper and murder of James Bulger. In the Suzanne Capper case, the 16-year-old was forced to listen to recordings of the gangleader repeating the catchphrase \"I'm Chucky, wanna play?\"[11][12][13] Tom Holland, in response to both murders, defended the film, stating that viewers of horror movies could only be influenced by their content if they were \"unbalanced to begin with.\"[14]","Sequels":"Child's Play spawned a series of films titled Chucky. After four sequels, Don Mancini and David Kirschner spoke in a September 2008 interview of a planned reboot of the franchise to be written and directed by Mancini, although nothing was official.[18][19] They described their choice of a remake over a sequel as a response to the will of the fans, who \"want to see a scary Chucky movie again,\" and \"want to go back to the straightforward horror rather than the horror comedy.\" They stated that if the remake was made, they would want Brad Dourif to reprise his role as Chucky, because \"no one could fit the part like he could.\"In a subsequent interview, Mancini described the script as a darker and scarier retelling of the original movie, but one that, while having new twists and turns, will not stray too far from the original concept. Additionally, Brad Dourif confirmed that he will reprise his role in the remake.[20]On June 23, 2012, it was announced that the next movie would instead be a direct-to-video sequel to the original series titled Curse of Chucky.[21][22] Production on the movie began in September 2012 and filming ended in November. The film was released on Blu-ray and DVD on October 8, 2013 marking the 25th anniversary of the original Child's Play.","music_by":"Joe Renzetti","edited_by":"Edward Warschilka Roy E. Peterson","budget":"$9 million[1]"}