{"country":"United States of America","distributed_by":"Herald Pictures","Plot":"Would-be theatrical producer Jim Walton is planning a new show that will feature bandleader Slam Stewart and the comic female impersonator Bumpsie (Tim Moore).[1] Mr. Cummings, the wealthy father of Jim’s girlfriend Cristola, has agreed to finance half of the show if the famous Parisian impresario Madame Deborah will provide the second half of the funding. When word arrives that Madame Deborah’s arrival from France has been delayed, Bumpsie is brought in to keep Mr. Cummings occupied. Mr. Cummings, however, is unaware that Bumpsie is a man in drag and he falls in love with him. The real Madame Deborah unexpectedly arrives early and passes herself off as Mrs. Martin. Two other would-be suitors, impressed with Madame Deborah’s wealth, begin to pursue Bumpsie. A fundraising party for the show is held, where several musical acts arrive to perform. A pair of thugs attempt to kidnap Bumpsie, believing he is Madame Deborah, but he manages to escape. The real Madame Deborah identifies herself and agrees to finance Jim’s show, enabling him to achieve his professional goals and to marry Cristola.[2][3][4]","language":"English","cinematography":"George Webber","directed_by":"Arthur H. Leonard","release_dates":"April 7, 1947 (USA)","Production":"Boy! What a Girl! was planned to be the first in a series of all-black race films produced by the independent company Herald Pictures. The film’s press kit acknowledged the segregated distribution patterns of the race film by proclaiming Boy! What a Girl! would be “an all-Negro motion picture can be produced to play in any theater in the country and not merely confined to the some 600 odd playhouses that cater strictly to an all-Negro audience.” [5]The film was shot at the Fox Movietone Studio in New York City. Gene Krupa, the only white member of the cast, was not originally signed to appear in the film; director Arthur H. Leonard invited Krupa to be on camera when the famous drummer stopped by to visit cast member Sid Catlett on the set.[5]Boy! What a Girl! was the only starring film role for Tim Moore, an African American vaudeville comedy star who later became famous as the Kingfish in the television series Amos 'n Andy.[6] A pre-production news item identified Marva Lewis, the ex-wife of boxing champion Joe Louis, as being a part of the cast, but she is not present in the finished film, as she was forced to withdraw due to illness. She was replaced by the Brown Dots.[5][7]","produced_by":"Jack Goldberg Arthur H. Leonard","starring":"Tim Moore The Brown Dots Slam Stewart Sid Catlett Gene Krupa.","running_time":"70 minutes","edited_by":"Jack Kemp","boy!_what_a_girl!":"DVD box art","written_by":"Vincent Valentini"}