{"country":"United States","distributed_by":"Universal Studios","cheech_&_chong's_next_movie":"Theatrical release poster","Plot":"Cheech & Chong are on a mission to siphon gasoline for their next door neighbor's car, which they apparently \"borrowed,\" and continue with their day; Cheech goes to work at a movie studio and Chong searches for something to smoke (a roach), followed by him revving up an indoor motorcycle and playing extremely loud rock music with an electric guitar that disturbs the entire neighborhood. Cheech gets fired from his job and they go to see Donna, a welfare officer and Cheech's girlfriend. Cheech successfully seduces Donna, under her objections, and gets her in trouble with her boss. The doped-up duo are expelled from the building and, in an attempt to find alternative means of income start writing songs like, \"Mexican Americans\" and \"Beaners.\"Cheech answers the phone to find Donna on the other end, sets up a date, and goes to tell Chong to get lost so he can clean the house and get ready for Donna. The phone rings again with Cheech thinking it's Donna and turns out to be Red, Cheech's \"kinda\" cousin, with money problems and a plea for help. Cheech asks Chong to pick up his cousin and hang out with him as Cheech informs him they have similar interests like \"go to clubs,\" \"get plenty of chicks,\" and \"likes to get high.\" Chong heads off to the hotel where Red is staying and arrives to find him in a dispute with the receptionist (played by Paul Reubens) over how much the room is costing (\"$37.50 a week, not a goddamned day!\"). The receptionist is holding his luggage, consisting of a boom-box, a suitcase, and a 20-pound canvas bag full of high-grade marijuana, hostage and Red can't afford the bill. They break into the room around the back and Red retrieves his luggage and the receptionist is falsely arrested after calling the cops to arrest Chong and Red but accidentally assaults them and is taken away to jail.Later, on the corner, a roller-skater invites them to a \"party,\" which is in fact a brothel. They are kicked out of the place for causing too much commotion, sharing weed with the girls, and peeing in the Jacuzzi. They then play a recording from Red's boombox that Red recorded earlier when the police arrived at the hotel he was staying at over the dispute with his luggage, which scares everyone off. One of the girls from the brothel accompanies them and they all go onto Sunset Boulevard in search of adventure and more highness. After visiting the house of a girl's parents, whom they found at a music store on Ventura Boulevard, they all get into the parents' Rolls Royce, light up a spliff, and drive to a stand-up comedy club where they tell jokes and encounter the angry hotel receptionist (Reubens in an early appearance as Pee-wee Herman) who was falsely arrested earlier that day and begin a commotion with him and a large female bouncer (Faith Minton) leading to a rally fight. Later that night, they are chased by the cops as they check out Red's weed fields out in the countryside. They set off fireworks and are suddenly abducted by a UFO along with several of the cannabis plants. Cheech meanwhile gets so pumped and excited about the date that he wears himself out and ends up sleeping through it, while dreaming about what might have happened. He wakes up in the morning to find Chong (who was abducted by Aliens alongside Red) bursting in, dressed in what appears to be a cross between Genghis Khan and a Viking, holding a jar of \"space coke\", which Chong says, \"It'll blow your head off.\" The \"space coke\" causes Cheech to go berserk and starts trashing their next door neighbor's house with a surprised Chong following after. The film ends with the duo bursting through their neighbor's roof into outer space, achieving the ultimate high and Chong dropping the \"space coke\" back to Earth for others to try which leads to an animated sequence with Cheech and Chong ascending into a blunt which then takes off displaying the caption \"That's It Man!\".","language":"English","Reception":"Considered by some critics at the time to be a superior film to the previous Up in Smoke, the film however performed somewhat less than expected at the box office. According to some sources, including Tommy Chong, the film actually made more money during its second-run release in double-bill with The Blues Brothers.[citation needed]","box_office":"$41,675,194","cinematography":"King Baggot Nick McLean","directed_by":"Tommy Chong","Versions":"There are two versions of this film in release. One is the theatrical version shown during its initial release, while the other is a heavily edited version aired on several cable networks. The edited version adds in some cut scenes - such as the neighbor being revealed to be a transvestite, and extended footage on the Alien Spacecraft - but also has some of the more drug-related scenes cut or altered. Most notably altered is the contents of Red's duffel bag, which in the TV version contains not hundreds of Thai sticks, but diamonds. A novelization, also written by Cheech and Chong, features photos of these omitted scenes.The original theatrical release & early home video editions have Cheech singing the song \"Ya-Ya\" in the scene where he is ironing his clothes for his date. Current releases changed this audio to him humming a different song.Also in the theatrical release, Paul Reubens' character, in an attempt to convince the 9-1-1 operator to send help immediately, finally implores, \"Look, I think they're Iranians!\"; the newer video releases have the line re-dubbed as \"Look, I think they're hippies!\"[citation needed]","release_dates":"July 18, 1980 (1980-07-18)|||||","produced_by":"Howard Brown","starring":"Cheech Marin Tommy Chong Evelyn Guerrero Edie McClurg Paul Reubens","running_time":"99 min.","music_by":"Mark Davis","written_by":"Tommy Chong Cheech Marin"}