{"country":"Ethiopia","Plot":"The film chronicles a legal-precedent setting court case that outlawed the kidnapping of child brides in Ethiopia. It tells the story of a 14-year-old girl, Hirut Assefa (based on Aberash Bekele), who is kidnapped on her way home from school and subsequently grabs a rifle and tries to escape, but ends up shooting her would-be husband. In her village, the practice of abduction into marriage is common and one of Ethiopia's oldest traditions. Meaza Ashenafi, the founder of the Ethiopian Women Lawyers Association, arrives from the city to have her team represent Hirut and argue that she acted in self defence.","Accolades":"<left>","language":"Amharic","Reception":"Difret received mixed reviews upon its premiere at the 2014 Sundance Film Festival. Dennis Harvey of Variety, said in his review that \"“Difret” presents an important message, albeit in rather clunky narrative terms. More showing and less telling would have made this fact-inspired drama by Zeresenay Berhane Mehari as artistically compelling as it is informative. Still, fests and other outlets attracted to social-justice issues will queue up for this relatively rare export-ready Ethiopian feature.\"[14] Boyd van Hoeij in his review for The Hollywood Reporter called the film \"A quiet and powerful drama, based on a true story, that relies on familiar storytelling tropes.\"[15] The film has a score of 58% on Metacritic.[16]","box_office":"$17,618[1]","cinematography":"Monika Lenczewska","production_company":"Haile Addis Pictures Truth Aid","directed_by":"Zeresenay Berhane Mehari","release_dates":"18 January 2014 (2014-01-18) (Sundance)|25 September 2014 (2014-09-25) (Ethiopia)||||","produced_by":"Mehret Mandefro Leelai Demoz Zeresenay Mehari","running_time":"99 minutes","Controversy":"The alleged controversy stems from an effort to discredit the work of the human rights lawyer Meaza Ashenafi. The film was initially banned in September for allegedly giving \"too much credit\" to Meaza but the claim was not valid and the ban was lifted.[11] The film subsequently enjoyed a successful theatrical run in Ethiopia and kicked off its educational outreach efforts that are focused on raising awareness about the issue of child marriage.[12] Unfortunately a second lawsuit has been filed to yet again discredit Meaza Ashenafi's contribution to the case despite her role as the Founder and Executive Director of the legal aid organization Ethiopian Women Lawyers Association which was responsible for the case chronicled in Difret. Meaza employed all the EWLA lawyers working on this case, including Etagegnehu Lemessa, and was the chief strategist. Meaza's leadership and administration of EWLA during this time is the basis for the film Difret and is also the reason she has received several international human rights awards including the Hunger Prize, also known as the African Nobel Laureate, for her work defending vulnerable women and children in Ethiopia.[13]","difret":"Theatrical release poster","music_by":"Dave Eggar David Schommer","edited_by":"Agnieszka Glinska","written_by":"Zeresenay Berhane Mehari"}