{"country":"United States","distributed_by":"Warner Bros.","Plot":"Late in the reign of Elizabeth I of England, Spanish noble Don Juan de Maraña (Errol Flynn) is repatriated from London to Madrid after a serious diplomatic scandal caused by his affair with the British fiancée of a Spanish duke. The Spanish ambassador in London, Count de Polan (Robert Warwick), sends a letter of recommendation to his friend Queen Margaret (Viveca Lindfors), asking her to provide an opportunity at the court to rehabilitate Don Juan after the gossiping and rumors about his multiple illicit love affairs. He is thus hired as a fencing instructor at the Spanish Academy.He secretly falls in love with Queen Margaret but remains a loyal subject to her and her irresponsible and weak husband, King Phillip III (Romney Brent). Don Juan discovers the treacherous plan of the Machiavellian Duke de Lorca (Robert Douglas), who is plotting to depose the monarch, usurp power in Spain and declare war on England. With the support of his friends, Don Juan defends the Queen, the King and the loyal Count de Polan against Duke de Lorca and his henchmen.[3]","adventures_of_don_juan":"Original film poster","language":"English Spanish","Reception":"The film was very successful in Europe but less so in the US and struggled to recoup its large budget. From this point on, Warner Bros would reduce the budget of Flynn's films.[6]It recorded admissions of 3,763,314 in France, making it the 7th most popular movie in the country that year.[10]","box_office":"$5 million[1]","cinematography":"Elwood Bredell","directed_by":"Vincent Sherman","Awards":"The film won the Academy Award for Best Costume Design, Color (Leah Rhodes, Travilla and Marjorie Best) and was nominated for the Academy Award for Best Art Direction-Set Direction, Color (Edward Carrere, Lyle Reifsnider).[9]","release_dates":"December 1, 1948 (1948-12-01)","produced_by":"Jerry Wald","starring":"Errol Flynn Viveca Lindfors","running_time":"110 minutes","music_by":"Max Steiner","edited_by":"Alan Crosland, Jr.","Notes":"The film was originally meant to be directed in May 1945 under the direction of Raoul Walsh but was postponed for two and a half years due to script problems and industrial unrest in Hollywood after the war.[6] Warner Bros were encouraged in 1947 by a successful reissue of Flynn's earlier starring vehicles, The Adventures of Robin Hood (1938) and The Sea Hawk (1940).Shooting eventually began in October 1947. Errol Flynn was suffering from poor health, suffering allegedly from a mild heart condition and recurrent bouts of hepatitis. According to film historian Tony Thomas, he drank heavily during the making of the movie. Filming was frequently halted due to Flynn's physical condition and by frequent changes and replacements in production personnel. In the famous leap from the head of a long staircase, Flynn was doubled by stunt expert Jock Mahoney.[7] In the silent film Don Juan (1926), Flynn's idol John Barrymore performed a similar leap without a stunt double. At the end of the 1948 film, the young woman in the coach asking Don Juan for directions is Flynn's wife, Nora Eddington.Parts of the film's score were adapted later by composer Ian Fraser for the George Hamilton comedy Zorro, The Gay Blade (1981).[8] A portion was also used in two scenes in the film The Goonies (1985), although in the first scene, it accompanied a TV broadcast of the earlier film Captain Blood (1935).The chase scene early in the film used recycled footage from The Adventures of Robin Hood (1938), and is then followed by a grand procession with recycled outtakes from the The Private Lives of Elizabeth and Essex (1939), both starring Errol Flynn and Alan Hale. The film is the last of 13 in which Hale and his close friend Errol Flynn appeared together. Hale died on January 22, 1950, just over a year after this film's release.","written_by":"Herbert Dalmas George Oppenheimer Harry Kurnitz","budget":"$3.5 million[1] or $3 million[2]"}