{"country":"Italy|Spain|Mexico[1]|","screenplay_by":"Gino Capone|Jose Antonio de la Loma[1]|","story_by":"Giovanni Di Clemente[1]","Plot":"A mysterious man with no facial features bursts in and shoots up a room full of people. The last person he kills, using a magical energy bow, is the Queen of an evil empire. She awakens suddenly, revealing that it was all a dream or a vision. This drives her to seek out the man that is the harbinger of her demise. He turns out to be a kind young man who is trying to fight against her rule. Meanwhile, the tribal people out in the plains are being violently repressed by her werewolf henchmen. Many of them are killed in a violent scene that is par for the course in a Fulci film. They take some of the women with them to make the trip back entertaining. In mid-route, the young man attacks the villains, but is overwhelmed.Fortunately, a large, rugged man appears to help him out. He makes short work of the wild beast-men and escapes with the man. Their battle has only just began. The older man learns of the younger one's mission and agrees to help him out. The journey is not an easy one, as it leads them through a swamp full of zombie-like creatures. This section is shot with an eerily-strange tint that gives it a rather dream-like quality. After a vicious battle, the duo escapes and continues their quest to stop the evil queen. Getting desperate now, after another failure, she calls upon the power of an ancient evil force that is inhabiting an inanimate statue in the center of her room. It calls up greater forces than she ever could to destroy her enemies.Now in the midsts of a desert-like plain, the May-December duo is led into a trap involving the werewolf henchmen. In the midst of this, the young men is quite efficiently killed, seemingly putting an end to the threat against her. Driven on by his companion's decapitation, the veteran fighter picks up his magical weapon and vows to finish the job that he started. Since she feels more safe, the Queen lets her protection lax, playing right into our protagonist's hands. Placing the bow in his hand, he uses its magical properties to shoot energy projectiles at his foes. His volley of magic proves to be very efficient and effective in dealing with the threat. Nothing can stand in his way.","Reception":"In a contemporary review, the Monthly Film Bulletin referred to the film as a \"low-budget, deliriously magpie mix of Conan the Barbarian, Quest for Fire and Raiders of the Lost Ark with a few zombies-Fulci's Forte-thrown in for good measure.\"[1] The review stated that despite \"excessive gore\", \"manifestly implausible plot\" and \"patchy special effects\", that the film was \"actually very enjoyable\". The review also commented on Claudio Simonetti's score, finding it \"wonderfully inappropriate\" and reminiscent of Simonetti's work in Goblin and on the scores for Deep Red and Dawn of the Dead.[1]Jeremy Wheeler (AllMovie) gave the film two stars out of five, while noting that \"even with the shoddy production values and downright embarrassing monster masks, it is what it is -- a psychedelic C-Grade fantasy flick by the master of Italian gore done in an incredibly strange time and place in movie history -- Italy in the early '80s. Some might call in junk, but those with their tongue planted firmly in cheek will call it a schlock masterpiece.\".[5]","conquest":"Italian theatrical release poster by Enzo Sciotti","directed_by":"Lucio Fulci","production_companies":"Clemi Cinematgorafica Golden Sun Producciones Esme[1]","release_dates":"June 3, 1983 (1983-06-03) (Italy)|||||","produced_by":"Giovanni Di Clemente[1]","starring":"Jorge Rivero|Andrea Occhipinti|Conrado san Martín|Sabrina Siani|","running_time":"92 minutes[1]","music_by":"Claudio Simonetti","edited_by":"Emilio Rodriguez Oses[1]","Release":"Conquest was shown in Mexico on August 15, 1985.[4]"}