{"based_on":"Le Dîner de Cons  by Francis Veber","country":"United States","dinner_for_schmucks":"Theatrical poster","distributed_by":"Paramount Pictures","screenplay_by":"David Guion|Michael Handelman|","Plot":"Tim Conrad is a mid-level financial executive, who comes up with a way to invite wealthy Swiss businessman Martin Mueller to become a client of his firm. Impressed by Tim's ingenuity, his boss Lance Fender invites him to a \"dinner for winners\" in which he must find and bring an eccentric person with a special talent; the winner earns a trophy and the executive that brought him or her gets glory. He learns it is more of a \"dinner for idiots\", and the partygoers will be mocked. Tim's girlfriend Julie lands a curator deal for eccentric artist Kieran Vollard and Tim unsuccessfully proposes to her. After learning of the cruel nature of the dinner party, Julie becomes upset and asks him not to attend and he agrees.Tim accidentally hits IRS employee Barry Speck with his car when Barry tries to retrieve a dead mouse in the road. Witnessing Barry's bizarre behavior, Tim realizes he is the perfect loser for the dinner. Barry shows up at Tim's apartment and accidentally invites over Darla, who had a one-night stand with Tim years ago and has been stalking him. Barry decides to guard Tim's apartment from Darla to make up for inviting her. When Julie arrives at his apartment, Barry mistakes her for Darla and sends her away, giving Julie the impression that Tim is cheating on her. Barry calls Vollard and finds the number saved in the phone. While talking to him, he and Tim think they hear Julie in the background and head to Vollard's apartment. Barry tosses Tim's keys through Vollard's apartment window and must break in, only to find Kieran preparing to make love to two girls dressed like animals (neither are Julie) and head back home.Barry opens the door to find Darla waiting outside. Julie calls and asks Tim if he's having an affair and Darla steals the phone and stuffs it down her pants. While Tim hides in his bedroom, Darla and Barry get into a bar-styled fight, scaring Darla away. Julie left her phone at Tim's apartment and a voice message from Vollard reveals that Julie is leaving for his ranch. Barry works for the IRS and offers to take Tim to work to find Vollard's ranch address, where they meet up with Barry's boss and rival, Therman Murch, who stole Barry's wife. Tim leaves the next day for his brunch with the Muellers but Barry crashes, with Darla pretending to be Julie. Tim is pushed into asking Darla to marry him by Barry and Julie walks in during. Tim and Barry chase Julie down to Vollard's ranch, where Tim accidentally offends Barry.To his surprise, Tim found Barry already at Fender's dinner party. Barry is a hit with the group and is a shoo-in for the trophy, but unexpectedly, Therman arrives, embarrassing Barry with his mind control. Tim then tells Barry everything and, after some encouragement, gets Barry to win with \"brain control\", before causing his boss and fellow executives to reveal the truth. A guest reacts badly to the news and causes chaos in the process, with Mueller losing a finger. Tim is fired, as is Julie after Barry makes Vollard realize it would be a problem to have her continue working for him. Tim marries Julie, Barry enters into a relationship with Darla, does some artwork with Vollard, and hosts a monthly \"breakfast for champions\" for all of the losers. Therman writes a book in the mental hospital and Tim gets a new museum started in Switzerland for Mueller. Fender's company goes into a big loss and he is named wall street's biggest loser","Accolades":"\"Dinner for Schmucks\" was nominated for one award","language":"English","Reception":"Dinner for Schmucks received mixed reviews from critics. Review aggregation website Rotten Tomatoes gives the film a rating of 42%, based on 185 reviews, with an average rating of 5.4/10. The site's consensus is: \"It doesn't honor its source material – or its immensely likable leads – as well as it should, but Dinner for Schmucks offers fitfully nourishing comedy.\"[17] On Metacritic, the film a score of 56 out of 100, based on 37 critics, indicating \"mixed or average reviews\".[18]The film made $8.4 million on its first day, ranking number two at the box office, behind Inception. The film earned $23.5 million on its opening weekend, placing it second overall for the weekend of July 30 to August 1.[3] Dinner for Schmucks ultimately grossed $73 million in North America and $13.4 million internationally for a total of $86.4 million worldwide.Dinner for Schmucks was released on DVD and Blu-ray Disc on January 4, 2011.","box_office":"$86.4 million[3]","cinematography":"Jim Deult","production_company":"DreamWorks Pictures Spyglass Entertainment Parkes + MacDonald Everyman Pictures Reliance ADA Group[1] BIG Pictures [citation needed]","directed_by":"Jay Roach","release_dates":"July 30, 2010 (2010-07-30)|||||","Production":"The budget for the film was split between the distributor Paramount Pictures, as well as DreamWorks Pictures and Spyglass Entertainment. The production budget was $69 million, but with tax credits the cost came in at $62.7 million.[2]Filming of the dinner scene took place at the same location as was used for Wayne Manor in the 1960s Batman television series.[6]Dinner for Schmucks is the American adaptation of the French film Le Dîner de Cons (literally, \"The Dinner of Idiots\"). The film retains many familiar elements of the original, with the basic plot, including the involvement of the taxation authorities and the love triangle around the main character Tim. In the remake, however, Tim is made much more sympathetic (this is the first dinner he has participated in, and he is not in fact having an affair or deliberately cheating on his taxes), and the actual dinner is shown. Director Roach describes the film as \"inspired by\" the original rather than a remake.[7]Debate ensued[where?][when?] about the title's usage of the Yiddish word schmucks which is a mild cultural insult similar to \"idiot\" while technically refers to 'male genitals.' Debbie Schlussel asked whether the title should have been Dinner for Schlemiels as it would better describe the clumsy character played by Steve Carell.[8] Responding in The New York Times, critic Michael Cieply determined that the intent was to be ambiguous as to which of the two main characters, played by Steve Carell and Paul Rudd, was the intended idiot.[9] In The Forward, Laura Hodes suggested that 'schmucks' correctly referred instead to the behavior of the film's antagonists, the bosses of Rudd's character.[10] 'Schmucks' may be fitting after all because the original French play and movie, Le Dîner de cons, which was originally translated as The Dinner Game[11] \".[12]","produced_by":"Walter F. Parkes|Laurie MacDonald|Jay Roach|","starring":"Steve Carell|Paul Rudd|Jemaine Clement|Bruce Greenwood|Ron Livingston|","running_time":"114 minutes","music_by":"Theodore Shapiro","edited_by":"Alan Baumgarten","Release":"Dinner for Schmucks was pushed back a week to July 30, 2010, to avoid competition with Salt and Inception.[13][14]As part of promoting the film, the website Funny or Die featured videos of Jemaine Clement in character as Kieran Vollard.[15][16]The film's first trailer debuted with Date Night, Death at a Funeral, and A Nightmare on Elm Street. The second trailer was shown before select screenings of The A-Team, Get Him to the Greek, Grown Ups, and Inception.","budget":"$69 million[2][3]"}