{"Development and production":"William Horberg, eventually credited as an executive producer, got the project started when he optioned the rights to Himes' novel.[3] Hornberg, a first-time producer approached John Toles-Bey, a Chicago-based actor with no screenwriting credits, to draft the film's first script; the development effort gained steam after Hornberg met Kerry Boyle of Palace Productions, and through the efforts of Boyle and Stephen Woolley, the film was sold to Miramax Films and given the green-light.[3]According to publicity leading up to the start of principal photography, Forest Whitaker was the first of the two lead actors to commit to the film, described as an action-comedy with \"very dark\" comedy.[1] Whitaker among others, was consulted as Boyle and Woolley sought an African American to direct the film, doing so because they believed \"maintaining the cultural integrity of the novel demanded a black director\"; they also wanted \"someone who was older and secure enough to collaborate and make a picture that we could distribute widely, but who still had a passion for the material.\"[4] They chose Duke in part for his experience directing Hill Street Blues, experience that was key \"because of the way that series mixed humor and violence.\"[4] Duke later cast Robin Givens to play the female lead after considering 300 women for the part.[4]The film was shot in the Cincinnati, Ohio neighborhood of Over-the-Rhine, whose \"un-gentrified area of the old downtown lower depths stood in quite nicely for ... 1950s Harlem.\"[3] About midway during production, it turned out that Duke and Woolley had undiscussed differences about the tone the film was going to take:[5]About halfway through we [Woolley and Duke] were looking at a scene, and I turned to Bill [Duke] and said 'You know, that wasn't quite as funny as it was in the script. And I don't know why. And he said to me, 'We're not making no god-damn comedy.' I'd raised the entire money for this film on the basis that it was a comedy. It was Chester Himes, it was supposed to be funny. And a shiver went down my spine...I hoped that Bill was joking. But I realized he thought we were making Porgy and Bess.","country":"United States","distributed_by":"Miramax Films[1]","screenplay_by":"Bobby Crawford","story_by":"Chester Himes","Plot":"A beautiful black gangster's moll flees to Harlem with a trunkload of gold after a shootout, unaware that the rest of the gang, and a few other unsavoury characters, are on her trail.","language":"English","Reception":"The film premiered in competition at the 44th Cannes Film Festival[6] in its Grand Palais, receiving a \"five-minute standing ovation.\"[3] It was also shown at the 2nd Stockholm International Film Festival.[7]Vincent Canby, reviewing the film for The New York Times, called it \"painless, occasionally funny\" but with a \"heedlessly incomprehensible plot\"; according to Canby, \"because the screenplay is so thin, the characters are revealed entirely by the actors who play them. Miss Givens does particularly well as a doxy with a heart of gold as well as a trunk full of it. She looks great and shows a real flair for absurd comedy. Mr. Hines, Mr. Whitaker and Mr. Glover also are in good form, as are Badja Djola, who plays Imabelle's intimidatingly large former lover, the guy she's stolen the gold from, and Mr. Toles-Bey, who, in addition to working on the screenplay, appears as one of the bad guys.\"[8]According to Box Office Mojo, the film grossed about $10.4 million in the United States.[2] The film currently holds a 63% rating on Rotten Tomatoes based on 32 reviews.","box_office":"$10.4 million (USA)[2]","cinematography":"Toyomichi Kurita","production_company":"Palace Productions[1]","directed_by":"Bill Duke","release_dates":"May 3, 1991 (1991-05-03)|||||","produced_by":"Kerry Rock Stephen Woolley","starring":"Forest Whitaker|Gregory Hines|Robin Givens|Zakes Mokae|Danny Glover|","running_time":"115 minutes","music_by":"Elmer Bernstein Jeff Vincent","edited_by":"Curtiss Clayton","written_by":"John Toles-Bey","budget":"$8 million[1]"}