{"country":"United States","Inspiration":"Several characters in the film originated in a sketch written by Guest for Saturday Night Live in 1984. Shearer, Guest, and McKean appeared as The Folksmen on Saturday Night Live, in the movie The Return of Spinal Tap (which similarly featured the trio as a parody of an aging heavy metal band), and occasionally on concert stages. The original conception for A Mighty Wind was as a longer narrative vehicle for the fictional group[3]Every song featured in the film was written by members of the cast or by Guest's long-term musical collaborator, C.J. Vanston. \"A Kiss at the End of the Rainbow\", which was composed for the film by McKean and wife Annette O'Toole, was nominated for an Academy Award for Best Original Song.","distributed_by":"Warner Bros.","Plot":"The film is structured as mockumentary about a memorial concert for (fictional) folk music producer Irving Steinbloom. Upon his death, his children organize a concert, which they hope to feature his three most famous acts: The Folksmen, The New Main Street Singers, and Mitch & Mickey.The Folksmen trio — Mark Shubb (Harry Shearer), Alan Barrows (Christopher Guest), and Jerry Palter (Michael McKean) — were once the most popular of the acts but have not appeared together in decades. They had several minor hits, and their most famous song was \"Old Joe's Place.\"The New Main Street Singers are the second generation of the original Main Street Singers, formed by George Menschell (Paul Dooley), the only living member of the original group. Menschell sings and holds a guitar he cannot play. Performers include Terry Bohner (John Michael Higgins) and his wife Laurie Bohner (Jane Lynch). Laurie, a former adult film star, and her husband are founders of Witches in Nature's Colors (WINC), a coven of modern-day witches that worships the power of color. Another member is Sissy Knox (Parker Posey), a former juvenile delinquent and daughter of one of the original Main Street Singers. They are managed by Mike LaFontaine (Fred Willard), whose fifteen minutes of fame came by way of a failed 1970s sitcom, Wha' Happened?. The show lasted for less than one season and has largely been forgotten, but LaFontaine is constantly quoting the titular tagline to the puzzlement of others. The group, which is otherwise entirely white, includes one Filipino American member, Mike Maryama (played by Mark Nonisa), and is known for their needlessly complex nine-part harmonies.Mitch Cohen (Eugene Levy) and Mickey Crabbe (Catherine O'Hara) comprised Mitch & Mickey, a former couple that released seven albums until their dramatic break-up years before the setting of the film. Mickey seemingly moved on and has married a medical supply salesman, but Mitch had an emotional breakdown and has never fully recovered. Their most famous song was \"A Kiss at the End of the Rainbow,\" at the end of which the pair would actually kiss on stage.The three groups, which had sunk to various levels of musical irrelevance since their respective heyday, agree to the reunion performance, to be held at The Town Hall in New York and televised live on PBN (a reference to PBS). The film features rehearsals for the show along with interviews with the performers discussing their activities over the previous years and their feelings about performing again. When some are enthusiastic, Mitch and Mickey (particularly Mitch) are very apprehensive about how it will go.The show itself goes off with only two hitches: The song that The Folksmen intend to open their set with is played first by the New Main Street Singers (a song called \"Wanderin' \", which the Folksmen sing in a rugged, emotional manner consistent with the spirit of the song, while the New Main Street Singers perform it in their usual peppy, upbeat way), and Mitch temporarily disappears minutes before he and Mickey are to perform. It turns out that Mitch had gone to buy a rose for Mickey, which she accepts with gratitude as they go on stage. Mitch and Mickey perform \"A Kiss at the End of the Rainbow\", and after a suspenseful pause, they do the much-anticipated kiss at the end. In the finale, all three acts join together to sing \"A Mighty Wind.\"The film then jumps to interviews with many of the performers six months after the concert in which they detail subsequent events. Mickey is performing \"The Sure-Flo Song\" (about a medical device used for bladder control) at her husband's trade show booth. Mitch is writing poetry again, claiming to be in a \"prolific phase.\" Mickey claims that Mitch overreacted to their onstage kiss, while Mitch insists that Mickey's feelings for him returned. LaFontaine is trying to drum up interest for a sitcom starring the New Main Street Singers. He wants to call it \"Supreme Folk\" and have each play Supreme Court judges by day, folk singers sharing a house by night. The Folksmen have reunited, but with Mark Shubb now a transgender woman, she continues to sing in her deep bass voice.","language":"English","Reception":"The film received mostly positive reviews. Review aggregation website Rotten Tomatoes gives the film a score of 88% based on reviews from 172 critics, with the sites consensus, \"Though not as uproariously funny as Guest's previous movies, A Mighty Wind is also more heartfelt.\"[4] Roger Moore called the film \"mature, heartfelt and keenly observed.\"[citation needed] Roger Ebert, on the other hand, stated that \"though there were many times when I laughed\", \"the edge is missing from Guest's usual style\" perhaps because he \"is too fond of the characters\". Ebert gave the film two-and-a-half stars out of four.[5]One of the songs from the movie, \"A Kiss at the End of the Rainbow\" was nominated for the Academy Award for Best Song, and was performed at the 76th Academy Awards by Levy and O'Hara (in character). The title song won the Grammy Award for Best Song Written for a Motion Picture, Television or Other Visual Media at the 46th Grammy Awards, beating Lose Yourself by Eminem, among others.The film had a moderate intake for its opening day in April 2003, grossing $307,931 in total. It went on to gross $2,112,140 in 133 theatres for an average of $15,880 per theatre.[6] With a domestic total of $17,583,468 and a foreign total of $969,240, the film brought in a total of $18,750,246 during its theatrical run.","box_office":"$18.7 million","cinematography":"Arlene Nelson","production_company":"Castle Rock Entertainment","directed_by":"Christopher Guest","a_mighty_wind":"North American release poster","release_dates":"April 16, 2003 (2003-04-16)","Production":"In an interview about the film, Annette O'Toole claimed that many of the songs were written when plane groundings in the aftermath of the September 11, 2001 attacks meant she and husband Michael McKean had to drive from their home in Los Angeles to Vancouver, where O'Toole's television series Smallville was being filmed.In the commentary for the DVD release, Christopher Guest and Eugene Levy noted that, in a scene cut from the finished movie, it is explained that Menschell cannot play the guitar. However, just before a performance of the original Main Street Singers, he stained his shirt front and covered it up by holding a guitar for the performance, something he continued to do for all subsequent performances.The Town Hall scenes were filmed at the restored Orpheum Theatre in Los Angeles.","produced_by":"Karen Murphy","starring":"Catherine O'Hara Eugene Levy Christopher Guest Michael McKean Harry Shearer John Michael Higgins Jane Lynch Parker Posey Fred Willard","running_time":"91 minutes","music_by":"Christopher Guest","edited_by":"Robert Leighton","Promotional tour":"To promote the September 2003 release of the film on DVD, the cast of the film performed in character in a seven-city tour in the fall of 2003. The tour dates were: Philadelphia (Tower Theater, September 19), New York City (Town Hall, September 20), Washington, D.C. (The 9:30 Club, September 21), Boston (Orpheum Theater, September 22), San Francisco (Warfield Theater, November 9) and Seattle (McCaw Hall, November 14), as well as Vancouver, BC.[7][8][9]","written_by":"Christopher Guest Eugene Levy","budget":"$6 million[1]"}