{"country":"United States","distributed_by":"Roadside Attractions","Plot":"Jay Wheeler, the \"black sheep\" son of a rich family meets Daisy, a young psychiatric patient who has been raised in isolation her entire life. He takes the naïve young woman home for his brother's wedding to convince his family that he has finally straightened out his life. She impresses the family with her genuine, if unstable, charm. His father, suspecting that something is amiss, presses her for information at the wedding. She suffers a panic attack, and Jay shuffles her into a car and they head to his parents' house. After searching through his father's cars for keys, they find a set in a classic RV and set out for home. At Shreveport, Louisiana, he leaves her in a bus station, but ends up having a change of heart and goes back for her and they head towards his home.They then have fun along the way. But when they make a stopover, he makes a phone call to the doctor who was handling Daisy. She then overhears his conversation that he is going to take her back to Los Angeles only to bring her back to the psychiatric hospital. She then cries and goes to the RV alone and drives the RV in circles before crashing it. Jay then opens the RV's door and hurries to take her to a diner. Jay, curious about Daisy who tells him that she killed her mother then asks her what she means by her killing her mother. Later, he discovers that she didn't kill her mother - her mother was dying and Daisy never heard voices, it was her mother who heard them.As Jay kisses Daisy, the cops come in, handcuff Jay and take Daisy away from him. Jay's mother finds out that Jay is in jail and then persuades Jason to bail him out. When Jay is bailed out, he returns to his apartment, only to find out that the door is busted and someone has broken into his apartment. He then looks at the window and sees the man to whom he owes money. He then runs from the guy and hurries to the psychiatric hospital to see Daisy, but the security and the Doctor tell him to leave.Desperate, Jay goes to the train station and lies down on the rail to get people to think that he's crazy. The scene then moves to the psychiatric hospital when the Doctor who is handling Daisy is releasing him because he knows Jay's motive is only to get to see Daisy. The doctor eventually lets Jay be a patient. The man to whom Jay owes money works together with Frakel, the guy whom Jay punched when that guy was trying to trick Daisy that he was a doctor In order to rape her. The man then comes to Jay's room and strangles him with a chain, but luckily, one of Jay's patient friends appears from behind and hits the guy with a broom stick.The doctor then visits Jay and apologizes to him, saying that he is right about Daisy's mother and Frakel. The Doctor then understands that he needs to release Daisy and Jay. After that, Jay receives a note and a check for $40,000 from his father to pay his debt and to come back home. Daisy then meets with Jay and they share a hug and a kiss.The last scene shows Daisy and Jay riding a merry-go-round.","language":"English","Reception":"Barefoot received mostly negative reviews. On film aggregation website Rotten Tomatoes, it currently holds an 14% rating, with an average score of 4.1/10, based on 21 reviews.[2]Barbara VanDenburgh of the Arizona Republic rated the film 1.5 out of 5 stars and called the film an \"offensively infantilizing [...] spectacularly wrong-headed, chemistry-free romance, and too dumb to know how sexist it is\" and calling Evan Rachel Wood's character \"a cartoon character\" similar to the Little Mermaid who \"all but brushes her hair with a fork\".[3]","box_office":"$15,071[1]","cinematography":"Alexander Gruszynski","production_company":"WhiteFlame Productions","directed_by":"Andrew Fleming","barefoot":"Theatrical release poster","release_dates":"February 2, 2014 (2014-02-02) (SBIFF)|February 21, 2014 (2014-02-21) (limited)||||","produced_by":"Lisa Demetree David Scharf","starring":"Evan Rachel Wood Scott Speedman Treat Williams Kate Burton J. K. Simmons","running_time":"90 minutes","music_by":"Michael Penn","edited_by":"Tara Timpone","written_by":"Stephen Zotnowski"}