{"based_on":"Casper the Friendly Ghost  by Seymour Reit Joe Oriolo","country":"United States","distributed_by":"Universal Pictures","Legacy":"A cartoon series, The Spooktacular New Adventures of Casper, was released in 1996 based on the film. Fatso (Season 1-2), Stinkie, Stretch and Casper were all voiced by the actors from the film, while Dr. Harvey was voiced by Dan Castellaneta.In the mid-1990s, Simon Wells co-wrote a screenplay for Casper 2, which he was set to direct. Amblin cancelled the sequel because they did not believe there would be enough interest from moviegoers. Wells also credited the uncertainty of actress Christina Ricci returning and Fox's ill-received direct-to-video Casper films as contributing to the cancellation of Casper 2.Two direct-to-video prequels to the movie were released by 20th Century Fox, Casper: A Spirited Beginning was released in 1997, and Casper Meets Wendy was released in 1998. Ben Stein reprised his film role in the first two prequels.There were several video games based on or tied-in with the film released on the major consoles of the time, such as the 3DO, Super NES, Sega Saturn, PlayStation, Game Boy Color and original Game Boy. An LCD handheld game was released for Tiger Electronics in 1995.","Plot":"Following the death of her father, neurotic and spoiled heiress Carrigan Crittenden discovers he has only left her Whipstaff Manor in Friendship, Maine. Carrigan and her attorney Dibs discover a vast treasure allegedly is in the manor, but they find it is haunted by a friendly ghost named Casper and his obnoxious prankster uncles, the Ghostly Trio, who scare the two off the property. A lonely Casper watches a news report of paranormal therapist James Harvey, instantly smitten with his teenage daughter Kat, and inspires Carrigan to summon Dr. Harvey to Whipstaff. Harvey and Kat have an estranged relationship due to the former’s reputation, and searching for the ghost of his late wife Amelia. Moving into Whipstaff, Kat and her father quickly encounter Casper, who tries to befriend them, while his uncles try to scare them out of the house.After befriending Casper over breakfast, Kat goes to school and becomes popular when her class agree to host their Halloween party at Whipstaff upon learning she lives there. Amber, Kat’s classmate, envious of Kat stealing her spotlight, plots with her boyfriend Vic to humiliate Kat during the party. Harvey attempts to have therapy sessions with the Ghostly Trio, who reveal they know Amelia, but when they pull a prank on him, Harvey becomes dispassionate, encouraging the trio to take him out for a night on the town. At a bar, Harvey gets drunk and falls down a manhole. Meanwhile, Kat learns Casper has no memory of his life, and unlocks his old bedroom to remind him. Casper comes across a sled, recalling his father bought it for him, only for Casper to have died of an illness and became a ghost to keep his father company. A newspaper article reveals that Casper’s father built a machine called Lazarus, which could bring the dead back to life.Casper and Kat venture down into the manor’s basement, discovering Lazarus. Carrigan and Dibs sneak in, stealing the formula that powers Lazarus and plot to use the machine to essentially become immortals and commit crimes. However, the two attempt to kill each other as an experiment; as a result, Carrigan falls off a cliff to her death and rises as a ghost. She confronts Casper and Kat, launching Dibs out of a window when he tries to double-cross her. Casper tricks her into stating that she has no unfinished business on Earth, causing Carrigan to be involuntarily ejected into the afterlife. The alleged treasure is revealed to be Casper’s prized baseball signed by Duke Snider. Harvey, now a ghost, and Casper's uncles appear, and seeing Kat in despair, Casper sacrifices his last chance for life to restore Harvey.The Halloween party kicks off upstairs, and Amber and Vic’s prank is thwarted by the three ghostly uncles. Casper is visited by Amelia’s ghost, who briefly transforms him into a human as a reward for his sacrifice until ten o’clock. Casper dances with Kat, while Amelia speaks with Harvey, revealing that she was so content alive that she had no unfinished business, encouraging him to move on. Amelia departs as the clock chimes ten, and Casper transforms back into a ghost and playfully scares off the party guests, leaving him, and the Harveys to dance to the ghost uncles' music.","language":"English","Reception":"Casper opened at #1 over the Memorial Day weekend, grossing $16,840,385 over its first three days from 2,714 theaters, averaging $6,205 per theater. Over four days it grossed $22,091,975, averaging $8,140 per theater. It stayed at #1 in its second weekend, grossing another $13,409,610, and boosting its 10-day cume to $38,921,225. It played solidly all through the summer, ending up with a final gross of $100,328,194 domestically, and an additional $187,600,000 internationally, for a total worldwide gross of $287,928,194, far exceeding its $55 million budget and becoming a commercial success.[1]Casper received mixed reviews from critics. On Rotten Tomatoes, the film has a rating of 44%, based on 36 reviews, with the site's critical consensus reading, \"A meandering, mindless family movie that frequently resorts to special effects and transparent sappiness.\"[5] Time Out London described it as \"an intimate and likeable film\".[6] Roger Ebert gave the film three out of four stars, calling it a \"technical achievement, it's impressive, and entertaining. And there is even a little winsome philosophy.\"[7]The CGI effects, which were considered cutting edge at the time, and the performances of Pullman and Ricci were praised, especially considering that, in the scenes where the Harveys interact with the ghosts, Pullman and Ricci were actually acting either with nothing or with stand-in maquettes used as animators' references.Moriarty's performance was criticized, with Variety saying she does \"a poor woman's Cruella de Vil\".[8] Many reviewers also felt that Idle, being a venerable comedian, was underused in the role of Moriarty's obsequious henchman.","box_office":"$287.9 million[1]","cinematography":"Dean Cundey","production_company":"Amblin Entertainment The Harvey Entertainment Company","directed_by":"Brad Silberling","Soundtrack":"The soundtrack was composed by award-winning composer James Horner, who had worked on a number of previous movies for Amblin Entertainment, including An American Tail.","casper":"Promotional poster","release_dates":"May 26, 1995 (1995-05-26)|||||","Production":"In the mirror scene, Dr. Harvey was also supposed to transform into Steven Spielberg. According to director Brad Silberling, the cameo was filmed, but was cut for pacing reasons. Spielberg was relieved, feeling that he is not much of an actor himself and was quite nervous in front of the camera.[3] Casper is the first feature film to have a fully CGI character in a leading role.[4]","produced_by":"Colin Wilson","starring":"Christina Ricci Bill Pullman Cathy Moriarty Eric Idle Amy Brenneman Voices: Malachi Pearson Joe Nipote Joe Alaskey Brad Garrett","running_time":"101 minutes","music_by":"James Horner","edited_by":"Michael Kahn","written_by":"Sherri Stoner Deanna Oliver","budget":"$55 million[1]"}