{"country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Jonathan Mostow Sam Montgomery","story_by":"Jonathan Mostow","breakdown":"Promotional poster","Plot":"Jeff Taylor and his wife Amy drive cross-country from Boston to San Diego in their new Jeep. Jeff narrowly avoids colliding with a beat-up truck. Later, at a gas station, Earl, the truck's driver, confronts Jeff, exchanging hostile words.Shortly after the couple resume their journey, their car breaks down on a vacant road. Leaving Jeff with the Jeep, Amy accepts a ride from a passing big rig trucker to get to a nearby diner and call for help. Jeff eventually discovers that someone has suspiciously tampered with the Jeep's battery connections. After reconnecting them, he drives to the diner, only to discover that no one has seen Amy. When he sees the trucker on the road and forces him to stop, the trucker claims he has never seen Jeff or Amy. Jeff then hails a passing sheriff named Boyd, but a brief search of the truck yields no sign of Amy. The trucker, Red Barr, is let go and Jeff is instructed by Boyd to see his deputy in the town of Brackett.After speaking with the deputy, Jeff goes back to the diner. Billy, a mentally-impaired mechanic, informs Jeff that Amy left with some men, but refuses to speak with the police, claiming they are involved. Jeff rushes to the location Billy mentioned, but is ambushed on a back road by Earl. He escapes by driving his Jeep into a river, then circles back on foot to watch his attackers salvage the Jeep from the river. He is then discovered and knocked out by Billy.When Jeff wakes up, he is confronted by Billy (who feigned mental impairment earlier), Earl and another accomplice named Al. Their leader is none other than Red Barr. Red informs Jeff that he wants the $90,000 in Jeff's bank account, and shows him the bank of Brackett. Realizing he has only a fraction of the assumed amount, Jeff attempts to alert the bank manager to his plight. However, paranoid that Red's group is keeping an eye on him, Jeff gives up the idea and steals marked money ribbons and a letter opener. He uses the money ribbons to pack stacks of $1 bills between two $100 bills.Jeff is then instructed to leave town, where Earl picks him up and bounds him with duct tape. Earl begins gloating about how Jeff and his wife were easy targets, how he tampered with their Jeep and his group intends to kill them anyway. Jeff cuts himself free with the letter opener and stabs Earl. After a brief struggle, Jeff takes over the vehicle, binds Earl, and forces him to reveal his rendezvous with Red at a local truck stop. They pass Boyd, who sees the speeding, swerving pickup and stops the vehicle. When Jeff exits the truck with Earl's gun, Boyd mistakes the situation and forces him to lie down. Earl frees himself and shoots Boyd with a concealed gun. Before Earl can shoot Jeff, a wounded Boyd shoots and kills him. Jeff uses Boyd's radio to call for an ambulance and rushes to the truck stop.At the stop, Jeff sees Red and stows away under his truck. Early the next morning, Red arrives at his farm. Jeff sneaks into the barn, discovering evidence that Red has a history robbing and killing people and that his real name is Warren. Al and Billy arrive with Amy, and the three lock her in a freezer in the barn's cellar, leaving her to die. Unable to open the cellar door, Jeff finds a gun and demands the cellar key from Red. When he is distracted by Red's son, Billy escapes. Jeff forces Al, Red, his wife, and his son to release Amy, then locks them in the cellar. Jeff and Amy steal a pickup and flee, while Billy returns to free Red and Al, who each pursue the Taylors in their own vehicles.During the pursuit, Billy is killed when Jeff forces his car off the road. Shortly after, the trailer from Red's truck detaches, causing Al to violently crash into it. Undeterred, Red attempts to force Jeff and Amy's vehicle off a bridge, trapping Amy's leg underneath the dashboard. Jeff rushes out of the vehicle and into Red's big rig, where a struggle over the steering wheel forces Red's truck over the edge and dangle on a steel bridge support. Jeff fights Red on the suspended big rig, eventually hurling him to the rocks below. Jeff frees Amy from the dashboard. Seeing that Red survived the fall, Amy pulls the automatic shifter on their pickup, causing the semi to fall on Red and crush him. Sitting on the edge of the bridge beside their mangled pickup, Jeff and Amy embrace each other.","language":"English","box_office":"$50.2 million[1]","cinematography":"Douglas Milsome","production_company":"Dino De Laurentiis Company Spelling Films","directed_by":"Jonathan Mostow","release_dates":"May 2, 1997 (1997-05-02)|||||","Production":"Breakdown was filmed on location in Sacramento, California, Victorville, California, Pyramid Lake (Los Angeles County, California), Moab, Utah, and Sedona, Arizona.The score was written by Basil Poledouris, with contributions from Steve Forman, Judd Miller, Eric Colvin and Richard Marvin.It was released as a limited edition of 3,000 units by LaLaLand Records in June 2011, and as of January 2013 is still available. The release comprises a 3-CD set: the first CD contains the score as heard in the film, which contains material from additional composers. This is not 100% complete; omitting a few extremely low-key passages from the early scenes; nor is it chronological - some cues have been combined and re-ordered to maintain a listening experience.The second CD contains an alternate early version of many cues by Poledouris that represent a different, far more orchestral approach to scoring the film (the score in the film stripped away many layers, and left mostly percussive and sound design elements for many cues.)The third CD contains further alternates that demonstrate the changing nature of the music as scenes were re-scored.","produced_by":"Dino De Laurentiis Martha De Laurentiis","starring":"Kurt Russell J. T. Walsh Kathleen Quinlan M. C. Gainey","running_time":"93 minutes","music_by":"Basil Poledouris","edited_by":"Derek Brechin Kevin Stitt","Release":"The review aggregator website Rotten Tomatoes reported that 80% of critics gave the film positive reviews based upon a sample of 47, with an average score of 7 out of 10.[2] At Metacritic, which assigns a weighted average rating out of 100 to reviews from mainstream critics, the film received an average score of 73 based on 19 reviews.[3] Peter Stack of the San Francisco Chronicle praised the film, \"Breakdown use[s] old-fashioned ingenuity — plus a compelling star, a fast-paced mystery and a deadpan villain — to come up with a sizzler.\"[4] Roger Ebert gave the film a positive review, calling it \"taut, skillful and surgically effective\".[5] Stephen Hunter of The Washington Post criticized Russell for not conveying a desperate husband willing to fight for his missing wife, writing \"He does a lot of running around while making desperate faces, but he never projects a sense of deep rage. He never gets dangerous. Thus the movie is shorn of its one primitive gratification: the image of the civilized man who finds the Peruvian commando inside himself and lays waste to louts who have underestimated him.\"[6]In 2014, Time Out polled several film critics, directors, actors and stunt actors to list their top action films.[7] Breakdown was listed at 90th place on this list.[8]Breakdown debuted at first place at the box office with $12.3 million.[9] After initially opening to 2,108 theaters, the film later expanded to 2,348 theaters and grossed a total of $50,159,144 in the United States and Canada.[10]","budget":"$36 million[1]"}