{"country":"United States","distributed_by":"Crown International Pictures","Plot":"Former Vietnam vet, amateur bodybuilder, and talented porno-photographer Kirk Smith is a crazed killer who stalks the streets of Los Angeles, picking up young women, strangling them in lurid fashion, and sexually abusing their dead bodies. Between murders, he carries out twisted religious ceremonies, talks to his dead father, and weeps like a baby. He repeatedly contacts Dr. Lindsay Gale, a psychologist with a radio show as well as a private therapy practice. He calls her show, speaking with an assumed Spanish accent and complaining of chronic headaches and blackouts. He follows one of Dr. Gale's female patients home from her therapy session, and tortures her (the patient) to death. He also murders a prostitute while on the phone to Dr. Gale's show, forcing Dr. Gale to listen to the victim's cries.Two goofy detectives named Hatcher and McCabe are charged with the task of tracking him down. When McCabe first questions Dr. Gale, his manner is brusque and unsympathetic. She develops a strong dislike for him. However, he later prevents one of her patients from committing suicide, after which Dr. Gale becomes fond of McCabe and they have a brief love affair.Hatcher and McCabe visit a whore-and-drug-house in search of a witness who has seen the strangler leaving the scene of one of his murders, but the witness (who is a pimp and a drug dealer) attacks them and they shoot him to death without being able to question him.Kirk Smith is interrupted at the scene of his next murder by the victim's landlady, and he leaves a portfolio of photographs behind as he flees the scene. Hatcher and McCabe show the photographs to the local pornography dealer (played by Chuck Mitchell, who would later star in Porky's); he identifies them as the work of Kirk Smith, who has provided him with high-quality pornographic pictures in the past. When the detectives search Smith's apartment, they find his pictures of Dr. Gale and realize that he has selected her to be his next victim. During this time, Smith invades Dr. Gale's home, ties her up, and terrorizes her for hours, ranting about his childhood, grabbing her breast and shouting \"Shut up or I'll tear your tit off!\"McCabe goes to Dr. Gale's home just in time to rescue her. At the end of a protracted struggle, McCabe shoots Smith many times, including several times in the back. The film ends with a shot of Smith's bullet-ridden body floating in Dr. Gale's garden pool, while McCabe snarls: \"Adios, creep!\"","language":"English","Censorship":"When first released on DVD by Rhino Entertainment in 2001, an edited for television print was used, which had been subject to heavy edits—over 9 minutes were edited from the film. The uncensored, theatrical release version was released by BCI Eclipse on DVD on October 2006.[3][4]","Reception":"Vincent Canby in The New York Times felt the film was “a nasty, dimly executed exploitation movie about a psychopathic fellow who roams around Los Angeles strangling women with stockings and then mutilating their bodies. The performances are terrible, as are the writing and the direction…\"[10] Paul Taylor in Time Out magazine called it “a routinely mindless sickie.\" [11]Years after its initial release, the film's mainstream critical reputation continues to be abysmal. Michael Weldon, in The Psychotronic Encyclopedia of Film, noted, \"If you like really sick films, see this one...The ads made it look like another baby-sitter-in-distress movie, but it's in a class by itself.\"[12] Phil Hardy's The Aurum Film Encyclopedia: Horror described the film as \"yet another woman-in-jeopardy movie...the covert suggestion that the female victims have 'asked for it' is particularly objectionable.\"[13] However, the review further observed that Nicholas Worth's performance as the lunatic killer was \"so outrageously over-the-top, and so bizarrely eccentric as to be horribly fascinating and the final line of 'Adios, creep', delivered over a shot of Worth's corpse floating in a swimming pool, is curiously resonant.\"[13] Leonard Maltin gave the film a BOMB rating, stating that it was another psychopathic Vietnam veteran killer film, warning readers to not watch the film.[14]","don't_answer_the_phone":"Official poster","cinematography":"James L. Carter","production_company":"Scorpion","directed_by":"Robert Hammer","Soundtrack":"The score was composed by Byron Allred.[5]","release_dates":"February 29, 1980 (1980-02-29)|||||","Production":"The film was shot in and around Los Angeles, California.[2]","produced_by":"Michael D. Castle Robert Hammer","starring":"James Westmoreland Denise Galik Nicholas Worth","running_time":"94 minutes","music_by":"Byron Allred","edited_by":"Joe Fineman","Release":"Crown International Pictures released the film on February 29, 1980.[6] By the end of that year the film had accrued US$ 1,750,000 in distributors' domestic (U.S. and Canada) rentals, making it the year's 105th biggest earner.[7]The VHS was released in the United States on 28 February 1982 by Media Home Entertainment.[8] The DVD was released in 2002 by Rhino Home Video[9] and re-released by BCI Eclipse on 10 October 2006.[4]","written_by":"Michael D. Castle Robert Hammer"}