{"country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Brian Burns|Sean Anders|John Morris|","story_by":"Brian Burns","Plot":"Mild-mannered radio executive Brad Whitaker (Will Ferrell) struggles to be a good stepfather to his wife Sara's (Linda Cardellini) two children, Megan and Dylan, and is seemingly sterile after an accident to his testicles some years ago. The children begin to grow closer to Brad, with Dylan confiding in him that he is being picked on at school and Megan asking him to take her to a father/daughter dance at her school. One night, the kids' father and Sara's former husband Dusty Mayron (Mark Wahlberg) calls, and discovers Sara's marriage with Brad. He subsequently and suddenly announces he will be visiting the next day. Sara is hesitant about her former husband being in their home, but Brad convinces her that it is important for the kids that their father and stepfather establish boundaries with each other.When Dusty arrives, Brad is immediately intimidated by his more attractive and muscular appearance, and how he easily gets along with Megan and Dylan - however, Dusty continually charms Brad into letting him stay, despite Sara protesting about the kind of man that Dusty really is. Brad soon wises up when it becomes clear that Dusty intends to drive Brad out of his kids' lives and reconcile with Sara. After multiple instances of Dusty showing Brad up - including getting the kids a dog, finishing a treehouse that Brad wanted to build with Dylan, and attempting to drive a wedge between Brad and Sara by taking them to a fertility doctor (Bobby Cannavale), hoping that Brad's inability to give Sara a baby will send her into Dusty's arms, the two men appear to reach an understanding after working together to teach Dylan how to defend himself. Additionally, Brad and Sara are overjoyed to learn that Brad's sperm count has increased significantly (implied to be a result of Dusty \"invading his territory\"), giving them hope of having a child together.However, Brad is stunned when Dusty reveals that he still intends to drive Brad out of the family. Desperate, Brad spends tens of thousands of dollars on early Christmas gifts, including a pony and 18,000 dollar seats at a basketball game. At the game, Dusty once again shows Brad up by revealing himself to be friends with the coach to Dylan's favorite team, and an enraged Brad begins drinking heavily. During half-time, Brad is chosen to try to shoot a basketball to win a prize. Drunk, Brad goes on a rant about Dusty before accidentally pelting a cheerleader and a disabled child in a wheelchair in the face with basketballs. Sara kicks Brad out of the house; however, when Dusty tries to comfort her, she rejects him, and forces him to step up as a dad to help his kids with their busy schedules.Four days later, Brad is living in his office at work, depressed. Dusty, meanwhile, is overwhelmed by the many responsibilities of being a full time father. When Dusty decides to call it quits and leave on the day of Megan's father-daughter dance, his friend Griff (Hannibal Buress) goes to Brad and convinces him to fight for his family. Brad catches Dusty at the airport and tries to get him to come back. Dusty admits that he cannot handle the hard parts about being a father, and admires Brad for putting up with all the things that he has to go through. Brad says that all of the terrible parts about being a dad is worth it, because in the end he is doing it for his kids. This convinces Dusty to go to the dance, and he and Brad arrive together. There, they discover that the classmate who was picking on Dylan at school is a girl, and almost get into a fight with her father when Dylan physically retaliates. However, Dusty finally decides to follow Brad's lead on being a father, and instead quells the fight by starting a dance-off. Brad and Sara reconcile, and Dusty decides to stay and be a good \"co-dad\" to his kids.Later, the whole family is happy; Brad and Sara have a new baby boy named after Griff, and Megan and Dylan have finally accepted Brad as their stepfather. Dusty, who now has a job as a Panda DJ and become wealthy through his work, has moved in across the street after building a castle there, and he and Brad are now friends. Dusty eventually remarried to a woman named Karen (Alessandra Ambrosio), who has a daughter and thus Dusty becoming a stepfather himself. Sara is immediately intimidated by Karen after meeting her; she feels that Karen's looks surpasses hers and jealous of the latter's professions as a doctor and a novelist. Dusty is now in the exact same position that he put Brad in a year ago - at odds with his stepdaughter's incredibly intimidating father, Roger (John Cena).","language":"English","Reception":"Daddy's Home grossed $150.4 million in North America and $90 million in other territories for a worldwide total of $240.4 million, against a budget of $50 million.[3] It is Ferrell's highest-grossing live-action film, surpassing Elf ($220.4 million).[20]In the United States and Canada, the film opened on December 25, 2015 alongside Point Break, Joy, Concussion, and the wide release of The Big Short. In its opening weekend the film was projected to gross $20–25 million from 3,271 theaters.[21] However after grossing $1.2 million from its early Thursday showings and $15.7 on its opening day, weekend projections were increased to $43–46 million.[22] The film ended up grossing $38.7 million in its opening weekend, finishing second at the box office behind Star Wars: The Force Awakens ($149.2 million).[23] It was the second biggest non-animated opening of Ferrell's career, behind Talladega Nights: The Ballad of Ricky Bobby ($47 million).[24]On Rotten Tomatoes, the film has an approval rating of 31%, based on 105 reviews, with an average rating of 4.9/10. The site's critical consensus reads: \"Will Ferrell and Mark Wahlberg have proven comedic chemistry, but Daddy's Home suffers from a dearth of genuinely funny ideas – and lacks enough guts or imagination to explore the satirical possibilities of its premise.\"[25] On Metacritic, the film has a score of 42 out of 100, based on 30 critics, indicating \"mixed or average reviews\".[26] Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.[23]","box_office":"$240.4 million[3]","cinematography":"Julio Macat","directed_by":"Sean Anders","daddy's_home":"Theatrical release poster","production_companies":"Red Granite Pictures Gary Sanchez Productions","release_dates":"December 13, 2015 (2015-12-13) (New York City premiere)|December 25, 2015 (2015-12-25) (United States)||||","Production":"On November 5, 2014, it was confirmed that Will Ferrell and Mark Wahlberg would play the lead roles in the film.[5][6] On November 12, Linda Cardellini joined the cast of the film, to play Ferrell's character's wife.[7] On November 18, Hannibal Buress joined the film to play a sarcastic handyman who believes that the stepfather is a racist.[8] On January 28, 2015, Paul Scheer was added to the cast of the film, playing The Whip, a crazy DJ.[9]Principal photography began on November 17, 2014, in New Orleans, Louisiana.[10][11] On November 24 and 25, filming took place at Edward Hynes Charter School.[12] On January 12, 2015, actors were spotted filming in the Lakeview area.[13] On January 21, 2015, a scene was shot during a New Orleans Pelicans and Los Angeles Lakers game where Ferrell smashed a cheerleader (played by stuntwoman/wrestler Taryn Terrell) in the face with a basketball.[14] Filming was scheduled to wrap on February 3, 2015, but lasted through February 6.[15][16]","produced_by":"Will Ferrell|Adam McKay|Chris Henchy|John Morris|","starring":"Will Ferrell|Mark Wahlberg|Linda Cardellini|","running_time":"96 minutes[1]","Sequel":"On April 21, 2016, it was announced that a sequel had been greenlit, with Ferrell and Wahlberg reprising their roles, Anders and Morris writing the script, and Anders returning to direct.[28]","music_by":"Michael Andrews","edited_by":"Eric Kissack|Brad Wilhite|","Release":"The film was released on December 25, 2015 by Paramount Pictures.[17]Daddy's Home was released digitally on March 8, 2016, [18] before being released on Blu-ray and DVD on March 22, 2016.[19]","budget":"$69 million[2]"}