{"country":"United States","distributed_by":"Buena Vista Pictures","DVD release":"Buena Vista Home Entertainment released the film on DVD in both anamorphic widescreen and fullscreen editions on August 23, 2005. Both have English, French, and Spanish audio tracks and French and Spanish subtitles. Bonus features include audio commentary by director Nigel Cole and producers Armyan Bernstein and Kevin J. Messick, deleted scenes, a blooper reel, and a music video by Aqualung. In India, the film is released as a bonus DVD with the film The Proposal.","Plot":"Constructed as a series of chapters that take place at a turning point in each character's life, the story moves from seven years in the past to three years to two and finally arrives in the present day. Emily Friehl (Amanda Peet) and Oliver Martin's (Ashton Kutcher) first encounter is on a flight from Los Angeles to New York City, during which they join the mile high club. He has hopes of becoming an Internet entrepreneur and, certain of his future success, gives her his mother's phone number and suggests she call him in six years to see if his prediction came true.Three years later, facing the prospect of spending New Year's Eve alone, Emily finds Oliver's number and calls him, and the two meet for dinner. Thus starts a series of reunions with the passing of time, as each drifts in and out of relationships with others, Oliver and his business partner Jeeter start an on-line diaper service, and Emily becomes a successful photographer. Each time they meet, one appears to be settled and content while the other is struggling to make headway in both life and career. Eventually they come to the realization that each is exactly the person the other one needs for fulfillment.","language":"English","Critical reception":"A Lot like Love received mixed reviews from critics and currently holds a 41% rating on Rotten Tomatoes.Manohla Dargis of The New York Times said the film \"isn't half bad and every so often is pretty good, filled with real sentiment, worked-through performances and a story textured enough to sometimes feel a lot like life. If nothing else, A Lot Like Love is a pleasant reminder of a Hollywood time, seemingly long gone, when boy met girl in a midlevel romantic comedy without arty aspirations . . . or low-brow yucks.\"[4]Roger Ebert of the Chicago Sun-Times observed, \"The movie is 95 minutes long, and neither character says a single memorable thing. You've heard of being too clever by half? Ollie and Emily are not clever enough by three-quarters . . . To call A Lot like Love dead in the water is an insult to water.\".[5] Ebert awarded the film one out four stars, and ultimately included it in his list of \"Most Hated Films\".Ruthe Stein of the San Francisco Chronicle said, \"An unfortunate casting decision . . . comes close to sabotaging a witty script . . . As the sometimes couple, Ashton Kutcher and Amanda Peet are together in almost every scene, making it difficult to conceal the huge gap in their acting skills. Bland and with a small television face (words once used to describe David Caruso, but equally applicable here), Kutcher is incapable of doing the heavy lifting required to be a romantic lead . . . Peet, who has the looks and magnetism of a Kennedy offspring, makes Kutcher fade into the background, and you're left fantasizing what the movie might have been if Peter Sarsgaard had co-starred . . . Still, the movie is rich in the kind of details often left out because of a lack of budget or imagination.\"[6]Christopher Orr of The New York Sun said, \"What do you call a shameless imitation of a shameless imitation? A rip-off squared? An homage once removed? Whatever label you choose, it can be comfortably affixed to A Lot Like Love, an Ashton Kutcher-Amanda Peet vehicle that is a lot like When Harry Met Sally, which was itself a lot like Annie Hall. Sadly, the resemblance does not extend to quality. Indeed, those with a scientific turn of mind may take the devolution from Annie to Harry to A Lot Like Love as yet another demonstration of the Second Law of Thermodynamics, which says that in a closed system (an apt description of Hollywood if ever there was one) there is a tendency toward entropy - in this case, from acknowledged classic to memorable cable-television staple to dim, flabby dud . . . If one thing saves A Lot Like Love from disaster - and I'm not sure it does - it's an easy chemistry between the leads, though one that owes little to Mr. Kutcher's performance . . . Fortunately, Ms. Peet carries off the role of Emily with enough spark that even Mr. Kutcher gradually lights up . . . Since running away with The Whole Nine Yards five years ago, Ms. Peet has had altogether too little opportunity to showcase her sexy comic appeal. A Lot Like Love might have provided that opportunity, had it only featured something a little like a script.\"[7]Peter Travers of Rolling Stone rated the film two out of four stars, calling it \"a lot like a lot of other romantic comedies that make two lovers of friends (When Harry Met Sally, Serendipity) and a lot not like the two witty and wise Richard Linklater movies - Before Sunrise and Before Sunset - that span the relationship between Ethan Hawke and Julie Delpy for nearly a decade and leave you wanting more . . . About A Lot Like Love leaving you wanting a lot less, I am right.\"[8]","box_office":"$42.8 million[1]","cinematography":"John de Borman","production_company":"Touchstone Pictures","directed_by":"Nigel Cole","a_lot_like_love":"Original poster","release_dates":"April 21, 2005 (2005-04-21) (Israel) April 22, 2005 (2005-04-22)","Production":"The film was shot on location in New York City, Los Angeles, and Antelope Valley.A soundtrack album for the film was released by Columbia Records on April 12, 2005.[2][3]","Box office":"The film opened on 2,502 screens in the United States on April 22, 2005. It earned $7,576,593 on its opening weekend, ranking fourth after The Interpreter, The Amityville Horror, and Sahara. It eventually grossed $21,845,719 in the US and $21,041,000 in foreign markets for a total worldwide box office of $42,886,719.[1]","produced_by":"Armyan Bernstein Kevin J. Messick","starring":"Ashton Kutcher Amanda Peet","running_time":"107 minutes","music_by":"Alex Wurman","edited_by":"Susan Littenberg","written_by":"Colin Patrick Lynch","budget":"$30 million [1]"}