{"college":"Theatrical Release poster","country":"United States","distributed_by":"MGM/UA","Plot":"After Kevin (Drake Bell), a high school senior, gets dumped by his girlfriend Gina (Alona Tal) for being too boring, he does not want to go to the freshman orientation weekend at Fieldmont University, where they had planned to go together. But his best friends Carter (Andrew Caldwell) and Morris (Kevin Covais) convince him that the weekend away will help get his mind off her and hearing stories from their friend Fletcher (Ryan Pinkston) who told them about his college weekend visiting his brother and got laid by three college chicks at once. That convinced Kevin go to Fieldmont for the freshmen orientation to prove to his ex-girlfriend that he can be fun too and instead of boring. Once they are there, one of the rowdiest fraternities and sororities on campus pretends to recruit them as pledges in return for granting them access to the college party scene. Though forced to put up with the disgusting antics of fraternity brothers Teague (Nick Zano), Bearcat (Gary Owen), and Cooper (Zach Cregger), the guys meet sorority girls Kendall (Haley Bennett), Heather (Camille Mana), and Amy (Nathalie Walker), and sparks fly. But once Teague feels threatened by Kevin's new relationship with Kendall who once dated Teague, he takes the pre-frosh humiliation to a greater level and make their lives miserable and start bullying them out of their college. They have no choice, forcing the guys to decide to fight back and payback for ruining their weekend and ruining Morris college scholarship here and Kevin's chance go to school here.","language":"English","box_office":"$6,265,483[2]","cinematography":"Dan Stoloff","directed_by":"Deb Hagan","release_dates":"August 29, 2008[1]","Production":"The film was released on Labor Day weekend August 29, 2008 in 2,123 theaters.Many of the scenes of the actors at university are filmed on the campus of Tulane University in New Orleans and Grace King High School in Metairie on January 2007.[citation needed]","produced_by":"Malcolm Petal Julie Dangel","starring":"Drake Bell Kevin Covais Andrew Caldwell Haley Bennett Ryan Pinkston","running_time":"94 min.","music_by":"Transcenders","edited_by":"David Codron","Release":"The film was panned by critics. On Rotten Tomatoes, the film holds a rating of 5%, based on 42 reviews, with an average rating of 2.5/10. The site's consensus reads: \"A pale imitation of the raunchy frat comedies of old, College aims low and misses.\"[3] On Metacritic, the film holds a score of 15 out of 100, based on 11 critics, indicating \"overwhelming dislike\".The film was released on August 29, 2008, in 2,123 theaters. It made US$2.6 million over the Labor Day weekend. The film has grossed an estimated $4.7 million in America and $1.6 million in other territories for a total gross of $6.3 million worldwide.[4]The film was released on Region 1 DVD, January 27, 2009.The DVD includes both the Theatrical and Unrated versions of the film as well as a Gag Reel.[5]","written_by":"Dan Callahan Adam Ellison","budget":"$7 million"}