{"country":"United States","distributed_by":"Destination Films","Plot":"Mona Hibbard (Driver) is a young woman from a troubled home who has one overarching goal: to become the winner of the Miss American Miss pageant. Her mother is an alcoholic who graduates from berating her young daughter for not doing well in kids' pageants to declaring she will not provide any money or support for Mona if she keeps competing. Fortunately for Mona, she becomes best friends with Ruby Stilwell (Adams) and Ruby's kind grandmother (Herta Ware) to help Mona as she begins her steady rise in the beauty pageant ranks.Mona becomes pregnant, but, as women with children are ineligible for the MAM crown, Ruby selflessly agrees to raise Mona's daughter Vanessa (Eisenberg) as her own daughter. Mona becomes colder and meaner as she gets closer to achieving her goal, whether she's sabotaging a fellow contestant Leslie Stefanson on her routine and earning a lifelong enemy of an aspiring newscaster, or pawning all of her inconveniences onto Ruby while ignoring how obvious it is that Vanessa looks exactly like her - a path that leads to her victory in the Miss Illinois pageant.When Ruby is falsely accused of euthanasia and jailed, Mona is forced to care for Vanessa, a task at which she is neither qualified nor appreciative, as she is afraid that her MAM crown bid will be taken away. Vanessa reacts to the situation by being angry and difficult to handle. Mona heads to the MAM showcase. She only later matures after seeking guidance from jailed Ruby, only to have Ruby finally tell her friend that she needs to start taking care of her responsibilities. Mona comes to see that the pursuit of pageant fame is empty next to taking care of her family, and finally announces when she's made the MAM Final 3 that she is Vanessa's mom and is withdrawing from the pageant. But the judges see that the crowd is 100% in her favor, and change their rules so Mona becomes the new Miss America Miss.","language":"English","box_office":"$3.2 million[1]","cinematography":"Robert D. Yeoman","directed_by":"Sally Field","release_dates":"September 29, 2000 (2000-09-29)|||||","produced_by":"John Bertolli B.J. Rack","starring":"Minnie Driver Joey Lauren Adams Kathleen Turner Kathleen Robertson","running_time":"112 minutes","music_by":"John Frizzell","edited_by":"Debra Neil-Fisher","written_by":"Jon Bernstein","budget":"$14 million[1]"}