{"based_on":"Characters created  by Pierre Boulle","distributed_by":"20th Century Fox","Plot summary":"The opening titles set the film in \"North America – 1991.\" Armando (Ricardo Montalbán) explains that in 1983 (ten years after the end of Escape from the Planet of the Apes, which was set two years ahead of its theatrical release date), a disease killed the world's cats and dogs, leaving humans with no pets. To replace them, humans began keeping apes as household pets. Realizing the apes' capacity to learn and adapt, humans train them to perform household tasks. By 1991, American culture is based on ape slave labor (just as Cornelius described would happen in the previous film). It is also suggested that the North America of the 1990s is at least partly a police state, as apes and humans are being watched at all times.Armando and Caesar (Roddy McDowall), a young chimpanzee horseback rider in Armando's circus, distribute flyers around a large city to advertise the circus' arrival. Armando warns the chimpanzee to be careful....should anyone learn his identity as the son of Cornelius and Zira, it would mean their deaths. They see apes performing various menial tasks, and are shocked at the harsh discipline on disobedient apes. Seeing an ape being beaten and drugged, Caesar shouts \"Lousy human bastards!\" Quickly, Armando takes responsibility for the exclamation, explaining to the policemen that it was he who shouted, not his chimpanzee. The surrounding crowd becomes agitated, and Caesar flees.Hiding in a stairway, Armando tells Caesar he will go to the authorities and bluff his way out of the situation. Meantime, Caesar has to hide among his own kind (in a cage of orangutans) and soon finds himself being trained for slavery through violent conditioning. He is then sold at auction to Governor Breck (Don Murray). Breck allows the ape to name himself by randomly pointing to a word in a book handed to him and the chimpanzee's finger rests upon the name \"Caesar\", feigning coincidence. Caesar is then put to work by Breck's chief aide MacDonald (Hari Rhodes) who sympathizes with the apes to the thinly veiled disgust of his boss.Meanwhile, Armando is being interrogated by Inspector Kolp (Severn Darden), who suspects his \"circus ape\" is the child of the two talking apes from the future. Kolp's assistant puts Armando under a machine, \"The Authenticator,\" that psychologically forces people to be truthful. After admitting he had heard the name Cornelius before, Armando realizes he cannot fight the machine. A guard comes in to force him to continue the interrogation, but Armando struggles and jumps through a window falling to his death. Learning of the death of his foster father, the only human that cared for him, Caesar loses faith in human kindness and begins plotting a rebellion.Secretly, Caesar teaches combat to the other apes and has them gather weapons. While doing an errand with Ceasar, MacDonald expresses concern for the rising problems and wished he could communicate with Caesar. Caesar exposes himself as the lost circus ape and tells MacDonald of his plans to depose Breck. MacDonald, while understanding of Caesar's intent, has his doubts about the effectiveness of revolution, as well as Caesar being dismissive of all humans. Meanwhile, Breck learns from Kolp that the vessel which supposedly delivered Caesar is from a region with no native chimpanzees. Suspecting Caesar is the ape the police are hunting, Breck's men arrest Caesar and electrically torture him until he speaks. Hearing him speak, Breck orders Caesar's immediate death. Caesar survives his execution because MacDonald lowers the machine's electrical output well below lethal levels. Once Breck leaves, Caesar kills his torturer and escapes.Caesar begins his revolution with the first objective to capture Ape Management. The apes are victorious after killing most of the riot police. After bursting into Breck's command post and killing most of the personnel, Caesar has Breck marched out to be executed. MacDonald, whose ancestors had been slaves, begs Caesar not to succumb to brutality and show mercy to one's former masters. Caesar ignores him and in a rage declares:Where there is fire, there is smoke. And in that smoke, from this day forward, my people will crouch, and conspire, and plot, and plan for the inevitable day of Man's downfall. The day when he finally and self-destructively turns his weapons against his own kind. The day of the writing in the sky, when your cities lie buried under radioactive rubble! When the sea is a dead sea, and the land is a wasteland out of which I will lead my people from their captivity! And we shall build our own cities, in which there will be no place for humans except to serve our ends! And we shall found our own armies, our own religion, our own dynasty! And that day is upon you NOW!As the apes raise their rifles to beat Breck to death, Caesar's love interest Lisa (Natalie Trundy) voices her objection, \"NO!\" She is the first ape to speak other than Caesar. Caesar reconsiders and orders the apes to lower their weapons, saying:But now... now we will put away our hatred. Now we will put down our weapons. We have passed through the night of the fires, and those who were our masters are now our servants. And we, who are not human, can afford to be humane. Destiny is the will of God, and if it is Man’s destiny to be dominated, it is God’s will that he be dominated with compassion, and understanding. So, cast out your vengeance. Tonight, we have seen the birth of the Planet of the Apes!","language":"English","Reception":"The film received mixed to positive reviews from critics at the time of its release. It currently holds a 44% 'rotten' rating on Rotten Tomatoes, from 18 reviews, all published 2000—2008.[8]The film earned $4.5 million in theatrical rentals at the North American box office.[9]","conquest_of_the_planet_of_the_apes":"Theatrical release poster","box_office":"$9,700,000[1]","cinematography":"Bruce Surtees","production_company":"APJAC Productions","directed_by":"J. Lee Thompson","release_dates":"June 30, 1972 (1972-06-30)|||||","Production":"J. Lee Thompson, who had maintained an interest in the franchise ever since producer Arthur P. Jacobs invited him for the original Planet of the Apes, was hired to direct Conquest of the Planet of the Apes. Thompson had worked with Jacobs on two earlier films, What a Way to Go! and The Chairman, as well as during the initial stages of Planet, but scheduling conflicts had made him unavailable during its long development process.[3]Thompson staged every scene with attention to detail, such as highlighting the conflicts with color: the humans wear black and other muted colors, while the apes' suits are colorful. Don Murray suggested to Thompson his wardrobe with a black turtleneck sweater, and rehearsed his scenes after translating his dialogue into German \"to get this kind of severe feeling of the Nazis\". Screenwriter Paul Dehn wrote the film incorporating references to the racial conflicts in North America during the early 1970s, and Thompson further highlighted by shooting some scenes in a manner similar to a news broadcast. The primary location was Century City, Los Angeles, that had previously been part of the 20th Century Fox backlot and translated well the bleak future with monochromatic buildings in a sterile ultramodern style.[4] Also used as a shooting location was the University of California, Irvine, in Orange County. In addition, TV producer Irwin Allen contributed props and clothes to the film: he let the makers of 'Conquest' borrow his Seaview jumpsuits from Voyage to the Bottom of the Sea, brown clothes and computers and cabinets for Ape Management that were used first on The Time Tunnel and other sets and props from other Allen productions.Of the five original films, Conquest is the only entry filmed in Todd-AO 35 using Arriflex ARRI 35IIC cameras with lenses provided by the Carl Zeiss Group; the other Apes pictures were filmed in Panavision.The original cut of Conquest ended with the brutal killing of Governor Breck, with an implicit message that this circle of hatred would never end. After a preview screening in Phoenix on June 1, 1972, the impact of the graphic content caused the producers to rework the film, even though they did not have the budget to do so. Roddy McDowall recorded a complement to Caesar's final speech, which was portrayed through editing tricks - Caesar being mostly shown through close-ups of his eyes, the gorillas hitting Breck with his rifles played backwards to imply they were giving up - and assured a lower rating.[4] The film's Blu-ray version adds an unrated version, restoring the original ending and many other graphic scenes.[5]Conquest is the only Apes film without a pre-title sequence. The film's script and novelization describes a nighttime pre-title scene where police on night patrol shoot an escaping ape and discover that his body is covered with welts and bruises as evidence of severe abuse (in a later scene Governor Breck refers to the \"ape that physically assaulted his master,\" thereby prompting MacDonald to report that the escape must have been the result of severe mistreatment). The scene appears in the first chapter of John Jakes' novelization of the movie, and in the Marvel Comics adaption of the film in the early 1970s, both of which were probably based directly on the screenplay and not on the final edit of the actual film. An article in the Summer 1972 issue of Cinefantastique (volume 2, issue 2) by Dale Winogura shows and describes the scene being shot,[6] but it is unknown why it was cut. The Blu-ray extended cut does not contain the pre-credit opening.Screenplay writer Paul Dehn, who wrote and co-wrote the sequels, said in interviews with Cinefantastique[7] (quoted in The Planet of the Apes Chronicles, by Paul Woods) that the story he was writing had a circular timeline:The whole thing has become a very logical development in the form of a circle. I have a complete chronology of the time circle mapped out, and when I start a new script, I check every supposition I make against the chart to see if it is correct to use it...While I was out there [in California], Arthur Jacobs said he thought this would be the last so I fitted it together so that it fitted in with the beginning of Apes One, so that the wheel had come full circle and one could stop there quite happily, I think?","produced_by":"Arthur P. Jacobs","starring":"Roddy McDowall Don Murray Ricardo Montalbán Natalie Trundy Hari Rhodes","running_time":"88 minutes","music_by":"Tom Scott","edited_by":"Marjorie Fowler Alan L. Jaggs","written_by":"Paul Dehn","budget":"$1.7 million[1]"}