{"based_on":"Death Sentence  by Brian Garfield","country":"United States","distributed_by":"20th Century Fox","Plot":"Nick Hume (Kevin Bacon) is husband to Helen (Kelly Preston), and father of two boys, Brendan (Stuart Lafferty) and Lucas (Jordan Garrett). After Brendan's hockey game, Nick and Brendan drive home, talking about the latter's potential future as a professional hockey player. They make a quick stop at a gas station in a very bad part of town. During an ostensible robbery of the gas station, Joe Darley (Matt O'Leary), a new initiate and younger brother to the gang leader, slices Brendan's throat open with a machete. Nick attempts to ambush the thugs, managing to pull off Joe's mask and see his face, but Joe escapes, only to be hit by a car. Nick rushes Brendan to the hospital, but his son dies from major blood loss.Nick identifies Joe in a line-up, but while meeting with the district attorney, he is angered that the DA hopes to present a strong enough case that the defense will cut a deal for a mere 3 to 5 years in jail. The DA explains that Nick is the only witness, there were no surveillance cameras, and the defense could gain sympathy for Darley. At a pre-trial hearing, Nick recants his identification so that Joe will go free. He follows the gang to see where they hide out, later returning and stabbing Joe upon finding him alone. The next morning, the gang leader, Billy (Garrett Hedlund), wants revenge. After quickly discounting members of other gangs as culprits, one of his gang members says that his sister saw a man in a suit that night. Confirming it was Nick from a picture published in a newspaper, and seeing where he works, they ambush him the next day on the street. After chasing him through alleys, a restaurant, then to the top of a multi-story parking garage, Nick gets into a fight with one of the members, trapping him in a car and sending him over the edge of the lot.The next day, one of the gang members then arrives at the office where Nick works to deliver Nick's suitcase (which he dropped during the chase). Nick calls a phone number found in the case, which belongs to the gang leader Billy. Billy warns that Nick has bought a \"death sentence\" for his family, and reveals that Joe Darley was his brother. Nick immediately calls the police detective assigned to Brendan's case, Jessica Wallis (Aisha Tyler), who was already aware of what Nick started. She grants Nick's family police protection and issues APBs on Billy and his gang. That night, the officers watching over the family are stealthily killed, but by the time Nick realizes, he finds the gang members have already made their way inside. They attack and subdue Nick, then drag Helen and Luke downstairs to shoot them all.Nick and Luke survive, but Helen does not. After Detective Wallis gives a brief speech that wars are never settled, she lets Nick pay a short visit to his now-comatose son, where he apologizes for not being a better father. Nick escapes from the hospital to go after the remaining gang members, obtaining guns from a black market gun dealer known as Bones (John Goodman), Billy's father, who accepts the fact that Nick wants to kill his son. Nick tracks down Heco, another member of the gang, and interrogates him about where the other members are, learning their lair is an abandoned mental hospital they call \"The Office.\" He forces Heco at gunpoint to call Billy's cell phone, and executes Heco while Billy is listening. Bones confronts Billy and criticizes him, just before Billy kills him. Nick heads to \"The Office\" to kill the remainder of the gang. After an intense shootout, he and Billy encounter and seriously wound each other in the hospital chapel. Sitting on the same pew, Billy claims that he turned Nick into a vicious cold-blooded killer, just like him. After this, Nick pulls out one of his guns and asks if Billy is \"ready,\" implying that Nick kills Billy after the scene ends.With his family now avenged, Nick returns home and starts to watch home movies and await his inevitable arrest and prosecution. Detective Wallis arrives to arrest Nick but first informs him that miraculously his son has started moving and will now live. Nick actually shows some sign of relief and looks back to the TV, which shows Luke, Helen, Nick and Brendan singing on the couch. Nick's final fate remains unknown, but the extended version of the film shows him succumbing to his injuries.","language":"English","Reception":"Rotten Tomatoes, a review aggregator, reports that 20% of 111 surveyed critics gave the film a positive review; the average rating was 4.1 out of 10. The critical consensus states: \"A nonsensical plot and an absurd amount of violence make this revenge pic gratuitous and overwrought.\"[3] The film has a score of 36 out of 100 on Metacritic based on 24 critics, indicating \"Generally unfavorable reviews\".[4]Roger Ebert of the Chicago Sun-Times gave the film 2½ stars out of 4. He compared Death Sentence to the Death Wish films starring Charles Bronson, saying: \"In the Bronson movies, the hero just looked more and more determined until you felt if you tapped his face, it would explode. In Death Sentence, Bacon acts out a lot more.\" Ebert called Death Sentence \"very efficient\", praising \"a courtroom scene of true surprise and suspense, and some other effective moments\", but concluded that \"basically this is a movie about a lot of people shooting at each other\".[5]Scott Tobias of The A.V. Club contends the film is \"certainly never boring\"; he felt that director James Wan was \"too busy jamming the accelerator to realize that his movie's spinning out of control.\"[6] Matt Zoller Seitz of The New York Times said, \"Aside from a stunning three-minute tracking shot as the gang pursues Nick through a parking garage, and Mr. Bacon's hauntingly pale, dark-eyed visage, Mr. Wan's film is a tedious, pandering time-waster.\"[7] Owen Gleiberman of Entertainment Weekly felt that \"[t]he morality of revenge is barely at issue in a movie that pushes the plausibility of revenge right over a cliff.\"[8] Conversely, Justin Chang of Variety called the film \"well-made, often intensely gripping\".[9] Similarly, Bill Gibron of PopMatters felt the film was \"a significant movie\" and \"a wonderfully tight little thriller\".[10] Darren Amner of Eye for Film also gave the film a positive review, praising Bacon's performance in particular: \"[H]is portrayal is emotional, sympathetic and highly aggressive. As a father he is touching and as a stone-cold killing machine he is even more convincing.\"[11]Author Brian Garfield, who wrote the novel the film is loosely based on, said of the film: \"While I could have done with a bit less blood-and-thunder, I think it's a stunningly good movie. In the details of its story it's quite different from the novel, but it's a movie, not a novel. In its cinematic way it connects with its audience and it makes the same point the book makes, and those are the things that count.\" He also liked that, like his novels, but unlike the Death Wish film series, it does not advocate vigilantism.[12] Garfield further explained in an interview: \"I think that, except for its ludicrous violence toward the end, the Death Sentence movie does depict its character's decline and the stupidity of vengeful vigilantism,\" adding, \"As a story it made the point I wanted it to make.\"[13]","death_sentence":"Theatrical release poster","box_office":"$17 million[2]","cinematography":"John R. Leonetti","production_company":"Hyde Park Entertainment Baldwin Entertainment Group","directed_by":"James Wan","release_dates":"August 31, 2007 (2007-08-31)|||||","Box office":"Death Sentence opened in 1,822 theaters in the United States and grossed $4,231,321, with an average of $2,322 per theater and ranking #8 at the box office. The film ultimately earned $9,534,258 domestically and $7,440,201 internationally for a total of $16,974,459.[2]","produced_by":"Ashok Amritraj|Howard Baldwin|Karen Baldwin|","starring":"Kevin Bacon|Garrett Hedlund|Kelly Preston|Aisha Tyler|John Goodman|Jordan Garrett|Stuart Lafferty|","running_time":"105 minutes","music_by":"Charlie Clouser","edited_by":"Michael N. Knue","written_by":"Ian Mackenzie Jeffers","budget":"$20 million[1]"}