{"based_on":"A Civil Action 1995 book  by Jonathan Harr","country":"United States","distributed_by":"Buena Vista Pictures (USA and Canada) United International Pictures (International)","Plot":"Environmental toxins in the city of Woburn, Massachusetts contaminate the area's water supply, and become linked to a number of deaths of neighboring children. Jan Schlichtmann (John Travolta), a cocky and successful Boston attorney who zips around town in his Porsche, and his small firm of personal injury lawyers are asked by Woburn resident Anne Anderson (Kathleen Quinlan) to take legal action against those responsible.After originally rejecting a seemingly unprofitable case, Jan finds a major environmental issue involving groundwater contamination that has great legal potential and a couple of defendants with deep pockets. The local tanneries could be responsible for several deadly cases of leukemia, but also are the main employers for the area. Jan decides to go forward against two giant corporations (real-life companies Beatrice Foods and W. R. Grace and Company) with links to the tanneries, thinking that the case could possibly earn him millions, as well as enhancing his and his firm's already considerable reputation.Bringing a class action lawsuit in federal court, Jan represents families who demand a clean-up of contaminated areas and an apology. However, the case develops a life of its own and takes over the lives of Jan and his firm. The lawyers for the tanneries' parent corporations are not easy to intimidate, a judge (John Lithgow) makes a key ruling against the plaintiffs, and soon Jan and his partners find themselves in a position where their professional and financial survival has been staked on the outcome of the case.Jan stubbornly declines settlement offers, gradually coming to believe that the case is about more than just the money. He allows his pride to take over, making outrageous demands and deciding that he must win at all costs. Pressures take their toll, with Jan and his partners going deeply into debt. After a lengthy trial, the case is dismissed in favor of Beatrice, Jan having turned down an offer of $20 million from Beatrice attorney Jerry Facher (Robert Duvall) while the jury was deliberating. The plaintiffs are forced to accept a settlement with Grace that barely covers the expense involved in trying the case, leaving Jan and his partners broke. The families are deeply disappointed, and Jan's partners dissolve their partnership, effectively breaking up the firm. Jan ends up alone, living in a small apartment and running a small time law practice. He later files for bankruptcy.In a postscript, a montage of short scenes involving the key characters in the film, combined with on-screen captions, reveals that the Environmental Protection Agency, building on Jan's work on the case, later brought its own enforcement action against the offending companies, forcing them to pay millions to clean up the land and the groundwater. It takes Jan several years to settle his debts, and he now practices environmental law in Boston.The plotline has been greatly simplified from the book, e.g. later findings by the Environmental Protection Agency and its potential consequences that might have allowed the plaintiffs another trial against Beatrice, and which did ultimately lead to a conviction of perjury against John Riley, and improper conduct for Mary Ryan, are referred to only briefly in the epilogue.The characters Charles Nesson, Mark Phillips, Rikki Klieman, Teresa Padro and others have been removed from the film version, as well as the plot points that they contribute.","language":"English","Reception":"Film review aggregation website Rotten Tomatoes certified the Film as \"Fresh\" with 60% of reviews favorable, summarizing the consensus as \"intelligent and unconventional.\"[1] Despite receiving mostly positive reception from critics and with Duvall getting an Oscar nomination, A Civil Action was nowhere near as successful as anticipated with audiences. Its domestic gross was a mere $56 million, well below its $75 million budget. During its original theatrical release A Civil Action was competing with other Christmas season blockbusters including Shakespeare in Love, The Prince of Egypt, Star Trek: Insurrection, You've Got Mail, Stepmom and Patch Adams. The film was successful on limited release.[2]","box_office":"$56,709,981","cinematography":"Conrad L. Hall","production_company":"Touchstone Pictures Paramount Pictures","directed_by":"Steven Zaillian","a_civil_action":"Theatrical release poster","Music":"The music score was written by Danny Elfman.Other songs include:","release_dates":"December 25, 1998 (1998-12-25)|||||","produced_by":"Scott Rudin Steven Zaillian David Wisnievitz Robert Redford Rachel Pfeffer David McGiffert Henry J. Golas","starring":"John Travolta Robert Duvall James Gandolfini Dan Hedaya John Lithgow William H. Macy Kathleen Quinlan Tony Shalhoub Stephen Fry","running_time":"115 minutes","music_by":"Danny Elfman","edited_by":"Wayne Wahrman","written_by":"Steven Zaillian","budget":"$75 million"}