{"based_on":"Planet B-Boy  by Benson Lee","country":"United States","distributed_by":"Screen Gems","screenplay_by":"Brin Hill|Chris Parker|","Plot":"Dante Graham enlists Jason Blake to coach the United States' b-boy team to compete in the Battle of the Year, as the US has not won in 15 years. Blake puts together a team of the best b-boys across America à la Dream Team. After overcoming their differences and learning to work as a team, the Dream Team makes it to the semi-finals, beats the reigning champion French team and finds themselves against the favorites, the Koreans. Ultimately, they lose by one point. Blake resolves to resume training as soon as possible to win next year.","language":"English","Reception":"The film was universally panned by film critics; it currently holds a 6% rating on Rotten Tomatoes based on 48 reviews with the consensus: \"With a hopelessly hokey plot and unintentionally hilarious dialogue, Battle of the Year is flimsy even by the standards of the dance movie genre.\"Chris Brown was nominated for Worst Supporting Actor in the 34th Golden Raspberry Awards for his work in the film, but lost the award to Will Smith for After Earth.The film was a significant box office bomb grossing roughly $16 million and failed to recoup its budget of $20 million.","box_office":"$16.5 million[2]","cinematography":"Vasco Nunes|Michael Barrett|","production_company":"Contrafilm","Marketing":"The first trailer for Battle of the Year was released in July 2013, with Adam Chitwood, Associate Editor of Collider stating that \"if B-boy competitions are your thing I assume you'll have some interest in Battle of the Year.\"[8] Screen Crush commented that the 3D aspect \"could be a lot of fun with a film like this\" but questioned whether the film would stand out against \"an A-list title\".[9]","directed_by":"Benson Lee","battle_of_the_year":"Theatrical poster","release_dates":"September 19, 2013 (2013-09-19) (Israel, Lebanon)|September 20, 2013 (2013-09-20) (United States)|November 21, 2013 (2013-11-21) (Malaysia)|||","Development":"Film company Screen Gems first began planning for a feature film adaptation of Lee's documentary Planet B-Boy in 2009 after discovering that while interest in breakdancing had declined in the United States, it still enjoyed popularity in other countries.[6] Chris Brown and Josh Holloway were announced as being attached to the project in October 2011.[7] Filming began in late 2011 in Los Angeles, with more filming taking place in Montpellier, France.[4]","produced_by":"Beau Flynn|Tripp Vinson|Amy Lo|","starring":"Josh Holloway|Laz Alonso|Josh Peck|Caity Lotz|Chris Brown|","running_time":"109 minutes","music_by":"Christopher Lennertz","edited_by":"Peter S. Elliot","budget":"$20 million[1]"}