{"distributed_by":"Buena Vista Pictures","Plot":"Calvin Fuller is a nerdy young boy living in the Los Angeles suburb of Reseda. The gangly, unsure youth is first seen at a baseball game, standing at bat for his team, the Knights, ready for yet another strike out. Suddenly an earthquake hits; as the others run for safety, the ground opens up under Calvin's shoes and he falls through the chasm. Eventually he lands on the head of a 6th-century black knight. Upon hearing of his miraculous appearance, the elderly King Arthur, seeing him as the savior whose appearance Merlin has predicted, dubs the boy Calvin of Reseda and invites him to dine with the court.Calvin begins his knight training to help Arthur retain his crown. When the earthquake hit, Calvin had just grabbed his knapsack, a fact that enables him to wow the Arthurians with his futuristic \"magic\", including an introduction to rock and roll via CD player, and a Swiss Army knife. The young wizard also shows them how to make inline rollerskates. His work wins him adulation and renown; but it also rouses the jealousy of Lord Belasco, who will use any means to take over the throne. Meanwhile, Calvin finds himself developing a crush on young Princess Katey. After he helps Arthur keep the crown, he is returned to the 20th century just before the moment when he struck out, and he steps up to the plate: this time, he is ready and hits a home run. He is greeted by his teammates – including a girl who looks like Katey – and is looked on by a spectator who looks like Arthur, who is whittling a piece of wood with a pocketknife – the same knife Calvin gave to King Arthur.","language":"English","Reception":"Upon its release the movie was universally panned by critics.[2][3][4] It currently holds a rating of 5% on Rotten Tomatoes, aggregating 21 reviews. The consensus reads: \"Disappointing even by the relaxed standards of live-action children's entertainment, A Kid in King Arthur's Court stands as a rare near-total misfire from Disney.\"[5] Since its release, and since Kate Winslet and Daniel Craig went on to become major superstars in Hollywood, the film received slightly more attention.[citation needed] Despite the negative reviews, The Buffalo News replied \"A must-see for the whole family!\"[citation needed]The movie debuted at No. 9.[6] In the movie's second week it fell to No. 10.[7][8]","box_office":"$13.4 million (domestic)","cinematography":"László Gárdonyi","production_company":"Walt Disney Pictures Trimark Pictures Tapestry Films","directed_by":"Michael Gottlieb","a_kid_in_king_arthur's_court":"Theatrical release poster","release_dates":"August 11, 1995 (1995-08-11)|||||","Production":"Most of the 6th-century portion of the film was shot in Budapest, Hungary, while the majority of the 20th-century portion was filmed in late September 1994, at the softball field of London Central High School (LCHS), an American institution at RAF Daws Hill, High Wycombe, England.[1]","produced_by":"Peter Abrams J.P. Guerin Robert L. Levy","starring":"Thomas Ian Nicholas Joss Ackland Art Malik Paloma Baeza Kate Winslet Daniel Craig Ron Moody","running_time":"89 minutes","music_by":"J. A. C. Redford","edited_by":"Anita Brandt-Burgoyne and Michael Ripps","written_by":"Michael Part Robert L. Levy"}