{"country":"United States Philippines","Black Power":"Black Mama White Mama also contains elements of Black Power, as it was released during the middle of the Black Power era.The revenge that Lee Daniels gets on her former pimp is nothing short of Black Power, and \"1973 marked the first time that audiences saw African American women in non-servitude roles.\"[8]Lee also wears her hair in an afro. As a \"Killer Dame\" (along with Tamara Dobson, Teresa Graves, Jean Bell, et al.), \"It was a goodbye to the headscarves worn by Mammy and the wavy hair of the Exotic Other, and a refreshing and political greeting to the woman with a natural hairstyle modeled, according to [film scholar Cedric Robinson], from civil rights heroines such as Angela Davis.\" Moreover, her very portrayal of an action heroine \"represented the antithesis of the Mammy.\"[8]In the beginning of the film, Lee resists the white matron of the prison's lesbian advances, even though she knows that her life in prison will be a lot easier if she engages with her. Karen, on the other hand, readily submits to the matron's advances so that she does not have to work in the field, placing a greater burden on the other prisoners. This greatly irks Lee, as she sees it as a selfish move. Though both women play strong roles, Lee is unique in that she never lets a single character walk over her. The film may also be symbolic in that Lee is mentioned first in the title and the credits. The ending also implies that her strength exceeded Karen's.In another scene, Black Power is alluded to by a surprising source, Karen. During a fight with Lee over which direction to go while shackled together, she exclaims, \"We're trying to set this island free. Christ, you're black, you understand, don't you?\" This line of thought is not pursued further, but the scriptwriters (one of which was none other than Jonathan Demme) were clearly making the connection between revolutionary actions occurring in Latin America and the Black Power Movement in the United States. Demme and Joseph Vila could have been referring to a number of Latin American revolutions, including the Black Power Revolution in Trinidad in 1970. This particular connection would make a lot of sense, because at the time in Trinidad, guns were not \"readily available\"[10] and a major plot point of this film is that the guerrillas need guns in order to succeed and Karen's American weapons contacts are deemed essential for their cause.","distributed_by":"American International","screenplay_by":"H.R. Christian","story_by":"Joseph Vila Jonathan Demme","Plot":"Brought to a women's prison in a tropical country which resembles the film's Philippines-set location, Lee Daniels (Pam Grier) and Karen Brent (Margaret Markov), a prostitute and a revolutionary respectively, butt heads and cause enough trouble to warrant transfer to maximum security prison. They are chained together during the transfer, much to their dismay, and an attack by Karen’s rebel friends set them free, albeit still chained together. The film chronicles the pair’s struggle to escape the army, led by Captain Cruz (Eddie Garcia) who enlists the help of the cowboy gang led by Ruben (Sid Haig). The pair also has competing goals: Lee to recover the money she extorted from her former pimp Vic Cheng (Vic Díaz) and escape by boat, and Karen to meet her gun connection on time so they don’t turn on her rebel friends. The pair finally bond despite their initial hate for each other until they are finally freed by the rebel leader Ernesto (Zaldy Zschornack). The film culminates in a violent shootout with Cheng and Ruben's henchmen (who are rivals), Ernesto's guerrillas, and the army.","language":"English","Reception":"The film, like many Blaxploitation films, was a B-movie produced on a low budget and received mixed reviews.Variety magazine said that \"Performances ranged from bad to mediocre.\" Josiah Howard writes in Blaxploitation Cinema: The Essential Reference Guide that the film was \"a lively and well-done women's prison yarn\" but that it \"somehow never really hits its mark,\" largely because \"the filmmakers do little to distance themselves from the tired trick...of having key characters shackled together for almost the entire length of the picture.\" However, the pairing of Pam Grier and Margaret Markov was \"a hit with audiences\"[11] as they played off each other well. Variety praised Eddie Garcia, saying that he \"rises above the material by studious underplaying\".[3]","box_office":"$1 million (US/ Canada rentals)[1]","cinematography":"Justo Paulino","directed_by":"Eddie Romero","Feminism and sexuality":"Black Mama White Mama, despite its exploitative nature, passes the Bechdel test and contains themes of female empowerment. Both of the films' leads are strong women. Moreover, Karen Brent is a guerrilla fighter and Lee Daniels masterminds a scheme to screw over the misogynistic pimp Vic Cheng. Although Karen is the only female present in the guerrilla force, she is essential to their cause, as she is the only one that has the connections to the weapons dealers, and the only one those dealers trust (Ernesto says \"Her contacts would never turn them over to us). She also is seen firing a gun right alongside Ernesto, the guerrilla leader.Throughout the film, Pam Grier is \"an intriguing mixture of pugnacity and femininity, with a heavy dose of world-weary cynicism\"[3] despite the movie itself being \"somewhat listless\"[7] and the strength of both women outshine most of the male characters. In fact, \"it became evident very quickly that Grier's screen presence overshadowed the one-dimensional roles that focused on her physical attributes and the weak storylines in AIP [American International Pictures] productions.\"[8]Pam Grier's character Lee also escapes from her former pimp with $40,000 of his money, while the pimp and his henchmen are all killed. Not only that, but when the pair is sexually assaulted by Luis in his work shed midway through the film, Lee stabs him to death. These victories of a strong woman over her misogynistic abusers is nothing short of feminist. Cultural critic Nelson George notes, \"Pam Grier was a cult figure who was even embraced by many feminists for her ball-breaking action films. She remains one of the few women of any color in American film history who had vehicles developed for her that not only emphasized her physical beauty but also her ability to take retribution on men who challenged her.\"[9] Therefore, \"Grier...brought a new character to the screen that was instrumental in reshaping gender roles, particularly those involving action-centered storylines.\"[8]","Soundtrack":"The soundtrack received praise. Howard comments, \"Harry Bett's superior ambient music soundtrack (available on CD) is much more sophisticated than the film that it was created for.\"[11]","black_mama_white_mama":"Theatrical release poster","release_dates":"January 19, 1973","Production":"The film takes its inspiration from the concept of shackling a black actor and a white actor together introduced by The Defiant Ones (1958).The lead actresses also reprised roles they already knew well. Pam Grier, who plays Lee Daniels, had done several tropical prison films, including The Big Doll House (1971), its non-sequel follow-up The Big Bird Cage (1972), and Women in Cages (1971).[4] Margaret Markov, who plays Karen Brent, had appeared in The Hot Box (1972), which was also a Latin American prison film. All of these films were shot in the Philippines in accordance with their low budgets.[5] Pam Grier and Sid Haig also appear together in another tropical prison film The Big Doll House (1971) and Grier, Haig, Vic Díaz, and Andrés Centenera appear together in its non-sequel follow-up The Big Bird Cage (1972), which were also both filmed in the Philippines. Grier and Margaret Markov also starred opposite each other in the 1974 film The Arena (aka Naked Warriors).[3]Several Volkswagen Country Buggies are used in the film; these were based on the VW Beetle chassis originally for the Australian market. The Country Buggy was locally produced in the Philippines as the Sakbayan using VW powerplants sourced from either Brazil or Mexico.One advertisement for the film included the tagline, \"Chicks in chains... and nothing in common but the hunger of 1,000 nights without a man!\"[6]","produced_by":"Four Associates Ltd. executive producer David J. Cohen produced by John Ashley and Eddie Romero","starring":"Pam Grier Margaret Markov","running_time":"87 minutes","music_by":"composed and conducted by Harry Betts","edited_by":"Asagani V. Pastor","written_by":"screenplay by H. R. Christian from an original story by Joseph Viola and Jonathan Demme"}