{"country":"Australia","distributed_by":"Sony Pictures Classics","Plot":"After his mother overdoses, 17-year-old Joshua \"J\" Cody asks his estranged grandmother, Janine \"Smurf\" Cody, for help, and she invites him to move in with her. Smurf is the affectionate matriarch of a Melbourne crime family that uses her home as a base. Her home is also being watched by cops who are looking for the oldest son, Andrew \"Pope\" Cody, who is in hiding. The volatile middle brother, Craig, deals drugs successfully enough to have bought the house for his mother. The youngest brother, Darren, follows the lead of his siblings, while family friend \"Baz\" leads the gang, which specializes in armed robbery.Craig takes J along to meet with a crooked cop from the drug squad, who tells him that renegade cops on the armed robbery squad are on the look out for all of them. Later, Baz goes to meet Pope at a shopping centre, where they discuss quitting crime and going straight. As Baz gets in his car to leave, police approach and kill him. Angry, Pope and Craig want revenge, and ask J to steal a Commodore and bring it to Darren's place. The car is then planted in the middle of a street. Two policemen are soon drawn to the scene, where they are ambushed and killed. The next day, Pope, Darren and J are taken in for questioning, where J meets Detective Senior Sergeant Nathan Leckie who also leads the armed robbery squad. Leckie, one of the few non-corrupt police officers, recognizes J's predicament and begins to lean on him. The three are later released from custody, but J returns with his girlfriend Nicky to her parents' home.Craig, who has avoided being picked up by the police, Pope, Darren and Smurf meet at a diner, where they recognize J as the weak link. When told by Smurf to give himself up for questioning, Craig panics, and meets a friend in rural Bendigo. He learns that the house is already being monitored, and as the police arrive tries to flee through a field but is gunned down. Pope and Darren take J to meet their solicitor Ezra. He coaches him to not tell the police anything and pressure him to break up with Nicky, which he does. Leckie takes J into custody again, where he proposes that J be moved to witness protection, but J turns down the offer. Meanwhile, Nicky, unsure what to do, shows up at Smurf's home, where Pope gives her heroin, questions her, then smothers her to death to keep her silent.When J returns to Smurf's house the next morning he discovers Nicky's bracelet outside the house. He calls Nicky's phone, and realising something is not right, flees to Nicky's parents house. Pope gets Nicky's address from Darren and arrives in time to intercept J. J flees on foot and is taken into a safe house. With Craig and Baz dead, Pope and Darren imprisoned, and J potentially being the star witness for the prosecution, Smurf decides, \"J needs to go\". Smurf uses her connections to procure J's address, and persuades the corrupt cop to help her. Police from the drug squad then raid the safe house. J jumps a fence and returns to Smurf's house, saying he wishes to help free Pope and Darren from jail. To do this, the family's barrister then coaches J's answers.After his day in court, Leckie sees J before his departure from the safe hotel, and asks him if he has found his place in the world (a reference to Leckie's animal kingdom metaphor for J's predicament). Pope, Darren and Smurf celebrate with champagne while being interviewed after their controversial acquittal. Smurf later sees Leckie in the supermarket and taunts him. Later again, J returns to Smurf's home asking to stay, before going to his room. Pope enters and begins to talk to him, but is cut off when J shoots him in the head. In the final scene, J returns to the living room and embraces a now silenced Smurf.","language":"English","Reception":"Animal Kingdom grossed $4,350,187 in Australia, $1,044,039 in North America and $1,399,756 elsewhere for a total of $6,793,982.[12]Animal Kingdom received overwhelming critical acclaim, with Weaver's performance being singled out. Review aggregate Rotten Tomatoes reports that 96% of critics gave the film a positive review, \"Certified Fresh\", based on 152 reviews with an average rating of 8 out of 10. The critical consensus is: \"With confident pacing, a smart script, and a top-notch cast, Animal Kingdom represents the best the Australian film industry has to offer.\"[13]David Stratton said on At the Movies: \"It's so lovely to see a really good Australian film. And we're not admiring this because it's an Australian film, because it's a very good film,\" adding, \"The revelation here is Jacki Weaver, always a fine actor but seldom revealing the depths of character she does here. All the performances are superb, down to the small parts – like Dan Wyllie as the family's lawyer and Anna Lisa Phillips [sic] as Josh's barrister.\" Stratton and co-host Margaret Pomeranz both gave the film four and a half stars.[14]Quentin Tarantino listed Animal Kingdom as his third favourite film of 2010, behind Toy Story 3 and The Social Network.[15]In 2015, the film was named as one of the top 50 films of the decade so far by The Guardian.[16]Animal Kingdom received 18 nominations for the 2010 Australian Film Institute Awards, across all major feature film categories – a record achievement. On 11 December 2010, Animal Kingdom won a record 10 awards.[17] The film received several other film awards to Jacki Weaver who was nominated for the Golden Globe Award for Best Supporting Actress – Motion Picture for the 68th Golden Globe Awards. Weaver was also nominated for the Academy Award for Best Supporting Actress at the 83rd Academy Awards.It was named one of the Top Independent Films of 2010 at the National Board of Review Awards.[18]","box_office":"$6.8 million[2]","TV adaptation":"TNT is developing a TV show inspired by the film with John Wells as a producer.[31] This show will star Scott Speedman, Ellen Barkin, and Shawn Hatosy.","cinematography":"Adam Arkapaw","production_company":"Screen Australia Porchlight Films Film Victoria Screen NSW Fulcrum Media Finance Showtime Australia","directed_by":"David Michôd","animal_kingdom":"Theater release poster","Soundtrack":"The film's original score was composed by Antony Partos with additional music composed by Sam Petty and David McCormack. It was released on 16 August 2010.[8]","release_dates":"22 January 2010 (2010-01-22) (Sundance)|3 June 2010 (2010-06-03)||||","Production":"The film is loosely inspired by the real life Pettingill family, and by the Walsh Street police shootings that occurred in Melbourne in 1988.[4] Director David Michôd was interested in the underworld in Melbourne and wrote a script titled J in December 2000. Working at Screen NSW Script Development, fellow producer Liz Watts saw potential in the script. Watts said, \"It needed more characterization and structure, which he kind of agreed with. It was important to me that he recognize that there was still work to be done on it.\"[1] Michôd then did a number of draft scripts gaining feedback from many different people in the film industry. Liz Watts then became a producer on the film with a budget of A$5 million from Screen Australia, Film Victoria, Screen NSW and Showtime Australia.[1] The final version of Animal Kingdom did not contain any of the dialogue featured in Michôd's script for J.[5]Animal Kingdom was filmed in the Melbourne metropolitan area.[6] The outside funeral scene was filmed in Ivanhoe East, Victoria.[7]","produced_by":"Liz Watts","starring":"Ben Mendelsohn Joel Edgerton Guy Pearce Luke Ford Jacki Weaver Sullivan Stapleton James Frecheville","running_time":"113 minutes","music_by":"Antony Partos","edited_by":"Luke Doolan","Release":"Animal Kingdom premiered at the 26th Sundance Film Festival on 22 January 2010.[9] It later opened in Australia on 3 June 2010.[10][11]Internationally, the film has been sold to the United Kingdom, Italy, France, Canada and Eastern Europe. It was released in August 2010 in the United States and Latin America by Sony Pictures Classics, grossing a total of $1,030,288 in North America.[2] It was released in Australia on DVD and Blu-ray Disc formats on 13 October 2010. The Blu-ray release available from Madman is region-free.[10]","written_by":"David Michôd","budget":"$5 million[1]"}