{"country":"United States","Awards and nominations":"Michael Caine was nominated for the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy but lost to Tom Hanks in Big. Glenne Headly was named Most Promising New Actress by the Chicago Film Critics Association.","distributed_by":"Orion Pictures Corporation","Plot":"Lawrence Jamieson is an intelligent and sophisticated British con artist operating in the French Riviera with the help of manservant Arthur and corrupt police official Andre. He seduces wealthy and morally suspect women and steals their money. His only concern is a con artist known as \"The Jackal\" who has been preying on other wealthy victims.When underachieving American hustler Freddy Benson searches for easy marks in Beaumont-sur-Mer, Lawrence's home base, Lawrence believes the Jackal has shown his face. Worried that Freddy's inexperienced antics will scare away his prey, Lawrence has Freddy arrested and put on the next plane out of town. However, Freddy meets one of Lawrence's former marks and deduces that he is also a crook.Returning to Beaumont-sur-Mer, Freddy forces Lawrence to take him on as a pupil in exchange for his silence. Lawrence attempts to teach Freddy about high culture with limited success. He also involves him as a subordinate player in his cons, making him play the mentally challenged and socially inept Ruprecht in order to scare away their female targets after their money has been acquired. Freddy, tired of not getting paid and the humiliating part he has to play, strikes out on his own.Lawrence believes there are not enough potential victims in Beaumont-sur-Mer for both of them, so a bet is proposed to decide who will stay. The first to con $50,000 out of a selected mark may remain; the other must leave town. The two select Janet Colgate, a naive American heiress, and embark on their separate strategies while ruthlessly sabotaging each other. Freddy poses as a psychosomatically crippled U.S. Army officer unable to walk after seeing his fiancee cheat on him with Dance U.S.A. host Deney Terrio, who needs to borrow $50,000 for treatment by the celebrated Liechtenstein psychiatrist, Dr. Emil Shaffhausen. When Lawrence discovers this scheme he claims to be Dr. Shaffhausen, insisting Freddy's condition is one he can cure, stipulating that Janet pay the $50,000 fee directly to him.Lawrence discovers that Janet is not wealthy but on vacation as a contest winner; she intends to liquidate most of her assets to pay for Freddy's treatment. Touched by Janet's kindness, Lawrence calls off the bet. Freddy agrees, but proposes a new bet: Janet herself, with the first to bed her declared the winner. Lawrence refuses to bed Janet; instead the bet will be whether or not Freddy can succeed.Lawrence keeps Janet from having any time alone with Freddy in which they might consummate a relationship. With the help of some British sailors, Freddy waylays Lawrence and rushes to Janet's hotel room where he demonstrates his love by walking to her. However, Janet is not alone. Lawrence is present and declares Freddy cured of his ailment. Ushering Freddy out of the room he explains that the sailors released him after discovering that he is a Royal Navy Reserves officer. The sailors, angry at being duped by Freddy, keep him occupied at a party while Lawrence puts Janet on a plane to America. Despite his impending loss, Freddy becomes inebriated and enjoys the party.The next day, instead of boarding her flight, Janet returns to her hotel room to find a repentant Freddy there. They kiss, close the door and begin undressing. The news reaches Lawrence and he accepts his defeat with grace. While Lawrence is waiting for Freddy to return and gloat over his victory, Janet arrives in tears. She tells him that Freddy stole the money her father sent. Lawrence compensates her with $50,000 of his own, calls Andre to have Freddy arrested, and takes Janet to the airport.At the last minute before Janet boards the plane, she tells Lawrence that she cannot take the money and gives the bag back to him. As the plane leaves, the police arrive with Freddy, wearing nothing but a bathrobe, who claims that Janet robbed the both of them, including Freddy's clothes. Lawrence opens up the bag to find Freddy's clothes and, underneath, a note from Janet admitting to having taken the $50,000 and revealing herself to be the Jackal. Freddy is furious while Lawrence is impressed.The following week, Freddy and Lawrence are at Lawrence's villa contemplating their loss. They are about to part company when the Jackal, posing as a New York real estate developer, arrives in a yacht filled with wealthy people. She promptly has the shocked Lawrence and Freddy assume roles in her scheme and, after sending her guests off to refresh themselves, takes the pair aside and announces that while she made three million dollars the previous year, \"[their] fifty thousand was the most fun\". Joining arms, they set out to fleece their latest victims.","language":"English","box_office":"$42,039,085","cinematography":"Michael Ballhaus","directed_by":"Frank Oz","dirty_rotten_scoundrels":"Theatrical release poster","Musical adaptation":"The film served as the basis of a successful stage musical of the same name that opened on Broadway in early 2005. It starred John Lithgow and Norbert Leo Butz as Lawrence and Freddy and Broadway star Sherie Rene Scott as the soap queen, in the show named Christine Colgate, not Janet.","release_dates":"December 14, 1988 (1988-12-14)|||||","Production":"The film was originally to have been written as a vehicle for Mick Jagger and David Bowie, who, according to Bowie, were \"a bit tweezed that we lost out on a script that could have been reasonably good.\"[5] According to Splitsider, Eddie Murphy was considered for the role of Freddy Benson.[6] John Cleese admitted in a 2008 interview that he regretted turning down the role of Lawrence Jamieson.[7]Filming locations included Antibes, Cannes, Beaulieu-sur-Mer (depicted in the film as \"Beaumont-sur-Mer\"), Saint-Jean-Cap-Ferrat, Nice, and Villefranche-sur-Mer. The Villa Ephrussi de Rothschild was visited by the leading characters in a scene. The estate belonging to Lawrence is a private villa located at the tip of the Cap d'Antibes, and the hotel hosting a number of dining and casino scenes is the Grand-Hôtel du Cap-Ferrat.The soundtrack includes \"Puttin' on the Ritz\" by Irving Berlin, \"Pick Yourself Up\" by Jerome Kern and Dorothy Fields, and \"We're in the Money\" by Harry Warren and Al Dubin. They all feature the violinist Jerry Goodman.","produced_by":"Bernard Williams[1]","starring":"Steve Martin|Michael Caine|Glenne Headly|Anton Rodgers|Barbara Harris|","running_time":"110 minutes[2]","music_by":"Miles Goodman","edited_by":"Stephen A. Rotter William S. Scharf","Release":"In a DVD extra providing a behind-the-scenes look at the making of the film, Frank Oz discusses a teaser trailer he directed for the studio, which wanted to begin promoting the film before there was enough actual footage to assemble a trailer. An entire day was spent filming a scene in which Freddy and Lawrence stroll along the promenade, politely moving out of the way of other people, until Freddy casually pushes an elderly woman into the water and Lawrence nonchalantly shoves a little boy's face into his cotton candy.[8]Roger Ebert of the Chicago Sun-Times said, \"The plot ... is not as complex as a movie like The Sting, and we can see some of the surprises as soon as they appear on the horizon. But the chemistry between Martin and Caine is fun, and Headly provides a resilient foil.\"[9]Variety called it \"wonderfully crafted\" and \"absolutely charming\" and added, \"Director Frank Oz clearly has fun with his subjects, helped out in good part by clever cutting and a great, imitative '30s jazzy score by Miles Goodman.\"[10]Vincent Canby of the New York Times called it \"one of the season's most cheerful, most satisfying new comedies\" which was a \"blithe, seemingly all-new, laugh-out-loud escapade\". He added that \"Mr. Caine and Mr. Martin work together with an exuberant ease that's a joy to watch\" plus \"In this season of lazy, fat, mistimed and misdirected comedies, exemplified by Scrooged and Twins, Dirty Rotten Scoundrels is an enchanted featherweight folly.\"[11]Review aggregate website Rotten Tomatoes gives the film a score of 87% based on 31 reviews.[12]The film opened on 1,466 screens in the United States and earned $3,840,498 on its opening weekend. In total it grossed $42,039,085 in the US.[13]","written_by":"Dale Launer Stanley Shapiro Paul Henning"}