{"country":"United States Spain","Plot":"Blood and Sand revolves around the young and talented natural gifted Toreros Juan Gallardo played by Christopher Rydel. Gallardo wants to be popular in bullfighting. His love Carmen (Ana Torrent), has a cousin who has left home with Gallardo for bullfighting competition. They successfully earn some level and skills in the arena, but something went wrong and the bull charged at Gallardo, but his friend saved Gallardo and it cost him his own life. Gallardo then left and met Lady Doña Sol (Sharon Stone) a beautiful rich lady, where he was offered to join her company as a worker of her fields and lands, but Gallardo insisted to become a superstar in bullfighting in his country. As Gallardo is leaving her home, a security guard tells him to join the a bullfighting trainer Nacional (Albert Vidal). Nacional trains Gallardo until he is able to join the national bullfighting competition. Another friend of Gallardo, Garabato (Guillermo Montesinos) also joins him. He displays brilliant skills in his first appearance of national league and his popularity rises.Gallardo then marries to Carmen and his popularity increases weeks after weeks. Gallardo soon gets crush on Lady Doña Sol, which starts a dramatic twist in the movie. As time passes, Gallardo falls deeply in love with Lady Doña Sol and offers to marry her, but Lady Doña Sol isn't interested in the marriage. Gallardo's wife Carmen finally came to Lady Doña Sol and talk about Gallardo, but instead Lady Doña Sol shows where Gallardo is hiding.That night, Gallardo goes to a midnight bar and hangs out with some bar girls. He is drunk while his trainer Nacional told him not to do such stupid thing and, advising him to focus on the competition for the next day. Angered, Gallardo kicks Nacional and asks him to leave. Nacional leaves angrily.Juan gallardo went to a popular hotel of the city with Doña Sol, where the competition rival of Juan, Pepe Serrano was present, he and Doña Sol have some eye contact and Juan took this with great anger, later on Juan punched his rival but he went out and he found that Dina Sol the rich lady was in the car of his rival Pepe Serrano. Juan on the next day comes to the office to Don Sose (his manager) with two girls and Juan was not conscious because he was drunk. Nacional told him not to do such a thing again but this time Juan Gallardo slapped Nacional with great power and then Nacional gave up from his work.Juan called to his wife Carmen and said sorry but she was very upset and did not forgive him. Then the final scene of the movie comes where at the start Juan Gallardo was very poor to control the bull and at the same time at the home of Juan his wife, mother were praying for him, his brother in law Antonio put the TV volume very high to tell Carmen that she must go to help him and she must forgive him.Then his wife came and Nacional saw her, Nacional went to Juan and told him that his wife has come to watch him and he must say sorry to her, Juan said sorry to Carmen and threw his cap to Carmen, and in the final act, Gallardo begun the grand bullfighting competition. He successfully tricked the dumb bull and gave one of the best performance in the league. When the time comes to kill the bull, with the final move, when Gallardo was about to pierce the bull with his sword, the bull suddenly charged its horn into Gallardo's stomach and threw him off the ground several time. Paramedics ran to Gallardo and sent him to trauma room immediately as Carmen and Nacional chased after them to see what had become of Gallardo. While back in the arena, Gallardo's rival bullfighter has won and the crowd cheers for him, with Lady Doña Sol smiling at the winner. Gallardo passes out and died in the trauma room, as doctors covered his face, Carmen and Nacional are weeping for the dead Gallardo, while on the other side people were holding Pepe Serrano on their shoulders.","language":"English","cinematography":"Antonio Ríos","directed_by":"Javier Elorrieta","release_dates":"1989","blood_and_sand":"Promotional film poster","produced_by":"José Frade","starring":"Christopher Rydell Sharon Stone Ana Torrent","running_time":"113 minutes","music_by":"Paco de Lucía Jesús Gluck","edited_by":"José Antonio Rojo","written_by":"Rafael Azcona Ricardo Franco Thomas A. Fucci"}