{"country":"United States","distributed_by":"TriStar Pictures (United States) Warner Bros. (United Kingdom)","Plot":"Forensic psychiatrist Dr. Jack Gramm (Al Pacino) testifies at the trial of suspected serial murderer Jon Forster (Neal McDonough), dubbed \"The Seattle Slayer\" by police. Gramm's testimony and expert psychiatric opinion are crucial to help convict Forster of the attempted killing of Janie Cates and the murder of Joanie Cates, who was drugged, hanged upside down, and killed after the killer broke into her home. After receiving his conviction by the jury, Forster taunts Gramm, saying \"Tick-tock, Doc.\"Nine years later, as Forster's execution date approaches, several similar torture murders with very similar circumstances occur. Gramm is questioned by a lawyer from the Attorney General's office as well as FBI Special Agent Frank Parks (William Forsythe) about his connection to the latest victim, Dale Morris, a former psychology student of Gramm's with whom he was at a party the night before, just hours before her death. On the way to his class, Gramm receives a phone call from someone using software to distort their voice, threatening he has 88 minutes to live. He later reports the call to his secretary Shelly (Amy Brenneman) and has her put together a risk assessment profile of potential perpetrators.Gramm receives another threatening phone call while teaching and becomes suspicious of his students, particularly Mike Stempt (Benjamin McKenzie). The Dean of students, Carol Johnson (Deborah Kara Unger), interrupts the class to evacuate the building due to a bomb threat called in. As he evacuates the lecture hall, Gramm finds a written threat on the overhead projector in the classroom as well as on his car, which has been vandalized in the parking garage. Gramm then is met by his teaching assistant Kim Cummings (Alicia Witt) who offers to help him find the person that's been targeting him. In the stairwell of the parking garage, Gramm comes upon one of his students, Lauren Douglas (Leelee Sobieski), attacked by an unknown assailant and reports the assault to campus security.Gramm and Kim go to his condo where a package has been delivered. The package contains an old audio tape of his kid sister, Katie, begging for her life, and her subsequent murder. Gramm later explains she was killed several years ago when he left her alone in his apartment while he attended an important meeting; the crime took exactly 88 minutes. As Gramm determines someone had accessed his secure files area to obtain the audio tape, suddenly Kim's ex-husband, Guy LaForge (Stephen Moyer), shows up with a gun but is shot and killed from behind by an unknown person wearing a motorcycle helmet and leather protective gear. The shooter flees through the crowd outside after a fire alarm is triggered in the building.Next, Gramm and Kim visit Sara Pollard (Leah Cairns), the woman Gramm was with the night before, but find her murdered in her apartment with evidence incriminating Gramm. Carol calls Gramm and makes comments suggesting that she is the killer and demands Gramm meet her at his office. Shelly arrives at Sara's apartment and advises Gramm she suspects Lauren was the one who stole the audio tape of Gramm's sister's death. Kim disappears from the apartment and later calls Gramm with a threat similar to Carol's, also demanding he meet her at the office.Through prison visitation records, Gramm deduces that Forster's appeals attorney \"Lydia Doherty\" is actually Lauren using a pseudonym, and surmises she set up the frame on orders from Forster from jail. Kim calls again instructing Gramm to come to another nearby location on campus where he finds Carol has been hung over a seventh floor balcony and Kim is tied up and gagged, held at gun point by Lauren. Lauren threatens Gramm and forces him to \"confess\" on tape that he gave false testimony at Forster's trial. Special Agent Parks arrives and shoots Lauren, causing both Carol and Lauren to partially fall from the balcony. Gramm saves Carol from completing the fall, but Lauren comes loose and plummets to her death. When Forster calls asking to speak with Lauren, Gramm informs him Lauren is dead, the set up is over. He then quips, \"Tick tock, tick tock, you got 12 hours to live.\"","language":"English","Reception":"In its opening weekend, the film grossed $6,957,216 in 2,168 theaters in the United States and Canada, ranking fourth at the box office and averaging $3,209 per theater. In its second weekend, the film grossed $3,593,890 and fell to number eight at the box office.[5] The film grossed $17,213,467 at the US and Canadian box office and $15,379,918 internationally, for a worldwide gross of $32,593,385.88 Minutes was panned by critics and has a \"rotten\" score of 5% on Rotten Tomatoes based on 122 reviews with an average rating of 2.6 out of 10. The critical consensus states \"88 Minutes is a shockingly inept psychological thriller that expertly squanders the talent at hand.\"[6] The film also has a score of 17 out of 100 On Metacritic based on 27 critics indicating \"Overwhelming dislike\".[7]The film was nominated for two Razzie Awards, Worst Actor for Al Pacino and Worst Supporting Actress for Leelee Sobieski, but lost to Mike Myers for The Love Guru and Paris Hilton for Repo! The Genetic Opera.[citation needed]88 Minutes was released on home video on September 16, 2008, and sold 220,965 in the opening weekend. As of the seventh week, it has sold about 574,041 units which gathered revenue of $11,150,056 or more than one-third of the budget.[1]","box_office":"$32,593,385[2]","cinematography":"Denis Lenoir","production_company":"Millennium Films Equity Pictures Family Room Entertainment Emmett/Furla Films","directed_by":"Jon Avnet","88_minutes":"Theatrical release poster","release_dates":"March 2, 2007 (2007-03-02) (Israel)|April 18, 2008 (2008-04-18) (United States)||||","produced_by":"Jon Avnet Randall Emmett Michael P. Flannigan George Furla (executive) Avi Lerner(executive) Gary Scott Thompson","starring":"Al Pacino Alicia Witt Leelee Sobieski William Forsythe Amy Brenneman Deborah Kara Unger Neal McDonough","running_time":"111 minutes","music_by":"Edward Shearmur","edited_by":"Peter Berger","written_by":"Gary Scott Thompson","budget":"$30 million[1]"}