{"country":"United States","distributed_by":"Universal Pictures","Plot":"Johnny Van Owen is a rapper who drifts from city to city. Johnny is performing at a nightclub rapping and dancing with his crew and a club background songstress playing \"Cool as Ice (Everybody Get Loose)\".While the group passes through a small town, Johnny falls for honor student Kathy Winslow. The crew is stranded in the town after a member's motorcycle breaks down and has to be left at a local repair shop. While waiting for repairs, Johnny uses the opportunity to see Kathy. She already has a boyfriend named Nick, whom he advises Kathy to dump.Johnny shows up with his crew at a local club frequented by Kathy and her friends. Noticing that no one was enjoying the live music playing at the club, Johnny and the crew decide to perform a musical number, \"People's Choice\", by unplugging the other band's instruments and taking control, shocking the audience and ending with Johnny sweeping Kathy off her feet, humiliating Nick.He offers to forgive Kathy and take her home, but she refuses and walks home by herself. Unbeknownst to Kathy, she is stalked by two strange men in a car. She is saved by Johnny, who takes her home. At the club's parking lot, a jealous Nick and his friends smash up motorcycles belonging to Johnny's friends. Nick's friends attack the rapping biker who fights back, leaving Nick and his buddies unconscious and Nick himself in the hospital with a broken nose.Kathy's father, Gordon, becomes suspicious of Johnny, and warns Kathy to stay away from him because they can't trust strangers. The next day, Kathy goes for a ride with Johnny against her father's wishes. They ride all over town, including a construction site. When they finally return home, they are greeted by an angry Gordon, who coldly warns Johnny to stay away from his daughter.Gordon, under pressure from his wife Grace, reveals to Kathy the secret of his past—he was once a police officer. They were on the run from two corrupt cops and were able to escape using fabricated documents, explaining why he kept his life a secret from Kathy all these years. Kathy criticizes her father, saying it was not fair that he lied to her in order to protect her, yet refuse to permit her to see a total stranger.The next day, Johnny agrees to give Tommy a ride on his bike. They cruise through the streets, and finally back to the Winslow home where Tommy is kidnapped. At the repair shop, the crew prepares to leave town since the bike has been repaired, but they tell Johnny to say goodbye to Kathy. When Johnny arrives at the Winslow house, he finds an envelope meant for the family. It turns out to be a message from the crooked cops with Tommy recording it. Fearing the worst, Gordon accuses Johnny of criminal involvement, much to Kathy's dismay.When Kathy asks Johnny to play the tape left behind by the kidnappers, he hears a loud clanging noise from a construction vehicle, revealing the message was recorded at the construction site. The gang ambushes the kidnappers and rescue Tommy. When the police arrive, the gang return Tommy to the Winslows, and Gordon apologizes to Johnny. The rapper tells Kathy he has to move on, but she decides to follow him. Nick arrives in his car, telling Kathy to get used to being a biker chick because she will never see him again. Kathy holds on as Johnny uses the car as a ramp and the two new lovers ride off into the big city.The film ends with Johnny reaching his destination, rapping \"Get Wit It\" and dancing with his crew to an audience at a night club. Kathy joins him on stage after the show is over, dancing alone in the spotlight.","language":"English","Reception":"The film opened in 393 theaters in the United States, grossing $638,000, ranking at #14 among the week's new releases.[4] Reviews of the film were negative. Film website Rotten Tomatoes, which compiles reviews from a wide range of critics, gives the film a score of 8%.[5] Blender ranked Van Winkle's performance in the film as the seventh worst performance by a musician turned actor.[6] Director David Kellogg later disowned the film.[7] On February 19, 2013 Rifftrax released a Video on Demand of the movie featuring a riffing-commentary by Mystery Science Theater 3000 alums Michael J. Nelson, Bill Corbett and Kevin Murphy.","box_office":"$1.2 million","cinematography":"Janusz Kamiński","directed_by":"David Kellogg","Music":"The film's soundtrack album contained four new songs by Vanilla Ice, as well as other material. It peaked at #89 on the Billboard 200.[3]","release_dates":"October 18, 1991 (1991-10-18)|||||","Production":"Filming began in April 1991.[1] The role of Kathy was offered to Gwyneth Paltrow. Her father Bruce Paltrow forbade her from accepting it, due to the script's sexual content.[2] Cool as Ice's director of photography of the film was future Schindler's List and Minority Report cinematographer Janusz Kamiński.","produced_by":"Carolyn Pfeiffer|Lionel Wigram|","starring":"Vanilla Ice|Kristin Minter|Michael Gross|","running_time":"91 minutes","music_by":"Stanley Clarke","edited_by":"Debra Goldfield","cool_as_ice":"Theatrical release poster","written_by":"David Stenn","budget":"$6 million"}