{"directed_by":"Nick Broomfield","distributed_by":"Roxie Releasing Lions Gate Entertainment","Content":"Broomfield's low-budget documentary was as the New York Times[2] described it, a \"largely speculative\" and \"circumstantial\"[2] account relying on flimsy evidence, failing to \"present counter-evidence\" or \"question sources.\" The movie alleged that Knight had Tupac killed before he could part ways with Knight's Death Row label and conspired to kill Biggie to divert attention from himself in the Tupac murder.[3] As The Courant[3] noted:Broomfield's interview subjects aren't the most credible bunch. They include bounty hunter and ex-con Kevin Hackie, an ex-LAPD officer [Russell Poole on whose theory Broomfield's film is built] who talks about mysterious documents that never turn up; Mark Hyland, known for some reason as the Bookkeeper, who is in prison awaiting trial on 37 counts of impersonating a lawyer when he tells Broomfield that he was present when Knight and crooked cops arranged a hit on Biggie; and Biggie's mother, friends and bodyguard, who obviously have no reason to present Wallace as anything less than a hip-hop martyr.Moreover, the motive suggested for the murder of Biggie (as in the Russell Poole theory on which it relied) -- to decrease suspicion for the Shakur shooting six months earlier—was, as The New York Times phrased it, \"unsupported in the film.\"[2]Broomfield's documentary was based on the theory and interviews of ex-detective Russelle Poole. Poole claimed that the L.A.P.D. conspired to cover up Suge Knight's conspiracy to kill Tupac and Biggie. The documentary shows Poole to have been forced out of his position as an L.A. P.D. detective for independently pursuing a theory considered threadbare by his colleagues and superiors. Russell Poole suspected ex-cop David Mack, and Amir Muhammed (a mortgage broker with no plausible connection to the case) to have worked with Suge Knight to kill Biggie.A key source for Poole's theory was Kevin Hackie. Hackie had implicated Suge Knight and David Mack along with supposed crooked cops in the murder of Biggie. When pressed by Broomfield in the film, Hackie agreed that Harry Billups, also known as Amir Muhammed, was involved in the murder, although Hackie said on camera, \"Don't ask me why.\" Hackie, a former Death Row bodyguard, wrote in a statement filed June 6, 2004 that he had \"\"personal knowledge\" about Wallace's slaying, alleging that \"persons within Death Row Records offered $25,000 to a law enforcement officer\" to kill Wallace.[4]In an interview, Hackie later told the Los Angeles Times that he suffered memory lapses due to psychiatric medications.[4] Hackie also claimed to have knowledge of involvement between Suge Knight and David Mack as well as other alleged crooked cops. The Wallace family used the alleged claim as the basis of their $500 million lawsuit against the city of L.A. for Biggie's death. But Hackie later told the LA Times that the Wallace attorneys had altered his statements and he did not testify in their suit.[4] (The 500 million dollar suit was dismissed in 2010.)A 2005 article in the LA Times, saying that another source for the Poole/Sullivan theory accusing Amir Muhammed, David Mack, Suge Knight and the L.A.P.D. in the Wallace suit was a schizophrenic known as \"Psycho Mike\" who confessed to hearsay and memory lapses and falsely identifying Amir Muhammed.[5] John Cook of Brill's Content noted that the LA Times article \"demolished\" [6] the Poole-Sullvan theory of Biggie's murder represented in the film.In contrast to Broomfield's implication of Suge Knight in the death of Tupac, a 2002 two-part series by reporter Chuck Philips with the Times, titled “Who Killed Tupac Shakur?” based on a year-long investigation, reconstructing the events leading up to Shakur's murder including police affidavits, court documents and interviews with investigators, supposed witnesses to the crime and members of the Southside Crips [7][8] claimed that “the shooting was carried out by a Compton gang called the Southside Crips to avenge the beating of one of its members by Shakur a few hours earlier. Orlando Anderson, the Crip whom Shakur had attacked, fired the fatal shots. Las Vegas police discounted Anderson as a suspect and interviewed him only once, briefly. He was later killed in an unrelated gang shooting.”[7]","release_dates":"January 11, 2002","produced_by":"Nick Broomfield Michele D'Acosta","starring":"Biggie Smalls (archive footage) Tupac Shakur (archive footage) Nick Broomfield Russell Poole Voletta Wallace Billy Garland David Hicken Suge Knight","running_time":"108 min.","language":"English","music_by":"Christian Henson","edited_by":"Mark Atkins Jaime Estrada Torres","biggie_&_tupac":"DVD Cover for Biggie & Tupac","cinematography":"Joan Churchill"}