{"based_on":"Coriolanus  by William Shakespeare","country":"United Kingdom","distributed_by":"The Weinstein Company","screenplay_by":"John Logan","Plot":"In a contemporary day alternate version of Rome, riots are in progress after stores of grain are withheld from citizens and civil liberties are reduced due to a war between Rome and neighbouring Volsci. The rioters are particularly angry at Caius Martius (Ralph Fiennes), a brilliant Roman general whom they blame for the city's problems. During a march, the rioters encounter Martius, who is openly contemptuous and does not hide his low opinion of the regular citizens. The commander of the Volscian army, Tullus Aufidius (Gerard Butler), who has fought Martius on several occasions and considers him a mortal enemy, swears that the next time they meet in battle will be the last. Martius leads a raid against the Volscian city of Corioles and during the siege, with much of Martius's unit being killed, Martius gathers reinforcements and the Romans take the city. After the battle, Martius and Aufidius meet in single combat, which results in both men being wounded but ends when Aufidius' soldiers drag him away from the fight.Martius returns to Rome victorious and in recognition of his great courage, General Cominius (John Kani) gives him the agnomen of \"Coriolanus\". Coriolanus's mother Volumnia (Vanessa Redgrave) encourages her son to run for consul within the Roman Senate. Coriolanus is reluctant but he eventually agrees to his mother's wishes. He easily wins the Roman Senate and seems at first to have won over the commoners as well due to his military victories. Two tribunes, Brutus (Paul Jesson) and Sicinius (James Nesbitt), are critical of his entrance into politics, fearing that his popularity would lead to Coriolanus taking power away from the Senate for himself. They scheme to undo Coriolanus and so stir up another riot in opposition to him becoming consul. When they call Coriolanus a traitor, Coriolanus bursts into rage and openly attacks the concept of popular rule as well as the citizens of Rome, demonstrating that he still holds the plebeians in contempt. He compares allowing citizens to have power over the senators as to allowing \"crows to peck the eagles\". The tribunes term Coriolanus a traitor for his words and order him banished. Coriolanus retorts that it is he who will banish Rome from his presence: \"There is a world elsewhere\".After being exiled from Rome, Coriolanus seeks out Aufidius in the Volscian capital of Antium and offers to let Aufidius kill him, to spite the country that banished him. Moved by his plight and honoured to fight alongside the great general, Aufidius and his superiors embrace Coriolanus and allow him to lead a new assault on the city, so that he can claim vengeance on the city which he feels betrayed him. Coriolanus and Aufidius lead a Voscilian attack on Rome. Panicked, Rome sends General Titus to persuade Coriolanus to halt his crusade for vengeance; when Titus reports his failure, Senator Menenius (Brian Cox) follows but is also shunned. In response, Menenius, who has seemingly lost all hope in Coriolanus and Rome, commits suicide by a river bank. Finally, Volumnia is sent to meet with her son, along with Coriolanus' wife Virgilia (Jessica Chastain) and his son. Volumnia succeeds in dissuading her son from destroying Rome and Coriolanus makes peace between the Volscians and the Romans alongside General Cominius. When Coriolanus returns to the Volscian border, he is confronted by Aufidius and his men, who now also brand him as a traitor. They call him Martius and refuse to call him by his \"stolen name\" of Coriolanus. Aufidius explains to Coriolanus how he put aside his hatred so that they could conquer Rome but now that Coriolanus has prevented this, he has betrayed the promise between them. For this betrayal, Aufidius and his men attack and kill Coriolanus.","language":"English","Reception":"Coriolanus received positive reviews and currently holds an aggregate of 93% at Rotten Tomatoes, based on 134 reviews; the consensus states: \"Visceral and visually striking, Ralph Fiennes' Coriolanus proves Shakespeare can still be both electrifying and relevant in a modern context.\"[12] Katherine Monk of The Vancouver Sun gave the film a rating of 3.5 out of 5, stating that \"Coriolanus not only finds all the contemporary parallels, it reiterates the tragedy of the endlessly exploited patriot who hopes to earn love at the end of a barrel\".[13] Manohla Dargis of The New York Times wrote in her review, \"Mr. Fiennes has made smart choices here, notably by surrounding himself with a strong secondary cast\".[10] On Metacritic, the film holds a score of 79 out of 100, based on reviews from 32 critics, indicating \"generally favorable reviews\".[14]The film was nominated for Golden Berlin Bear award at the 61st Berlin International Film Festival.[1] Ralph Fiennes was nominated for the BAFTA Award for Outstanding Debut by a British Writer, Director or Producer at the 65th British Academy Film Awards.Coriolanus was released by Anchor Bay Home Entertainment on DVD and Blu-ray in the United States on 29 May 2012. Both home media formats of the film contain director commentary with Ralph Fiennes and a behind-the-scenes featurette entitled The Making of Coriolanus.[15] The film was later released on DVD and Blu-ray in the United Kingdom by Lionsgate Films on 4 June 2012, containing the same director commentary audio track but replacing the Making of… featurette with Behind The Scenes of Coriolanus with Will Young.[16]","box_office":"$1,072,602[3]","cinematography":"Barry Ackroyd","production_company":"Icon Entertainment International BBC Films","directed_by":"Ralph Fiennes","release_dates":"14 February 2011 (2011-02-14) (BIFF[1])|20 January 2012 (2012-01-20)||||","Production":"The film was produced on a budget of US $7.7 million. It was filmed in Belgrade and other areas of Serbia using many locals as extras.[2][7]","produced_by":"Ralph Fiennes|John Logan|Gabrielle Tana|Julia Taylor-Stanley|Colin Vaines|","starring":"Ralph Fiennes|Gerard Butler|Vanessa Redgrave|Brian Cox|Jessica Chastain|John Kani|James Nesbitt|Paul Jesson|Lubna Azabal|Ashraf Barhom|","running_time":"123 minutes","coriolanus":"Theatrical release poster","music_by":"Ilan Eshkeri","edited_by":"Nicolas Gaster","Release":"The film premiered in Competition at the 61st Berlin International Film Festival on 14 February 2011[1] and it opened the 2011 Belgrade International Film Festival.[8][9] On 2 December of that year, it opened in New York City and Los Angeles.[10] As of February 2012, it has not yet received a wide U.S. release. However, the film has been shown on a limited basis in other large US cities, such as Chicago. It received a full UK cinema release on 20 January 2012 after premiering at London's Curzon Mayfair cinema on 5 January.[11]","budget":"$7.7 million[2]"}