{"country":"Germany United Kingdom","distributed_by":"Sony Pictures Classics","Plot":"Forty-something schoolmistress Kate and her two best friends, police superintendent Janine and doctor Molly, live in rural Britain and share their single lives and dating exploits in weekly chats. Kate has recovered from ovarian cyst disease and fears a relapse; she hasn't been dating much. By chance, she meets Jed, a former student of hers, now a handsome twenty-something church organist. To her surprise, she ends up sleeping with him and the two embark on an unlikely relationship that's looked on with suspicion by Janine and Molly. Janine comes to believe in Kate and Jed's feelings for each other. But Molly is still dubious, showing Jed's criminal record and medical history to Kate, bringing adult dates to their dinner parties and taking her and Janine to Paris so that she will go off Jed. Conversely, this brings Kate and Jed closer together and they plan their wedding.Molly eventually attempts to prove Jed's faithlessness by seducing him, which fails but angers Kate to the extreme. After an argument about how Kate has kept their engagement quiet, Jed is thrown out of Kate's house. He is struck and killed by a passing truck; this unexpected tragedy breaks the three women up, as Kate is inconsolable and Janine blames Molly. Kate reluctantly embarks on a mild romance with a local vicar who's always been in love with her, but when she finally agrees to marry him, she becomes ill at the altar. Molly and Janine take her away, and discover that she is pregnant with Jed's child. She decides to have the baby and raise it on her own, while the vicar meets a woman who's actually excited about him. Also, Janine starts going out with Bill (a robbery suspect) and Molly falls for a pediatrician named Eleanor. The three friends reconcile and continue to share their lives and experiences.","language":"English French","cinematography":"Henry Braham","directed_by":"John McKay","Debated title":"As told by John McKay,[1] the film combines two plot lines which eventually came together. At first he wrote a play which was named \"Crush\" about an older woman and a younger man.Later, he met \"a set of women doctors who were working too hard to get a date on Friday nights and so would get together instead, drink cheap liquor, eat chocolate, smoke cigarettes and have a competition to decide who was the saddest fucker of the week\". This influenced the original play as it \"sprouted more female characters\" and became a movie script.McKay, who both wrote the screenplay and directed the film in 1999, wanted to name the film The Sad Fuckers Club,[1] a name which he felt fit the plot line - and which, according to him, Andie MacDowell approved of when offered the role in the film. This, however, was changed after resistance from the producers and distributors and uneasiness on the part of test audiences, eventually reverting to the original name, \"Crush\".Crush met with generally mixed reviews, and has scored an average of 5 out of 10 on review aggregate site, Rotten Tomatoes.","crush":"Promotional poster","release_dates":"19 August 2001 (2001-08-19) (Edinburgh Film Festival) 7 June 2002 (2002-06-07) (United Kingdom) 5 September 2002 (2002-09-05) (Germany)","produced_by":"Julia Chasman Hanno Huth Paul Webster Lee Thomas","starring":"Andie MacDowell Imelda Staunton Anna Chancellor Kenny Doughty Bill Paterson","running_time":"112 minutes","music_by":"Kevin Sargent","External links":"","edited_by":"Anne Sopel","written_by":"John McKay"}