{"country":"United States United Kingdom","distributed_by":"New Line Cinema (America release)1 PolyGram Filmed Entertainment (International release)","screenplay_by":"Carlos Davis Anthony Fingleton","story_by":"Elizabeth Livingston","Plot":"Elizabeth Cronin is an unassertive and repressed woman, domineered by her controlling mother, Polly. While taking her lunch break from work, she visits her husband, Charles, whom she is separated from, hoping to sort out their problems. He reasserts his desire for a divorce and says that he is in love with another woman named Annabella. While she is at the public phone, a man walking down the street breaks into her car to steal her purse. Then her car is stolen as well. Forced to run back to work (at the courthouse), she arrives late and loses her job. While leaving the courthouse she runs into an old friend, Mickey, who brings up childhood memories they shared, which includes memories of Elizabeth's childhood imaginary friend, Drop Dead Fred. Mickey explains how only Elizabeth could see Drop Dead Fred, and everybody else thought she was crazy.Since losing her job Elizabeth moves back in to her mother's home. While rummaging through past belongings in her childhood bedroom closet, Elizabeth finds a taped-shut jack-in-the-box. She places the box by the window and gets into bed. Through a series of flashbacks, it is revealed that while he caused havoc for her, he also gave her happiness and a release from her oppressive mother. Elizabeth wakes up to find the jack-in-the-box slowing playing music. She removes the tape and the box continues to play itself, faster and faster, until Drop Dead Fred flies out of the box, finally freed after all these years. He agrees to help her become happy again, which she believes will only happen when she wins back Charles. However, his childish antics do more harm than good.Worried by Elizabeth's recent strange behavior, Polly brings her to a (children's) psychologist. In the waiting room, Fred is seen meeting up with other patients' (who are all children) imaginary friends. The doctor prescribes medication to rid her of him, whom he and Polly believe is a figment of her imagination. She also changes her appearance and wardrobe. Charles now wants her back and she is overjoyed, until Fred discovers he is still cheating on her with Annabella. Heartbroken, she tells Fred that she can't leave Charles, because she is scared of being alone. They escape to a dream sequence in which she is finally able to reject him, stand up to Polly, and declare she is no longer afraid of her. She frees her imprisoned childhood self. Fred tells her that she doesn't need him anymore, so they kiss and he disappears into her eternal subconscious.Upon awakening from the dream, Elizabeth dumps Charles and asserts herself to Polly, who blames her for her father leaving home. Before leaving, she reconciles with Polly, and encourages her to find a friend to escape her own loneliness. She goes to her friend Mickey's house, and on meeting, they both express interest in becoming more than just friends. After his daughter, Natalie, comes up to them and blames Fred for mischief that has just prompted her nanny to quit, Elizabeth realizes that he is now with Natalie. She can no longer see him, but he is now leading another. She watches Natalie and the imaginary Drop Dead Fred capture the babysitter in a trap, and Natalie laughs hysterically with her imaginary accomplice. Elizabeth knows that Fred is with Natalie now, and smiles with content.","language":"English","Reception":"The film was released theatrically in North America on April 19, 1991, grossing $3,625,648 on its opening weekend, and $13,878,334 over its entire theatrical run.[1]Leonard Maltin stated that \"Phoebe Cates' appealing performance can't salvage this putrid mess...recommended only for people who think nose-picking is funny.\"[citation needed] Rotten Tomatoes gave it a score of 9% based on 34 reviews.[2] Gene Siskel named Drop Dead Fred as the worst film of 1991.Writing for Entertainment Weekly, Margaret Lyons asked, \"is it supposed to be hilarious, or a really, really depressing story about the long-term effects of emotional abuse?\"[3] Writing for Mystical Movie Guide, Carl J. Schroeder wrote, \"The imaginary friend is cavortingly rude for a reason; he served to push the girlchild to do mischief for attention and as a cry for help. Now grown up, the woman has forgotten and is about to lose her soul, so events call for some kind of literal return of her demon to force the exposure of her pain. This psychic crisis is poignantly realistic... The creature who is visible only to the woman is like a poltergeist energy of her repressed self, a problematic ego container into which her powers of assertion and creativity were poured and stored. The movie's resolution is startlingly beautiful\".[4]","box_office":"$14.8 million (domestic)[1]","cinematography":"Peter Deming","production_company":"PolyGram Filmed Entertainment Working Title Films","directed_by":"Ate De Jong","release_dates":"April 19, 1991 (1991-04-19) (United States)|October 11, 1991 (1991-10-11) (United Kingdom)||||","drop_dead_fred":"Theatrical release poster","produced_by":"Paul Webster","starring":"Phoebe Cates|Rik Mayall|Marsha Mason|Tim Matheson|Carrie Fisher|","running_time":"101 minutes","music_by":"Randy Edelman","edited_by":"Marshall Harvey"}