{"distributed_by":"Universal Pictures","Plot":"Rick Jarmin (Mel Gibson) helped convict a drug-dealing FBI agent named Eugene Sorenson (David Carradine) and was placed in the witness protection program. Fifteen years later his former fiancée Marianne Graves (Goldie Hawn) crosses paths with him at a gas station in Detroit, Michigan. Rick refuses to recognize Marianne as the witness protection program does not allow contact with people from the witness' previous life. If she recognizes him it may lead to Sorenson finding and killing him.Sorenson has been let out of jail after serving his sentence, and with his partner Albert Diggs (Bill Duke) they are out to kill Rick in order to smooth the passage of their latest deal with drug dealers. Marianne has blown Rick's cover and he makes a frantic call to his relocation officer for a new identity, only to discover that his old contact has retired and is later revealed to have Alzheimer's.His new contact is Joe Weyburn (Stephen Tobolowsky), a dirty cop in league with Diggs and Sorenson. Just as Marianne prepares to confront Rick they are surprised by Sorenson and Diggs, who show up at the gas station with guns blazing.They shoot Rick's kindly old boss at the gas station, pinning the murder on Rick and Marianne, and Rick is shot in the buttocks. A witness sees them and her rental car, a blue BMW, and they are forced to go on the run, which occupies most of the movie, during which they revisit some of Rick's former life-in-hiding, including a beauty salon where he was a star employee, an old flame of a veterinarian who still wants to marry him, who owns an animal farm and operates on the wound in his behind, in her operating room.Rick and Marianne spend a night in a hotel room, where they later share their feelings and engage in sexual intercourse.The climax of the film takes place the next night in a zoo where Rick used to work and knows his way around. He releases the various large cats and other animals from their cages, and these and crocodiles and piranhas complicate the pitched battle with Sorenson, Albert Diggs and their men, who meet various ends. At the end Rick is suspended over a large cat in a pit and Marianne can't quite reach him. He offers her the extra incentive of marriage and children, which does the trick. To tease her afterwards, he pretends to back out of his promise, but the next scene shows them boating in the Caribbean, and their repartee suggests that they have tied the knot.","language":"English","Reception":"The movie gained a mixed to negative reception.[2][3][4][5] Bird on a Wire currently holds a 32% rating on Rotten Tomatoes based on 22 reviews.Bird on a Wire debuted at #1 at the box office.[6] The film went on to gross over $138.6 million worldwide.","box_office":"$138,697,012","cinematography":"Robert Primes","production_company":"Interscope Communications The Badham/Cohen Group","bird_on_a_wire":"Theatrical release poster","directed_by":"John Badham","release_dates":"May 18, 1990","produced_by":"Rob Cohen","starring":"Mel Gibson|Goldie Hawn|David Carradine|Bill Duke|","running_time":"110 minutes","music_by":"Hans Zimmer","edited_by":"Frank Morriss Dallas Puett","written_by":"Louis Venosta David Seltzer","budget":"$20 million"}