{"based_on":"an article by Sydney A. Glass","country":"United States","distributed_by":"Universal Pictures","language":"English","Reception":"Blue Collar was universally praised by critics. The film holds a rare 100% \"Fresh\" rating on the review aggregate website Rotten Tomatoes.[5] Both Roger Ebert and Gene Siskel especially lauded the film. Ebert awarded the film 4 stars[6] and Siskel placed the film 4th on his list of the ten best of 1978.[7]Filmmaker Spike Lee included the film on his essential film list entitled List of Films All Aspiring Filmmakers Must See.[8]","cinematography":"Bobby Byrne","production_company":"T.A.T. Communications Company","directed_by":"Paul Schrader","Plot synopsis":"A trio of Detroit auto workers, two black—Zeke Brown (Pryor) and Smokey James (Kotto)—and one white—Jerry Bartowski (Keitel)—are fed up with mistreatment at the hands of both management and union brass. Smokey is in debt to a loan shark, Jerry works a second job to get by and finds himself unable to pay for the dental treatment that his daughter needs, and Zeke cheats money out of the IRS in order to improve his family’s income.[4]Coupled with the financial hardships on each man's end, the trio hatch a plan to rob a safe at union headquarters. They commit the caper but find only a few scant bills in the process. More importantly, they also come away with a ledger which contains evidence of the union's illegal loan operation and ties to organized crime syndicates. They attempt to blackmail the union with the information but the union retaliates strongly and begins to turn the tables on the three friends. A suspicious accident at the plant results in Smokey's death.A federal agent attempts to coerce Jerry into informing on the union's corruption, which could make him enemies with his co-workers as well as the union bosses. At the same time, corrupt union bosses try to get Zeke to work for them. By the end, once close friends, Jerry and Zeke turn against each another.","blue_collar":"Theatrical release poster","release_dates":"February 10, 1978 (1978-02-10)|||||","Production":"The film was shot on location at the Checker plant in Kalamazoo, Michigan and at locales around Detroit, including the Ford River Rouge Complex on the city's southwest side and the MacArthur Bridge to Belle Isle.The three main actors didn't get along and were constantly fighting throughout the shoot. The tension became so great that at one point Richard Pryor (supposedly in a drug-fueled rage) pointed a gun at Schrader and told him that there was \"no way\" he was ever going to do more than three takes for a scene, an incident which may have caused Schrader's nervous breakdown.[3]","produced_by":"Don Guest","starring":"Richard Pryor Harvey Keitel Yaphet Kotto","running_time":"114 min.","music_by":"Jack Nitzsche","edited_by":"Tom Rolf","written_by":"Paul Schrader Leonard Schrader","budget":"$1.7 million[1]"}