{"country":"United States","distributed_by":"United Artists","Plot":"J.C. Wiatt (Diane Keaton) is a driven Manhattan career woman (nicknamed the \"Tiger Lady\") typical of the 1980s whose fast-paced life leaves her with no time for romance or relaxation (or as the narrator in the beginning puts it she works \"5 to 9\"), though she derives pleasure from her frantic schedule and demanding job. She works as a management consultant and lives with an investment banker (Harold Ramis), whose job and life are likewise hectic. Her life is thrown into turmoil when she inherits a toddler, Elizabeth (twins Kristina and Michelle Kennedy[1][2]), from a deceased cousin whom she hadn't seen in over 30 years.Caring for the child soon occupies much of her time and her career begins to suffer, culminating in the loss of her boyfriend and job. Wiatt tries to give Elizabeth up for adoption but finds that she has grown too attached to the child, forcing a reevaluation of her priorities. She moves into a house in the country in Vermont. Purchasing the home without first having seen it in person or having it inspected she finds it is riddled with problems (failing plumbing and heating, lack of water, bad roof).Suffering a nervous breakdown and on the brink of financial collapse, she sees an opportunity to sell baby food applesauce she had concocted for Elizabeth from fresh ingredients. Amid the clamor for her new products she develops a relationship with local veterinarian Jeff Cooper (Sam Shepard). At first annoyed by him, she is opposed to Jeff's overtures and is focused now on returning to New York as fast as possible. Finding a buyer for the house proves almost impossible.After a rough start she succeeds in selling \"Country Baby\", her gourmet baby food, and soon business is booming. Finally, her old boss (Sam Wanamaker) and his client (Pat Hingle) take notice. They offer to buy her company for millions, take her product nationwide, and give her back her career and high-prestige life. On the brink of accepting, she decides that she can grow her enterprise on her own without having to sacrifice her personal life. She returns to Vermont, to her new lover and adopted daughter.","language":"English","Reception":"Baby Boom was favorably received by audiences and critics alike. The Rotten Tomatoes criticism aggregation website ranks it at 76 percent fresh (positive) from 17 reviews.[4][4][5][6][7][8]Diane Keaton's performance was singled out by Pauline Kael from The New Yorker, who described it as \"a glorious comedy performance that rides over many of the inanities in this picture (...) Keaton is smashing: the Tiger Lady's having all this drive is played for farce and Keaton keeps you alert to every shade of pride and panic the character feels. She's an ultra-feminine executive, a wide-eyed charmer, with a breathless ditziness that may remind you of Jean Arthur in THE MORE THE MERRIER.\"[9]It earned a respectable USD$1,608,924 in its opening weekend in the U.S. and earned approximately $26,712,476 in its entire run.[10][11]","box_office":"$26 million","Home video":"The film debuted strongly on VHS.[12]","cinematography":"William A. Fraker","directed_by":"Charles Shyer","release_dates":"October 7, 1987 (1987-10-07)","Production":"The film was shot on location in Los Angeles, New York City and Manchester, Vermont. Filming took place between November 5, 1986 and February 3, 1987.","produced_by":"Nancy Meyers Bruce A. Block","starring":"Diane Keaton|Harold Ramis|Sam Wanamaker|Sam Shepard|","running_time":"103 minutes","music_by":"Bill Conti","baby_boom":"Theatrical release poster","edited_by":"Lynzee Klingman","written_by":"Nancy Meyers Charles Shyer","budget":"$15 million"}