{"Availability":"A PG-rated version of C.H.O.M.P.S. was shown for a short time during the summer of 1979.[3] The stricter rating was due to some salty language employed by a dog—not the title character.[5] It was edited, with the canine profanity overdubbed, in order to receive a G-rating and released during the Christmas season.[3][5] This version was released in the United States on December 21, 1979, opening in Los Angeles.[6][7] Scholastic Corporation released a 121-page book version of the film's story at the time of the film's first release.[8] MGM Home Entertainment (part of Metro-Goldwyn-Mayer, the successor-in-interest to AIP and the very studio where the Hanna-Barbera team got its start) released C.H.O.M.P.S in DVD format on April 12, 2005.[9]","country":"United States","distributed_by":"American International Pictures","screenplay_by":"Joseph Barbera Duane Poole Dick Robbins","story_by":"Joseph Barbera","Background":"Joseph Barbera approached his friend Samuel Z. Arkoff of American International Pictures about his company collaborating with Hanna-Barbera on live-action films. Though William Hanna and other members of Hanna-Barbera were not eager to venture beyond the animation field, according to Barbera, Arkoff was enthusiastic about the ideas that Barbera presented, and agreed to do nine films together. Barbera's first idea was for a film about a super-canine, robotic Doberman pinscher guard dog which would capitalize on several ideas popular at the time.Barbera recalled that Arkoff's son Louis suggested that rather than a Doberman, the dog would have to be a non-threatening dog in the Benji mold. Barbera attributes this change in focus in the story to the film's lackluster performance at the box-office. In his autobiography, Barbera wrote that the film \"did okay... but it never made the splash it should have\". Because of this, the future film deals between Hanna-Barbera and AIP were canceled.[1]Burt Topper worked on the movie as producer with Barbera.[2] This film was in theaters during 1979 starring Brain Foster and Casey Norton","Plot":"Brian Foster (Wesley Eure), a young inventor, creates a robotic dog for use as part of a home protection system. C.H.O.M.P.S. is an acronym for \"Canine HOMe Protection System.\" Ralph Norton (Conrad Bain) is his boss who he constantly argues with. Norton's daughter Casey (Valerie Bertinelli) and Foster develop a relationship. A rival company wants the dog and sends a few petty criminals to dognap \"C.H.O.M.P.S.\"","language":"English","c.h.o.m.p.s":"Theatrical poster to C.H.O.M.P.S","Critical reception":"On the film's release, Variety wrote, \"although it features a cute canine hero, a pair of do-gooding young people and a bevy of silly-minded adults, pic has little of the action or charm that lure audiences.\" The review noted that director Don Chaffey \"has done what he can to keep the pic moving given what he has to work with.\" Of the performers, Variety judged, \"Actors are uniformly okay but there's really only one star in this picture, 'Chomps.' Benji he's not.\"[3]Judging the film to be \"unpretentious but slightly dismal in its execution\", the Los Angeles Times wrote, \"The premise is engaging enough to entertain dog lovers and kids for awhile [sic], but the screenplay... is mediocre television sitcom fare and too thin to sustain an entire movie.\"[4]The film currently holds a 32% rating on the review aggregation site Rotten Tomatoes.","cinematography":"Charles F. Wheeler","production_company":"Hanna-Barbera","directed_by":"Don Chaffey","release_dates":"December 21, 1979 (1979-12-21)|||||","produced_by":"Burt Topper Joseph Barbera","starring":"Wesley Eure Valerie Bertinelli Conrad Bain","running_time":"89 minutes","music_by":"Hoyt Curtin","edited_by":"Dick Darling Warner E. Leighton"}