{"country":"United States","distributed_by":"20th Century Fox","screenplay_by":"Steven E. de Souza","story_by":"Steven E. de Souza Jeph Loeb Matthew Weisman","Plot":"Retired Delta Force operator Colonel John Matrix (Arnold Schwarzenegger) is informed by his former superior Major General Franklin Kirby (James Olson) that all the other members of his unit have been killed by unknown mercenaries. The mercenaries, among them Bennett (Vernon Wells), an Australian ex-member of Matrix's team fired for overt brutality in service, attack Matrix's secluded mountain home and kidnap Matrix's young daughter Jenny (Alyssa Milano). While trying to intercept them, Matrix is also overpowered by the mercenaries.It is revealed that Matrix is needed to carry out a political assassination for a South American former dictator named Arius (Dan Hedaya), who wishes to lead a military coup in his home country of Val Verde. Arius, who was deposed by Matrix in the course of one of his missions, has chosen the colonel because the current president trusts him implicitly. With Jenny's life on the line, Matrix reluctantly accepts the demand.After boarding a plane to Val Verde, Matrix manages to kill his guard, Henriques, and jumps from the plane just as it is taking off. With approximately 11 hours' time (the period of the flight), he sets out after another of Arius' men, Sully (David Patrick Kelly). He then enlists the aid of an off-duty flight attendant named Cindy (Rae Dawn Chong), and instructs her to follow Sully to a shopping mall. Cindy first assumes that Matrix is a maniac, but after seeing him desperately trying to get his hands on Sully, she has a change of heart and henceforth assists him in his endeavor. After a lengthy car chase, Matrix catches up with Sully whom he drops off a cliff to his death. Taking a motel key from Sully's jacket, Matrix tracks down and confronts Cooke (Bill Duke), a former Green Beret in Arius' employ. He kills Cooke in combat and learns where Jenny is being held after searching Cooke's car.Matrix breaks into a surplus store to equip himself with military weapons, but the police arrive and Matrix is arrested. Cindy helps him escape with an RPG and, after commandeering a seaplane from a nearby marina controlled by Arius, Matrix and Cindy land the plane off the coast of Arius' island hideout. Matrix instructs Cindy to contact General Kirby and then proceeds to Arius' villa, where he embarks on a killing spree. Matrix stabs a number of soldiers, dispatches tens of Arius' men with his machine gun, fights further opposition from within a shed utilizing gardening tools before then taking possession of the dead soldiers' weapons and proceeding to the main building, shooting every single man he encounters on the way. Matrix then faces Arius man-to-man in a furious gunfight, and even though Arius has the high ground, Matrix outsmarts and shoots him dead.Matrix locates Jenny in the basement of the villa, where she has fled, and encounters Bennett. After a fierce struggle during which each is injured, Matrix finally impales Bennett with a steam pipe, finishing him once and for all. However, Kirby arrives with a military detachment and asks Matrix to rejoin the Special Forces Unit, but Matrix declines with \"No chance.\" and departs the island aboard the seaplane with Jenny and Cindy.","language":"English","Reception":"Commando was a box office success grossing over $57.5 million against a $10 million budget. The film debuted at number one on October 6, 1985 in the United States and spent three consecutive weeks at the top position.[6]The film maintains a 69% on Rotten Tomatoes (based on 32 reviews), indicating generally positive reviews. Reviews from Kevin N. Laforest, Scott Weinberg, Dave Kehr and Luke Thomson acknowledge the film's tongue-in-cheek humor as well as its status as a cult classic.[7]","box_office":"$57.5 million[2]","Remake":"In 2008, a Russian remake (День Д)[9] was made. It was produced and directed by Mikhail Porechenkov (who stars as John Matrix's equivalent) and also features Barbara Porechenkova, Mikhail Trukhin, Alexandra Ursulyak, and Bob Schrijber.[10]In 2010, it was announced that Fox would begin filming a remake of the film with David Ayer in negotiations to direct.[11] Sam Worthington was attached to play the new lead role, which would reportedly have a more realistic approach.[12]","cinematography":"Matthew F. Leonetti","production_company":"Silver Pictures","directed_by":"Mark L. Lester","commando":"Theatrical release poster","Soundtrack":"A soundtrack album was released by Varèse Sarabande on December 2, 2003 as part of the label's CD Club and was limited to 3000 copies.[8] The score, composed by James Horner, is notable for its prominent use of steel drums.A song titled \"We Fight for Love\", featured in the film and recorded by the Power Station, wasn't included in the official soundtrack. The song featured founder Robert Palmer's replacement, Michael Des Barres, and was the band's only song with Des Barres singing lead. It would appear on the 2006 remaster of The Power Station.La-La Land Records released a limited edition of James Horner's score in August 2011. The release features approximately 62 minutes of music across 24 tracks and includes \"We Fight for Love\".","release_dates":"October 4, 1985 (1985-10-04)|||||","Production":"Screenwriter Jeph Loeb pitched his original idea to producer Robert Kosberg, who then partnered with Stephanie Brody, and together the two brought the spec script by Loeb to producer Joel Silver. Loeb states that the film was originally conceived as a vehicle for Gene Simmons, who passed, and later scripted with Nick Nolte in mind to play the lead as an out-of-condition former commando struggling with the demands of his mission. Walter Hill was originally involved in the development process. Kosberg and Brody were credited as Associate Producers.[4]The original concept was for an Israeli special forces–Mossad agent who, sick of the continual death and destruction in the Middle East, emigrates from Israel to the United States, where he is forced out of his self-imposed retirement after his daughter is kidnapped. This was modified and further adapted when Schwarzenegger was cast; some of the original dialogue can be heard in the deleted scenes when Matrix says he regrets his past actions.Principal photography commenced on April 22, 1985 and lasted for 45 days.[5] The film was shot on location in California. San Nicolas Island off the coast of Santa Barbara, to which Matrix flies to rescue his daughter, was filmed on the Pacific coast at San Simeon. The barracks that are \"attacked\" are actually beach properties belonging to the Hearst Castle Estate. The house that Matrix storms at the film's climax was actually the former main residence of the Harold Lloyd Estate in the Benedict Canyon district of Beverly Hills. The car chase scene between Sully and Matrix starts on Ventura Blvd and moves into the hills on Benedict Canyon.","Distribution":"Diamond Toymakers released a line of action figures in 1986 in an attempt to cash in on the success of G.I. Joe: A Real American Hero. Matrix now leads an elite special forces unit (which replaced his old deceased unit from the original film) called C-Team, made up of Spex, Blaster, and Chopper, against the forces of F.E.A.R., led by Psycho (who is based on the character of Bennett) and consisting of Lead-Head, Stalker, and Sawbones. There was an assortment of 4\" figures, containing all of the above, a series of 8\" figures, consisting of Matrix, Spex, Blaster, Psycho, Lead-Head, and Stalker. Chopper and Sawbones are absent. Finally, there was an 18\" John Matrix that came with a pistol, an M16, and a grenade.The first DVD of Commando was released in region 1 in the United States on May 25, 1999. Common with early DVD releases, the disc featured a non-anamorphic video transfer, a basic 2.0 surround track, and only the US theatrical trailer as an extra. DVDs released in other regions soon followed, some with anamorphic transfers, but the 2001 United Kingdom region 2 DVD was censored by the BBFC, with 12 seconds of cuts to an arm severing and closeups of the impaled Bennett. These cuts were brought over from the 1985 original theatrical release. However, a German master was used for the UK DVD, meaning the film was cut even more than it should have been, leading to 56 seconds of cuts instead of the BBFC's 12 seconds. If the film had been resubmitted to the BBFC, it would be passed uncut under the BBFC's new, more liberal rules. This has proven to be the case as the BBFC's website indicates that both versions of the film (the U.S. theatrical cut and the unrated edition) for the DVD were passed on June 11, 2007. With the unrated edition released, the film is in its entirety, a first for the UK.On June 5, 2007, 20th Century Fox officially announced that a completely unedited and unrated director's cut of the film would be released on region 1 DVD on September 18, 2007. Through seamless branching, this disc not only features an unrated cut (which was claimed to run at 95 minutes, but is only 91 minutes, with 92 seconds of extra footage), but as a bonus, also contains the original 90-minute, R-rated US theatrical version. Aside from this, the DVD is a special edition, featuring an audio commentary from director Mark L. Lester (only on the theatrical cut), additional deleted scenes, a Pure Action featurette, a Let Off Some Steam featurette, and four photo galleries with over 150 photos. The transfer is anamorphically enhanced and features a 5.1 audio mix.In April 2008, the 90-minute theatrical version of the film was released to consumers on the high definition Blu-ray disc format.On May 5, 2015, as part of the film's 30th anniversary, the director's cut of Commando was released on Blu-ray Disc in a limited edition, collectible metalpak as a Best Buy exclusive. It contains all of the special features that were included in the 2007 DVD release, including the 90-minute theatrical version of the film.","produced_by":"Joel Silver","starring":"Arnold Schwarzenegger|Rae Dawn Chong|","running_time":"90 minutes","music_by":"James Horner","edited_by":"Glenn Farr Mark Goldblatt John F. Link","budget":"$10 million[1]"}