{"country":"Hong Kong","distributed_by":"One Dollar Distribution","story_by":"Li Yu","language":"Cantonese Mandarin","box_office":"US$6,369,363[2]","3d_sex_and_zen:_extreme_ecstasy":"Chinese release poster","cinematography":"Jimmy Wong","production_company":"One Dollar Production, Ltd. Local Production","Marketing":"During the Chinese New Year in 2011, T-shirts and 3-D mouse pads with portraits of the cast were sold at the Lunar New Year Fair in Victoria Park, Hong Kong.[12][13]","directed_by":"Christopher Suen","release_dates":"14 April 2011 (2011-04-14)|||||","running_time":"110 minutes[1]118 min (extended cut) 129 min (director's cut)","budget":"US$3.5 million[2]","mandarin":"Sān D Ròupútuán zhī Jílè Bǎojiàn","screenplay_by":"Stephen Shiu Stephen Shiu, Jr. Mark Wu","Background":"3D Sex and Zen: Extreme Ecstasy is essentially an adaptation of the novel The Carnal Prayer Mat depicting the sexual exploits of Weiyangsheng, a young Ming dynasty scholar. It is produced by Stephen Shiu, the executive producer of Sex and Zen. The film was incorrectly promoted as \"Hong Kong's first IMAX 3-D erotic film\" because it was actually rejected by IMAX due to its subject matter and content.[4] Its cast includes Japanese AV idols.[5][6] Laughing aloud, Shiu described the experience of watching this film onscreen: \"It is just like [being a] voyeur near someone's bed.\"[7]","Plot":"A conceited Ming dynasty scholar, Weiyangsheng, believes that since life is short, one should pursue the ultimate sexual pleasure as time permits. By chance, he meets Yuxiang, the daughter of the Taoist priest Tie Fei, falls in love with her on first sight, and marries her. Yuxiang is elegant and courteous under the influence of her father's faith, though her lack of passion cannot fully satisfy Weiyangsheng's sexual needs. His disappointment is no less than his affection for her. He ventures in search of ways to increase his sex drive and performance in bed.","Reception":"3D Sex and Zen: Extreme Ecstasy received mostly negative reviews from critics. Review aggregator Rotten Tomatoes reports that 22% of critics gave the film positive reviews, based on 23 reviews.[14]Simon Foster of SBS Australia suggested the film loses steam along the way. He believes the thrill of the movie dissipates as the narrative turns nasty at the final 40 minutes, caused by those multi-dimensional rape and dismemberment scenes.[15] Elizabeth Kerr of The Hollywood Reporter wrote, \"Given Extreme Ecstasy's ultimate message that \"All you need is love\" and the vindication of the value of emotional connection in intercourse, the road the filmmakers take to get there is perplexing to say the least.\"[16] The Daily Telegraph named it one of the ten worst films of the year, citing \"the film goes on for too long, and gets darker as it does so, veering awfully close to torture porn on occasion, before ending with some unexpectedly sentimental philosophy that will be anathema to the manufacturers of Viagra.\"[17]However, Zoe Li of CNNGo gave the film a positive review. \"I walked out of the first private screening of the softcore 3D Sex and Zen: Extreme Ecstasy never wanting to have sex again, not because the sex scenes were gross... but because its message of 'true love doesn't need sex' was so convincing\", she states.[18] Simon Miraudo suggested on his Quickflix blog that the movie heralded a new age in cinema.[19]","cantonese":"Saam1 D Yuk6 Pou4tyun4 Zi1 Gik6lok6 Bou2 Gaam3","traditional":"3D肉蒲團之極樂寶鑑","simplified":"3D肉蒲团之极乐宝鉴","Distribution":"The film is a Category III film as per Hong Kong rating and Stephen Shiu said that screening was likely to be blocked in mainland China, a key market for Hong Kong filmmakers.[8] Nevertheless, the producers further announced that 3D Sex and Zen will be released in various versions to bypass censorship laws in some jurisdictions and allow wider distribution.[9]In Australia and New Zealand, the film was screened by Hoyts.[10][11]","Box office":"According to Russell Edwards of Variety, 3D Sex and Zen: Extreme Ecstasy took in US$351,000 (HK$2,790,000) on the first day alone in Hong Kong,[20] beating Avatar's HK$2.5 million opening gross in the country in 2009.[21] It earned HK$13,104,982 in the first four days after opening.[22]As of 15 June 2011, 3D Sex and Zen: Extreme Ecstasy earned more than HK$40 million (over US $5M) in Hong Kong.[23][24]","produced_by":"Stephen Shiu Stephen Shiu, Jr. Ng Kin-hung","starring":"Hayama Hiro Lan Yan Saori Hara Vonnie Lui Yukiko Suo Tony Ho","music_by":"Raymond Wong","edited_by":"Azrael Chung Matthew Hui"}