{"country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Stephen King","Plot":"A young boy named Billy gets yelled at and slapped by his father, Stan, for reading a horror comic titled Creepshow. Stan reminds his wife that he had to be hard on Billy because he does not want their son to be reading such \"crap\". As Billy sits upstairs cursing his father with hopes of him rotting in Hell, he hears a sound at the window, which turns out to be a ghostly apparition in the form of The Creep from the comic book, beckoning him to come closer.(First story, written by King specifically for the film) Nathan Grantham, the miserly old patriarch of a family whose fortune was made through bootlegging, fraud, extortion, and murder-for-hire, is killed on Father's Day by his long-suffering spinster daughter Bedelia. Bedelia was already unstable as the result of a lifetime spent putting up with her father's incessant demands and emotional abuse, which culminated in his orchestrating the murder of her sweetheart.The sequence begins in 1980, when the remainder of Nathan's descendants—including Nathan's granddaughter Sylvia, his great-grandchildren Richard, Cass, and Cass' husband Hank—get together for their annual dinner on the third Sunday in June.Bedelia, who typically arrives later than the others, stops in the cemetery outside the family house to lay a flower at the grave site and drunkenly reminisce about how she murdered her insufferable, overbearing father. When she accidentally spills her whiskey bottle in front of the headstone, it seems to have a reanimating effect on the mortal remains interred below. Suddenly, Nathan's putrefied, maggot-infested corpse emerges from the burial plot in the form of a revenant who has come back to claim the Father's Day cake he never got. Grantham slowly avenges himself on Bedelia and the rest of his idle, scheming, money-grubbing heirs, killing them off one by one (which includes some apparent supernatural abilities such as making a heavy tombstone move by will) before finally attaining his Father's Day cake, topped with Sylvia's severed head.Based on the short story \"Weeds\". Jordy Verrill (played by Stephen King himself), a dimwitted backwoods yokel, thinks that a newly discovered meteorite will provide enough money from the local college to pay off his $200 bank loan. As the meteorite is too hot to touch, he douses it with water, causing it to crack open and spew a glowing green substance that comes into contact with his skin. He then finds himself being overcome by a rapidly spreading plant-like organism that begins growing on his body. Jordy is eventually cautioned by the ghost of his father not to take a bath. But when the itching from the growth on his skin becomes unbearable, Jordy succumbs to temptation and collapses into the bathwater. By the next morning, Jordy and his farm have been completely covered with dense layers of the hideous alien vegetation. In despair, he reaches for a shotgun and blows the top of his head off, thus killing himself. A radio weather forecast announces that heavy rains are predicted and the audience is left with the dire expectation that this will accelerate the spread of the extraterrestrial plant growth to surrounding areas.Richard Vickers, a vicious, wealthy psychopath whose jocularity belies his cold-blooded murderousness, stages a terrible fate for his unfaithful wife, Becky, and her lover, Harry Wentworth, by separately luring them out to his secluded beach property and then, at gunpoint, burying them up to their necks below the high tide line. He explains that they have a chance of survival—if they can hold their breath long enough for the sand to loosen once the seawater covers them, they could break free and escape.Vickers sets up closed-circuit TV cameras so he can watch them die from the comfort of his well-appointed beach house. However, Richard is in for a surprise of his own when the two lovers he murdered return as a pair of waterlogged, seaweed-covered revenants intent on revenge. He tries to shoot them, but they remind him: \"You can't shoot us dead, Richard, because we're already dead!\" The final scene reveals that Richard is now the one buried in the beach, facing the approaching tide— and the sight of two sets of footprints disappearing into the surf. While the tide is rising, he laughs hysterically, his sanity shattered by the experience, and screams: \"I can hold my breath for a LOOONG TIME!\" The frame freezes into animation and the flipping comic pages stop on the title of the next story, one of the longer entries at nearly 30 minutes.Based on the short story \"The Crate\". A college custodian, Mike, drops a quarter and finds a wooden storage crate, hidden under some basement stairs for 148 years. He notifies a college professor, Dexter Stanley, of the find. The two decide to open the crate and it is found to contain an extremely lethal creature[3] resembling a Yeti, or Abominable Snowman, which despite its diminutive size promptly kills and entirely devours Mike, leaving behind only his boot. Escaping, Stanley runs into a graduate student, Charlie Gereson, who is skeptical and investigates. The crate has been moved back under the stairs and Gereson is killed by the creature as he examines the crate. Stanley flees to inform his friend and colleague at the university, the mild-mannered Professor Henry Northrup.Stanley, now traumatized and hysterical, babbles to Northrup that the deadly monster must be disposed of somehow. Northrup sees the creature as a way to rid himself of his perpetually drunk, obnoxious and emotionally abusive wife, Wilma, whom he often daydreams of killing. He contrives a scheme to lure her near the crate, where the beast does indeed maul and eat her. Northrup secures the beast back inside its crate, then drops it into a nearby lake, where it sinks to the bottom. He returns to assure Stanley that the creature is no more. However, it is subsequently revealed to the audience that the beast has escaped from its crate, and is in fact alive and well.Upson Pratt is a cruel, ruthless businessman whose mysophobia has him living in a hermetically sealed apartment controlled completely with both electric locks and surveillance cameras. During a particularly severe lightning storm, he finds himself looking out over the concrete canyons of New York City, as a rolling blackout travels his way. When it hits his apartment tower, the terror begins for Mr. Pratt, who now finds himself helpless, when his flat becomes overrun by hordes of cockroaches. As the cockroaches begin to overrun him, he locks himself inside a panic room, only to find the cockroaches have already infested the room as well. With no way to escape, he is swarmed upon by the roaches which induce a fatal heart attack. Later, as electricity returns to the building, Pratt's corpse is shown in the panic room, now devoid of roaches. However, Pratt's body soon begins to contort, as roaches grotesquely burst out of his mouth and body, re-enveloping the panic room.The following morning, two garbage collectors find the Creepshow comic book in the trash. They look at the ads in the book for X-ray specs and a Charles Atlas bodybuilding course. They also see an advertisement for a voodoo doll, but lament that the order form has already been redeemed. Inside the house, Stan complains of neck pain, which escalates and becomes deadly as Billy repeatedly and gleefully jabs the voodoo doll as he finally gets revenge on his accursed father for his past abuse.","Sequels and adaptations":"The film was adapted into an actual comic book of the same name soon after the film's release, illustrated by Bernie Wrightson, (of Heavy Metal fame)), an artist fittingly influenced by the 1950s E.C. Comics.A sequel, Creepshow 2, was released in 1987, and was once again based on Stephen King short stories, with a screenplay from Creepshow director George A. Romero. The film contained only three tales of horror (due to budget constraints) as opposed to the original's five stories.A further sequel, Creepshow III, featuring no involvement from Stephen King, George A. Romero, or anyone else involved in the production of the first two films, was released direct-to-video in 2007 (though it was finished in 2006) to mostly negative reviews. This film, in a fashion similar to the original Creepshow, features five short, darkly comedic horror stories.Creepshow make-up artist and actor Tom Savini has said that he considers Tales from the Darkside: The Movie (1990) the real Creepshow 3.Taurus Entertainment (rights holders of the original Creepshow) have licensed the rights to Jace Hall, of HDFILMS, a Burbank, California company, to produce Creepshow: RAW, a web series based upon the original film.The pilot episode for Creepshow: RAW wrapped on July 30, 2008. The pilot was directed by Wilmer Valderrama and features Michael Madsen.","language":"English","box_office":"$21 million","cinematography":"Michael Gornick","production_company":"Laurel Entertainment Inc. United Film Distribution Company","directed_by":"George A. Romero","Home media":"The film was first released in 1983 on VHS and CED Videodisc.A 2 disc Special Edition DVD of Creepshow was released 22 October 2007 in the UK. The discs feature a brand new widescreen transfer of the film sourced from the original master, a making-of documentary running 90 minutes (titled Just Desserts: The Making of Creepshow), behind-the-scenes footage, rare deleted scenes, galleries, a commentary track with director George A. Romero and make-up effects artist, Tom Savini, and more. Owner of Red Shirt Pictures, Michael Felsher is responsible for the special edition, the documentary and audio commentary in particular.In the United States Warner Bros. sticks to a one-disc set with only the film's trailer. No other special features have ever been released with the Region 1 version. The Region 1 DVD was a 2-sided disc. One side was the 1:85 transfer (widescreen) version of the film, and the other side was the full screen version.On September 8, 2009, the film was released on Blu-ray. Again the only special feature is the film's trailer.Second Sight acquired the license to release a new Blu-ray in the U.K., It contains all of the special features included from the special 2 disc edition which was released in 2007. It also contains a new audio commentary with Director of Photography Michael Gornick, Actor John Amplas, Property Master Bruce Alan Green and make-up effects assistant Darryl Ferruci. To be released October 28.","creepshow":"Original theatrical release poster","release_dates":"May 16, 1982 (1982-05-16) (Cannes Film Festival)|November 12, 1982 (1982-11-12) (United States)||||","Production":"In keeping with Romero's tradition of filming in and around the Pittsburgh area, most of the film was shot in an empty all-girls school located outside Greensburg, Pennsylvania. The school was converted into a film studio, and the episodes \"The Lonesome Death of Jordy Verrill\", and \"They're Creeping Up on You\", as well as the prologue and epilogue, were filmed in their entirety at the former school. Filming took place at the Greensburg location throughout 1981.Several additional locations were also used for filming:In a 2015 interview with The A.V. Club, Ted Danson explained the brief shot of his character drowning underwater: \"so they make a little aquarium tank. I got in a wetsuit and climbed in, and somebody would reach down with an oxygen tank ventilator thingy, and I’d breathe, and then they’d take that out. And there was a yoke made out of… I don’t know, wood and fake sand, so it looked like my head was buried in the sand, underwater.\"[4]The large cockroaches featured in the episode \"They're Creeping Up on You\" were hissing cockroaches imported from Guatemala. Romero was unable to obtain an export permit for them, so they were imported on a temporary permit. This meant that each one had to be counted before and after each shot, and accurate records kept of the number of dead specimens. The cockroaches were stored in styrofoam egg cartons kept inside a large van that was filled with high levels of carbon dioxide to keep the cockroaches quiet. In the final scene of the segment—in which the room is almost filled with cockroaches—many of the apparent insects were actually nuts and raisins, as specified by Tom Savini.","produced_by":"Richard P. Rubinstein","starring":"Hal Holbrook|Adrienne Barbeau|Fritz Weaver|Leslie Nielsen|Carrie Nye|E. G. Marshall|Viveca Lindfors|","running_time":"120 minutes","music_by":"John Harrison","edited_by":"George A. Romero|Pasquale Buba|Paul Hirsch|Michael Spolan|","Release":"Creepshow was given a wide release by Warner Bros. on November 12, 1982. It started with an $8 million box-office gross for its first five days.[5] In its opening weekend, Creepshow grossed $5,870,889, ranking #1 in the box office, replacing First Blood in the top spot.[6] In total it grossed $21,028,755 in the U.S.,[7] making it the highest grossing horror film for the Warner Bros. studio that year.[8]Rotten Tomatoes gave the film a 69% approval rating based on 29 reviews; the average rating is 6.2/10. The site's consensus reads: \"It's uneven, as anthologies often are, but Creepshow is colorful, frequently funny, and treats its inspirations with infectious reverence.\"[9] Roger Ebert gave the film three out of four stars and wrote, \"Romero and King have approached this movie with humor and affection, as well as with an appreciation of the macabre\".[10] In his review for The New York Times, Vincent Canby wrote, \"The best things about Creepshow are its carefully simulated comic-book tackiness and the gusto with which some good actors assume silly positions. Horror film purists may object to the levity even though failed, as a lot of it is\".[11] Gary Arnold, in his review for The Washington Post, wrote, \"What one confronts in Creepshow is five consistently stale, derivative horror vignettes of various lengths and defects\".[12] In his review for The Globe and Mail, Jay Scott wrote, \"The Romero-King collaboration has softened both the horror and the cynicism, but not by enough to betray the sources — Creepshow is almost as funny and as horrible as the filmmakers would clearly love it to be\".[13] David Ansen, in his review for Newsweek, wrote, \"For anyone over 12 there's not much pleasure to be had watching two masters of horror deliberately working beneath themselves. Creepshow is a faux naif horror film: too arch to be truly scary, too elemental to succeed as satire\".[14] In his review for Time, Richard Corliss wrote, \"But the treatment manages to be both perfunctory and languid; the jolts can be predicted by any ten-year-old with a stop watch. Only the story in which Evil Plutocrat E.G. Marshall is eaten alive by cockroaches mixes giggles and grue in the right measure\".[15]The film has become a cult horror classic.[16] Bravo awarded it the 99th spot on their \"The 100 Scariest Movie Moments\", mostly for the scene with the cockroaches bursting out on Upson Pratt's body.[17]","budget":"$8 million[1]"}