{"Cast":"Cameo appearances by:","country":"United States","distributed_by":"Warner Bros. Pictures","screenplay_by":"Cynthia Friedlob John Semper","story_by":"Michael Swerdlick Richard Brenne Wayne Allan Rice","Plot":"Genius high school student Duncan Pinderhughes (Christopher \"Kid\" Reid) is getting ready for graduation, but is somewhat disheartened to find out that, despite his perfect SAT score and 4.0 GPA, prestigious Hafford University (parody of Harvard University) will not admit him unless he can pass phys. ed. Ex-convict Michael \"Blade\" Brown (Christopher \"Play\" Martin) is released from jail, and told by his parole officer (Rick Ducommun) that the condition of his release is satisfactory graduation from high school. A mishap results in their pictures being swapped on their permanent school records. In effect, Blade is surprised to find out that he is being placed in gifted classes, while Duncan is shocked to be placed in minimal classes with substandard conditions and miscreants for classmates.Blade realizes this and sees Duncan as his ticket permanently out of jail, since Duncan could pass his classes with ease. He transforms Duncan into a version of himself with dreadlocks, and does his best to teach Duncan how to act and talk like a gangsta. Having no grasp of hip hop culture, Duncan's parents begin to worry about their son's new \"friend\"; his father especially, beginning to suspect Duncan is gay.Blade manages to smooth-talk his way through his advanced classes, even successfully executing a dissertation on sexual intercourse (one of his favorite subjects). Duncan ends up running into a high school thug named Wedge (Lamont Johnson), and gets in trouble, but also ends up discovering an uncanny ability to kick field goals, and joins the school's football team. Both Blade and Duncan end up with girlfriends that the other would have, with Blade smooth-talking the intelligent but excitement-seeking Ellen (Karyn Parsons) and Duncan being pursued by the wild Damita (Alysia Rogers).A drug dealer named Mink (Thomas Mikal Ford) was told by his employee Wedge that Blade Brown was stepping into his territory and a chase involving the guys and their girlfriends and one of Duncan's new buddies ensues. The gang briefly lose Wedge and Mink and go to Damita's work (a wax museum), but are discovered by Mink and Wedge. Once there, the girlfriends realize that their men are swapped, and both guys eventually end up dumped. Still, Duncan manages to knock out Wedge in the museum, while Blade handles Mink, but they all end up in jail.After the mix-up is corrected, Blade, Duncan and company are all set free. In an anti-climax, Duncan and Blade both enter a Knowledge bowl in an effort to get Blade back with Ellen. They succeed when Blade answers a tiebreaker question to win the competition, recalling a choice tidbit Ellen once told him. Afterward, both couples end up together. In a final scene, Duncan's dad finds out the hard way that Duncan is definitely not gay by catching him and Damita having sex in Duncan's bedroom. However, after returning to his room with his wife, he expresses relief and noted that his son's girlfriend is \"stacked\".Walking in each other's shoes dramatically changed the lives of both Duncan and Blade. In the epilogue, the audience learns that Blade graduated from high school and attended Hafford (even wearing preppy attire), while Duncan attended Stanford on a football scholarship.","language":"English","Reception":"The film received mixed reviews, but after release on VHS and DVD, it became a cult favorite with favorable comments on Amazon and IMDB.[2][3][4]Rotten Tomatoes gives the film a score of 17% based on reviews from 12 critics.[5]The film debuted at No.7 at the US box office.[6] It went on to earn a total of $13,272,113.[1]","box_office":"$13,272,113[1]","cinematography":"Francis Kenny","production_company":"Motown Productions","directed_by":"Randall Miller","Home media":"The film was made available on DVD as part of the Warner Archive Collection on May 18, 2010.[7] Fans of the movie created an online petition for a DVD release.The film was released on pan-and-scan VHS and laserdisc in 1992.","release_dates":"June 5, 1992 (1992-06-05)|||||","produced_by":"Jean Higgins Joe Wizan Maynell Thomas Suzanne de Passe Todd Black","starring":"Kid 'n Play|","running_time":"98 minutes","class_act":"Theatrical release poster","music_by":"Vassal Benford","edited_by":"John F. Burnett Richard Leeman"}