{"country":"United States","distributed_by":"DreamWorks Pictures (North America) Columbia Pictures (International)","Plot":"In 1968, child prodigy William Miller struggles to fit in with the world. His widowed mother Elaine – who has told him that he's a year older than he really is, and had him skip two grades of school – strictly controls and protects him and his older sister Anita, forbidding rock music and other unwelcome influences, driving Anita to leave home and become a flight attendant.In 1973, 15-year-old William aspires to be a rock journalist, writing freelance articles for underground papers in San Diego. Rock journalist Lester Bangs, impressed with his writing, gives him a $35 assignment to review a Black Sabbath concert. He can't get backstage, but opening band Stillwater arrives, and after he flatters them with critical praise they bring him along. Lead guitarist Russell Hammond takes a liking to him, partly because of William's new friendship with veteran groupie Penny Lane. Feigning retirement from her glory days, she takes William under her wing, but only to get close to Russell, for whom she has genuine feelings.William is contacted by Ben Fong-Torres, editor of Rolling Stone, who believes him to be older and hires him to write a story. He convinces Ben to let him write about Stillwater, and he is instructed to go on the road with them. Tensions between Russell and lead singer Jeff Bebe are evident. William begins to interview the members of the band, but Russell repeatedly puts it off. Penny watches the interaction and sympathizes with William, whom they joking call \"the enemy\" because he's a journalist, but he quickly becomes part of their inner circle as he loses his objectivity.The band experiences problems with promoters and venues on the tour, and hires Dennis, a professional manager. Penny is told she must leave them before New York, where Russell's ex-wife/girlfriend Leslie will join them. Stillwater \"loses\" Penny's three protégé groupies to another band in a poker game; she acts nonchalant but is devastated. Also, Dennis has chartered a small plane to allow them to play more gigs than their tour bus does, and there is no room on it for Penny, who is left behind.However, Penny goes to New York on her own, and shows up at the restaurant where the band is celebrating the news that they will be featured on the cover of Rolling Stone. Leslie notices her apparent attempts to get Russell's attention, and Penny is asked to leave. William chases her back to her hotel, where he saves her from overdosing on quaaludes.The next day, the band flies to another gig, but the plane encounters severe weather. Believing they are about to die, members of the group confess their secrets to one another, bringing the conflicts between Jeff and Russell into the open. Jeff insults Penny, but William defends her and confesses that he loves her. The plane lands safely, leaving everyone to ponder the changed atmosphere.William leaves the group, to finish the article at the Rolling Stone office in San Francisco, writing the whole truth about what he has observed. Fearful the story will damage the band's image, Russell tells the magazine's fact-checker that the boy's story is untrue, killing the article and crushing William emotionally. William's sister happens to encounter him sitting dejected in the airport, and offers to take him anywhere in the world; he chooses to go home to San Diego, where their mother is overcome to have them back.One of the groupies chastises Russell for what he did to William. Russell calls Penny and asks to meet with her, but she tricks him, giving him William's home address instead. He is forced to face William and apologizes; William finally gets his interview, and Russell reverses himself and confirms William's article to Rolling Stone, which runs it as a cover feature. Meanwhile, Penny purchases a ticket to Morocco, fulfilling her long-standing fantasy, and William reluctantly sees her off.","language":"English","Reaction":"Almost Famous had its premiere at the 2000 Toronto Film Festival.[7] It was subsequently given a limited release on September 15, 2000, in 131 theaters where it grossed $2.3 million on its first weekend. It was given a wider release on September 22, 2000, in 1,193 theaters where it grossed $6.9 million on its opening weekend. The film went on to make $32.5 million in North America and $14.8 million in the rest of the world for a worldwide total of $47,383,689, well below its $60 million budget.[8]Film critic Roger Ebert gave the film four out of four stars and praised it for being \"funny and touching in so many different ways\".[9] In his review for The New York Times, A.O. Scott wrote, \"The movie's real pleasures are to be found not in its story but in its profusion of funny, offbeat scenes. It's the kind of picture that invites you to go back and savor your favorite moments like choice album cuts\".[10] Time magazine's Richard Corliss praised the film's screenplay for \"giving each character his reasons, making everyone in the emotional debate charming and compelling, creating fictional people who breathe in a story with an organic life\".[11] In her review for the L.A. Weekly, Manohla Dargis wrote that \"the film shimmers with the irresistible pleasures that define Hollywood at its best - it's polished like glass, funny, knowing and bright, and filled with characters whose lives are invariably sexier and more purposeful than our own\".[12] Rolling Stone magazine's Peter Travers wrote, \"Not since A Hard Day's Night has a movie caught the thrumming exuberance of going where the music takes you\".[13] In his review for Newsweek, David Ansen wrote, \"Character-driven, it relies on chemistry, camaraderie, a sharp eye for detail and good casting\".[14] Entertainment Weekly put it on its end-of-the-decade, \"best-of\" list, saying, \" Every Cameron Crowe film is, in one way or another, about romance, rock & roll, and his romance with rock & roll. This power ballad of a movie, from 2000, also happens to be Crowe's greatest (and most personal) film thanks to the golden gods of Stillwater and their biggest fan, Kate Hudson's incomparable Penny Lane.\"[15]Entertainment Weekly gave the film an \"A-\" rating and Owen Gleiberman praised Crowe for depicting the 1970s as \"an era that found its purpose in having no purpose. Crowe, staying close to his memories, has gotten it, for perhaps the first time, onto the screen\".[16] In his review for the Los Angeles Times, Kenneth Turan praised Philip Seymour Hoffman's portrayal of Lester Bangs: \"Superbly played by Philip Seymour Hoffman, more and more the most gifted and inspired character actor working in film, what could have been the cliched portrait of an older mentor who speaks the straight truth blossoms into a marvelous personality\".[17] However, in his review for The New York Observer, Andrew Sarris felt that \"none of the non-musical components on the screen matched the excitement of the music. For whatever reason, too much of the dark side has been left out\".[18] Desson Howe, in his review for the Washington Post, found it \"very hard to see these long-haired kids as products of the 1970s instead of dressed up actors from the Seattle-Starbucks era. I couldn't help wondering how many of these performers had to buy a CD copy of the song and study it for the first time\".[19]The film received an 88% rating on Rotten Tomatoes and a 90 metascore on Metacritic.[20][21]","box_office":"$47.4 million[1]","cinematography":"John Toll","production_company":"Vinyl Films","directed_by":"Cameron Crowe","almost_famous":"Theatrical release poster","Soundtrack":"The Almost Famous soundtrack album was awarded the 2001 Grammy Award for Best Compilation Soundtrack Album for a Motion Picture, Television or Other Visual Media.","release_dates":"September 13, 2000","Production":"Crowe used a composite of the bands he had known to come up with Stillwater, the emerging act that welcomes the young journalist into its sphere, then becomes wary of his intentions. Seventies rocker Peter Frampton served as a technical consultant on the film. Crowe and his then-wife, musician Nancy Wilson of Heart, co-wrote three of the five Stillwater songs in the film, and Frampton wrote the other two, with Mike McCready of Pearl Jam playing lead guitar on all of the Stillwater songs.Crowe based the character of Penny Lane on the real life Pennie Ann Trumbull and her group of female promoters who called themselves the Flying Garter Girls Group.[3] Though they were not in the Flying Garter Girls group, various other women have been described as Crowe's inspiration, for instance Pamela Des Barres [4] and Bebe Buell.[5]The character of William Miller's mother (played by Frances McDormand) was based on Crowe's own mother, who even showed up on the set to keep an eye on him while he worked. Though he asked his mother not to bother McDormand, the two women ended up getting along well.[6]Crowe took a copy of the film to London for a special screening with Led Zeppelin members Jimmy Page and Robert Plant. After the screening, Led Zeppelin granted Crowe the right to use one of their songs on the soundtrack — the first time they had ever consented to this since allowing Crowe to use \"Kashmir\" in Fast Times at Ridgemont High — and also gave him rights to four of their other songs in the movie itself, although they did not grant him the rights to \"Stairway to Heaven\" for an intended scene (on the special \"Bootleg\" edition DVD, the scene is included as an extra, sans the song, where the viewer is instructed by a watermark to begin playing it).","produced_by":"Cameron Crowe Ian Bryce","starring":"Billy Crudup Frances McDormand Kate Hudson Jason Lee Patrick Fugit Anna Paquin Fairuza Balk Noah Taylor Philip Seymour Hoffman","running_time":"122 minutes","music_by":"Nancy Wilson","edited_by":"Joe Hutshing Saar Klein","written_by":"Cameron Crowe","budget":"$60 million[1]"}