{"country":"United Kingdom United States","distributed_by":"Universal Pictures","4.3.2.1":"Film poster","Plot":"The story focuses on four 19-year-old friends: Joanne, Cassandra, Shannon and Kerrys. They all meet one other at a diner, where they see Dillon and Smoothy. Unbeknownst to Dillon, Shannon has a crush on him. As the police turn up, Dillon and Smoothy run off and Dillon accidentally drops a stolen diamond into Cassandra's bag. The four girls then walk out and go their separate ways home.First, the story focuses on Shannon: she walks into her home just as her mother is leaving her father. She loses her temper and runs away, going to Jo's home, who has to rush to work, telling her she does not have time to talk. Jo calls Shannon over to the supermarket where she works, but tells her to leave as soon as she arrives. When she refuses, Dillon kisses Jo, upsetting Shannon, so she grabs a Pringles tube from the shop and runs away.After getting drunk at a bar, she goes to a tunnel where she graffitis, is attacked by a gang and then taken in by Kelly, who saved her. Shannon realizes that Kelly seems to be looking for the Pringles. This is later confirmed when she finds out that she is searching for \"15 diamonds\". One is already in Cassandra's bag and the rest are in the can that fell out of Shannon's bag in the tunnel. She escapes by knocking Kelly out with the bathroom door. She finds the diamonds by going back to where she was attacked. Her story ends with her holding the diamonds above a bridge, suggesting she is about to commit suicide. Jo, Cassandra and Kerrys appear to threaten Shannon into handing the diamonds over.Second, the story moves onto Cassandra, who visits New York City to meet up with Brett, whom she has met on the internet and audition for a piano school. She has sex with Brett and in the morning finds all her possessions gone except for her handbag, which contains a diamond. She also finds a letter that Shannon has been looking for, which was written by her mother explaining why she left.She goes to Brett's house to find that Brett is a stalker who hacked into Cassandra's computer, taking videos of her. When the fake Brett comes, she knocks him out but he escapes and chases her down the street where she is rescued by a black woman and her family, who do not take kindly to Brett's racist comments. Cassandra forces her way into an audition with Jago Larofsky and wins a place at his school. She then leaves to go home to London.Third, the story of Kerrys is explored. Kerrys and her girlfriend Jas break into Cassandra's flat and stay there. Kerrys' brother Manuel locks them in the panic room and throws a party. When the two girls escape from the panic room, they lock Manuel in there and run away.Fourth, Jo, who works at a 24-hour supermarket with Angelo . She finds that her new manager Tee is in town. Tee has been working with Dillon and Smoothy to deliver the diamonds, but one is missing. Tee asks Dillon and Smoothy to come over to the supermarket. Dillon and Smoothy come to get the money, when they find that Tee has betrayed them, keeping the money for himself and they hold up the store in retaliation.When Shannon arrives, Jo tries to make her leave and Dillon kisses Jo, unseen to Shannon, is at gunpoint. Shannon leaves, stealing a tube of Pringles, and Dillon and Smoothy escape, leaving Tee with the 14 diamonds, which Tee had hidden in the tube of Pringles that Shannon stole. When Tee is about to be shot by Kelly, Jo rescues him, but when he tries to run, Angelo attacks him and Tee is then arrested.Cassandra returns with the last diamond and the letter. She meets Jo and Kerrys and they go to find Shannon. They talk her down and give her the letter, comforting her. They put the fourteen diamonds together, give them to the police and fly to New York City with Kelly also on the plane.","language":"English","Critical reception":"The film has received mixed reviews from critics. On film review website Rotten Tomatoes, the film has garnered nine fresh reviews and sixteen negative reviews, giving the film an overall rotten 36% rating from critics.[3]However, Peter Bradshaw from British newspaper The Guardian and Wendy Idle from The Times both gave the film a negative review. Bradshaw said the film is \"all over the place\", also deeming that the acting is on the \"torpid side\", and Idle believed the film \"might just claim back a small corner of the multiplex audience from the relentless onslaught of cynical Hollywood garbage\" and described the film as \"mostly\" bad.","box_office":"$1,163,967 [1]","cinematography":"Franco Pezzino","directed_by":"Noel Clarke Mark Davis","release_dates":"2 June 2010 (2010-06-02)|||||","produced_by":"Damon Bryant Dean O'Toole Noel Clarke","starring":"Emma Roberts Tamsin Egerton Ophelia Lovibond Shanika Warren-Markland Mandy Patinkin Kevin Smith Noel Clarke","running_time":"117 minutes","music_by":"Adam Lewis","edited_by":"Mark Davis Mark Everson","written_by":"Noel Clarke"}