{"Cast":"(during the song \"Apna Bombay Talkies\", in order of appearance)","country":"India","distributed_by":"Viacom 18 Motion Pictures","Plots":"The short film begins with Avinash (Saqib Saleem), a young man, bursting into his house. He wakes his father and pushes him against the wall declaring that he is homosexual. He leaves his parents house, distraught and heartbroken but ready for a new start. He passes a girl at a train station singing \"Ajeeb Dastan Hain Ye.\" Gayatri (Rani Mukerji) is married to Dev (Randeep Hooda). Gayatri, who works for a magazine meets Avinash, the new intern. Avinash informs her that he's gay and is shocked to see that it doesn't shock her. They gradually become very close. On his birthday, Gayatri invites Avinash home for dinner. That evening, Gayatri tells Dev that Avinash is gay. Dev seems shocked.During dinner, Avinash and Dev find that they both share a love for old Hindi films and music. Avinash leans over Dev to look at something on the table and Dev visibly reacts. The next day, Gayatri leaves for some work. Avinash goes to her house to meet Dev. He gives him a CD and then invites him to come out. (A funny play on \"coming out of the closet.\") Avinash takes Dev to meet the little girl who sings \"Lag jaa gale.\" Dev is shocked. He pays the girl a lot of money and asks her what she plans on doing with it. She says she will buy food for her brothers and sisters. He asks her if she's lying. She curtly replies that she isn't, and telling lies is bad.By this point, Avinash is sure that Dev is gay but hasn't come out of the closet. The next day he meets Gayatri who happily informs him that she and Dev had amazing sex the last night. Avinash is disappointed and angry, knowing fully well that he is the reason for Dev's good mood.He goes to meet Dev at work. He admits that he took the one-hour journey between the offices just to meet him. Dev is embarrassed and asks him to leave. Avinash reaches over to hug him sensually, alarming Dev. Dev loses his temper and begins to beat Avinash up. Avinash leaves Dev, and goes back home. The beating he received from Dev triggers memories of his own father beating him up upon discovering his sexuality.Dev visits him to apologize. He seems torn and after hitting Avinash again and throwing him against the cupboard, he kisses him. Again, Dev begins to hit Avinash. Avinash loses his temper and throws Dev out.Avinash then goes and tells Gayatri that her husband kissed him. Gayatri is infuriated and doesn't listen to anything else Avinash has to say and goes home. Dev enters and tries to kiss her, but she pushes him away and begins to wipe her face. She tells him that she now knows that the there's nothing wrong with her but with him and that he is the reason their marriage failed. She says she's glad she's free now and informs him that their relationship is over.In the final scene we see Avinash sitting on his bed, upset. We see Dev beside the young girl who is singing, Gayatri has kicked him out. And we see Gayatri putting on make up. The film ends on an ironical note. The young girl asks Dev for money and he says that he doesn't have any. She says that he's lying. He replies that he isn't, and lying is bad, mirroring her words from earlier. The irony being, that his whole marriage and life was a lie.The story is an adaptation of Satyajit Ray's short story \"Patol Babu, Film Star\". A failed actor (Nawazuddin Siddiqui) is struggling to make a living after his father’s death. He expects others to come to him and offer him work. One day he meets his master's spirit and learns the lesson of life that work is not God's Gift and one only gets it when one tries. In a turn of events he stumbles upon his last chance to prove himself to the world and more importantly, to his daughter (this last point is adapted from another of Ray's short stories, \"Pterodactyl-er Dim\").A 12-year-old child (played by Naman Jain) named Vicky aspires to be a Bollywood dancer. Vicky's father however wants his kid to follow typically masculine sports, be \"tough\" and be a football player. Vicky is a Katrina Kaif fan and loves dancing to \"Sheila Ki Jawani.\" During a TV interview, Vicky hears Katrina Kaif talk about breaking conventions of society and following dreams regardless of the obstacles that come in one's way, and that sometimes, one must keep their dreams a secret at the start. Vicky is encouraged by Katrina's words. When the parents leave the house, Vicky dresses up like 'Sheila' and performs. Vicky is caught when the parents return, and is rebuked for dressing in women's clothes. Meanwhile, Vicky's sister wants to go on a school trip but is refused Rs. 2000 by their father because he had already spent funds on the Vicky's football training. She is rather disappointed that the parents are so focused on her sibling's football training when it's clear Vicky doesn't even enjoy football. Vicky realizes how unfair this is, and offers to perform to collect money for her trip. They then decide to organize a small ticketed event for the neighborhood at an old garage, where Vicky dances to his favorite tunes.Vijay (Vineet Kumar Singh) is from Allahabad city in UP. The story begins with Vijay traveling to Mumbai to fulfill his ailing father's desire. His father (Sudhir Pandey) desires that Vijay meet Bollywood superstar Mr. Amitabh Bachchan, offer and feed him homemade 'murabba' and bring the remaining half for his father. Vijay's father believes that doing so will bring comfort to him and in turn lengthen his life. Vijay is shown struggling to get personal audience with Mr. Bachchan. Hungry, frustrated and penniless, Vijay even takes up an odd job in Mumbai. Eventually, after much struggling and convincing Mr. Bachchan's security guards, he gets to meet Mr. Bachchan personally. Amazed at Vijay's determination and dedication towards his father Mr. Bachchan happily obliges Vijay. He eats half of Vijay's homemade murabba. Satisfied and victorious Vijay now sets on his return journey by train. On his way back he is shown narrating his experiences to fellow passengers. Meanwhile, a co- passenger maliciously breaks the glass jar containing the murabba eaten by Mr. Bachchan while another co-passenger inadvertently squishes it. Disappointed and heartbroken, Vijay has no option but to replace the piece of murabba somehow. He decides to buy a new glass jar and some murabba. He reaches home with the murabba and offer it to his father. The father however is able to detect that something went wrong; he asks his son, where he broke the glass jar? In response, Vijay narrates the truth to him. It is then that the father narrates his own story to Vijay. Just as he had asked Vijay to meet Mr. Bachchan, his grandfather had asked his father to meet Mr. Dilip Kumar, a Bollywood superstar of his times. His grandfather had handed over a jar of honey to his father and had asked that Mr. Dilip Kumar dip his finger into the jar. However, the jar of honey caught ants by the time it reached Mr. Dilip Kumar and the actor refused to dip his finger into it. Vijay's father had then replaced the jar of honey, dipped his own finger into it and taken it back to his father. Unsuspectingly, Vijay's grandfather ate honey from the jar for years to come and lived a long life. The movie ends with Vijay's father contemplating how life takes a full circle.","language":"Hindi English","Reception":"Bombay Talkies received positive reviews upon release.[11][12][13] Taran Adarsh of Bollywood Hungama gave the film 4/5 stars, and noted that the film \"is one of those infrequent movies wherein you get to eyeball the superior efforts of four top notch film-makers in less than two hours.This reality alone makes the film a compelling watch, while the superior performances and absorbing themes that the movie prides itself in only serve as an icing on the cake. This celebration of cinema is a must watch!\" He said Rani Mukerji is an actor par excellence[14] Anupama Chopra of Hindustan Times also gave the film 4/5 stars, saying \"Bombay Talkies is a unique experiment that works very well. The collaboration between four leading directors suggests a confidence that was rare in the industry even a decade ago. I believe that things can only get better from here on.\"[15] Tushar Joshi gave the film 3.5/5 stars, adding that \"Bombay Talkies is a format that needs to be praised for its concept. The sequencing of the stories works and the pace is swift, never showing signs of lethargy. If this was a tribute to 100 years of cinema, then we need to have an array of directors from different genres pay such homages more often.\"[16] Similarly, Sukanya Verma gave the 3.5/5 stars, concluding that \"Bombay Talkies is an absorbing ode to the language of cinema that is part of our collective system.\" As for performances, she noted that \"it’s Rani Mukerji’s flawless artistry as an imprisoned soul wearing a mark of normalcy which elevates the emotional core of Johar’s story.\"[17] The duo of Banerjee-Nawazuddin creates magic on the screen in 30 mins, adapting Satyajit Ray's short story- Patol Babu, Film Star.[18][19][20]","box_office":"₹14.3 crore (equivalent to ₹17 crore or US$2.5 million in 2016)[2]","cinematography":"Anil Mehta Carlos Catalan Nikos Andritsakis Rajeev Ravi Ayananka Bose","production_company":"Flying Unicorn Entertainment","directed_by":"Karan Johar Dibakar Banerjee Zoya Akhtar Anurag Kashyap","Soundtrack":"The music in this movie is given by Amit Trivedi and lyrics by Amitabh Bhattacharya & Swanand Kirkire.\"Apna Bombay Talkies\" is the only song which brings legendary singers of 90's Kumar Sanu, Udit Narayan , Alka Yagnik & Abhijeet together for the first time that too with veteran singer S. P. Balasubrahmanyam. The song features all the singers according to the respective actors they have sung most of their hit numbers making this song one of its kind.","release_dates":"3 May 2013 (2013-05-03)|||||","bombay_talkies":"Theatrical release poster","produced_by":"Ashi Dua","starring":"Rani Mukerji Randeep Hooda Saqib Saleem Vineet Kumar Singh Nawazuddin Siddiqui Sadashiv Amrapurkar Naman Jain Katrina Kaif Amitabh Bachchan","running_time":"128 minutes","music_by":"Amit Trivedi","edited_by":"Deepa Bhatia","written_by":"Karan Johar Dibakar Banerjee Zoya Akhtar Anurag Kashyap Reema Kagti","budget":"₹6 crore (equivalent to ₹7.1 crore or US$1.1 million in 2016)[1]"}