{"country":"United States","countdown_to_zero":"Film poster","distributed_by":"Magnolia Pictures","language":"English","Critical reception":"A review in Daily Variety called the film \"highly creative documentary-making\" and concluded that the film makes \"a convincing argument that the human race is on borrowed time: Given the number of nuclear weapons in existence, the ease with which they can be made, the eagerness of terrorists to possess them and a worldwide cluelessness about nuclear security, it's only a matter of time before something terribly ugly happens. A politically urgent picture, it will also literally scare the breath out of what will certainly be a worldwide audience.\"[2] The trade journal also highly praised the special effects and cinematography for creating \"immaculate images\".[2] A review for Reuters said the film was \"convincingly argued and extremely polished\" and described portions as \"absolutely chilling.\"[11]The Wall Street Journal called the film \"hair-raising\" and noted that it was one of the rare documentaries to screen at Cannes.[19] Jason Solomons, writing for The Observer, said the film was one of \"five films to watch\" at Cannes.[15] The Guardian described the documentary as \"unmissable\" and \"the best horror film of all time\".[20]The Washington Times was highly critical of the film. Its reviewer said the documentary appeared to be produced by \"the peacenik movement\" and concluded, \"The pacifist message of the former is loud and clear: 'Our only option is to eradicate every last nuclear missile'...\"[7]","box_office":"$288,000[3]","cinematography":"Robert Chappell Gary Clarke Bryan Donnell Nick Higgins[2]","production_company":"Participant Media","directed_by":"Lucy Walker[1][2]","narrated_by":"Gary Oldman[2] (prologue)","release_dates":"January 25, 2010 (2010-01-25) (Sundance)|July 23, 2010 (2010-07-23) (United States)||||","Production":"The film features interviews with leading statesmen and experts, including Tony Blair, Jimmy Carter, Mikhail Gorbachev, Robert McNamara, Pervez Musharraf, and Valerie Plame.[1][2] The film prologue was narrated by Gary Oldman.[2] The musical score was composed by Peter Golub, and the rock band Pearl Jam contributed the song \"The Fixer.\"[2]It was developed, financed and executive produced by Participant Media[1][2] together with the World Security Institute.[8] The idea for the film first occurred to the producers when the Nobel Peace Prize was awarded to Al Gore after the success of his documentary about global warming, An Inconvenient Truth.[6] Diane Weyermann of Participant Media asked Walker if she was interested in directing a film about nuclear weapons, and Walker said yes.[9] More than 84 people were interviewed for the film.[9] Global Zero, an international organization promoting the elimination of nuclear weapons, provided production assistance for the film.[10]The film's closing credits contain a phone number to which a text message may be sent to protest the maintenance of high levels of nuclear arsenals and lax security regarding nuclear weapons and materials.[11]The film debuted at the Sundance Film Festival in 2010, where it screened at the Palais des Festivals out of competition.[1][12] At that time, Magnolia Pictures secured the North American theatrical distribution rights.[1] The film was screened privately for Secretary of State Hillary Rodham Clinton, and a portion of the film shown for the press at the National Press Club.[7][13]The film was accepted at the Cannes Film Festival, where it screened out of competition.[14][15]On July 19, 2010, REACT to FILM screened the film at the SoHo House in Manhattan, NY and moderated a Q&A with director Lucy Walker, former CIA agent Valerie Plame and producer Lawrence Bender.[16]Tad Daley, writer of the book Apocalypse Never was invited to speak at the film's debut in Washington, DC about the dangers of nuclear weapons. In an interview he said that it was a coincidence that the book and the movie came out virtually exactly at the same time and that Countdown To Zero and Apocalypse Never had the same ambition and that ambition is twofold: 1) to talk to ordinary folks about the nuclear peril and 2) that abolition should be the solution\".[17] A video promoting the movie was created with the assistance of Ploughshares, an award-winning literary magazine at Emerson College. The premiere screening took place at the E Street Cinema in Washington, DC and the shows have been sold out. These screenings brought in large crowds.[18]","produced_by":"Lawrence Bender[1][2]","running_time":"90 minutes[2]","music_by":"Peter Golub[2]","edited_by":"Brad Fuller and Brian Johnson[2]"}