{"based_on":"Cannery Row Sweet Thursday  by John Steinbeck","country":"United States","distributed_by":"United Artists MGM/UA Entertainment Company","screenplay_by":"David S. Ward William Graham","Plot":"The story is about the skid row citizens of Monterey, California, set during World War II. As declining fish stocks are shutting down a previously rich fishery and the dependent canning industry, bums and hookers lead colorful and adventurous lives in a balmy seaside setting.Doc (Nick Nolte), a self-employed marine biologist, lives in a dockside warehouse and researches octopuses. Suzy DeSoto (Debra Winger), a girl from the local bordello, is working there only out of necessity.A collection of linked vignettes describes life on Cannery Row. It is depicted as an impoverished area inhabited by a motley band of people who have experienced failures but somehow have found their niche and a community of strangely kindred souls.Doc and Suzy don’t quite fit in, but are accepted. Mac and the boys gather frogs and sell them to give a surprise party for Doc, which turns into a brawl, breaking Doc’s tank with his octopus collection. To make amends, they buy Doc a present of a microscope, but mistakenly get him a telescope instead.A deeper mystery revolves around why Doc stays in Cannery Row. Suzy discovers that Doc was once a professional baseball pitcher but quit. Another character, the Seer (Sunshine Parker), spends his days playing his horn. He depends on the gifts that mysteriously appear, such as groceries. Suzy eventually learns that the Seer is a former baseball player whom Doc injured with a pitch to the head, and now Doc takes care of him. Doc and Suzy ultimately find love.","cannery_row":"Theatrical release poster","language":"English","Reception":"Film critic, Roger Ebert, wrote of the film, \"The movie is almost always good to look at, thanks to Richard MacDonald's sets (he linked together two giant sound stages) and Sven Nykvist's photography. And Nolte and Winger are almost able to make their relationship work, if only it didn't seem scripted out of old country songs and lonely hearts columns. It's tough to pull off a movie like this, in the semi-cynical 1980s (it would have been impossible in the truly cynical seventies). I guess we no longer believe in the essential heroism of the little guy, and in the proposition that anyone can succeed with a little luck.\"[2]","box_office":"$5,301,539","cinematography":"Sven Nykvist","production_company":"Metro-Goldwyn-Mayer Chai Productions","directed_by":"David S. Ward","narrated_by":"John Huston","release_dates":"February 12, 1982 (1982-02-12) (United States)|||||","Production":"Raquel Welch was cast as Suzy, but was fired after the first few days of production. Welch sued the filmmakers and won a reported settlement of more than $10 million in court.[3][4][5]","produced_by":"Michael Phillips","starring":"Nick Nolte|Debra Winger|Audra Lindley|","running_time":"120 minutes","music_by":"Jack Nitzsche","edited_by":"David Bretherton"}