{"country":"United States","distributed_by":"Artisan Entertainment","Plot":"Steven Schoichet (Adrien Brody) is a recently unemployed ne'er-do-well who has difficulty expressing himself. Steven finds he has a knack for ventriloquism. Steven's best friend is Fangora \"Fanny\" Gurkel (Milla Jovovich), an aspiring punk rock singer who, along with Steven, is just looking for her niche. Eventually, Fanny takes a shine to klezmer music when she learns of an opportunity to get an actual gig. Through his newfound talent, Steven discovers that he is able to overcome his social problems through his dummy and decides to try impressing and winning the heart of Lorena Fanchetti (Vera Farmiga).","language":"English","Reception":"The film was given a limited release in the United States. Dummy made $30,130 from 5 theaters in its opening weekend. It made an additional $41,516 at the box office for a total domestic gross of $71,646.[1]Dummy received mostly positive reviews from film critics. Review aggregator website Rotten Tomatoes gave the film a 70% rating, based on 33 reviews, with an average rating of 6.1/10. The site's consensus reads, \"Dummy is a sweet family comedy that succeeds due to charming performances, even if the final product feels slightly undercooked.\"[4] The film currently holds a 48% rating on Metacritic, based on 12 critical reviews, indicating \"mixed or average reviews\".[5]","box_office":"$71,646[1]","cinematography":"Horacio Marquinez","production_company":"Quadrant Entertainment Dummy Productions LLC","dummy":"Theatrical release poster","directed_by":"Greg Pritikin","release_dates":"February 21, 2002 (2002-02-21) (AFM premiere)|September 12, 2003 (2003-09-12) (United States)||||","Production":"In May 2000, it was reported by Variety that Adrien Brody and Milla Jovovich had been cast in the film, Brody as the lead character of Steven, and Jovovich as the best friend of Brody's character.[2] The following month, in June 2000, it was announced that Illeana Douglas had joined the cast in a supporting role.[3] Vera Farmiga, Ron Leibman, Jared Harris and Jessica Walter were also cast in supporting roles. Brody (who had no previous experience as a ventriloquist) performed all of the ventriloquism and puppetry live during shooting, doing so without puppeteering stand-ins or voiceover dubbing. He was coached prior to and during production by veteran actor-ventriloquist-puppetmaker Alan Semok, who is credited in the film as special consultant and designer/creator of the title character.Principal photography took place in New York City, Wayne, New Jersey, and Long Island, New York in July and August 2000.","produced_by":"Bob Fagen|Richard Temtchine|","starring":"Adrien Brody|Milla Jovovich|Illeana Douglas|Vera Farmiga|Jared Harris|","running_time":"91 minutes","music_by":"Paul Wallfisch","edited_by":"William Henry|Michael Palmerio|","written_by":"Greg Pritikin"}