{"based_on":"In God We Trust: All Others Pay Cash  by Jean Shepherd","Cast":"In the DVD commentary, director Bob Clark mentions that Jack Nicholson was considered for the role of the Old Man; Clark expresses gratitude that he ended up with Darren McGavin instead, who later appeared in several other Clark films. He cast Melinda Dillon on the basis of her similar role in Close Encounters of the Third Kind. Peter Billingsley was already a minor star from appearing in many commercials and co-hosting the TV series Real People; Clark initially wanted him for the role of Ralphie, but decided he was \"too obvious\" a choice and auditioned many other young actors before realizing that Billingsley was the right choice after all. Ian Petrella was cast immediately before filming began. Tedde Moore had previously appeared in Clark's film Murder by Decree and was the only onscreen character from A Christmas Story who was played by the same actor in the sequel, My Summer Story. Jeff Gillen was an old friend of Clark's who had been in one of his earliest films.[8]The screenplay was written by Jean Shepherd, Leigh Brown, and Bob Clark. Several subplots are incorporated into the body of the film, based on other separate short stories by Shepherd. Shepherd provides the film's narration from the perspective of an adult Ralphie, a narrative style later used in the dramedy television series The Wonder Years. Shepherd, Brown and Clark have cameo appearances in the film: Shepherd plays the man who directed Ralphie and Randy to the back of the Santa line at the department store; Brown -- Shepherd's wife in real life -- plays the woman in the Santa line with Shepherd; Clark plays Swede, the neighbor the Old Man was talking to outside during the Leg Lamp scene.","country":"United States","distributed_by":"MGM/UA Entertainment Co.","Broadcasting and home video release":"The film first aired on television on HBO in 1985, and quickly attracted a growing following. In the late 1980s and early 1990s, the film began airing quietly on SuperStation WTBS and Superstation WGN.[38] In 1988, then-fledgling Fox aired the film the night after Thanksgiving.[38] In 1989–1990, TBS showed it Thanksgiving night, while in 1991–1992, they aired it the night after.[38]Turner Broadcasting has maintained ownership of the broadcast rights, and since the mid-1990s, aired the film increasingly on TBS, TNT, and TCM. By 1995, it was aired on those networks a combined six times on December 24–26,[38] and in 1996, it was aired eight times over those three days.[38]Due to the increasing popularity of the film, in 1997, TNT began airing a 24-hour marathon dubbed \"24 Hours of A Christmas Story,\" consisting of the film shown twelve consecutive times beginning at 7 or 8 p.m. on Christmas Eve and ending Christmas Day.[38] This was in addition to various other airings earlier in the month of December. In 2004, after TNT switched to a predominantly drama format, sister network TBS, under its comedy-based \"Very Funny\" moniker, took over the marathon. Clark stated that, in 2002, an estimated 38.4 million people tuned into the marathon at one point or another, nearly one sixth of the country.[8] TBS reported 45.4 million viewers in 2005,[39] and 45.5 million in 2006.[40] In 2007, new all-time ratings records were set,[41] with the highest single showing (8 p.m. Christmas Eve) drawing 4.4 million viewers.[41] Viewership increased again in 2008, with 8 p.m. Christmas Eve drawing 4.5 million viewers, and 10 p.m. drawing 4.3 million,[42] and 54.4 million total.[43] As of 2009, the film had been shown 250 times on the Turner family of networks.[43]In 2007, the marathon continued, and the original tradition was revived. TNT also aired the film twice the Sunday of Thanksgiving weekend (November 25). In 2009, the 24-hour marathon continued on TBS, for the 13th overall year, starting at 8 p.m. eastern on Christmas Eve.[44]In 2009, the film aired on TBS during a 24-hour marathon on Christmas Eve. The first viewing at 8 p.m. Eastern on December 24 earned a 1.6 rating (18-49) and beat the major broadcast networks (NBC, ABC, CBS, and Fox).[45] In 2010, the marathon averaged 3 million viewers, up 2% from the previous year, ranking TBS as the top cable network for the 24-hour period. The 10 a.m. airing on December 25 was seen by 4.4 million viewers, and the 8 p.m. airing on December 24 was close behind with 4.3 million viewers.[46] The marathons in 2011[47] and 2012 [48] continued to see increases in ratings.For the 2014 and 2015 editions of the marathon, Turner Broadcasting elected to simulcast it on both TNT and TBS, marking the first time since 2003 that TNT aired it as well as the first time the marathon is being carried by multiple stations; the two networks set their airings one hour apart (so that the TNT airings began while TBS was at the middle of the film).[49][50]A sequel involving Ralphie and his family, titled My Summer Story (originally released as It Runs in the Family), was made in 1994. With the exceptions of Tedde Moore as Ralphie's teacher (Miss Shields) and Jean Shepherd as the narrator (the voice of the adult Ralphie), it features an entirely different cast. A series of television films involving the Parker family, also from Shepherd stories, were made by PBS, including Ollie Hopnoodle's Haven of Bliss (1988), The Star-Crossed Romance of Josephine Cosnowski (1985), The Great American Fourth of July and Other Disasters (1982), and The Phantom of the Open Hearth (1976).Another sequel, A Christmas Story 2, was released straight to DVD and Blu-ray[51] in 2012 and directed by Brian Levant. It was filmed in New Westminster, British Columbia, Canada.[52]In 2000, a stage play adaptation of A Christmas Story was written by Philip Grecian.[53]In November 2012, A Christmas Story: The Musical, based on the film, opened on Broadway. Written by Benj Pasek and Justin Paul (music and lyrics) and Joseph Robinette (book), the musical opened to positive reviews.[54] The run ended December 30, 2012.[55] The musical was directed by John Rando with choreography by Warren Carlyle and featured Dan Lauria as Jean Shepherd.[56] The musical received Tony Award nominations for Best Musical, Best Book of a Musical (Robinette), and Best Original Score (Music and/or Lyrics) Written for the Theatre.[57]","Plot":"Nine-year-old Ralphie Parker wants only one thing for Christmas: a Red Ryder Carbine Action 200-shot Range Model air rifle with a compass in the stock and \"this thing which tells time\" (a sundial). Ralphie's desire is rejected by his mother, his teacher Miss Shields, and even a department store Santa Claus, all giving him the same warning: \"You'll shoot your eye out.\"Christmas morning arrives and Ralphie dives into his presents. Although he does receive some presents he enjoys, Ralphie ultimately is disappointed that he did not receive the one thing he wanted more than anything. After it appears all of the presents have been opened, Ralphie's father, who is referred to throughout the film as \"The Old Man,\" directs Ralphie to look at one last present that he had hidden. Ralphie opens it to reveal the Red Ryder gun he wanted.Ralphie takes the gun outside and fires it at a target perched on a metal sign in the backyard. However, the BB ricochets back at Ralphie and knocks his glasses off. While searching for them, thinking he has indeed shot his eye out, Ralphie accidentally steps on his glasses and breaks them. In order to cover for the fact that he accidentally broke his glasses, Ralphie tells his mother that a falling icicle was responsible for the accident. His mother, not having seen what actually happened, believes him.The film ends with Ralphie lying in bed on Christmas night with his gun by his side. A voiceover by an adult Ralphie states that this was the best present he had ever received or would ever receive.Although Ralphie's BB gun desire is the main plot point of the film, there are several other stories contained in the film. Among them:","language":"English","Release and reception":"Initially overlooked as a sleeper film,[23] A Christmas Story was released a week before Thanksgiving 1983 to moderate success, earning about $2 million in its first weekend.[24] Vincent Canby's mostly negative New York Times review[25] echoed the more common response.[citation needed] Roger Ebert suggested the film had only modest success because holiday-themed films were not popular at the time.[26] The film would go on to win two Genie Awards, for Bob Clark's screenplay and direction.[27]By Christmas 1983, however, the film was no longer playing at most venues, but remained in about a hundred theaters until January 1984.[8] Gross earnings were just over $19.2 million.[24] In the years since, due to television airings and home video release, A Christmas Story has become widely popular and is now an annual Christmas special. The film was originally released by Metro-Goldwyn-Mayer. The rights to the film were acquired by Turner Entertainment Co. after Ted Turner's purchase of MGM's pre-1986 film library. Subsequently, Time Warner purchased Turner Entertainment, and currently holds rights to the film.Over the years, the film's critical reputation has grown considerably and it is considered by some to be one of the best films of 1983.[28] Based on 52 reviews on Rotten Tomatoes, the film has an overall approval rating from critics of 89%, with an average score of 8.5/10. The site's consensus reads: \"Both warmly nostalgic and darkly humorous, A Christmas Story deserves its status as a holiday perennial.\"[29] On Metacritic, the film has a score of 77 out of 100, based on 8 critics, indicating \"generally favorable reviews\".[30] In his movie guide, Leonard Maltin awarded the film a rare[citation needed] four-star rating, calling the film \"Delightful\" and \"Truly funny for kids and grown-ups alike\" with \"Wonderful period flavor.\"[31]On December 24, 2007, AOL ranked the film their #1 Christmas film of all time.[32] IGN ranked the film the top holiday-themed film of all time.[33] In 2012, a Marist Poll named the film the most favorite holiday film in the U.S.[34]American Film Institute lists","box_office":"$19.3 million","a_christmas_story":"Theatrical release poster","cinematography":"Reginald H. Morris","production_company":"Metro-Goldwyn-Mayer","directed_by":"Bob Clark","narrated_by":"Jean Shepherd","release_dates":"November 18, 1983 (1983-11-18)|||||","Production":"Three of the semi-autobiographical short stories on which the film is based were originally published in Playboy magazine between 1964 and 1966.[9] Shepherd later read \"Duel in the Snow, or Red Ryder nails the Cleveland Street Kid\" and told the otherwise unpublished story \"Flick's Tongue\" on his WOR Radio talk show, as can be heard in one of the DVD extras.[10] Bob Clark states on the DVD commentary that he became interested in Shepherd's work when he heard \"Flick's Tongue\" on the radio in 1968. Additional source material for the film, according to Clark, came from unpublished anecdotes Shepherd told live audiences \"on the college circuit.\"[8]The film is set in the fictional Indiana town of Hohman, a fictionalized version of Shepherd's hometown of Hammond, Indiana. Local references in the film include Warren G. Harding Elementary School and Cleveland Street (where Shepherd spent his childhood). Other local references include mention of a person \"swallowing a yo-yo\" in nearby Griffith,[11] the Old Man being one of the fiercest \"furnace fighters in northern Indiana\" and that his obscenities were \"hanging in space over Lake Michigan,\" a mention of the Indianapolis 500, and the line to Santa Claus \"stretching all the way to Terre Haute, Indiana.\" The Old Man is also revealed to be a fan of the Bears (whom he jokingly calls the \"Chicago Chipmunks\") and White Sox, consistent with living in northwest Indiana.The school scenes were shot at Victoria School in St. Catharines, Ontario.[12]Director Bob Clark reportedly sent location scouts to twenty cities before selecting Cleveland, Ohio, as the principal site for filming. Higbee's department store in downtown Cleveland was the stage for three scenes in the film. The first is the opening scene in which Ralphie first spies the Red Ryder BB Gun in the store's Christmas window display. The second is the parade scene, filmed just outside Higbee’s on Public Square at 3 AM. The final scene is Ralphie and Randy’s visit to see Santa, which was filmed inside Higbee’s. The store kept the Santa slide that was made for the film and used it for several years after the film's release. Higbee's was known for its elaborate, child-centered Christmas themes and decorations, with Santa as the centerpiece until the store, which became Dillard's in 1992, closed for good in 2002.[13] Higbee's was exclusive to Northeast Ohio. As such, he was most likely referring to Goldblatts in downtown Hammond (with the Cam-Lan Chinese Restaurant three doors down on Sibley Ave.) The parade was filmed at night because, during the daytime, the 1960s Erieview Tower and Federal Building were visible from the Public Square, as was the BP Tower, which was under construction at the time.The exterior shots (and select interior shots, including the opening of the leg lamp) of the house and neighborhood were filmed in the Tremont section of Cleveland's West Side. The house used as the Parker home in these scenes has been restored, reconfigured inside to match the soundstage interiors, and opened to the public as \"A Christmas Story House\". The \"...only I didn't say fudge\" scene was filmed at the foot of Cherry Street in Toronto.In 2008, two fans from Canada released a documentary that visits every location used in the film. Their film, Road Trip for Ralphie, was shot over two years and includes footage of the filmmakers saving Miss Shields' black board from the garbage bin on the day the old Victoria School was gutted for renovation, discovering the antique fire truck that saved Flick, locating all the original costumes from the film, and tracking down the real-life location of the film's Chop Suey Palace in Toronto.[14]The Red Ryder BB gun was available beginning in 1938 and remains available today, but never in the exact configuration mentioned in the film. The Daisy \"Buck Jones\" model did have a compass and a sundial in the stock, but these features were not included in the Red Ryder model.[15] The compass and sundial were placed on Ralphie's BB gun, but on the opposite side of the stock due to Peter Billingsley being left-handed.[16]Director Bob Clark stated in the film's DVD commentary that he and author Shepherd wished for the film to be seen as \"amorphously late 30s, early 40s\".[17] A specific year is never mentioned in the film; however, numerous sources including The New York Times and CBS News have dated the film variously at 1940 to the early-1940s.[18][19][20][21]","produced_by":"Rene Dupont|Bob Clark|","starring":"Melinda Dillon|Darren McGavin|Peter Billingsley|","running_time":"93 minutes","music_by":"Carl Zittrer|Paul Zaza|","edited_by":"Stan Cole","written_by":"Jean Shepherd|Leigh Brown|Bob Clark|","budget":"$3.2 million[1]"}