{"country":"United States","distributed_by":"Lionsgate","dogma":"Theatrical release poster","Plot":"Bartleby (Affleck) and Loki (Damon) are fallen angels, banished for eternity from Heaven to Wisconsin for insubordination after an inebriated Loki (with Bartleby's encouragement) resigned as the Angel of Death. A newspaper article arrives by mail, in an envelope with no return address: The trendy Cardinal Glick (Carlin) has announced that he is rededicating his cathedral in Red Bank, New Jersey in the image of the \"Buddy Christ\". Anyone entering the cathedral during the rededication festivities will receive a plenary indulgence; all punishment for sin will be remitted, permitting direct entry into Heaven.[5] The angels have found a way home! They receive encouragement from an unexpected source: Azrael (Lee), a demon, once a Muse, also banished from Heaven (for refusing to take sides in the battle between God and Lucifer); and the Stygian Triplets (Barret Hackney, Jared Pfennigwerth, and Kitao Sakurai), three teenage hoodlums who serve Azrael in Hell.Bethany Sloane (Fiorentino)—a depressed, infertile, divorced abortion clinic employee—attends a service at her church in Illinois. Donations are being solicited to help a hospitalized, comatose homeless man—known only as John Doe Jersey (Cort)—who was beaten senseless outside a skee ball arcade in New Jersey by the Triplets. Later that day, Metatron (Rickman)—the Voice of God—appears to Bethany in a pillar of fire and declares that she is the last relative of Jesus Christ. He explains that Bartleby and Loki cannot be allowed to succeed: By re-entering Heaven, they would be overruling the word of God, thereby disproving the fundamental concept of God's omnipotence, and nullifying all of existence. She, together with two prophets who will appear to her, must stop the angels and save the universe.Now a target, Bethany is attacked by the Triplets, and is rescued by the two foretold prophets—drug-dealing stoners named Jay and Silent Bob (Mewes and Smith). Azrael then summons a Golgothan (a vile creature made of human excrement) to find and kill Bethany, but Silent Bob immobilizes it with aerosol deodorant. Other allies in Bethany's mission are Rufus (Rock), the thirteenth apostle (never mentioned in the Bible, he says, because he is black), and Serendipity (Hayek), the fickle Muse of creative inspiration, now working in a strip club in search of inspiration of her own.On a train to New Jersey, a drunken Bethany reveals her mission to Bartleby, who tries to kill her; a melee ensues, and Silent Bob throws the angels off the train. Bartleby and Loki now realize the potential consequences of their scheme; and while Loki wants no part of destroying all existence, Bartleby remains angry at God for his expulsion—and for granting free will to humans while demanding servitude of angels—and to Loki's horror, resolves to proceed.Bethany and her allies discuss the situation: Who told the angels about Glick's plenary indulgence in the first place, and why has God not intervened? Metatron explains that God's whereabouts are unknown; he disappeared while visiting New Jersey in human form to play skee ball. At the cathedral, the group attempts in vain to persuade Cardinal Glick to cancel the celebration; Jay angrily steals Glick's golf club.At a nearby bar, Azrael captures Bethany and her protectors and reveals that he sent the anonymous news clipping to the angels—he would rather not exist at all than spend eternity in Hell. Silent Bob kills Azrael with Glick's blessed golf club. Serendipity tells Bethany to bless the bar sink, turning its contents to holy water, and Jay, Rufus and Serendipity drown the Triplets in it. Bartleby and Loki reach the cathedral; Bartleby kills all the celebrants, and when Loki attempts to stop him he tears off Loki's wings, making him mortal. When the protectors block Bartleby's entry into the church, Bartleby kills Loki and fights off Rufus, Serendipity and Bob, but as he flees, Jay shoots off his wings with a machine gun.During his latest of several attempts to seduce Bethany, Jay mentions John Doe Jersey. Realizing that the homeless man is the mortal form that God assumed, Bethany and Bob race to the hospital. Bethany disconnects John Doe's life support, liberating God, but killing herself. As Bartleby again attempts to enter the cathedral, God manifests before him as a woman (Morissette), and kills him with the power of her voice. When Bob arrives with Bethany's lifeless body, God resurrects her and conceives a child within her womb. God, Metatron, Rufus, and Serendipity return to Heaven, leaving Bethany and the two prophets to reflect on what has happened.","language":"English","Reception":"The film was nominated for an Independent Spirit Award for Best Screenplay as well as a Science Fiction and Fantasy Writers of America honor for Best Screenplay.[citation needed]Dogma was the third-highest grossing film in its opening weekend, behind The Bone Collector and Pokémon: The First Movie.[6] The film grossed a domestic total of $30,652,890 from a modest $10 million budget.[1]Critic analysis of the film was generally positive; it has a 67% \"fresh\" rating on Rotten Tomatoes with the consensus: \"Provocative and audacious, Dogma is an uneven but thoughtful religious satire that's both respectful and irreverent.\" It fared better with fans, ranking 84% by the community.[7] On Metacritic, the film received a rating of 62 percent based on 36 reviews, and 7.7/10 by fans, based on 35 votes.[8] While some religious groups—in particular the activist Catholic League—angrily denounced the film as \"blasphemous\",[9] and others staged protests outside theaters screening the film,[10] critic Roger Ebert noted that there was no official objection from the Catholic Church itself. \"We are actually free in this country to disagree about religion,\" Ebert wrote, \"and blasphemy is not a crime.\"[11]The film was screened, but was not entered in competition, at the 1999 Cannes Film Festival.[12]","box_office":"$30.6 million[1]","cinematography":"Robert Yeoman","production_company":"View Askew Productions","directed_by":"Kevin Smith","Soundtrack":"The soundtrack album accompanying the film was released in the United States on November 2, 1999, by Warner Bros. Records. It features the film's orchestral score by Howard Shore, who receives sole credit on the album cover, and the song \"Still\" by Alanis Morissette, who wrote and produced it for the film. Stephen Thomas Erlewine of Allmusic gave the album a positive review, describing the score as \"alternately melodramatic and humorous\" and \"rich, effective\".[16]The London Philharmonic Orchestra performed tracks two through ten.","release_dates":"May 21, 1999 (1999-05-21) (Cannes)|November 12, 1999 (1999-11-12) (United States)||||","Production":"Aside from a few scenes filmed on the New Jersey shore, most of the film was shot in Pittsburgh, Pennsylvania.Critics expressed surprise at the film's eclectic casting, which Smith said was done deliberately to emphasize the contrasts between characters—Rickman as the powerful Metatron, for example, opposite Mewes as the hopelessly verbose stoner Jay, \"...a Shakespearean trained actor of the highest order next to a dude from New Jersey.\" Smith warned Mewes that he would have to take his acting to a higher level. \"I really impressed upon him that he had to be prepared for this movie. 'There are real actors in this one,' we kept telling him.\"[13] In response, Mewes memorized not only his own dialogue but the entire screenplay, because he \"didn't want to piss off that Rickman dude\".[14]Other unorthodox casting decisions included the Mexican actress Salma Hayek as Serendipity—\"the [Muse] who throughout history inspired all the geniuses of art and music, like Mozart and Michelangelo, and never got any of the credit\"—and singer-songwriter Alanis Morissette, as God. \"There's a Zen Buddhist serenity to Alanis that calls to mind something otherworldly,\" Smith explained. \"She's definitely ethereal in nature, even when not speaking, and she carries an air about her that played into the role.\"[13]Smith and his production partner Scott Mosier assembled a group of visual artists to realize their concept of a surreal, abstract environment \"somewhere between reality and unreality\": production designer Robert Holtzman, special effects supervisor Charles Belardinelli, creature effects supervisor Vincent Guastini, costume designer Abigail Murray, and director of photography Robert Yeoman.[13]In the publicity stills on the film's official website, Smith described a scene that did not make the final cut: a climactic face-off in the hospital between Silent Bob, the redheaded Triplet (with a burned-out face), and the Golgothan. The battle was to end with God, newly liberated, transforming the Golgothan into flowers.[15]","produced_by":"Scott Mosier","starring":"Ben Affleck|Matt Damon|Linda Fiorentino|Salma Hayek|Jason Lee|Alan Rickman|Chris Rock|","running_time":"128 minutes","Sequel":"In late November 2005, Smith was asked about a possible sequel on the ViewAskew.com message boards:Over a decade later, there has apparently been no further discussion.[18]","music_by":"Howard Shore","edited_by":"Kevin Smith|Scott Mosier|","written_by":"Kevin Smith","budget":"$10 million[1]"}