{"country_of_origin":"West Germany (1974–90) Germany (1990–98)","original_network":"ZDF ORF SRG","Evolution of concept":"The series took a noticeable turn towards psychological drama as time progressed and Derrick approached retirement age. Acting on a hunch, Derrick would ignore a number of possible suspects right from the start and, instead of doing the legwork often shown in police movies, would follow the main suspect to his or her favourite haunts and involve them in lengthy conversations, claiming that he had to get to know them better. Towards the end of the show the murderer, now revolted by what they had done, would then be prepared to confess to his or her crime without Derrick having to produce any further piece of evidence. Generally, there is little violence or bloodshed and no shoot-out at the end.This philosophy also held true to the last episode, \"Das Abschiedsgeschenk\" (\"The Farewell Gift\"). Originally, Derrick was supposed to die by the hands of one of the criminals he had incarcerated just as he is about to take a new job as the chief of Europol. But the violent end was eventually scrapped; while there is a shoot-out, no one is killed, and Derrick goes on into the dark city and towards a new life.","International popularity":"[5]","History":"All 281 60-minute episodes were written by veteran screenwriter Herbert Reinecker and produced by Helmut Ringelmann. As a rule, new Derrick episodes were broadcast on Friday night at 20:15. The series received enormous popularity and was aired in more than 100 countries worldwide.The series' discontinuation in October 1998 came as Horst Tappert had reached the age limit he had set himself.[citation needed] Horst Tappert is the only German actor who has ever had fan clubs abroad including the Netherlands and France.[2]In France Derrick is known as Inspecteur Derrick; in Italy, the show is called L’ispettore Derrick. In Chinese it is known as Dé li kè.","created_by":"Herbert Reinecker","executive_producer(s)":"Helmut Ringelmann","no._of_episodes":"281 (list of episodes)","original_release":"20 October 1974 – 16 October 1998","Derrick and Klein":"As the series begins Derrick has only recently been promoted from Hauptinspektor to Oberinspektor. The personal relationship between Derrick and his assistant, Klein, is characterized by Derrick's often annoyance over Klein which takes its form as sarcastic remarks to the point of rolling his eyes and shaking his head over his companion in front of witnesses and in public. The reason for this animosity remains unclear since Klein rarely makes any mistakes, yet Derrick seems to pick at him quite regularly. Klein on the other side never talks back and also never gives the slightest appearance of taking offense at this low-level bullying. These many minor episodes notwithstanding, the two work very professionally and organically as a team, however, with Derrick always as the leading partner. This behavior of Derrick becomes less noticeable as the seasons progress.Derrick hardly has any private life; a girl friend occurs only in two episodes. In one episode Derrick says, \"no, I am no longer married\"; Klein, on the other hand, does not seem to have any private life. However, as a younger inspector he seems to love getting statements from young, good-looking girls. In that respect and also in the way he goes about a case, Derrick resembles Lt. Columbo. However, as Umberto Eco has pointed out, Columbo is the obedient, seemingly helpless servant of a community of rich and powerful Californians while Derrick, elegantly dressed and impeccably behaved, always appears in control and superior even to the wealthy people he is tracking down.[citation needed]Just like an earlier television series, Der Kommissar (also written by Reinecker), Derrick features many prominent German and Austrian actors and actresses, including Luitgard Im, Armin Mueller-Stahl, Lilli Palmer, Heinz Bennent, Klaus Maria Brandauer, Horst Buchholz, Traugott Buhre, Cornelia Froboess, Johanna von Koczian, Uschi Glas, Karlheinz Hackl, Michael Heltau, Harald Juhnke, Curd Jürgens, Gudrun Landgrebe, Inge Meysel and Gusti Wolf. Many appear repeatedly throughout several of the seasons.For some reason, the series (as \"Detective Derek\" - 探长德里克) was popular in China. Reportedly it was also actually used to teach police officers and inspectors in proper procedure of tracing and solving criminal cases.[citation needed]The famous phrase \"Harry, hol schon mal den Wagen\" (\"Harry, bring the car 'round\"; implying \"we're done here\") [3][3] was attributed to Derrick and became part of popular culture in Germany and China as catch phrases. Actually, this phrase was never spoken in any of the 281 episodes; however, in the second episode of the series, \"Johanna\" (which premiered on 3 November 1974), Derrick orders Klein \"Harry! Wir brauchen den Wagen sofort!\" (\"Harry! We need the car immediately!\"). The exact same phrase was used by Erik Ode in the earlier TV Series Der Kommissar, where Fritz Wepper already played the character named Harry Klein, then the assistant to a different police inspector (played by Ode).It is unknown how exactly this phrase became attributed to Derrick, but one theory is that since Der Kommissar and Derrick were both created and written by screenwriter Herbert Reinecker, a TV critic may have attributed this phrase to the wrong one of Reinecker's series, after which it entered German popular culture as a catch phrase for Derrick. Horst Tappert did, however, speak this phrase in character as Stephan Derrick was as voice actor of his animated self in the 2004 animated feature film Derrick — die Pflicht ruft (Derrick — Duty calls). (See \"Beam me up, Scotty\" for a catch phrase with a similar background.) This animated film shed some satirical light on the ever-serious and sombre world of the original series, making fun of numerous clichés attributed to the series, including Harry's rumoured envy for Derrick always standing in the spotlight, while he, assistant for 25 years, always had to stand back behind his boss.","starring":"Horst Tappert Fritz Wepper Willy Schäfer","running_time":"60 minutes","Books":"Derrick was also used as the protagonist for a series of books published in Germany and Italy:","References in popular culture":"Derrick was briefly referenced in Marjane Satrapi's Persepolis. \"Inspektor Derrick\" is referenced in Elfriede Jelinek's \"Die Kinder der Toten\" [p. 461]The series was parodied on the Norwegian comedy show Åpen Post. It was humoristically claimed that NRK had bought the legal rights to produce dubbed remakes of the series' original episodes after the show stopped airing in Germany. However, NRK could not afford expensive remakes, leading to a very simplistic (and, in the viewers' eyes, ridiculous) approach to the show, involving uninspired actors and a strong want of action."}