{"based_on":"The Hundred and One Dalmatians  by Dodie Smith","country":"United States","distributed_by":"Walt Disney Home Entertainment","screenplay_by":"Jim Kammerud Brian Smith","story_by":"Jim Kammerud Dan Root Garrett K. Schiff Brian Smith","Plot":"In the year 1962, the Radcliffe family and their one hundred and one dalmatians are preparing to move to their \"Dalmatian Plantation,\" a home in the countryside with plenty of room for all of them. However, one of the puppies, Patch, feels ignored and wishes to be unique like his television hero, Thunderbolt. While watching the Thunderbolt Adventure Hour, he hears about a chance to appear on the show. He is accidentally left behind when his family leaves for the plantation, so he decides to head for the audition to meet his hero and win a guest spot on the show. He fails to impress the producers, allowing a jealous Lil' Lightning to manipulate them into making himself the hero of his own show. Depressed, Patch leaves and runs into Thunderbolt.Elsewhere in London, Cruella de Vil has returned, but she is under probation and a restraining order for her past behavior. No longer allowed to maintain her previous lifestyle, she attempts to soothe her fixation on spots with the help of Lars, a German artist. In order to inspire him, she restarts her hunt for the dalmatians, using a newspaper picture of Patch to find their new address.Patch's family finally becomes aware that he is missing and go back to London to find him. Cruella bails her former henchmen, Jasper and Horace, out of prison. She sends them in a stolen dog food truck to steal the remaining puppies. They succeed after dealing with Nanny, and they take them to Lars. When Cruella requests she be made a masterpiece from their fur, Lars refuses, not wanting them to be harmed. Angered, she has him bound and gagged and returns to her original plan of making a dalmatian fur coat.The captured puppies use the Twilight Bark to send a distress signal, which is picked up by Patch and Thunderbolt, and they set out to save Patch's family. On the way, they encounter Lil' Lightning, who follows them and convinces Thunderbolt not to use Patch's stealth plan but to openly attack. He frightens Jasper and Horace, but Cruella knocks him unconscious and he and Patch are captured. Lil' Lightning, believing his own scheme fulfilled, sneaks into the building and reveals that Thunderbolt is a fraud, and tells him that what he said a while ago was a lie to get him out of the way and finally be out of his shadow, before fleeing. Crushed by this revelation, and Thunderbolt telling Patch that he's really an actor, Patch falls into despair, but his siblings restore his spirit by reminding him that Thunderbolt escaped a similar predicament in one of the TV episodes. Patch breaks out and releases his family, but Thunderbolt remains behind, ashamed of himself for disappointing Patch. The dalmatians escape through the building's roof to Cruella's Panther De Ville, while having the villains stalled on where they are. Meanwhile, Thunderbolt escapes from his cage and frees Lars.The puppies steal a double-decker bus but Cruella, Jasper, and Horace discover the escape and pursue them in their stolen truck, a chase ensues through the streets of London, crashing through the filming of Lil' Lightning's new show in the process, and having him on the driving window. Cruella, Jasper, and Horace finally corner the dogs in an alley. Patch tries to hold them off while the others escape, but they are undaunted. Luckily, Thunderbolt arrives, having been driven to the scene by Lars, and fakes a heart attack, briefly gaining Lil' Lightning's sympathy and causing Cruella, in her distraction, to knock Jasper and Horace and incapacitate herself while Patch retreats back to the bus. He puts it in reverse, sending Cruella, Jasper, Horace, and Lil' Lightning scrambling into the Thames River, along with their stolen truck. As he and Thunderbolt stand triumphantly, Patch finally brings out a bark similar to Thunderbolt's.The police arrest Lil' Lightning, Jasper, and Horace, while Cruella, now driven completely insane, is sent to a mental institute. The Radcliffes and Nanny who were told by Jasper and Horace it was Cruella who made them do it arrive, along with Patch's parents, whom he introduces to Thunderbolt. They thank him, but he dismisses himself as simply an actor. Patch, on the other hand, is, in his eyes, \"a real, one of a kind wonder-dog\". After a newspaper montage reveals the fates of the characters, a post-credits scene shows Thunderbolt in his TV show with Patch as his new sidekick and the other puppies as extras, chasing the villain away into the sunset.","language":"English","Reception":"The film received positive reviews from critics. Rotten Tomatoes rating for it is currently 67% \"fresh,\" based on 6 reviews and has an average rating of 5/10, but without a consensus.[3]","production_company":"Walt Disney Pictures, DisneyToon Studios","directed_by":"Jim Kammerud Brian Smith","101_dalmatians_ii:_patch's_london_adventure":"DVD cover","release_dates":"January 21, 2003 (2003-01-21)|||||","produced_by":"Carolyn Bates Leslie Hough","starring":"Bobby Lockwood Barry Bostwick Samuel West Kath Soucie Susanne Blakeslee Jeff Bennett Maurice LaMarche Jason Alexander Martin Short","running_time":"74 minutes","music_by":"Richard Gibbs","edited_by":"Robert S. Bichard Ron Price","Release":"101 Dalmatians II: Patch's London Adventure was released direct-to-video on January 21, 2003. It is packed with bonus features, includes the behind-the-scenes footage \"Making of Dog-umentary\", music videos \"Try Again\" by Will Young and \"You're the One\" by LMNT, and some games. The film was re-released only on DVD on September 16, 2008. The DVD special edition featured the only new game \"Patch's Twilight Adventure\".[2] It was released on Blu-ray on September 3, 2012 in the United Kingdom, along with the UK Blu-ray release of 101 Dalmatians. The film is released on Blu-ray in June 2015 in the United States, following the Blu-ray Diamond Edition release of its prequel."}