{"based_on":"Clara's Heart by Joseph Olshan","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Mark Medoff","Plot":"The film tells the story of a family in crisis. The mother, Leona (Quinlan), escapes to Jamaica to grieve the loss of her baby daughter, Edith, who died of Sudden Infant Death Syndrome. While there she meets kindly housekeeper Clara Mayfield (Goldberg). Clara pulls Leona out of her depression with a blunt, no-nonsense style. Leona is so taken with her that she brings Clara back to their home in Baltimore to be housekeeper and nanny to young son David (Harris). At first he is resistant and sees her as an intruder, but as the parents are completely wrapped up in their own grief and dissolving marriage, David comes to trust Clara and to depend on her. Clara harbors her own dark secret, which when revealed, serves to firm the bond between these two very different, but loving, characters.","language":"English","Reception":"The film had a chilly reception with critics. Roger Ebert, In a 1 1/2-star review for the Chicago Sun Times, praised Whoopi Goldberg's performance but panned the film itself, writing, \"Goldberg is magnificent. The character belongs in a different film, even a different universe, from the rest of the ludicrous plot.\"[3] Recent praise for the film has appeared in an online article by film professor Robert Keser, who writes, \"Almost two decades after the release of Clara’s Heart, the film looks dated only in its virtues. As commercial cinema, it represents a classical control and modulation of storytelling, spinning its emotional threads patiently with no hammering close-ups and little pandering to the decoratively picturesque. Equally, the film seems sweetly unconscious of consumer culture that seeks to define us by acquisition and consumption: no brand names are touted, no recreational shopping montages display products to suggest meaning.\"[4]","box_office":"$5,194,491 (domestic)[1]","cinematography":"Freddie Francis","production_company":"MTM Enterprises","directed_by":"Robert Mulligan","release_dates":"October 7, 1988 (1988-10-07)|||||","Production":"The film marked a return to the director's chair for industry veteran Robert Mulligan, who had not made a film in six years after the critical and commercial failure of Kiss Me Goodbye. Film editor Sid Levin describes Mulligan as being \"a bit aloof\" during their first meeting but coming across as \"a caring, sensitive, decent man.\" Mulligan was tense during the shooting period, however, and grew angry when Levin expressed his concerns over the scenes involving actor Spalding Gray. Not until principal photography was finished was Mulligan willing to discuss alternative ideas with Levin in the editing room. They wound up finding common ground over one of the crucial scenes towards the end of the film, in which Clara confesses to David the truth about her son. When Mulligan realized that actress Whoopi Goldberg had improvised the sequence too negatively, Levin was able to edit the sequence in such a way to make it feel less dark.[2] Filming included several locations in Talbot County, Maryland. The opening scene, a funeral, was filmed at the historic Oxford Cemetery in Oxford, Maryland. The mansion home of Bill (Michael Ontkean) and Leona Hart (Kathleen Quinlan), and her young son, David (Neil Patrick Harris) is found on Old Country Club Road, adjacent to Maryland State Route 33 near Easton, Maryland. Other locations included Saint Michaels, Maryland, Baltimore, Maryland, New York and Port Antonio, Jamaica.","produced_by":"Martin Elfand","starring":"Whoopi Goldberg Michael Ontkean Kathleen Quinlan Neil Patrick Harris Spalding Gray","running_time":"108 minutes","clara's_heart":"Theatrical release poster","music_by":"Dave Grusin","edited_by":"Sidney Levin"}