{"based_on":"Quitters, Inc. and The Ledge by Stephen King","country":"United States","distributed_by":"MGM/UA Entertainment Co.","Plot":"A stray grey alley tom tabby cat is chased by a dishevelled St. Bernard dog, and nearly gets run down by a red 1958 Plymouth Fury (named Christine according to its fender sticker). He hides from the dog in a delivery truck, which drives to New York City. The tomcat hears the disembodied voice of a young girl (Drew Barrymore) pleading for help because something is threatening her. The cat is then captured by an employee from Quitters, Inc.Cigarette smoker Dick Morrison (James Woods) is advised by a friend to join Quitters, Inc. to kick his habit. Clinic counselor Dr. Vinnie Donatti (Alan King) explains that the clinic has a 100% success rate due to a uniquely persuasive method: every time Dick smokes a cigarette, horrors of increasing magnitude will befall his wife and child.Using the tomcat that Donatti's assistant Junk has caught in the street, Donatti demonstrates the first of these horrors: the cat is locked in a cage and tormented (albeit harmlessly) with electric shocks. Donatti explains that if his new client should be caught with a cigarette, Dick's wife Cindy will be subjected to the same shocks while he is forced to watch. For subsequent infractions, his young daughter afflicted with down syndrome will be subjected to the shocks, then his wife raped, and after the fourth infraction, they give up (i.e. kill him). Not wanting to worry them, Dick hides the looming threat from his family.That night, Dick is angered by the methods Quitters uses and notices an undisposed pack of cigarettes in his desk. He prepares to smoke it, but notices a set of feet in his closet, realizing Quitters Inc. is serious about their threat to ensure he is not smoking. The following day, Dick visits his daughter (also played by Drew Barrymore) and gives her a doll. Donatti is also at the school, warning Dick that if he strays the only thing his daughter would understand is that someone is hurting her because her father misbehaved. Morrison resolves to never let that happen, and Donatti hopes so for her sake.Two weeks later, Dick is at a party where he is the only guest not smoking. He feels trapped by everyone enjoying themselves while he must stick to Donatti's regimen, but resists tempatation and declines an offer to \"go with the gang\" and smoke.During a stressful traffic jam, Dick loses his will and smokes after finding an old forgotten pack of cigarettes in his glovebox, not realizing he is being watched by Junk in a nearby car. After watching Cindy suffer in the electric cage, an enraged Dick attacks Donatti and Junk, allowing the tomcat to escape in the scuffle. After regaining the upper hand Donatti says he understands and forgives Dick. Dick is determined never to smoke again and tells his wife everything, after which they embrace.Time passes, and Dick is apparently smoke-free at last, but has put on a little weight as a result of quitting. Dr. Donatti prescribes diet pills and sets a target weight for Dick. Dick jokingly asks what will happen if he continues to gain weight; if a man would attack his house with a flame thrower. Donatti chuckles and says that's not what they have in mind; instead someone will cut off his wife's pinky finger. Later Dick and his wife have a dinner party with the friends that recommended Quitters, Inc., and they toast the company for a job well done. As she raises her glass, Dick discovers Donatti was not joking around: his friend's wife is missing her little finger.The tomcat (having escaped Quitters, Inc. and left Manhattan via the Staten Island Ferry) briefly befriends a group of vagrants (who feed him a hot dog) and then travels to Atlantic City, New Jersey, where it hears the same disembodied girl's voice asking for his help. Meanwhile, gambler and former tennis pro Johnny Norris (Robert Hays) is involved with a woman whose estranged but jealous husband is crime boss and casino owner Cressner (Kenneth McMillan). Cressner, who will bet on anything, wins a wager that the cat will successfully cross the busy road outside his casino. He takes the tomcat home.Cressner has Norris kidnapped. As an amusing form of revenge, Cressner blackmails Norris into a dangerous ordeal: Norris must circumambulate the narrow exterior ledge of Cressner's penthouse apartment in a gothic skyscraper. If he can make it all the way around, Cressner will grant his wife a divorce. If Norris refuses, Cressner will call the police and have him arrested for possession of drugs, which have been planted in Norris' Mustang by a henchman named Albert (Mike Starr), a.k.a. \"Ducky\" for his T-shirt that depicts a cartoon duck.Norris agrees. During the circumambulation attempt Cressner and Ducky appear by windows to keep Norris from \"cheating\", and Cressner turns on a fire hose at the halfway point, which is a roomier section of the ledge, to keep Norris from lingering. Despite their harassment and a moment alone when Norris is hanging from a dislodged neon sign, Norris makes it back to the apartment, where Norris learns Mrs. Cressner has been dead the whole time. Cressner slyly claims he honors his bet to the letter of the law, in which the drugs have been removed; Norris can have a bagful of cash and \"his wife\", as evidenced by her severed head. Enraged, Norris springs upon Cressner, surprising him, while his gunman drops his firearm when tripped-up by the fleeing cat. Norris takes the gun, kills the henchman, and turns it on Cressner. Norris forces Cressner to undergo the same ordeal on the ledge, but the casino owner is far less successful as he ends up running into the same foot-pecking pigeon that earlier hassled Norris, causing Cressner to slip and fall to his death, while the escaped tomcat watches.The tomcat hops a freight train and travels to Wilmington, North Carolina, where it is adopted by a little girl, Amanda (Drew Barrymore), who names him General. The cat runs afoul of the girl's mother (Candy Clark), who believes he will harm their pet parakeet, Polly.Despite Amanda's protests, the mother puts General out at night. As a consequence, he is unable to protect Amanda from a small, malevolent troll that he witnessed take up residence in the house. When Amanda sleeps, the troll emerges via a retractable hole in one of the walls in Amanda's room. The troll slays the parakeet with a tiny dagger and then tries to steal Amanda's breath. General finds a way into the house and battles the troll. After luckily wounding the cat's shoulder with his dagger, the troll quickly finds itself outmatched by an enraged General. It successfully flees, leaving Amanda and her parents to discover the death of the bird. The parents are convinced that General killed Polly, but the father discovers a wound on the tomcat too large to have been caused by a parakeet. He starts to doubt the mother's belief that General slew the bird.General is then taken to the animal shelter by the mother and is scheduled to be euthanized the next day (at the mother's request). When night falls, the tiny troll emerges from a retractable hole in Amanda's wall. It uses a small rubber bookshelf to wedge the child's room door shut from the inside. Again it attempts to take the sleeping girl's breath. Meanwhile, at the animal shelter, a relaxed looking General is brought his last meal. But when his cage is opened, the wily feline explodes into action. He escapes and rushes back to Amanda's. Determined to defend the child at any cost, General makes his way down the chimney.General arrives in the nick of time to save Amanda, and again battles the troll, causing a great deal of noise. Knowing that he is no match for the cat, the small creature tries to flee. But General cuts off the troll's escape route by knocking down a thick hardcover storybook, covering the wall hole. Grabbing on to a bunch of mylar balloons, the troll tries to float out of the furious cat's reach, landing on Amanda's record player. The quick witted tomcat then uses the record player to hurl the troll into a box fan, slicing it to bits. The ruckus awakens Amanda's parents, who are initially prevented by the blocked door from reaching her. Once they break into her room, the girl explains to them that General saved her from the troll. The parents are at first unwilling to believe the story until parts of the troll's dismembered corpse are discovered, as well as the tiny dagger that caused General's wound. Amanda uses the justification that General will keep her safe in case others like her first assailant appear, and General is allowed to stay inside at night to act as a protector for Amanda. The valiant tomcat finally has a loving home.","language":"English","box_office":"$13,086,298[1]","cinematography":"Jack Cardiff","production_company":"De Laurentiis Entertainment Group","directed_by":"Lewis Teague","Awards":"The film was nominated for the International Fantasy Film Award for Best Film in 1987. Drew Barrymore was nominated for the Young Artist Award for Best Starring Performance by a Young Actress in a Motion Picture in 1986.","release_dates":"April 12, 1985 (1985-04-12)|||||","produced_by":"Dino De Laurentiis Martha Schumacher","starring":"Drew Barrymore|James Woods|Alan King|Kenneth McMillan|Robert Hays|Candy Clark|","running_time":"94 min.","music_by":"Alan Silvestri","cat's_eye":"Theatrical release poster","edited_by":"Scott Conrad","Release":"Cat's Eye received mixed to positive reviews from critics, as the film currently holds a 67% rating on Rotten Tomatoes based on 24 reviews.The film was released theatrically in the United States by MGM on April 12, 1985. It grossed $13,086,298 at the domestic box office.[1]The film was released on DVD by Warner Home Video in 2004.[2]","written_by":"Stephen King","budget":"$7 million"}