{"country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"John Sayles","story_by":"Amy Robinson","Plot":"The film is about a romance between an upper middle class Jewish girl named Jill Rosen (Arquette), who is bound for Sarah Lawrence College, and a blue-collar Italian boy nicknamed the Sheik (Spano) in late 1966 New Jersey, who aspires to follow in Frank Sinatra's footsteps.The movie follows their high school experiences during their romance: Jill's success in high school acting productions, Jill's rebuffing Sheik's sexual advances, Sheik's one-night stand with a sexually active friend of Jill's, and a subsequent suicide attempt by that friend.Eventually, Sheik is expelled from school, and after an attempted robbery and subsequent pursuit by local police, Sheik goes to Miami, Florida, while Jill subsequently leaves for her first year at Sarah Lawrence in the fall of 1967. At one point in her first year, Jill visits Sheik in Florida, and although she sees clearly how little he has going for him (he has found work in a nightclub washing dishes and, on weekends, lipsynching to Frank Sinatra recordings), she chooses to have sex with him, for their first (and only) time. In the moments before they undress, their conversation turns to his odd nickname, which he had not explained to Jill when they dated in high school. \"Sheik\" is brand of condoms, he explains--\"like Trojans.\"Some time after Jill returns to college, Sheik arrives at work to find that he has been unceremoniously replaced by a real singer, albeit one with no great talent. This humiliation makes Sheik self-aware of his almost non-existent opportunities for career success (in any endeavor), and in response, he steals a car and makes the long drive from Miami to New York, propelled by the romantic notion of reuniting with Jill.Jill's initial college experience has not been easy or happy: she has not met with the acting or social success she had in high school. Yet, the act of consummating her desire for Sheik has led her to realize that she does not love him, for having had sex with him has moved her past the point of romantic and sexual wonder, and left her seeing that they inhabit different social worlds (or more precisely, different class strata). When Sheik arrives at Sarah Lawrence and does not, at first, find Jill, he violently trashes her room and waits for her return. When she does and he declares his love for her, she tells him plainly that she does not love him. Sheik briefly resists her response and then, in a moment of quiet dignity, accepts it. This exchange between them (and the movie) ends with a moment of gentleness and kindness. Jill then reaches out to Sheik, and asks him as a favor--for them both, in a sense--if he will take her to a college dance, for which she has otherwise been unable to find a date. The movie ends with this dance, and this final scene also registers the quick change of pace in popular culture in the mid-1960s. In the midst of the dance, either Jill or Sheik (the film does not identify which one) makes a \"request\" of the rock band that is performing, which is that the band, incongruously, perform \"Strangers in the Night\", the Sinatra hit that had been a key part of the soundtrack, as it were, of their high school romance. The film ends with them looking into each other's eyes and slow-dancing.","language":"English","Reception":"Film critic Janet Maslin discussed the music in the film and wrote, \"Music is a major part of Baby, It's You, as the title may indicate. The score consists of rock songs that more or less correspond to the time, although Sheik's entrances are accompanied by Bruce Springsteen songs; these may be anachronistic, but they suit Sheik to a T. These touches, as well as the generally impeccable period details and the evocative cinematography by Michael Ballhaus (who shot many of R.W. Fassbinder's later films), suggest that Baby, It's You was a labor of love for everyone involved.\"[4]Critic Dennis Schwartz wrote, \"It was for indie filmmaker Sayles his first film to be made with financial backing by a major studio (Doubleday backed it and Paramount bought it), but he swore it would be his last as he was pissed that he lost final editing cut. For Sayles this is lighter fare than what he usually tackles, but he fights through all the teenage clichés to give his own spin on this romance, the significance of social-class differences, how it is to finally grow up by listening to your heart and to change with the times.\"[5]Wins","box_office":"$1,867,792","cinematography":"Michael Ballhaus","production_company":"Double Play","directed_by":"John Sayles","release_dates":"April 4, 1983 (1983-04-04) (United States)|||||","Production":"The film wasn't actually produced by the studio but financed on the basis of a distribution commitment. As a result, during post-production, Paramount executives began criticizing the downbeat ending of the film and the choice of classic pop music on the soundtrack. Sayles fought his way through the test screening process and was able to get his cut released but in retaliation the studio half-heartedly promoted it.There was a significant delay in its DVD release, which was primarily due to having to pay an expensive price for permission to use the Bruce Springsteen music found in the movie soundtrack. However, since July, 2008, Baby It's You has been available on DVD.","produced_by":"Griffin Dunne Amy Robinson","starring":"Rosanna Arquette|Vincent Spano|","running_time":"105 minutes","baby_it's_you":"Theatrical release poster","music_by":"Todd Kasow","edited_by":"Sonya Polonsky","budget":"$3,000,000[1]"}