{"Cast":"Many of the characters in the film are fictionalised versions of historical figures:","country":"India","distributed_by":"Dreamz Unlimited","screenplay_by":"Santosh Sivan Saket Chaudhary","Plot":"The film chronicles the early part of the life of Emperor Asoka. It begins with his career as a General in Takshashila (modern-day Punjab) and ends with the bloody conquest of the Kalinga country (modern day Odisha State)Emperor Chandragupta Maurya, grandfather of Asoka, of the Maurya empire, has decided to embrace Jainism and abdicate the throne of the empire in favour of his son Bindusara. But his grandson, Prince Asoka, claims his sword. The old emperor explains that this sword is evil and the sword demands blood and destruction.A few years later, Prince Asoka Maurya (Shah Rukh Khan), now a brave youth, is battling the rebellious chief of Taxila for his Emperor and father. He figures that his elder half-brother Susima Maurya (Ajith Kumar), who also has an eye on the throne of the empire, has deliberately withheld reinforcements from arriving, but defeats the enemy nevertheless. Asoka returns to the capital victorious and confronts Susima. Later, Susima tries to assassinate Asoka while he is bathing. The fight among the princes makes the Emperor unhappy and he orders Empress Dharma (Subhashini Ali) to control her son Asoka. She compels Asoka to temporarily leave the capital to lead the life of a common man. The Prince is disappointed but leaves nonetheless.Asoka, alone and disguised as an ordinary traveller, rides to the south. In his travels, he meets a lovely maiden, Kaurwaki (Kareena Kapoor) and falls in love with her. He also develops a good relationship with her little brother Arya. They are on the run from the Kingdom of Kalinga along with their faithful protector Bheema (Rahul Dev) and are being chased by soldiers of the Kingdom. After saving their lives, Asoka introduces himself as Pawan, hiding his true identity. Kaurwaki and Arya are the Princess and Prince of Kalinga, who fled from their kingdom when the Prime Minister assassinated their parents and took over power. Later, Asoka and Kaurwaki get secretly married.Soon, Asoka is summoned by Emperor Bindusara to the capital. The Emperor dispatches Asoka to quell a rebellion in Ujjaini. Before marching to the west, Asoka travels to Kalinga to meet Kaurwaki and Arya. Unable to find them, and not knowing they have gone into hiding, he is informed by General Bheema that they were slaughtered. A heartbroken Asoka attempts suicide, but is saved by Virat (Danny Denzongpa), who later swears to protect him. Mad with grief and anger, Asoka leads a brutal crackdown in Ujjaini. The assassins sent by Susima injure Asoka in a battle and Virat saves him. He is taken to a Buddhist monastery at Vidisa to recover.There, he meets a Buddhist maiden, Devi (Hrishita Bhatt), who cares for him. Asoka also survives another assassination attempt at Vidisa, this time with the help of Devi. Asoka marries Devi and returns in splendour to Pataliputra. Susima and his brothers are wild with anger from their futile attempts to eliminate Asoka. Emperor Bindusara, who favoured Susima over Asoka, becomes ill and dies. In another vigilante attack, Queen Dharma is stabbed to death by assassins sent by Susima. Angered, Asoka kills Susima and is appointed emperor.A few months later, princess Kaurwaki and prince Arya return to Kalinga with Bheema and have the Prime Minister executed for treason. Asoka declares war on Kalinga, not knowing that Kaurwaki is alive. Kaurwaki still does not know that Asoka is Pawan, and both sides prepare for war.A terrible war is fought in Kalinga. The Maurya army inflicts a crushing defeat on Kalinga. Not content with mere victory, Maurya soldiers butcher everyone in sight. General Bheema is slain and Kaurwaki is wounded. Asoka later visits the battlefield, where he discovers his horse, who was supposed to be in Kaurwaki's possession. With a surge of hope, he frantically searches for Kaurwaki and finds her. They have a heart-to-heart talk and he apologises deeply for his actions. He is interrupted by Arya, who is dying after being pierced with arrows. With Arya dying in his arms, Asoka suddenly realises that his enemies, his family, and even Arya, are all dead because of him. His grandfather's warning about the sword had been correct.The film ends with Asoka throwing the sword into the water at the same spot as his grandfather, and embracing Buddhism. The final narrative describes how Asoka not only built a large empire but spread Buddhism and the winds of peace throughout the empire.","Extended version":"The extended version of the film included scenes of Krishna Sharma playing Rani, a girl favoured by Asoka's mother to be his bride.","language":"Hindi","Reception":"Aśoka grossed ₹19.39 crore (US$2.9 million) in India and $1.8 million (₹8.64 crore) in other countries, for a worldwide total of ₹28.03 crore (US$4.2 million), against its ₹12.50 crore (US$1.9 million) budget. It had a worldwide opening weekend of ₹8.66 crore (US$1.3 million), and grossed ₹13.98 crore (US$2.1 million) in its first week. It is the 13th-highest-grossing film of 2001 worldwide.It opened on October 26, 2001, across 235 screens, and earned ₹1 crore (US$150,000) nett on its opening day. It grossed ₹2.87 crore (US$430,000) nett in its opening weekend, and had a first week of ₹5.26 crore (US$780,000) nett. The film earned a total of ₹11.54 crore (US$1.7 million) nett, and was declared \"Flop\" by Box Office India.[1] It is the 13th-highest-grossing film of 2001 in India.[14]It had an opening weekend of $800,000 (₹3.84 crore) and went on to gross $1.07 million (₹5.13 crore) in its first week. The film earned a total of $1.8 million (₹8.64 crore) at the end of its theatrical run.[1] Overseas, It is the 4th-highest-grossing film of 2001.[15]The portrayal of Asoka in the film proved controversial in India.[16] \"Shahrukh's Asoka is all bluster and mannerism, with no depth. Except for the nosebleeds and the mudbaths, he is the same Shahrukh of every other movie that he has acted in. The film leaves its many complex moments unexplored and disjointed, choosing to pitch it as a love story instead of an epic tale of war and peace,\" an Indian reviewer wrote.[17] \"Made for a western audience, Asoka has clearly alienated the Indian one,\" Indian magazine Outlook wrote after the failure of the film.Peter Bradshaw of The Guardian called the film \"a big, brash and deeply enjoyable Bollywood epic\". He stated \"This movie's narrative gusto, its intricate, indirect eroticism – no sex, or even kissing – its lavish musical numbers and its sheer self-belief are a treat.\"[18] Christopher Tookey, the film critic of the Daily Mail, wrote \"here at last is a Bollywood movie that deserves to be seen by everyone.\" He called Asoka \"a majestic epic on the scale of Gladiator. The battle scenes are as impressive as anything in Braveheart, and were achieved for a tiny fraction of the budget.\"[19] The Sunday Times said \"it is sexy without one kiss and savage without indulging in gore and deserves to be this year's Crouching Tiger, Hidden Dragon\".Neil Smith described the film; \"with elements of both Gandhi and Braveheart, Asoka is a big, sprawling epic that looks every rupee it took to bring it to the screen.\"[20] However, BBC's Santosh Sinha noted, \"It is at this point in the film [when the prince go into hiding as per the request of the mother Queen] that Asoka is temporarily lost and Shahrukh Khan the actor takes over. He meets Princess Kaurwaki in the forest and then chases her around in a typically Bollywood way. He [Khan] is also less convincing when, grieved by the loss of life in Kalinga, he renounces violence and vows to spread the message of peace far and wide. This comes across as melodramatic. Bollywood style, Asoka finds Kaurwaki and the young Prince Arya of Kalinga on the battlefield. Prince Arya manages a dying speech before he keels over and that breaks Asoka completely.\"[21]Variety's David Rooney states, \"a sprawling widescreen historical epic laced with Bollywood musical numbers, melodramatic romance, spectacular locations and violent battle scenes. Coming on the heels of Ashutosh Gowariker's Lagaan: Once Upon a Time in India, \"Asoka\" provides further evidence that Bollywood is poised for wider commercial impact beyond its already substantial established niche. And while the ambling, uneconomical nature of popular Indian storytelling makes major crossover business unlikely in this case, some degree of general art-house attention appears indicated. Khan cuts a dashing figure as a soulful hunk in the traditional Bollywood mould, while Kapoor plays ornately tattooed Kaurwaki as a lively mix of flirtatious coquette and feisty warrior woman, kind of like Jennifer Lopez meets Michelle Yeoh.\"[22] Empire praised the movie gave it 4 out of 5 stars. It states,\"Santosh Sivan may just be the man who provide that elusive Indian crossover hit with this rip-roaring historical adventure. The fact that Asoka was such a bloody warrior is no more ably demonstrated than when the battle scenes kick in near the end, it's like Akira Kurosawa goes Bollywood.\"[23]Critics generally praised the cinematography of Santosh Sivan.[16]","cinematography":"Santosh Sivan","directed_by":"Santosh Sivan","Soundtrack":"The soundtrack features six songs composed by Anu Malik. Gulzar wrote the lyrics for five songs while one song was written by Anand Bakshi. Sandeep Chowtha was the guest composer for the instrumental piece \"Asoka theme\"; he also composed the background score of the film.","Awards":"The film further received four Filmfare nominations, seven Zee Cine Award and six Star Screen Awards including Best Film and Best Actress for Kareena Kapoor.","narrated_by":"Suresh Oberoi","Differences from history":"All the characters in the film (from the Maurya empire and Kalinga) speak modern Hindi opposed to the ancient Prakrit dialects spoken in the 3rd century BCE. The names of the historical figures in the film are also changed in accordance with modern Hindi.\"And yet, as far as historical accuracy is concerned, there's a surprising result: though the whole Pawan/Kaurwaki episode is fantasy, the film mostly avoids messing around with the known facts\", wrote historian Alex von Tunzelmann.[6]","release_dates":"26 October 2001","Production":"\"I was dancing in a train for a song in a movie (Chaiya Chaiya on the sets of Mani Ratnam's Dil Se) that Santosh Sivan was lensing, and he came up to me between shots and told me about Asoka,\" says Shah Rukh Khan. \"I could only understand half of what he said but I could see the determination in his eyes, and that, somehow or other, he would make it with or without me. That's 80% of the battle won. I was hooked.\"[8][9]The director, along with principal costume designer Anu Vardhan, started working on the project two years before they started the actual shooting of the film. Though Anu agrees that there was no concept of wearing vests during that era, certain cinematic liberties have been taken because Shahrukh did not wanted to shoot shirtless through out the film. \"After all, it is a main stream commercial film. During Shah Rukh's forest sequences, he wears square pieces of a blanket-like-material, folded into two and cut in between, to pass around the neck. Another piece of cloth was tried around his waist, acting as a belt. There was no stitching involved.\" Anu explains \"While researching for the film, we discovered that Body Art was a prominent part of that time. For the character of Kaurwaki, (Kariena) we used different designs of tattoos.\" The armours and shields worn by the artistes also form an important part of the costume for the final war sequences. Metal jackets composed of special fibre glass were made for around 4000 members of the cast. \"These metal jackets are extremely light and comfortable and were made in Madras by more than 50 workers,\" she explains.[10]\"I also tried to give the different parts of the film different looks: for example when the viewer is taken to Magadha (Bihar), the temples and houses have been made using black granite while when we are in Kalinga (Orissa) I have used brown sandstone and earth tones to generate a different feel. Also I worked with only six pillars in the film, it is hard to imagine that once you see the film\", says Sabu Cyril.[11]The film was locations such as Panchmarhi (bulk of the romance between Asoka and the princess), Maheshwar (the palace intrigues of Pataliputra), Madhya Pradesh, Jaipur (battle scenes), Igatpuri and Bhubaneswar (the Kalinga portions). More than half the film was shot indoors on the studio floors of Film City and Filmistan[7][12] The elaborate final battle scene (the battle fought against the Kalingas) employed over six thousand extras and hundreds of elephants. Some of the actors portraying warriors in the film were masters of Kalari, who used their expertise. They were the only ones to use real weapons in the filming. The song \"Raat Ka Nasha\" was picturised at Bhedaghat and Panchmarhi in Madhya Pradesh amidst the Narmada River.[2][11][13]The film is also known for using minimal special effects.[7] While Lagaan was made at considerable expense, Asoka had only a moderate budget. Sivan says he didn't want any special effects, and no digitally augmented crowds.[8]","produced_by":"Shah Rukh Khan Juhi Chawla","starring":"Shah Rukh Khan Kareena Kapoor Hrishita Bhatt","running_time":"171 mins","music_by":"Sandeep Chowta Anu Malik","edited_by":"A. Sreekar Prasad","budget":"₹12.50 crore (US$1.9 million)[1]","Location":"Madhya Pradesh is a central state of India."}