{"country":"United States United Kingdom","distributed_by":"Momentum Pictures (UK)|Samuel Goldwyn Films (US)|","Plot":"In 1796, William Wilberforce is severely ill and taking a recuperative holiday in Bath, Somerset, with his cousin, Henry Thornton. It is here that William is introduced to his future wife, Barbara Spooner. Although he initially resists any romantic overtures, she convinces him to relate the story of his career.The story flashes back 15 years to 1782, and William recounts the events that led him to where he is now. Beginning as a young, ambitious, and popular Member of Parliament (MP), he experiences a religious enlightenment and aligns himself with the evangelical wing of the Church of England. William contemplates leaving politics to study theology, but is persuaded by his friends William Pitt, Thomas Clarkson, Hannah More, and Olaudah Equiano that he will be more effective doing the work of God by taking on the unpopular and dangerous issue of the abolition of the British slave trade. His conviction in the cause deepens following a meeting with his former mentor John Newton (introduced sweeping a church floor dressed in sackcloth) who is said to live \"in the company of 20,000 ghosts... slaves\". As a former slave ship captain turned Christian, he deeply regrets his past life and the effects on his fellow man. Newton urges William to take up the cause.Pitt becomes Prime Minister and William becomes a key supporter and confidant. Pitt gives William the opportunity to present a bill before the house outlawing the slave trade. William's passionate campaigning leads him to become highly unpopular in the House of Commons. He is opposed by a coalition of MPs representing vested interests of the slave trade in London, Bristol, Glasgow, and Liverpool led by Banastre Tarleton and the Duke of Clarence. Despite popular support and the assistance of an unlikely ally in the form of Charles James Fox, William's bill to abolish the slave trade goes down to defeat. Afterward, the film portrays Pitt as one of his few friends and allies remaining in Parliament, however even their relationship becomes strained. Pitt, now facing the stresses of leading a shaky coalition during the French Revolutionary Wars, tells William that his cause must now wait for a more stable political climate.William keeps up the fight but after years of failure he is left exhausted and frustrated that he was unable to change anything in the government. Believing his life's work has been in vain, he becomes physically ill (in the film he is depicted as suffering from chronic colitis which causes him to become addicted to laudanum prescribed for the crippling pain), which brings the story back up to 1797. Having virtually given up hope, William considers leaving politics forever. Barbara convinces him to keep fighting because there is no other person who is willing or able to do so. A few days afterward, William and Barbara marry. Several years pass with no further success. William's wife and new children provide him with the support and strength needed to carry on the fight.Finally, with a renewed hope for success William devises a backdoor method of slowly weakening the slave trade through seemingly innocuous legislation. Aided by Thornton, Clarkson, and new ally James Stephen and cheered on by the now terminally ill Pitt, he reintroduces his bill to abolish the slave trade. In time, after the 20-year campaign and many attempts to bring legislation forward, he is eventually responsible for a bill being passed through Parliament in 1807, which abolishes the slave trade in the British Empire forever.","language":"English","Reception":"Amazing Grace brought in a little over $4 million at the box office over its opening weekend of 23–25 February 2007, making it the 10th-highest grossing film for the weekend, behind such new releases as The Astronaut Farmer and The Number 23. The film had grossed $21,250,683 in the United States as of 14 June 2007. Worldwide box office as of 26 August 2007, stood at $32,050,774.[1]Amazing Grace received positive reviews. Review aggregation website Rotten Tomatoes gives the film a score of 70% based on review from 122 critics, 85 of which were positive. According to the website, the film is \"your quintessential historical biopic: stately, noble, and with plenty of electrifying performances.\"[5] Metacritic gives the film a 65 out of 100, based on reviews from 29 critics, indicating \"generally favorable reviews\".[6]Philip French described the film as \"not exactly innovative\" and compared it to \"earnestly worthy prewar Warner Brothers cinebiographies\". Overall he called it \"a very decent contribution to the present bicentennial celebrations of the parliamentary bill that outlawed the slave trade in the British empire.\"[7] Wally Hammond writing for Time Out singled out Benedict Cumberbatch's performance for praise saying his performance \"quietly upstaged\" the fine performance of Gruffudd.[8]","box_office":"US$32,120,360[1]","cinematography":"Remi Adefarasin","production_company":"FourBoys Films Walden Media Bristol Bay Productions Ingenious Film Partners Roadside Attractions","directed_by":"Michael Apted","amazing_grace":"Theatrical release poster","Music":"","release_dates":"16 September 2006 (2006-09-16) (TIFF)|23 February 2007 (2007-02-23) (US)|23 March 2007 (2007-03-23) (UK)|||","Production":"The film was shot primarily in Hull, Yorkshire. Baker's Quay, which forms part of the Parliament Docks on the Gloucester and Sharpness Canal, was used as a backdrop against which to recreate the atmosphere of the East India Docks in London circa 1780. Shooting took place during October 2005 and involved the tall ships, Kaskelot, Earl of Pembroke, Johanna Lucretia and Phoenix.[2] During January 2006, the scenes from The Houses of Parliament were shot at the 1743 Church within Chatham Historic Dockyard. The wedding scene was filmed at Garsington Church.[3]A number of outside scenes were shot at the former Greenwich Hospital, now part of the University of Greenwich and around Salisbury, Wiltshire.Executive Producer is Jeanney Kim, with Mark Cooper as co-producer. Producers on the film are Terrence Malick (The Thin Red Line) and Ed Pressman under their Sunflower Productions banner, Patricia Heaton and David Hunt for FourBoys Films, and Ken Wales.[4]","produced_by":"Patricia Heaton|David Hunt|Terrence Malick|Edward R. Pressman|Ken Wales|","starring":"Ioan Gruffudd|Benedict Cumberbatch|Romola Garai|Albert Finney|","running_time":"118 minutes","music_by":"David Arnold","edited_by":"Rick Shaine","written_by":"Steven Knight","budget":"US$29,000,000"}