{"country":"United States","distributed_by":"Columbia Pictures","Plot":"21-year-old Toni Simmons attempts to commit suicide by inhaling gas from a second-hand stove. Her neighbor, Igor Sullivan, smells the gas and rescues her by using mouth to mouth resuscitation, which evolves into a kiss after Toni regains consciousness.Toni's failed suicide attempt stems from her despondency following a romantic breakup. Her lover, Dr. Julian Winston, a dentist, ended the relationship by announcing he had a wife and three children. Unknown to Toni, Julian is not married. Upon learning of Toni's suicide attempt, Julian decides to marry Toni, but he needs a wife to divorce in order to sustain his earlier lie. Julian asks Stephanie Dickinson, his longtime nurse, to pose as his wife. At first unwilling, she ultimately relents, since she has long had a crush on her employer.Toni senses Miss Dickinson's feelings for Julian and asks Julian to help Miss Dickinson find another man. Ultimately Julian's friend Harvey, Señor Arturo Sánchez, and Igor all become embroiled in Julian's scheme. Toni suspects Julian's untrustworthiness and leaves him for Igor. Julian finally falls in love with Miss Dickinson.The prickly cactus Miss Dickinson keeps on her desk in the office gives the film its name. Like Miss Dickinson, the cactus thrives in the driest of settings.Ultimately, however, both the cactus and Miss Dickinson \"bloom.\"","language":"English","Reception":"On release, the film was acclaimed by both critics and the general public, becoming the eighth highest grossing film of 1969. Howard Thompson of The New York Times stated that \"both the expansive scenario of I. A. L. Diamond and the flexible direction of Gene Saks open up and even ventilate the story\".[2] Roger Ebert declared that \"the chemistry works\" and \"the movie is better than the play\".[3]In her first major film role, Goldie Hawn, once described as the \"dizzy cream puff who is constantly blowing her lines [on Laugh-In]\",[4] was praised for being \"a natural reactress; her timing is so canny that even her tears run amusingly\".[5] Hawn's performance in Cactus Flower won her the Academy Award for Best Supporting Actress, her sole Oscar to date.","box_office":"$25,889,208[1]","cinematography":"Charles Lang","directed_by":"Gene Saks","Awards":"Goldie Hawn won two awards for her supporting role:In addition, there was a nomination for Ingrid Bergman and an additional one for Goldie Hawn:Screenwriter I. A. L. Diamond was nominated for the 1969 Writers Guild of America Award for Best Comedy Adapted from Another Medium, the only one of his ten screenplay nominations that was not for a screenplay that he co-wrote with Billy Wilder.","release_dates":"December 16, 1969","produced_by":"M. J. Frankovich","starring":"Walter Matthau, Ingrid Bergman, Goldie Hawn","running_time":"103 min.","music_by":"Quincy Jones","written_by":"Abe Burrows (play), Pierre Barillet (Fleur de cactus), Jean-Pierre Grédy (Fleur de cactus), I. A. L. Diamond (screenwriter)","budget":"$3 million"}