{"country":"United States","distributed_by":"Universal Pictures","bridesmaids":"Theatrical release poster","Plot":"Annie Walker (Kristen Wiig) is a single woman in her late 30s. Following the failure of her bakery, she lost her boyfriend and her savings, forcing her to take a job as a sales clerk in a jewelry store and to share an apartment with an obnoxious roommate Gil (Matt Lucas) and his sister Brynn (Rebel Wilson). Her business's failure was so painful that she has given up baking entirely. She has a no-strings-attached sexual relationship with the self-absorbed Ted (Jon Hamm) but hopes for something more from him. Her best friend, Lillian (Maya Rudolph), is virtually her only source of happiness.Lillian becomes engaged and asks Annie to be her Maid of Honor. At the engagement party, Annie meets Lillian's bridesmaids: cynical cousin Rita (Wendi McLendon-Covey); idealistic friend Becca (Ellie Kemper); the groom's raunchy sister Megan (Melissa McCarthy); and Helen (Rose Byrne), the rich and beautiful wife of the groom's boss. Helen and Annie, who are jealous of each other's friendship with Lillian, take an instant dislike to each other, but Lillian persuades them to spend time together.Annie takes Lillian and the bridesmaids to a Brazilian steak restaurant for lunch before going to a chic bridal shop. However, Helen must use her influence to gain entry to the shop because Annie didn't make a reservation. While trying on gowns, the whole party— with the exception of Helen, who chose not to eat before the fitting —becomes sick from food poisoning. Later, Annie's suggestion of a bachelorette party at Lillian's parents' lake house is overruled in favor of a trip to Las Vegas planned by Helen. Worried about her finances and too proud to accept a ticket paid for by Helen, Annie books a ticket in coach although the rest of the party flies first class. However, the trip is cut short by an outburst from Annie, who had accepted a sedative from Helen because of her fear of flying. The plane makes an emergency landing in Casper, Wyoming; and the party takes a bus back home. Annie apologizes, but Lillian decides she wants Helen to take over planning the shower and the wedding.Annie continues to hope for a relationship with Ted, but Nathan Rhodes (Chris O'Dowd), a friendly State Patrol officer who had earlier let her off without a ticket for broken tail lights, begins flirting with her. Nathan Rhodes encourages her to open a new bakery, but Annie refuses. Following a night together, Nathan buys baking supplies for Annie to start baking again. Offended and overwhelmed, Annie leaves. Annie is later fired for being rude to a customer and kicked out of her apartment by her roommates, forcing her to move in with her mother (Jill Clayburgh, in her final film appearance).Annie travels to Helen's home in Chicago for the bridal shower, which has become a Parisian-themed event, an idea that Annie previously came up with but Helen turned down. Helen also upstages Annie's heartfelt, handmade shower gift by giving Lillian a trip to Paris, an idea Helen stole from Annie. Enraged that Helen has taken credit for the Parisian theme, Annie throws a tantrum. Lillian kicks her out of the shower and the wedding. On her way home, Annie is involved in a car accident due to her still-broken tail lights, but the other driver flees the scene. Nathan is the responding officer, and he admonishes her for not fixing her tail lights and taking responsibility for her life. He storms off when Ted arrives to give Annie a ride. On the ride home, Ted asks Annie to perform oral sex on him. Angered, she breaks off the relationship and walks home.Throughout the next several days, Annie becomes reclusive, refusing to leave her mother's house and obsessively watching television. Eventually, Megan arrives and gives Annie a pep talk, telling Annie that she must stop blaming the world for her problems and take control of her life. Annie realizes her errors and begins to repair her life, beginning to bake again and getting her car fixed. She tries to make amends with Nathan, but he ignores her. On the day of the wedding, Helen appears at Annie's doorstep distraught; Lillian has disappeared, and Helen begs for Annie's help in finding her. While driving, Helen apologizes to Annie and opens up to her, revealing that people only involve her in their lives because she is good at planning events, but she does not have any true female friends, leading to a reconciliation between them. The two enlist Nathan to help, and he grudgingly agrees. The group finds Lillian at her own apartment, discovering that she ran from her wedding because of Helen's extravagant planning and from fear of leaving her life in Milwaukee. After reconciling, Annie helps Lillian prepare for her wedding.Annie resumes her place as Maid of Honor. After the wedding, which Annie agrees with Helen is \"perfect\", Helen again apologizes to Annie and states her hope that they can be friends in the future. Realizing that Annie and Nathan were falling in love, Helen also arranged for him to pick up Annie after the wedding. Nathan and Annie reconcile and the pair ride away in his police car.","language":"English","Reception":"Bridesmaids received critical acclaim upon its release, with McCarthy's performance receiving widespread praise. The film review aggregate Rotten Tomatoes reported 90% of critics gave the film a positive review based on 252 reviews, with an average score of 7.6/10.[22] The critical consensus is: \"A marriage of genuine characters, gross out gags, and pathos, Bridesmaids is a female-driven comedy that refuses to be boxed in as Kristen Wiig emerges as a real star.\"[23] Metacritic rated the movie 75 based on 39 critics.[24]Roger Ebert gave the film 3.5 stars of out 4, and said that Bridesmaids \"seems to be a more or less deliberate attempt to cross the Chick Flick with the Raunch Comedy. It definitely proves that women are the equal of men in vulgarity, sexual frankness, lust, vulnerability, overdrinking and insecurity. . . . Love him or not, Judd Apatow is consistently involved with movies that connect with audiences.\"[25]Ms. magazine noted, to its \"enduring surprise,\" that despite the involvement of Apatow, and \"done and done and done\" themes, the film passed the Bechdel test of female-driven storylines.[26]Critic Owen Gleiberman of Entertainment Weekly pointed out the significance of Bridesmaids's success as follows: \"So far, the message that Hollywood seems to have taken from the incredible success of Bridesmaids is a predictably reductive one, something along the lines of: Hey, look! Raunchy comedies for women with awesome grossout scenes in the middle of them can be big box office too!! The message that Hollywood should be taking is: A comedy that's raunchy and fearless, and also brilliantly written and shrewdly honest about what's really going on in women's lives, may actually connect with the fabled non-teenage audience (remember them?).\"[27]Many critics, like Mary Elizabeth Williams at Salon (who called Bridesmaids the \"first black president of female-driven comedies\"[28] ) labeled the film as \"a breakthrough for female-centered comedy, and feminist to boot.\"[29] It was also credited with proving that \"women could pull off a good fart joke as well as the next guy, and did what seemed like the impossible: leading an all-female cast to blockbuster success.\"[30]Despite the majority of praise, the film was not without its detractors. The reviewers of Spill.com gave it an aggregate \"Some Ole Bullshit,\" saying that the main character played by Wiig was an \"annoying, horrible person\" who was \"a victim of her own circumstance.\" However, they praised the performances of Melissa McCarthy and Chris O'Dowd.McCarthy was nominated for the 2012 Academy Award for Best Supporting Actress, BAFTA Award for Best Actress in a Supporting Role, and Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Supporting Role.[31][32][33]Bridesmaids surpassed Knocked Up to become the top-grossing Judd Apatow production to date,[34][35] grossing $26,247,410 on its opening weekend and settling for a strong second place behind Thor.[4][36] Bridesmaids grossed $169,106,725 domestically and $119,276,798 in foreign markets, totalling $288,383,523.[4] It was reported that males made up 33 percent of the movie's audience and that 63 percent of the audience was over the age of 30.[36][37]","Potential sequel":"In January 2012, industry sources reported that Universal was interested in developing a sequel to Bridesmaids. When discussing the potential of a Bridesmaids 2, producer Apatow was quoted as saying, \"The key is we have to come up with an idea that is as good or better than the first one.\"[54] In an interview with Vanity Fair, director Paul Feig addressed rumors of a sequel, saying \"Everyone's very busy right now is one of the problems, and kind of doing their own thing, but we're very open to it.\"[55]However, when questioned about her potential involvement, Wiig told The Hollywood Reporter, \"We aren't working on that. Annie [Mumolo] and I aren't planning a sequel. We are writing something else.\"[54] Following Wiig's statement, reports surfaced that Universal was interested in proceeding without her, instead focusing on developing a story about McCarthy's character Megan. McCarthy dispelled the rumors that she would consider returning for a sequel without Wiig, telling E! Online, \"God, I wouldn't want to. I would never want to. I think it's a terrible idea. I don't know anything about it. But I know that nobody wants to do it unless it's great. If it is, I will show up wherever those ladies are.\"[56]","box_office":"$288.4 million[5]","cinematography":"Robert Yeoman","directed_by":"Paul Feig","Home media":"Bridesmaids was released on DVD and Blu-ray Disc in theatrical (125 minutes) and unrated (130 minutes) versions on September 20, 2011.[53] Special features include a Line-O-Rama (a feature popular among Apatow releases)), deleted, extended, and alternate scenes, and a Cholodecki's commercial. Another edition commemorating the 100th anniversary of Universal Studios was released on September 4, 2012.","production_companies":"Apatow Productions Relativity Media[1]","release_dates":"April 28, 2011 (2011-04-28) (Westwood premiere)|May 13, 2011 (2011-05-13) (United States)||||","Production":"\"It was only after the movie was completed that anyone said this had any significance. We didn't think it was any different than something like The House Bunny or Baby Mama. So we didn't think we were breaking any new ground. We just thought it was a fun thing to do.\"The script, originally titled Maid of Honor, was written by actress and screenwriter Annie Mumolo and Kristen Wiig.[11] Friends for years, they met at The Groundlings, a Los Angeles-based improvisational comedy troupe where they wrote sketches with one another, in the early 2000s.[11] The basic premise for the film originated in 2006, shortly after Wiig was cast in the supporting role of a passive-aggressive cable television executive in producer Judd Apatow's comedy film Knocked Up (2007).[11] Recognizing her comedic talent, Apatow asked Wiig if she had any ideas for a screenplay herself – a practice which had previously led to Steve Carell's idea for The 40-Year-Old Virgin (2005) – and she and Mumolo soon came up with Bridesmaids.[11] Over the following years, writing commenced, with Wiig working on Saturday Night Live in New York City and Mumolo grinding out the script in Los Angeles.[12] The two would meet on weekends and conduct semi-regular table reads of drafts for Apatow to get his suggestions and notes.[11]Several actresses auditioned for the role of Megan, including Rebel Wilson and Busy Philipps, the latter of whom had worked with Apatow and Feig on their comedy-drama television series Freaks and Geeks.[13] Wilson, who improvised for Apatow and Feig for an hour during, impressed them so much during her audition that she was later cast in the smaller role of Brynn. It marked her first appearance in an American production.[14] Mindy Kaling read for the role of Lillian, eventually losing to Wiig's Saturday Night Live colleague Maya Rudolph.[15] Rose Byrne initially also auditioned for Lillian, but later took the opportunity to read Helen.[16] Byrne was eventually chosen as the nemesis because she wasn’t a comedian as Feig feared the character would be “coming out to be too arch if we had a funny woman doing it.”[17] Greta Gerwig and Judy Greer also auditioned for unspecific roles.[18][19]Bridesmaids was budgeted at $32.5 million.[20] Though primarily set in Milwaukee and Chicago, principal photography actually took place in Los Angeles, California.[21] Production designer Jefferson Sage, who has worked with Apatow and Paul Feig since their Freaks and Geeks days, noted that the first fact that appealed to him about the project \"was that you had these two disparate worlds: There was Annie's world in Milwaukee, and then there was Helen's world in Chicago. It immediately drew this dichotomy between the rivalry that developed between them.\"[21] However, Sage acknowledged that it was a challenge to find \"architecture that would give us those Midwestern worlds. Chicago is a beautiful, distinctive city architecturally, and restricted views of downtown L.A. feel like Chicago.\"[21] The production decided to use the Los Angeles County Arboretum and Botanic Garden as the location for Lillian and Dougie's wedding.[21] Additional scenes where Annie meets Officer Rhodes on the highways between Milwaukee and Chicago were filmed in Oxnard, California, which Sage described as a \"broad, flat, green area away from mountains.\"[21]","produced_by":"Judd Apatow|Barry Mendel|Clayton Townsend|","starring":"Kristen Wiig|Maya Rudolph|Rose Byrne|Melissa McCarthy|Wendi McLendon-Covey|Ellie Kemper|Chris O'Dowd|Jill Clayburgh|","running_time":"125 minutes[2]","music_by":"Michael Andrews","edited_by":"William Kerr|Mike Sale|","written_by":"Annie Mumolo|Kristen Wiig|","budget":"$32.5 million[3][4]"}