{"country":"United States","distributed_by":"Universal Pictures Distributors Corporation of America (1956 re-release)","screenplay_by":"Richard Brooks","story_by":"Robert Patterson","Plot":"On a dark, rainy morning at Westgate Prison, prisoners crammed into a small cell watch through the window as Joe Collins (Burt Lancaster) returns from his term in solitary confinement. Joe is angry and talks about escape. The beleaguered warden is under pressure to improve discipline. His chief of security, Capt. Munsey (Hume Cronyn), is a sadist who manipulates prisoners to inform on one another and create trouble so he can inflict punishment. The often drunk prison doctor (Art Smith) warns that the prison is a powder keg and will explode if they are not careful. He denounces Munsey's approach and complains that the public and government officials fail to understand the need for rehabilitation.Joe's attorney visits and tells Joe his wife Ruth (Ann Blyth) is not willing to have an operation for cancer unless Joe can be there with her. He takes his revenge on fellow inmate Wilson (James O'Rear), who at Munsey's instigation had planted a weapon on Joe that earned him a stay in solitary. Joe has organized the brutal attack on Wilson in the prison machine shop but provides himself with an alibi by talking with the doctor in his office while the murder occurs.Joe presses another inmate, Gallagher (Charles Bickford), to help him escape but Gallagher has a good job at the prison newspaper and Munsey has promised him parole soon. Munsey then instigates a prisoner's suicide, giving higher authorities the opportunity to revoke all prisoner privileges and cancel parole hearings. Gallagher feels betrayed and decides to join Joe's escape plan. Joe and Gallagher plan an assault on the guard tower where they can get access to the lever that lowers a bridge that controls access to the prison.While the escape plan is taking shape, each of the inmates in cell R17 tells their story, and in every case, their love for a woman is what landed them in trouble with the law. Munsey learns the details of the escape plan from an informer, one of the men in cell R17, and the break goes badly. The normally subdued prison yard turns into a violent and bloody riot.","language":"English","Reception":"The staff at Variety magazine gave the film a positive review, writing, \"A closeup on prison life and prison methods, Brute Force is a showmanly mixture of gangster melodramatics, sociological exposition, and sex...The s.a. elements are plausible and realistic, well within the bounds, but always pointing up the femme fatale. Thus Yvonne De Carlo, Ann Blyth, Ella Raines and Anita Colby are the women on the 'outside' whose machinations, wiles or charms accounted for their men being on the 'inside'...Bristling, biting dialog by Richard Brooks paints broad cameos as each character takes shape under existing prison life. Bickford is the wise and patient prison paper editor whose trusty (Levene), has greater freedom in getting 'stories' for the sheet. Cronyn is diligently hateful as the arrogant, brutal captain, with his system of stoolpigeons and bludgeoning methods.\"[5]Film critic Bosley Crowther wrote, \"Not having intimate knowledge of prisons or prisoners, we wouldn't know whether the average American convict is so cruelly victimized as are the principal prison inmates in Brute Force, which came to Loew's Criterion yesterday. But to judge by this 'big house' melodrama, the poor chaps who languish in our jails are miserably and viciously mistreated and their jailers are either weaklings or brutes...Brute Force is faithful to its title—even to taking law and order into its own hands. The moral is: don't go to prison; you meet such vile authorities there. And, as the doctor observes sadly, 'Nobody ever escapes.'\"[6]More recently, critic Dennis Schwartz wrote, \"Jules Dassin (Rififi and Naked City) directs this hard-hitting but outdated crime drama concerned about prison conditions... The point hammered home is that the prison system reflects the values of society, as Dassin castigates society for creating and then turning a blind eye toward the brutality and insensitivity of a prison system that offers no chance for rehabilitation.\"[7]","box_office":"$2.2 million (US rentals)[1]","cinematography":"William Daniels","production_company":"Mark Hellinger Productions","directed_by":"Jules Dassin","brute_force":"Theatrical release lobby card","Production notes":"The direct inspiration for the unremitting desperate violence was the recent \"Battle of Alcatraz\" (May 2–4, 1946) in which prisoners fought a hopeless two-day battle rather than surrender in the aftermath of a failed escape attempt.[3] The film has a number of brutal scenes including the crushing of a stool pigeon prisoner under a stamping machine and the beating of a prisoner bound to a chair by straps. Film writer Eddie Muller wrote that \"the climax of Brute Force displayed the most harrowing violence ever seen in movie theaters.\"[4]","release_dates":"June 30, 1947 (1947-06-30) (United States)|||||","produced_by":"Mark Hellinger","starring":"Burt Lancaster Hume Cronyn Charles Bickford","running_time":"98 minutes","music_by":"Miklós Rózsa","edited_by":"Edward Curtiss"}