{"country":"United States","distributed_by":"Universal Pictures","screenplay_by":"Judy Freudberg Tony Geiss","story_by":"David Kirschner Judy Freudberg Tony Geiss","an_american_tail":"Theatrical release poster by Drew Struzan","Plot":"In 1885, Shostka, Russia, the Mousekewitzes, a Russian-Jewish family of mice who live with a human family named Moskowitz, are having a celebration of Hanukkah where Papa gives his hat to his son, Fievel, and tells of a wonderful place called America, where there are no cats. The celebration is interrupted when a battery of Cossacks ride through the village square in an arson attack and their cats likewise attack the village mice.In Hamburg, Germany, the Mousekewitzes board a tramp steamer headed for America. The crossing proves itself long and onerous, as well as the tramp steamer being buffeted by an angry sea. During a thunderstorm, Fievel suddenly finds himself separated from his family and washed overboard. Thinking that he has drowned, they proceed to New York City as planned, though they become depressed at his loss.However, Fievel floats to America in a bottle and, after a pep talk from a French pigeon named Henri, embarks on a quest to find his family. He is waylaid by conman Warren T. Rat, who gains his trust and then sells him to a sweatshop. He escapes with Tony Toponi, a street-smart Italian mouse, and they join up with Bridget, an Irish mouse trying to rouse her fellow mice to stand up to the cats. When a gang of them called the Mott Street Maulers attacks a mouse marketplace, the immigrant mice learn that the tales of a cat-free country are not true.Bridget takes Fievel and Tony to see Honest John, a drunk but reliable politician who knows all the voting mice in New York City. But, as the Mousekewitzes have not yet registered to vote, he can't help Fievel find them. Meanwhile, his older sister, Tanya, tells her gloomy parents she has a feeling that he is still alive, but they insist that it will eventually go away.Led by the rich and powerful Gussie Mausheimer, the mice hold a rally to decide what to do about the cats. Warren is extorting them all for protection that he never provides. No one knows what to do about it, until Fievel whispers a plan to Gussie. Although his family also attends, they stand well in the back of the audience and cannot quite see that it is Fievel onstage with her.The mice take over an abandoned museum on Chelsea Pier and begin constructing their plan. On the day of launch, Fievel gets lost and stumbles upon Warren's lair. He discovers that he is actually a cat in disguise, and the leader of the Maulers. They capture and imprison him, but his guard is a reluctant member of the gang, a goofy, soft-hearted cat named Tiger, who befriends and frees him.Fievel races back to the pier with the cats chasing after him when Gussie orders the mice to release the secret weapon. A huge mechanical mouse, inspired by the bedtime tales Papa told to Fievel of the \"Giant Mouse of Minsk\", chases the cats down the pier and into the water. A tramp steamer bound for Hong Kong picks them up on its anchor and carries them away. However, the giant mouse contraption has caused the pier to catch fire, and the mice flee as human firemen arrive to battle it.During the fire, Fievel is once again separated from his family and falls into despair when a group of orphans tell him that he should have given up looking for them. Papa overhears Bridget and Tony calling out to Fievel, but is sure that there may be another \"Fievel\" somewhere, until Mama finds his hat. Tiger allows them to ride him in a final effort to find Fievel, in the end, the sound of Papa's violin leads him back into their arms. The journey ends with Henri taking everyone to see his newly completed project—the Statue of Liberty, and the Mouskewitzes' new life in America begins.","Media":"The film was first released on VHS in 1987, and later on LaserDisc in both regular[29] and CAV play editions in November 1991 by MCA Home Video in North America, and CIC Video internationally.[30] A DVD version was first made available on January 20, 2004 by Universal Studios,[31] which was presented in fullscreen aspect only, and contained a number of changes from earlier versions, including re-dubbing certain character's voices in the Orphan Alley scene, the addition of new voices where there was previously no dialog, and new \"humorous\" sound effects. This version was reprinted along with other Universal films such as its sequel, The Land Before Time,[32] and Balto.[33] It was released in widescreen on Blu-ray for the first time on March 4, 2014, which included a digital HD and UltraViolet copy.[34] A re-release of the fullscreen DVD version with new cover artwork followed on February 3, 2015.[35]A Fievel-themed playground was built at Universal Studios Florida, featuring a large water slide and many oversized objects such as books, glasses, cowboy boots, and more. It is the only such playground at any of NBC Universal's theme parks.","language":"English","Reception":"Despite the film's commercial success, the film received positive to mixed reviews from movie critics. The film currently maintains a 68% \"fresh\" approval rating on Rotten Tomatoes, with an average rating of 6.3/10.[10] Critics Gene Siskel and Roger Ebert gave it \"two thumbs down\" on a November 22, 1986 episode of their television program At the Movies, calling it \"the most downbeat children's movie since Return to Oz,\" and that it was \"way too depressing for young audiences.\"[11] Both reviewers also criticized how it gave little mention that the main characters were Jewish, or that the attack on their home at the beginning was an antisemitic one, calling it \"a Jewish parable that doesn't want to declare itself,\" and felt that it \"chickened out on its ethnic heritage.\"[11] Conversely, Rita Kempley of the Washington Post called it \"a bright-eyed tale of Jewish triumphs that will find a place in many young hearts,\" adding that \"It reiterates the happiness of homogeneity, prepares the pups for both brotherhood and the free enterprise system. And it's as pretty as a cascade of soap bubbles.\"[12] In his own review for the Chicago Sun-Times, Roger Ebert gave it two stars out of four, giving credit to the animation, calling it \"full and detailed, enhanced by computers and an improvement on so much recent animation that cuts corners,\" but that the story was too \"dark and gloomy.\"[13]While the films's animation was routinely praised, its narrative was often derided. The staff of Halliwell's Film Guide gave it one star out of four. \"[This] expensive cartoon feature\", they wrote, \"[has] not much in the way of narrative interest or indeed humor.\"[14] Vincent Canby of the New York Times gave it two stars out of five, stating that \"An American Tail looks good but the tale itself... is witless if well-meaning,\" adding that its high points were scenes involving the characters Gussie Mausheimer and Tiger.[1][15] In his review for the Chicago Reader, Pat Graham panned its \"flimsy characterizations,\" but that \"the overall quality of the animation—baroquely executed if rather conventionally conceived—makes it worth a look.\"[16]The film has grossed up to $47 million in the United States, also known as the domestic box office, and $84 million worldwide. At the time of its domestic release, it became the highest-grossing non-Disney produced animated feature at the time. It was also one of the first animated films to outdraw a Disney one, beating out The Great Mouse Detective (another traditionally animated film involving mice that was released in 1986 but four months earlier) by over US $22 million. However, while both animated films received positive reviews from various movie critics at the time of their respective releases, The Great Mouse Detective[17] was more successful in terms of receiving favorable reception from movie critics, most notably from Gene Siskel and Roger Ebert,[18][19] than An American Tail did.[20] It would later be outgrossed by Bluth's next film, 1988's The Land Before Time, which marginally outperformed Oliver & Company. However, Oliver and Company did beat out The Land Before Time at the domestic box office by $5,000,000. The record would quickly be shattered with the release of The Little Mermaid three years later after the release of the film, beating out Don Bluth's own film, All Dogs go to Heaven.The film won \"Best Animated Motion Picture\" at the 9th Youth in Film Awards, with actors Phillip Glasser and Amy Green also receiving an award for \"Best Animation Voice Over Group\" for their roles as Fievel and Tanya.[21] It was also nominated for \"Best Fantasy Film\" and \"Best Music\" during the 14th Saturn Awards, losing to The Boy Who Could Fly and Little Shop of Horrors, respectively.[22]The song \"Somewhere Out There\" written by James Horner received a number of accolades during the 1987–1988 award season, including Grammys for \"Best Song Written Specifically for a Motion Picture or Television\" and \"Song of the Year\",[23] as well as \"Most Performed Song from a Motion Picture\" from both the ASCAP and Broadcast Music.[24] It also received a Golden Globe nomination for \"Best Original Song from a Motion Picture\", and an Academy Award nomination for \"Best Original Song\", losing both to \"Take My Breath Away\" from Top Gun.[25][26]","box_office":"$84 million","Alleged plagiarism":"Art Spiegelman accused Spielberg of plagiarism due to the fact that the Jews are depicted as mice in the film just as in Spiegelman's earlier Maus, a metaphor he had adopted from Nazi propaganda. Instead of pursuing copyright litigation, he opted to beat its release date by convincing his publishers to split Maus into two volumes and publish the first before he even finished the second.[41]","cinematography":"Bill Butler (uncredited)","directed_by":"Don Bluth","production_companies":"Sullivan Bluth Studios Amblin Entertainment","Sequels and legacy":"The film gave rise to a number of follow-up media of which Don Bluth had no direct involvement. The theatrical sequel Fievel Goes West, directed by Phil Nibbelink and Simon Wells and produced by Steven Spielberg and Robert Watts, was released in 1991 and follows the adventures of Fievel and his family as they move from New York to the Wild West.[36] A 13-episode TV series based on it called Fievel's American Tails aired on the CBS network between September and December 1992.[37] Two direct-to-video films were also later produced by Universal Pictures Home Entertainment: The Treasure of Manhattan Island in 1998,[38] and The Mystery of the Night Monster in 1999.[39]Fievel would also serve as the mascot for Spielberg's Amblimation animation production company, appearing in its production logo until the studio's dissolution in 1997. In March 2000, it was announced that he would also become the official children's spokesman for UNICEF, with the organization's director of communications Craig Kornblau remarking that \"Fievel Mousekewitz is a popular and endearing character for children everywhere,\" and \"His immigration experiences reflect the adventures and triumphs of all cultures and their children.\"[40]","Music":"\"...there is no way you could put a score like this in any other kind of film. It would only work in animation or if I wrote a ballet. I loved doing it.\"Spielberg's original vision for the film was as a musical—it is said he wanted a \"Heigh-Ho\" of his own (referring to the popular song from Disney's Snow White).[5] The score for the film was composed by James Horner, recorded in England, and performed by The London Symphony Orchestra and the Choir of King's College. Two excerpts of period music also appear in the film: Stars and Stripes Forever by John Philip Sousa and Poor Wand'ring One from the 1880 comic opera The Pirates of Penzance by Gilbert and Sullivan. There is also a musical reference to the 1947 song Galway Bay popularized by Bing Crosby. Initially Bluth and his team were disappointed with the first score recording, but once edited, they found the music worked quite well. Ironically, the final score became one of the film's strongest points.[5]After the first round of songs were written, it was decided a special song would be written for Linda Ronstadt (at that time the girlfriend of George Lucas) to sing over the end credits with James Ingram. Called \"Somewhere Out There\", it was composed by Horner and Barry Mann with lyrics by Cynthia Weil, won a Grammy Award, and became one of the most popular songs from an animated feature since the 1950s.[5]An official soundtrack containing 14 tracks from the film was first released in November 21, 1986 by MCA Records, and was made available on audio cassette, vinyl record, and CD.[8] The album was later released digitally by Geffen Records on February 5, 2013.","release_dates":"November 21, 1986 (1986-11-21)|||||","Production":"Production began in December 1984 as a collaboration between Spielberg, Bluth, and Universal, based on a concept by David Kirschner. Spielberg had asked Bluth to \"make me something pretty like you did in NIMH...make it beautiful.\" In a 1985 interview, he described his role in the production as \"first in the area of story, inventing incidents for the script, and now consists of looking, every three weeks to a month, at the storyboards that Bluth sends me and making my comments.\" Bluth later commented that \"Steven has not dominated the creative growth of Tail at all. There is an equal share of both of us in the picture.\" Nevertheless, this was his first animated feature, and it took some time for him to learn that adding a two-minute scene would take dozens of people months of work. In 1985 he stated, \"at this point, I'm enlightened, but I still can't believe it's so complicated.\"[5]Originally, the concept consisted of an all-animal world, like Disney's Robin Hood, but Bluth suggested featuring an animal world existing as a hidden society from the human world, like Disney's The Rescuers. After viewing The Rescuers, Spielberg agreed. Emmy-award winning writers Judy Freudberg and Tony Geiss were brought in to expand the script. When the initial script was complete, it was extremely long and was heavily edited before its final release. Bluth felt uncomfortable with the main character's name, thinking \"Fievel\" was too foreign-sounding, and he felt audiences wouldn't remember it.[5] Spielberg disagreed. The character was named after his maternal grandfather, Philip Posner, whose Yiddish name was Fievel. (The scene in which he presses up against a window to look into a classroom filled with American \"schoolmice\" is based on a story Spielberg remembered about his grandfather, who told him that Jews were only able to listen to lessons through open windows while sitting outside in the snow).[6] Spielberg eventually won out, though something of a compromise was reached by having Tony refer to Fievel as \"Filly.\" Spielberg also had some material cut that he felt was too intense for children, including a scene Bluth was developing revolving around wave monsters while the family was at sea.[5]Bluth described the process of voice casting as \"sometimes you can select a 'name' voice [i.e., a well-known actor] because it fits the essence of the character so well. Other times, you need to seek an obscure voice, close your eyes, and just listen to it. If it has the highs and lows in the deliverance of lines and it captures the focus of the character, it allows the animators to get a true fix on the action.\"Will Ryan (Digit), Neil Ross (Honest John), Cathianne Blore (Bridget), and Hal Smith (Moe) are all voice actors well known in the animation industry.[5]In designing the look of the film and its characters, Bluth worked with Amblin Entertainment and the Sears marketing department (Sears had a major marketing push on the main character). He decided to make a stylistic shift from the more angular \"modern style\" of animation of the time to a style similar to Disney animation from the 1940s, where the characters have a more soft and cuddly feel. This proved successful, and at release many critics praised the \"old fashioned style\" of the film's look and feel.[5] This was during a period when the market for nostalgia was particularly strong among baby boomers,[7] who at this time were seeking products for their young children, and only three years before the beginning of the Disney Renaissance for the studio Bluth once worked for.Bluth preferred to storyboard an entire picture, but it soon proved to be an enormous task. Larry Leker was brought in to assist, turning Bluth's rough sketches into final storyboard panels. Bluth commented that he would then \"send them over to [Spielberg]. Often I brought them over myself, so that I could explain them. Steven would get very excited by what he saw, and we'd edit the boards right there...adding more drawings, or trimming some back.\" a large crew of animators was pulled together from around the world, utilizing cel painters in Ireland. Discussion arose about moving the entire production to Ireland, but Spielberg balked at the idea of a story called An American Tail being produced overseas.[5]At this time, Bluth and his crew discovered that using a video printer greatly increased their productivity. They could videotape an action, then print out small black and white thermal images from the tape for reference for both human and animal characters, a shorthand method similar to the rotoscoping technique (called in fact xerography) used since the earliest days of animation, in which sequences are shot in live action and traced onto animation cels. They also utilized the process of building models and photographing them, particularly the ship at sea, and the \"Giant Mouse of Minsk\",[5] a technique also used in many Disney films.During production, Amblin and Universal expected to view the dailies and approve all major work on the film, and various outside parties also requested changes here and there. This caused the production to buckle from excessive oversight, and made Bluth feel that he was losing freedom of control over the production process. As the release deadline approached, pressure grew throughout the crew and numerous problems arose, ranging from slower-than-expected cel painting in Ireland to low footage output by some animators. Also, the song writers had written the score much later than originally desired. Suddenly scenes had to be dropped to save time and money and new, shorter scenes had to be created to help pick up the story points lost in the process, sometimes making the story line look jumbled. Notable cuts include the Mousekewitzes journey across Europe, a scene in which they first meet Tiger and he gets stuck up in a tree, an upbeat song that Fievel was planned to sing while imprisoned in the sweatshop, and a scene which gave greater explanation of the changing of names at Ellis Island. Cuts are also responsible for baby Yasha's apparent disappearance after the boat trip.[5]The film was also plagued by union difficulties. Bluth had agreed to accept $6.5 million to get it produced (which later grew to $9 million), at a time when Disney was spending around $12 million per film. He knew it would be difficult, but felt it was worth the sacrifice to work with Spielberg on a major project. With the agreement of his employees, salaries were frozen for a year and half. Unlike the former Bluth studios, the new Sullivan Bluth studios were non-union, and when many workers attempted to withdraw from the union, it sparked a battle between Bluth and the union which continued through most of production. It was mostly this struggle that later compelled Bluth to relocate to Ireland, which he felt offered a more supportive atmosphere.[5]","produced_by":"Don Bluth Gary Goldman John Pomeroy","starring":"Cathianne Blore|Dom DeLuise|John Finnegan|Phillip Glasser|Amy Green|Madeline Kahn|Pat Musick|Nehemiah Persoff|Christopher Plummer|Neil Ross|Will Ryan|Hal Smith|Erica Yohn|","running_time":"80 minutes","music_by":"James Horner","edited_by":"Dan Molina","budget":"$9 million"}