{"Cast":"Erica Hubbard, Lee Thompson Young, and Julito McCullum portray Akeelah's sister and brothers Kiana, Devon, and Terrence, respectively.[27] Dalia Phillips appears as Akeelah's teacher, Ms. Cross,[27][1] and Eddie Steeples as Derrick T.[27] Tzi Ma takes the role of Mr. Chiu, Dylan's father,[27][1] while Wolfgang Bodison plays the deceased Akeelah's unnamed father.[27]","country":"United States","distributed_by":"Lionsgate Films","Plot":"Akeelah Anderson, an 11-year-old spelling enthusiast, attends Crenshaw Middle School, a predominantly black school in South Los Angeles. She lives with her widowed mother, Tanya, her older sister Kiana, her older brothers Devon and Terrence, and her infant niece. Her principal, Mr. Welch suggests that she sign up for the Crenshaw Schoolwide Spelling Bee. She follows his advice and ends up winning. Soon after, Dr. Joshua Larabee, a visiting English professor and Mr. Welch's friend from college, tests Akeelah and decides that she is good enough to compete in the National Spelling Bee. Nevertheless, Dr. Larabee declines to coach her because she is rude to him. As a result, Akeelah studies on her own to prepare for the district spelling bee. Although Akeelah misspells her word during the final round of the bee, she qualifies for the regional bee when her sister Kiana catches the other finalist cheating. She also meets and befriends Javier Mendez, a 12-year-old Mexican American boy and fellow speller. Javier invites her to join the spelling club at his Woodland Hills middle school.At Woodland Hills, Akeelah meets Dylan Chiu, a Chinese American boy who had won second place at the past two national spelling bees. Contemptuous, he asks her to spell \"xanthosis\". When she starts with a \"z\", he tells her she needs a coach. At the conclusion of the spelling club meeting, Javier invites Akeelah to his birthday party. At the party, Akeelah nearly beats Dylan in Scrabble. The boy is reprimanded by his father for nearly losing to \"a little black girl\". After the party, Tanya is depressed over her husband's death and concerned about her daughter's grades and frequent truancy. She subsequently forbids Akeelah from participating in the upcoming state bee. To circumvent this prohibition, Akeelah forges her deceased father's signature on the consent form and secretly studies with Dr. Larabee. During the state bee, Tanya comes inside and interrupts her daughter before she can spell her word. Tanya relents after a side discussion with Dr. Larabee and Mr. Welch. Javier protects Akeelah from disqualification by stalling until she can return. Dylan, Javier, and Akeelah advance to the Scripps National Spelling Bee.As Christmas approaches, Akeelah goes out to buy Dr. Larabee a present, but when she meets him, he reveals that he is quitting being her coach because she reminds him of his deceased daughter Denise. Instead, he gives Akeelah 5,000 flashcards to study. Without her coach, rejected by her best friend Georgia, and feeling the pressure from her neighborhood residents to make them proud, Akeelah loses her motivation. However, Tanya tells her that if she looked around her, she would realize that she has \"50,000 coaches\". Akeelah recruits her family members, classmates, teachers, friends, and neighbor Derrick T to prepare in earnest. After reuniting with Dr. Larabee, Akeelah goes to Washington, D.C. with him, along with Tanya, Georgia, Mr. Welch, and her oldest brother, Devon, unaware that her coach has paid for four of their tickets. Georgia rekindles their friendship with Akeelah after Akeelah invites her. During the competition, Akeelah becomes a crowd favorite. After all the other competitors are eliminated, only Dylan and Akeelah remain. The two finalists are allowed a break, during which Akeelah overhears Dylan's father harshly pressuring him to win. Akeelah attempts to intentionally lose by deliberately misspelling \"xanthosis\". Dylan, knowing that Akeelah knows this word, intentionally misspells it as well. Dylan tells Akeelah that he wants a fair competition, rejecting his father's obsession to win. The two then proceed to spell every word listed by the judges in the hopes of winning the championship together, with Dylan earning a share of it by correctly spelling \"logorrhea\", much to his father's delight. Akeelah spells the last word on the list, \"pulchritude\", and the two are declared co-champions amidst a cheering crowd.","language":"English","Release and reception":"The film was promoted by coffee shop chain Starbucks as a result of a partnership between Lions Gate Entertainment and Starbucks Entertainment.[66] In January 2006, approximately 8,300 Starbucks locations in the United States and Canada began a promotional campaign for the film involving spelling-related trivia games and promotions on cardboard cup sleeves.[35][67] Variety stated that Lionsgate spent around $20 million with its market only,[68] while Los Angeles Times reported a $25 million cost to both produce and market the film.[69] Ford Motor Company also sponsored the film by providing a Lincoln Zephyr to chauffeur the cast and creators to and from a screening.[70]Akeelah and the Bee was first shown at the 2006 ShoWest on March 14,[71] and later premiered as the opening film at the 30th Cleveland International Film Festival on March 16.[72] On April 20, the film was screened at the The Academy of Motion Picture Arts and Sciences in Beverly Hills,[70] and it had a sneak preview in 900 theaters on April 22.[66][73] With predictions of strong box office returns by film critics,[66][74] it was released nationwide in theaters on April 28, grossing $6,011,585 in its opening weekend from around 2,195 American theaters and ranking eighth at the box office.[4] The film closed its run on July 14 and 20 domestically and internationally respectively, with $18,848,430 domestically and $110,994 internationally.[4] While the film received positive reviews, critics noted that it was not doing as well financially as they had predicted,[75][76] and Lionsgate's Michael Burns characterized the film's gross with the word \"only\".[77]Outside the United States, the film debuted at the Sprockets Toronto International Film Festival for Children on April 23, 2006,[78] where it was elected the best film by the kids in the ages of 10 and 11.[79] In the United Kingdom, Akeelah and the Bee was first shown at the Cambridge Film Festival on July 7,[80] and it premiered in the British theaters on August 18.[81][82] The film was also screened in October 2006 at the Rome Film Festival, in which it competed at the Alicy in the City section.[83]The film was released on DVD by Lionsgate Home Entertainment on August 29, becoming the first DVD offered for sale at Starbucks.[84] Its bonus features on the single-disc DVD include seven deleted scenes and a 25-minute making-of video featuring Atchinson and the cast.[85] DVD sales in the United States reached $5,391,947 as 317,942 copies were sold after one week on sale. By December 2006, American consumers had spent a total of $25,855,396 to purchase 1,512,498 copies,[86] making it one of the three most profitable home video releases of Lionsgate in 2006.[87]The film received generally positive reviews from film critics. The review aggregator website Rotten Tomatoes reports an 84% \"fresh\" with an average rating of 7/10 based on 136 reviews. Its critical consensus states, \"Although predictable in every way, a winning performance from its young star Keke Palmer and the rest of the cast makes it difficult not to cheer for the little heroine of Akeelah and the Bee. Sort of like Rocky for the middle school nerd set, Akeelah [and the Bee] is a warm, family-friendly underdog story, featuring terrific supporting performances from Laurence Fishburne and Angela Bassett.\"[93] On Metacritic, the film achieved an average score of 72 out 100, based on 30 reviews, signifying \"generally favorable reviews\".[94] CinemaScore reported that audiences gave the film a rare[95] average grade of A+.[96]Roger Ebert of the Chicago Sun-Times wrote it is \"an uncommonly good movie, entertaining and actually inspirational\".[54] Writing for Film Journal International, Doris Toumarkine praised its pace and how \"Atchison takes spelling competitions and conveys the excitement of the 'sport,' the appeal of the 'game,' the thrill of the win, [and] the crushing blow of the loss.\"[97] Hornaday from The Washington Post called the film \"a triumph on many levels\" and proclaimed, \"It's that nod to the collective ... that makes Akeelah and the Bee so special.\" She especially appreciated that South Los Angeles was presented without stereotypes.[57] Jane Clifford of U-T San Diego felt the film would appeal to both children and adults, and stated that every time she tried to predict its plot \"it took a sharp turn. A turn that leaves you facing your stereotypes and feeling a little sheepish.\"[58] Dana Stevens, writing for The New York Times, asserted, \"The innate suspense and charm of the spelling bee,\" and \"a trio of crack performances\" can turn \"a formulaic sports picture\" into a \"tale that manages to inspire without being sappy.\"[98] Shantayaé Grant of The Jamaica Observer wrote that \"acting is spectacular, the emotions are real and this story of black triumph is simply phenomenal.\"[99] New York Press critic affirmed that Akeelah and the Bee \"resurrects a nearly lost idea of what an art-movie really is\" because it has \"dramatic attention to character and place, psychology and existence.\"[59]Chang of Variety commented that it \"plays like The Karate Kid with a pro-literacy agenda, pushing all the right emotional buttons yet hitting quite a few wrong ones in the process.\"[1] The Evening Chronicle's review said it \"conceals few narrative surprises\" but contended that \"when [Atchison] does finally defy our expectations, it's to ensure his spellers learn a valuable lesson about integrity.\"[100] Turan of the Los Angeles Times criticized that the film \"telegraphs its plot\"; however, he praised it as \"genuinely sweet and determinedly inspirational.\"[52] PopMatters's Cynthia Fuchs stated it is formulaic as it has some \"conventions that make so many other genre films feel stale,\" but that it \"torques them slightly\", emphasizing the \"intellectual activities\" Akeelah gets involved with.[101] Furthermore, the film was described as \"derivatively entertaining in a feel-good sort of way\" by Rick Groen in an article for The Globe and Mail.[102] Ingman of The Austin Chronicle described it as a typical sports film and felt it was heavy-handed at times. However, she praised it for its thems and called the film a \"[t]houghtful, engaging,\" one and said it has \"cross-gender appeal\".[53] Morris of The Boston Globe argued, \"If Akeelah and the Bee is a generic, well-oiled commercial contraption, it is the first to credibly dramatize the plight of a truly gifted, poor black child.\" Morris added, \"Obviously, it's emotional propaganda. But it's just the kind of propaganda our children need.\"[61]Despite being a \"critically-acclaimed\" film, according to Rotten Tomatoes,[93] not all of its reviews were this positive. Anna Smith of Empire called it \"formulaic and all-American\", commenting that many scenes \"appear functional rather than inspirational\", and that the film focused on the racial issue \"a little too heavily\". Smith stated, \"clunky plotting and characterisation mean it has 'telemovie' written all over it.\"[103] Marc Mohan from The Oregonian stressed it can be compared to after-school specials due to its \"lack of originality in plot and character.\"[104] Time Out's Jessica Winter also drew a comparation to after-school specials, saying \"on the big screen ... its clichés seem bigger and its characterisations broader than they would on the more forgiving telly.\"[105] Nick Schager's of Slant Magazine lamented that the \"clichés are too numerous to mention\",[106] while Neil Smith from BBC asserted it has \"as much ... fantasy as Lord of the Rings.\"[81] Jan Stuart of Newsday deemed it \"virtually suspense-free,[107] while Robert Hanks of The Independent stated it has an important message but that is a \"shame it couldn't be encased in a less faked-up story\".[56] Commenting on the The Times, Chris Ayres stressed that although it has good \"visual flair\" it \"is ruined by its Oprah-style emotional manipulation.\"[108] New York Post's Kyle Smith deemed it as \"uplifting but unimaginative\", suggesting that \"Akeelah and the Bee is so warm and well-meaning that you may find yourself wanting to like it more than you really do.\"[109]In spite of criticism, cast members' performances were usually well-received – in particular, Palmer's portrayal of Akeelah. Ebert said, \"The movie depends on her, and she deserves its trust.\"[54] Hornaday opined that \"Palmer's Akeelah is that cinematic rara avis, the kid who is cute without being too cute, sympathetic without being cloying, and believable without being tiresome.\"[57] Evening Chronicle stated Palmer does it \"with effortless grace\" and that she \"carries the film and doesn't strike a single wrong emotional note.\"[100] Fuchs felt that most of the film's strengths \"have to do with Palmer's winning performance.\"[101] Ingman declared Atchison's \"ensemble is wonderful, and his star, Palmer, is a fantastically assured young actress who conveys Akeelah's maelstrom of 11-year-old feelings with no apparent effort.\"[53] Turan complimented how Fishburne and Bassett's \"presence and ability give this film a welcome integrity.\"[52] Mohan stated, \"Although Fishburne and Bassett can do these roles in their sleep, the kids are actually quite engaging.\"[104] Tourmakine felt there were \"fine performances all around\" and that Fishburne and Bassett \"lend fine support in utterly believable roles\".[97]Chang called Dylan's father \"a stiff Asian stereotype\",[1] while Mohan of The Oregonian found it contradictory for an anti-racist film to contain such depiction.[104] Peter Bradshaw of The Guardian even claimed that the line \"If you can barely beat a little black girl\" (spoken by Dylan's father) signifies that Atchison \"thinks it's all right to bring in racism by making the Asians the racists.\"[110] Metro Silicon Valley's Richard von Busack commented that \"[s]tepping around black stereotypes, the film squishes its two left feet right in the mire of Asian stereotyping.\"[111] Beth Accomando of KPBS also criticized Dylan and his father's portrayal as \"painful cliches\",[11] while Schager of Slant Magazine found it not authentic, even likening Dylan's father to Mao Zedong.[106]Scholars Charise Pimentel and Cathleen Sawyer from the Texas State University published an article titled \"Akeelah and the Bee: Inspirational Story of African-American Intellect and Triumph or Racist Rhetoric Served Up On Another Platter?\" on the May 2011 issue of journal Multicultural Perspectives.[112] On a critical discourse analysis, the authors argue that despite appearing to be an \"inoccent enough\" film, it has major approaches that make it racist.[112] First, it implies that African-Americans needs to be rescued by others;[112] second, depicts African-Americans community as \"marked by homelessness, poverty, criminality, unemployment, and remnants of gang activity\";[113] third, indicates that black people usually only achieve success through sports by \"linking the very essence of Akeelah's phenomenal ability to spell to her rhythmic abilities\";[114] and shows that African-Americans only can succeed outside their communities, \"far from the oppressive clutches of their own.\"[115]Linder, on her September 2011 paper \"Spelling Out Racial Difference: Moving Beyond the Inspirational Discourses in Akeelah and the Bee\", also criticizes it saying it \"acts as a platform for a racial melodrama through which ideals of whiteness are reinforced and strengthened.\"[116] Using Linda Williams' categories of what constitutes a racial melodrama, Linder argues that it is described as an \"inspirational\" film because of \"[its] portrayal of Akeelah's victimization by the black community that surrounds her\" and of redemption only achieved \"through the idealized discourse of young people's educational success as defined by dominant (white) culture.\"[117] Linder said characters \"are mostly represented as having 'no interest in escape' from societal oppressions and limitations\" and that \"there is no sign throughout the film of any kind of lasting change for Akeelah's school or her young peers.\"[118]Linder affirms that it creates a dichotomy between \"success (whiteness) versus failure (blackness).\"[118] Pimentel and Sawyer, as well as Linder, identify Larabee as the one who makes this separation clear when he manifests his disregard of African American Vernacular English.[119][113] The co-authors wrote that Larabee implies that \"legitimate forms of intelligence can only be achieved through a Eurocentric perspective, thus advancing the message that Akeelah must be rescued from her African-American ways of knowing, in order to be considered intellectual.\"[113] Another contraposition commented by scholars was \"between the supportive Dr. Larabee and Akeelah's skeptical mother.\"[120] Pimental and Sawyer said she is portrayed as \"an African-American obstructionist\",[121] while scholar Gloria Ladson‐Billings asserted she represents the stereotype of \"ignorant Black woman\".[122] Although Fuchs said the film was able to avoid the \"white authority figure saves the underclass child\" plotline by introducing Larabee,[101] Ladson‐Billings, Linder, and Pimentel and Sawyer opined that it did not.[121][122] After all, Larabee, as Linder described, is \"a non-threatening black man who has assimilated to white culture and who can be depended on to help assimilate others\".[118]The film was nominated for six Black Reel Awards, winning only Best Actress for Palmer.[90][123] Out of five NAACP Image Awards nominations, Akeelah and the Bee won Outstanding Actress in a Motion Picture and Outstanding Writing in a Feature Film/Television Movie - Comedy or Drama.[91][124] At the Black Movie Awards, it won the five awards it was nominated for.[89] The same happened during the Young Artist Awards where it was nominated for two categories and won two awards,[92] and at the CAMIE Awards where it was nominated for and won an award.[125] The film was also nominated for but did not win any award from the BET Awards,[126][127] Broadcast Film Critics Association Awards,[128] Chicago Film Critics,[129][130] and Satellite Awards.[131][132] National Board of Review elected it among the best ten independent films produced in 2006.[133] Additionally, two film critics, Chris Kaltenbach of The Baltimore Sun and Carrie Rickey of The Philadelphia Inquirer, added the film on their list of the ten best films of the year.[134][135] St. Petersburg Times's Steve Persall elected it the best family film of 2006.[136]","box_office":"$18.9 million[4]","cinematography":"David Mullen","production_company":"Lionsgate Films 2929 Entertainment Starbucks Entertainment Out of the Blue Entertainment Reactor Films Cinema Gypsy Productions[a]","directed_by":"Doug Atchison","akeelah_and_the_bee":"Theatrical release poster","release_dates":"March 16, 2006 (2006-03-16) (CIFF)|April 28, 2006 (2006-04-28)||||","Production":"Doug Atchison first had the idea of making a film about spelling bees after watching the Scripps National Spelling Bee of 1994 and noticing that most of the contestants had \"privileged backgrounds\".[28] Atchison also considered spelling bees to contain \"all the drama and tension and entertainment value of a sporting event\", and felt that this could be made into a film.[29][30] From this, he got the idea to write a script following the story of a child who had talent for spelling bee but was from a low-income neighborhood so did not \"have access to the resources or coaching to pursue it as these other kids had.\"[11][28] He had the desire of making a \"Rocky-like story\" and although made it a \"dramatic\" plot, he declared it is \"essentially a sports movie\".[11]Atchison started his screenplay in 1999, when he wrote a five-page treatment in about a month.[28][29] In addition to the fact he was working on other projects, Atchison said he waited years before starting to write because he \"thought someone else would do it first.\" This did not happen, so he began to write by himself.[30] Few changes were made in the process of transitioning from the original draft to the final product. One change was that at first, Akeelah's mother had a smaller role and Akeelah's father was alive. Also, Larabee had been an older man (72 years old), and a few characters were cut. However, Atchison has summarized that \"the steps she goes through, the friends she's got, those were always the same.\"[29]In 2000, Atchison submitted his script to the Academy of Motion Picture Arts and Sciences along with about 4,500 others, in hopes of winning the Nicholl Fellowships in Screenwriting. Atchison's script ended up being one of five scripts selected, and he won the grant.[28][31] Editor Glenn Farr, then a member of the committee, offered to edit Atchison's film as soon as it was finished.[16] Producer Sid Ganis was also attracted to the story during the award presentation ceremony.[28] Nancy Hult Ganis, Sid's wife who was interested in public education, encouraged him to follow through with the film.[7]The film was produced by Lionsgate Films, 2929 Entertainment, Starbucks Entertainment, Out of the Blue Entertainment, Reactor Films and Cinema Gypsy Productions,[a] with a budget around $6–8 million.[3][4] However, the Ganis couple found it difficult to secure funding for the film.[7] In August 2001, Danny Llewelyn's Panoptic Pictures acquired the rights of Atchison's script.[32] In 2002, documentary Spellbound was released and attracted attention to spelling bees, which, according to Hult Ganis, \"helped us in some way\".[7] In November 2004, Lionsgate Films announced they would fund and distribute the film;[33] and in collaboration with 2929 Entertainment they would co-finance the production.[34] In January 2006, Starbucks announced a partnership with Lionsgate to market it.[35]Another factor in not having a studio attached before was Atchison's desire to direct it as he wanted to ensure his story would remain the one he envisioned. Several studios wanted to turn Larabee's character into a white character but Atchison felt \"it was important that Akeelah's mentor be someone that comes from her neighborhood, that looks like her.\"[11] Lionsgate's President of Production Michael Paseornek agreed that Atchison should direct the script, claiming that he was the only person who could do it because the story \"was in his heart and in his mind\".[7]Filming began in February 2005;[36] the crew filmed for ten hours a day for thirty-one days.[20][29] The eleven-year-old Palmer had to follow the United States' child labor laws, which necessitated spending at least three hours a day at school, one on recreation, and one at lunch.[20][29] Nevertheless, Palmer appeared in almost every scene, about which Ganis commented, \"I honestly don't know how we figured it out, but we did\".[20] To get the filming done on time, Atchison storyboarded the scenes ahead of time and chatted with cinematographer David Mullen, the production designer Warren Young, and Glenn Farr to compile a list of scenes.[29] This way, the filming team began each day knowing what shots they would take, their order, and the performances scheduled for each day.[20][29] Most of the filming took place in South Los Angeles,[20] which Atchison picked as the filming location due to their low budget.[9] Scenes were also filmed at the University of Southern California, Hollywood Palladium—which stood in for the Grand Ballroom of the Washington, D.C. Hyatt Hotel—and Venice High School.[37]To bring authenticity to the film's portrayal of spelling bees, George Hornedo, who competed in spelling bees in real life, was hired to play contestant Roman and be \"an unofficial technical consultant.\" Hornedo helped the actors to recreate \"certain habits and idiosyncrasies they do on stage to help them spell.\"[37] Thus, Akeelah skipping rope to memorize the words was added as \"something that was normal for the spelling bee\" but Atchison tried to create it in a \"subtle\" way as he thought the audience could consider this unrealistic.[38] Hornedo and other children who had never acted before were cast because of their authentic portrayals of nervous contestants; other kids, in Atchison's eyes, were \"too old in how they acted\".[30]To further help the staff, Atchison asked Paige Kimball, director of the Scripps National Spelling Bee, to be a consultant. Kimball \"was amazed at not only at how precise it was in its recreation, but also how authentic the individuals and the casting for the event was.\"[37] However, she and the organization did have some disagreements. Atchison has admitted that he originally created a more dramatic story than she wanted. However, he believed most of the disagreements were about technical procedures, \"things you wouldn't even notice\". For example, the children were originally sponsored by newspapers to compete, but Atchison felt this detail did not improve the story, so he removed it. There were some concerns about the screenplay, and Atchison changed some of them \"because [he] thought it didn't matter one way or another so [he] just made them happy.\"[29]Dr. Jacques Bailly, who won the Scripps National Spelling Bee in 1980 and is currently the contest's official pronouncer, since 2003, played himself in the movie. He stated that the film had a great message in that contestants should study the history of words and foreign languages and the meaning of those words more than just memorizing them.[39] Bailly studied Ancient Greek and Latin, receiving his bachelor's degree from Brown University and his PhD from Cornell University.[40] He learned German in Switzerland with the help of a Fulbright scholarship.[41]The film features a musical score by Aaron Zigman, who wrote 45 minutes of compositions in two and a half weeks. He had planned to score Akeelah and the Bee over the holidays, but Lionsgate pushed its release date up, so Zigman was pressed for time to write the score.[42] He drew inspiration from Fishburne's performance to write it.[43] A soundtrack album consisting of 16 tracks was released by Lionsgate Records in a deal with BMG's RED Distribution on April 4, 2006.[44][45] It peaked at number 193 on the Billboard 200, and reached the 19th and sixth spot on the Billboard Top Independent Albums and Top Soundtracks respectively.[46] The original score, consisting of 37 tracks, was also released on April 4 as an iTunes exclusive.[47][48]","produced_by":"Laurence Fishburne|Sid Ganis|Nancy Hult Ganis|Danny Llewelyn|Michael Romersa|","starring":"Laurence Fishburne|Angela Bassett|Keke Palmer|Curtis Armstrong|","running_time":"112 minutes","Themes and analysis":"Commentators on Akeelah and the Bee opined it dealt with multiple themes, including race[49] and racism,[50] poverty,[51] educational system,[52][53] competition and sportsmanship,[53][54] self-esteem,[55] self-image,[56] stigma,[52] community,[52][57] friendship,[58] gender[49] and sexism,[51] age,[49] class[59] and classism,[50] and empowerment.[52] Atchison affirmed that its focus is not the spelling but \"a kid who learns what she's good at, becomes proud of that and doesn't want to hide it anymore. It's overcoming the fear of being great, before you can be great.\"[60] Sid Ganis described it as a film \"about hope and doing great things against all the odds,\"[7] while a New York Press reviewer declared it \"addresses the human condition\".[59]After attending USC School of Cinematic Arts and working at a youth center in South Los Angeles,[29] Atchison incorporated his experiences from the neighborhood into the film; among them, he heard that children who do well in school are said to be \"acting white\". As a result, Atchison tried to use the film to show what causes these children to doubt their own abilities.[30] This doubts are shown through the preconceptions Akeelah and other community members have that \"Spelling Bee is for someone else\".[34] She \"must first overcome her feelings of inadequacy,\"[34] and when she discovers Larabee comes from her neighborhood and is a successful man, it \"empowers her to ... accomplish this task.\"[7] Fishburne stated the film's treatment of race extends beyond the dichotomy of struggle and success, and goes into the prejudice that many people hold against black people competing in mainstream society. Atchison elaborated, \"it's about this girl's insecurity about doing a thing that she hasn't seen people who look like her doing\".[3] The director affirmed that African American children in film usually aspire to nothing other than being successful in sports, music or dance. He argued that the film industry has disseminated \"lies about black inferiority\", so he was interested in focusing in their intellect rather than let them succumb to the stereotypes. Atchison noted he had created the project for all publics \"but particularly for kids of color to see a little black girl who does something powerful.\"[3]The director also attributed Akeelah's low-esteem and doubt on her own capacities to the public school system, where she is bullied and \"her intellectual curiosity is kind of crushed\".[11] As such, Akeelah is portrayed as \"undermotivated student\",[1] who \"[u]nwilling to be stigmatized as a freak or a brainiac,\" avoids showing her abilities.[52] According to Wesley Morris of The Boston Globe, the film shows \"the contradiction gifted students feel in an inhospitable environment.\"[61] Ann Hornaday from The Washington Post opined that Akeelah's sentence \"Why would I want to represent a school that doesn't even have doors on the toilets?\" is \"one of the film's many subtle critiques of the country's education policies.\"[57] Writing in the English Journal, Amanda L. Hodges said it suggests a new approach on teaching with the \"50,000 coaches\" part; she declared it deconstructs the image of teachers \"as those who keep order and disseminate knowledge\" and shows that \"[t]eaching is not an isolated activity that begins and ends at the classroom door.\"[62]Villarreal commented that the film \"teaches you not to let your friends down\",[58] while Fishburne believed that the theme of community was important.[5] Marrit Ingman of The Austin Chronicle said the film indicates \"a community-based, cooperative model of group success,\"[53] while Justin Chang of Variety said it \"focuses ... on the bee's community-uniting impact.\"[1] Hodges said Akeelah goes to the spelling bee because she recognizes it \"proves that someone from their neighborhood can achieve success, and her achievementis, in a real sense, their own\".[62] In contrast, Bernard Beck wrote for Multicultural Perspectives that it depicts \"the success of individual perseverance\",[63] while Red Feather Journall's Kathryn Linder expressed a similar opinion about individual success.[64] Nevertheless, Kenneth Turan of the Los Angeles Times commented \"it raises important points about the ... obstacles to success that kids from poor neighborhoods face.\"[52] The New York Press's reviewer went further and said social class was its \"real subject\" as it \"depicts the basics of class mobility that are routinely taken for granted\".[59] However, Chang asserted it shows the spelling bee contest as \"a democratizing force\",[1] while Rob Asghar, for The Seattle Times, wrote it treats English as \"the quintessential American tool for success.\"[65]Both Fishburne and Bassett also remarked that an important message of Akeelah and the Bee is to \"speak properly\" rather than strictly in vernacular, although Bassett emphasized the importance of the film's themes beyond spelling and spelling bees.[14][18] Atchison added that beyond learning how to spell words, Akeelah must learn the importance of the words. He said that Larabee \"looks at Akeelah as a potential leader. He wants her to understand her history. She needs to know the importance of language – and competition.\"[30] In spite of knowing its importance, it \"deconstruct[s] the 'competition' paradigm of learning\", according to Ingman.[53] Fishburne noted not only children but parents can learn from the film; in his opinion, the most important is that they should pay attention to their children's abilities.[14] Villarreal also felt that, through Dylan's father, parents would be able to ponder if they are \"push[ing] their kids to follow their own dreams and not the children's dreams.\"[23]","music_by":"Aaron Zigman","edited_by":"Glenn Farr","written_by":"Doug Atchison","budget":"$6–8 million[3][4]"}