{"based_on":"About a Boy  by Nick Hornby","country":"United Kingdom United States France","distributed_by":"Universal Pictures","screenplay_by":"Peter Hedges Chris Weitz Paul Weitz","Plot":"Will Freeman[2] (Hugh Grant) lives a serene and luxurious lifestyle devoid of responsibility in London thanks to substantial royalties left to him from a successful Christmas song composed by his father. Will begins attending a support group, called SPAT (Single Parents Alone Together), for single parents as a way to meet women and as part of his ploy, invents a two-year-old son named Ned. His plan succeeds and he meets Suzie (Victoria Smurfit). Will brings Suzie on a picnic where he meets Marcus (Nicholas Hoult), the 12-year-old son of Suzie's friend, Fiona (Toni Collette). Will gains Marcus' interest and trust after he lies to a park ranger to cover up for Marcus killing a duck by throwing his mother's concrete loaf at it. Afterward, when Will and Suzie take Marcus home, they find Fiona in the living room, overdosed on pills in a suicide attempt.Marcus attempts to fix Will up with his mother in order to cheer her up, but the plan fails after a single date. Instead, Marcus becomes close to Will after blackmailing him with the knowledge that \"Ned\" doesn't exist, and begins to treat him as a surrogate big brother. Marcus' influence leads Will to mature and he seeks out a relationship with Rachel (Rachel Weisz), a self-assured career woman, bonding over their experiences raising teenaged sons, though Will neglects to explain his relationship to Marcus. Marcus, in turn, becomes infatuated with Ellie (Natalia Tena) but gives up his romantic interest in favour of a close platonic friendship. Will, realizing that he desires true intimacy with Rachel, decides to be honest with her about his relationship with Marcus, but this backfires and their relationship ends.One day, Marcus comes home from school to find his mother crying in the living room. Marcus attempts to unburden himself to Will, but Will is withdrawn following his break-up. Marcus decides to sing at a school talent show in order to make his mother happy. Will attempts to return to his previous lifestyle, but finds it unfulfilling and decides to help Marcus. He crashes a meeting of the single parents support group to find Fiona and beg her not to commit suicide. She assures him that she has no plans to do so in the immediate future and reveals that Marcus has decided to sing at the school show that day.Will realizes this will be a huge embarrassment for Marcus and rushes to the school to stop him, but Marcus is steadfast in his decision to perform, believing it will be the only thing that will make his mother happy. Marcus steps on stage and sings his mother's favourite song - \"Killing Me Softly with His Song\", the student body starts to taunts him. Suddenly, Will appears onstage with a guitar to accompany Marcus for the rest of the song, turning himself into the butt of the joke and rescuing Marcus from humiliation and even more social suicide.The following Christmas, Will has gotten back together with Rachel and hosts a celebration at his place with his new extended family. The idea of Will marrying Rachel is brought up and Marcus seems unenthusiastic. But Marcus reveals in voiceover that he's not against Will and Rachel marrying, merely that he believes that couples don't work on their own and that everyone needs an extended support system like he now has, concluding \"No man is an island.\"[3]","language":"English","Reception":"The film received critical acclaim, with a 94% 'Certified Fresh' rating on Rotten Tomatoes.[4] The film, with a budget of US$30 million, grossed a worldwide total of US$130,549,455.[1] In December 2002, the film was chosen by the American Film Institute as one of the ten best movies of the year. The film received a B+ CinemaScore from American audiences.[5] Almost universally praised, with an Academy Award-nominated screenplay, About a Boy was determined by the Washington Post to be \"that rare romantic comedy that dares to choose messiness over closure, prickly independence over fetishised coupledom, and honesty over typical Hollywood endings.\"[6] Rolling Stone wrote, \"The acid comedy of Grant's performance carries the film [and he] gives this pleasing heartbreaker the touch of gravity it needs\".[7]Roger Ebert observed that \"the Cary Grant department is understaffed, and Hugh Grant shows here that he is more than a star, he is a resource.\"[8] Released a day after the blockbuster Star Wars: Episode II – Attack of the Clones, About a Boy was a more modest box office grosser than other successful Grant films, making all of $129 million globally. The film earned Grant his third Golden-Globe nomination, while the London Film Critics Circle named Grant its Best British Actor and GQ honoured him as one of the magazine's men of the year 2006.[9] \"His performance can only be described as revelatory,\" wrote critic Ann Hornaday, adding that \"Grant lends the shoals layer upon layer of desire, terror, ambivalence and self-awareness.\"[6]The New York Observer concluded: \"[The film] gets most of its laughs from the evolved expertise of Hugh Grant in playing characters that audiences enjoy seeing taken down a peg or two as a punishment for philandering and womanising and simply being too handsome for words-and with an English accent besides. In the end, the film comes over as a messy delight, thanks to the skill, generosity and good-sport, punching-bag panache of Mr. Grant's performance.\"[10] About a Boy also marked a notable change in Grant's boyish look. Now 41, he had lost weight and also abandoned his trademark floppy hair. Entertainment Weekly's Owen Gleiberman took note of Grant's maturation in his review, saying he looked noticeably older and that it \"looked good on him.\"[11] He added that Grant's \"pillowy cheeks are flatter and a bit drawn, and the eyes that used to peer with 'love me' cuteness now betray a shark's casual cunning. Everything about him is leaner and spikier (including his hair, which has been shorn and moussed into a Eurochic bed-head mess), but it's not just his surface that's more virile; the nervousness is gone, too. Hugh Grant has grown up, holding on to his lightness and witty cynicism but losing the stuttering sherry-club mannerisms that were once his signature. In doing so, he has blossomed into the rare actor who can play a silver-tongued sleaze with a hidden inner decency.\"[11]","box_office":"$130,549,455[1]","cinematography":"Remi Adefarasin","production_company":"StudioCanal TriBeCa Productions Working Title Films","directed_by":"Chris Weitz Paul Weitz","about_a_boy":"Theatrical release poster","Soundtrack":"The soundtrack was released on 23 April 2002, composed by singer/songwriter Badly Drawn Boy.","narrated_by":"Nicholas Hoult","release_dates":"26 April 2002","produced_by":"Jane Rosenthal Robert De Niro Brad Epstein Tim Bevan Eric Fellner","starring":"Hugh Grant Nicholas Hoult Toni Collette Rachel Weisz","running_time":"101 minutes","music_by":"Badly Drawn Boy","edited_by":"Nick Moore","Release":"The film was released theatrically on 26 April 2002 by Universal Pictures and was released on DVD, Blu-ray and VHS on January 2, 2003 by Universal Studios Home Entertainment.","budget":"$30 million"}