{"based_on":"Anomalisa  by Charlie Kaufman (credited as Francis Fregoli)","country":"United States","distributed_by":"Paramount Pictures","screenplay_by":"Charlie Kaufman","Plot":"In 2005, customer service expert Michael Stone travels to Cincinnati, Ohio to promote his latest book entitled \"Let Me Help You To Help Them\" at a convention in a hotel. He is distant from everyone around him, whom he perceives as identical white men with identical faces and voices, including his wife and son.Michael practices his talk in his hotel room, but is haunted by the memory of an angry letter from his old flame, Bella, whom he abruptly left years ago. He arranges to meet her in the hotel bar; still angry, she is outraged by his invitation to his room and storms out. Going for a walk, Michael mistakes an adult toy store for a children's toy store and tries to buy something for his son, but is fascinated by a Japanese animatronic woman.After taking a shower, Michael hears a female voice. He rushes from his room to find its owner: an insecure young woman named Lisa Hesselman attending Michael's talk with her friend. Enraptured by her unique appearance and voice, he invites both women for drinks at the bar. Afterwards, to Lisa's surprise, Michael invites her to his room. Despite her claims that she is not special, Michael finds her captivating, admiring the facial scar she conceals with her hair. He encourages her to sing Cyndi Lauper's \"Girls Just Want to Have Fun\" and tell him about her life. Declaring her an \"anomaly\", he nicknames her \"Anomalisa\". They become intimate and have sex.Michael has a nightmare in which his face falls apart and the identical people of the world pursue him, claiming they love him and that he and Lisa cannot be together. The dream inspires Michael to propose that he and Lisa run away and start a new life. She agrees, but her eating habits during breakfast annoy him, and her voice and face begin to transform into everyone else's. During his convention talk, he suffers a breakdown, confessing that he has no one to talk to and ranting about the American government, alienating the audience.Michael returns to his Los Angeles home. He gives his son the Japanese animatronic woman as a gift, which nonplusses him. Michael's wife has arranged a surprise party, but he is unable to recognize any of the attendees, angering her. Michael sits alone on the stairs as the animatronic woman sings \"Momotarō's Song\", a Japanese children's song. Lisa writes a letter to Michael, saying she hopes they will meet again. Lisa's friend, sitting beside her in the car, has her own face.","language":"English","Reception":"As of 23 April 2016[update], Anomalisa has grossed $5.4 million worldwide, against a budget of $8 million.[2]Rotten Tomatoes reports a 92% approval based on 221 reviews; the average rating is 8.4 out of 10. The site's consensus reads: \"Anomalisa marks another brilliant and utterly distinctive highlight in Charlie Kaufman's filmography, and a thought-provoking treat for fans of introspective cinema.\"[19] The film also holds an 88/100 score on Metacritic based on 46 reviews, indicating \"universal acclaim\".[20]Writing for Time Out and awarding the film five out of five stars, David Calhoun wrote, \"It's what you imagine might have happened if Charlie Kaufman had got his hands on Up in the Air or Lost in Translation.\"[21] Drew McWeeny of Hitfix called it \"the most shattering experiment yet from Charlie Kaufman\" and graded it an \"A+\".[22] LA Weekly's Amy Nicholson gave the film an \"A\" and wrote that \"Kaufman is taking our brains apart and showing us the gears.\"[23] The Guardian's Peter Bradshaw gave the film five out of five, naming it his film of the week, and wrote: \"It is really funny, and incidentally boasts one of the most extraordinarily real sex scenes in film history. It also scared me the way a top-notch horror or a sci-fi dystopia might ... Is there anyone else in the movies doing such unique and extraordinary work?\"[24]Observer critic Mark Kermode gave Anomalisa three out of five, writing: \"Sometimes it falls apart ... But there’s something magical about the malaise which raises this above mere misanthropy – a heightened sense of fragile life that perhaps only puppets could hope to achieve.\"[25] Stephanie Zacharek of TIME wrote: \"Once you start reckoning with Anomalisa’s obsession with self-absorption, the novelty of this one-man pity party begins to wear off.\"[26]According to Metacritic, Anomalisa was the seventh most acclaimed film of 2015, tied with 45 Years. The film was ranked in first place by five critics, second by nine critics, and somewhere else within the top 10 by 39 others.[29]","anomalisa":"Theatrical release poster","box_office":"$5.5 million[3]","cinematography":"Joe Passarelli","production_company":"Starburns Industries Snoot Films","directed_by":"Charlie Kaufman|Duke Johnson|","Soundtrack":"All tracks by Carter Burwell except when mentioned.","release_dates":"4 September 2015 (2015-09-04) (Telluride Film Festival)|30 December 2015 (2015-12-30) (United States)||||","Production":"Anomalisa was written in 2005 for the Los Angeles run of \"Theater of the New Ear\", described as 'a concert for music and text, or a set of \"sound plays\"' by Carter Burwell, who commissioned and scored them.[6] It was a double bill with Kaufman's Hope Leaves the Theater, and replaced Sawbones, by the Coen Brothers, from the earlier New York run after that play's actors were unavailable.[7] Anomalisa was credited to the pen name Francis Fregoli: a reference to the Fregoli delusion, a belief that different people are in fact a single person who changes appearance or is in disguise.[8] The 2005 performance had Thewlis and Leigh sitting on opposite sides of the stage, with Noonan in the middle; Burwell conducted the Parabola Ensemble, and there was a foley artist.[6][9]Kaufman was initially opposed to turning the play into an animated film, saying that the play had \"a disconnect between what’s being said on stage and what the audience is seeing – there’s Tom playing all these characters, there’s Jennifer and David having sex while they’re really just standing across the stage from each other and moaning. You’d lose that.\" The film was reinvented, although its script was described as \"virtually the same\" as that of the original play by The Guardian.[10]The film raised its budget on Kickstarter so as to \"produce this unique and beautiful film outside of the typical Hollywood studio system where we believe that you, the audience, would never be allowed to enjoy this brilliant work the way it was originally conceived.\" Pitched as a short film \"approximately 40 minutes in length,\" 5,770 backers pledged $406,237 to help bring the project to life.[11] After the success of the Kickstarter initiative, additional funding was secured by the film's production company, Starburns Industries, and the film was expanded to a feature length.[12]The puppets were created with the use of 3D printers,[13] with multiple copies of each character. 18 Michaels and six Lisas were created.[14] While Johnson was told that such realistic animation would be \"disturbing and off-putting,\" he disagreed.[10] To that end, a goal of the film was for viewers to \"forget they were looking at something animated and just get wrapped up in the scene,\" further explaining that \"the challenge we felt with so much animated stuff is that you're always conscious of the animation, and we kept asking, 'What if we could escape that? What would it be like?'\"[13]The film was in production for more than two years, gathering only fractions of seconds of footage each day.[14] Kaufman has stated that on some days only about twelve frames (1/2 second) were shot.","produced_by":"Rosa Tran|Duke Johnson|Charlie Kaufman|Dino Stamatopoulos|","starring":"David Thewlis|Jennifer Jason Leigh|Tom Noonan|","running_time":"90 minutes[1]","music_by":"Carter Burwell","edited_by":"Garret Elkins","Release":"Anomalisa had its world premiere at the Telluride Film Festival on 4 September 2015.[15] The film went on to screen at the Venice Film Festival on 8 September 2015.[16] and the Toronto International Film Festival on 15 September 2015.[17] Shortly after, it was announced Paramount Pictures had acquired worldwide distribution rights to the film.[4] The film was released in a limited release on 30 December 2015.[16] A wider release followed in January.[18]","budget":"$8 million[2]"}