{"country":"United States","distributed_by":"Universal-International","screenplay_by":"Harry Essex Arthur A. Ross","story_by":"Maurice Zimm","Novelization":"Creature from the Black Lagoon was novelized in 1954 by John Russell Fearn under the pseudonym of \"Vargo Statten\"; and then later, in 1977, in paperback under the pseudonym of \"Carl Dreadstone\", as part of a short-lived series of books based on the classic Universal horror films. The 1977 book was introduced by Ramsey Campbell, but was written by Walter Harris. The 1977 novel offers a completely different Gill-man, who in this version of the story is gigantic, almost as big as the Rita herself, weighing in at 30 tons. It is both coldblooded and warmblooded, is a hermaphrodite, and also possesses a long whip-like tail. The gigantic creature is dubbed \"AA\", for \"Advanced Amphibian\", by the expedition team members. After slaying most of the team members, destroying a Sikorsky helicopter, and kidnapping Kay more than once, the creature is killed by the crew of a United States Navy torpedo boat.The 1977 novel also differs greatly with respect to the human characters. Only David Reed and Kay Lawrence remain the same. Mark Williams is a German named \"Bruno Gebhardt\" and dies not as a result from drowning, but by the monster falling on him. Lucas is named \"Jose Goncalves Fonseca de Souza\" and is a mostly sympathetic character, until his suggestion of throwing the wounded and unconscious Reed to the monster makes an enraged Gebhardt/Williams throw \"him\" to the beast instead. Dr. Thompson and Dr. Maia both die grisly deaths, whereas in the movie they survive; Maia is eaten by the monster, and Thompson is impaled on a long tree branch flung at him by the creature like a spear (in an apparent nod to a deleted scene from Revenge of the Creature wherein the Gill-man killed a guard in this fashion).","Legacy":"The extensive and persistent impact on media and popular culture of Creature from the Black Lagoon began even before it was seen in theaters.[citation needed]","Plot":"A geology expedition in the Amazon uncovers fossilized evidence from the Devonian period of a link between land and sea animals: a skeletal hand with webbed fingers. Expedition leader Dr. Carl Maia (Antonio Moreno) visits his friend and former student, Dr. David Reed (Richard Carlson), an ichthyologist. He works at an aquarium in California and has also been a guest at Maia's marine biology institute in Brazil for more than a month. Reed persuades his boss, the financially-minded Dr. Mark Williams (Richard Denning), to fund a return expedition to the Amazon to look for the remainder of the skeleton.The group goes aboard the tramp steamer Rita, which is captained by crusty old Lucas (Nestor Paiva). The expedition consists of David, Carl, and Mark, as well as Reed's girlfriend and colleague, Kay Lawrence (Julie Adams), and another scientist, Dr. Edwin Thompson (Whit Bissell). When they arrive at the camp, they discover that Maia's entire research team has been mysteriously killed while he was away. Lucas suggests it was likely done by a jaguar, but the others are unsure. In fact, the camp was attacked by a piscine amphibious humanoid, a living member of the same species from which the fossil originated. The creature, curious about the expedition, goes to the camp. When its sudden appearance frightens the members, they attack it, and in response the enraged creature kills them.The excavation of the area where Carl found the hand turns up nothing. Mark is ready to give up the search, but David suggests that perhaps thousands of years ago the part of the embankment containing the rest of the skeleton fell into the water and was washed downriver, broken up by the current. Lucas says that the tributary empties into a lagoon. Lucas calls it the \"Black Lagoon\", a paradise from which no one has ever returned. The scientists decide to risk it, unaware that the amphibious \"Gill-man\" that killed Carl's assistants earlier has been watching them. Taking notice of the beautiful Kay, it follows the Rita all the way downriver to the Black Lagoon. Once the expedition arrives, David and Mark go diving to collect fossils from the lagoon floor. After they return, Kay goes swimming and is stalked underwater by the creature, who then gets briefly caught in one of the ship's drag lines. Although it escapes, the creature leaves behind a claw in the net, revealing its existence to the scientists.Subsequent encounters with the Gill-man claim the lives of Lucas's crew members, before the creature is captured and locked in a cage aboard the Rita. It escapes during the night, attacking Edwin, who was guarding it. Edwin smashes the beast with a lantern, driving it off. Following this incident, David decides they should return to civilization, but as the Rita tries to leave, they find the lagoon's entrance blocked by fallen logs, courtesy of the escaped Gill-man. While the others attempt to remove the logs, Mark is mauled to death trying to capture the creature underwater, single handedly. It then abducts Kay and takes her to its cavern lair. David, Lucas, and Carl give chase, and Kay is rescued. The creature is riddled with bullets before retreating to the lagoon, where its body sinks into the watery depths.","language":"English","Reboot and shared universe":"[Note 1] On April 9, 2015, Tracking Board reports that the studio are offering actress Scarlett Johansson for the lead role.[19]On August 9, 2015 it was reported that The Amazing Spider-Man 2 writer Jeff Pinker had been hired to write the film.[20]","box_office":"$1,300,000","Home video":"In 1980, Universal released Creature from the Black Lagoon on video cassette in an anaglyph 3-D version, using the Deep Vision anaglyph 3-D release as it's source. Subsequent releases on VHS, Beta and DVD were the 2-D version. On October 2, 2012, Universal Pictures Home Entertainment released the film on Blu-ray as a 2-D / Blu-ray 3D dual format disc as part of the \"Universal Classic Monsters: The Essential Collection\" box set. On June 4, 2013, the Creature from the Black Lagoon Blu-ray disc from the box set was released as a stand-alone release.","cinematography":"William E. Snyder","production_company":"Universal Studios","directed_by":"Jack Arnold","release_dates":"February 12, 1954 (1954-02-12)|||||","Production":"Producer William Alland was attending a 1941 dinner party during the filming of Citizen Kane (in which he played the reporter Thompson) when Mexican cinematographer Gabriel Figueroa told him about the myth of a race of half-fish, half-human creatures in the Amazon River. Alland wrote story notes titled \"The Sea Monster\" 10 years later. His inspiration was Beauty and the Beast. In December 1952 Maurice Zimm expanded this into a treatment, which Harry Essex and Arthur Ross rewrote as The Black Lagoon. Following the success of the 3D film House of Wax in 1953, Jack Arnold was hired to direct the film in the same format.[3]The designer of the approved Gill-man was Disney animator Millicent Patrick, though her role was deliberately downplayed by make-up artist Bud Westmore, who for half a century would receive sole credit for the creature's conception.[4] Jack Kevan, who worked on The Wizard of Oz (1939) and made prosthetics for amputees during World War II, created the bodysuit, while Chris Mueller, Jr. sculpted the head.Ben Chapman portrayed the Gill-man for the majority of the film shot at Universal City, California. Many of the on-top of the water scenes were filmed at Rice Creek near Palatka, Florida. The costume made it impossible for Chapman to sit for the 14 hours of each day that he wore it, and it overheated easily, so he stayed in the back lot's lake, often requesting to be hosed down. He also could not see very well while wearing the headpiece, which caused him to scrape Julie Adams' head against the wall when carrying her in the grotto scenes. Ricou Browning played the Gill-Man in the underwater shots, which were filmed by the second unit in Wakulla Springs, Florida.[3]","creature_from_the_black_lagoon":"Theatrical release poster by Reynold Brown","produced_by":"William Alland","starring":"Richard Carlson Julia Adams Richard Denning Antonio Moreno","running_time":"79 minutes","Developments for a remake":"In 1982 John Landis wanted Jack Arnold to direct a remake of the film, and Nigel Kneale was commissioned to write the screenplay. Kneale completed the script, which involved a pair of creatures, one destructive and the other calm and sensitive, being persecuted by the United States Navy.[5] A decision to make the film in 3D led to the remake being canceled by producers at Universal, both for budgetary concerns and to avoid a clash with Jaws 3-D.[5] In July 1992 John Carpenter was developing the remake at Universal.[6] Herschel Weingrod and Timothy Harris wrote a new script,[7] and Universal offered Peter Jackson the director's position in 1995, but he chose to work on King Kong instead.[8] In February 1996 Ivan Reitman was planning to direct the remake, but the outing never materialized.[7] With the financial success of The Mummy remake in May 1999, development of the Creature from the Black Lagoon remake was revived.[9]In December 2001 Gary Ross signed on to write and produce the remake with his father, Arthur A. Ross, one of the original's writers. He told The Hollywood Reporter, \"The story my father wrote embodies the clash between primitive men and civilized men, and that obviously makes it a fertile area for re-examination.\"[10] In August 2002, Guillermo del Toro, a fan of the original, was attached as director.[11] Because of his commitments to numerous other projects, Universal was forced to go without del Toro and hired Tedi Sarafian (credited on Terminator 3: Rise of the Machines) to write a script in March 2003.[12]In October 2005 Breck Eisner signed on as director. \"As a kid, I remember loving Jack Arnold's original version of this film\", he explained. \"What I really want to do is update an iconic image from the '50s and bring in more of the sci-fi sensibility of Alien or John Carpenter's The Thing (1982).\"[13] Ross said in March 2007 the Gill-man's origin would be reinvented, with him being the result of a pharmaceutical corporation polluting the Amazon. \"It's about the rainforest being exploited for profit\", he said.[14]The production was delayed, however, by the 2007–2008 Writers Guild of America strike; as a result, Eisner made The Crazies (2010) the number one on his priority list instead. His new goal was to finish filming The Crazies and then begin filming Creature from the Black Lagoon in Manaus, Brazil and on the Amazon River in Peru. Eisner was inspired to shoot on location by the film Fitzcarraldo, and the boat set had been built. Eisner continued to rewrite the script, which was to be a summer blockbuster full of \"action and excitement, but [still] scary\". Eisner spent six months designing the new incarnation of the Gill-man with Mark McCreery (Jurassic Park, and Davy Jones' designer). The director said the design was \"very faithful to the original, but updated\" and that the Gill-man would still be sympathetic.[15]In 2009 it was reported that Carl Erik Rinsch might direct a 2010 remake that would be produced by Marc Abraham, Eric Newman and Gary Ross;[16][17] however, a project featuring this ensemble had been abandoned by 2011.In March 2012 Universal announced that a reboot was in production, and would simply be titled The Black Lagoon rather than Creature from the Black Lagoon, in order to distinguish the two versions. In October 2012, the studio hired Dave Kajganich to write the film.[18] The film was expected to hit theaters by May 2014, but was ultimately cancelled.","music_by":"Henry Mancini Hans J. Salter Herman Stein","edited_by":"Ted J. Kent","budget":"unknown"}