{"country":"United States","distributed_by":"Buena Vista Pictures","Plot":"Benji has become lost in a remote area of Oregon after a boating accident. He finds himself struggling to survive in the wilderness, avoiding close encounters with a timber wolf, a brown bear, and a territorial female cougar with her cub. Benji made friends with other animals including a great horned owl, a deer, a red fox and a raccoon.Shortly after washing ashore, Benji sees a cougar gunned down by a hunter. Benji attempts to comfort the dying animal, but he is chased away by the hunter, who then retrieves the dead cat and marches off with it draped over his shoulders. Benji subsequently encounters four orphaned cougar cubs, belonging to the killed cougar, and he attempts to shield them from predation. He finds another mother cougar and spends most of the movie trying to introduce the orphans to the mother so she will adopt them. Meanwhile, Benji's master is searching for him by helicopter and Benji deliberately hides so as not to be prevented from saving the cubs.A black timber wolf, relentlessly pursuing the cubs, is one of the main antagonists and highlights of the film. In one of the film's more tragic scenes, one of the cubs is carried off by a bird of prey. In the final encounter and chase with the wolf, Benji tricks the wolf by hiding in the bushes that shields the cliff behind it and sends the wolf flying off the cliff, becoming the victim of his own misjudgment.Benji ultimately succeeds in having the mother cougar adopt the cubs and in the final scene heads in the direction of the search helicopter to be rescued.Apart from a news report at the beginning of the movie setting up the plot and three short encounters with the hunter, the action is entirely animal activity in the wilderness.","language":"English","Critical reception":"Movie critic Roger Ebert gave Benji the Hunted four stars[citation needed] (out of four) as well as a \"Thumbs Up.\" Gene Siskel gave the film a \"Thumbs Down,\" criticizing Ebert for liking the film more than Stanley Kubrick’s Full Metal Jacket, which was released the same year. [1] Their difference in opinion was parodied in television show The Critic, where Siskel taunts Ebert with \"coming from the guy who liked Benji the Hunted!\"[2]Benji the Hunted holds a 56% rotten rating on Rotten Tomatoes.It grossed $22,257,624 at the US box office.","box_office":"$22.2 million","cinematography":"Don Reddy","production_company":"Walt Disney Pictures Mulberry Square Productions","directed_by":"Joe Camp","benji_the_hunted":"Theatrical release poster","release_dates":"June 5, 1987 (1987-06-05)|||||","Filming":"The movie was filmed entirely on location in Oregon and Table Mountain, in Washington near the town of Cascade Locks.","produced_by":"Ben Vaughn","starring":"Red Steagall|Frank Inn|Nancy Francis|","running_time":"88 minutes","music_by":"Betty Box Euel Box","edited_by":"Karen Thorndike","written_by":"Joe Camp"}