{"country":"United States","beyond_borders":"Theatrical poster for Beyond Borders","distributed_by":"Paramount Pictures","Plot":"While attending a fund-raising gala, Sarah Jordan (Angelina Jolie), a naive, married American socialite living in England, witnesses a fiery plea delivered by an intruder – a renegade humanitarian, Dr. Nick Callahan (Clive Owen). His plea made on behalf of impoverished children under his care turns Sarah's life upside down. Attracted to Nick and his cause, she impulsively abandons her job at an art gallery and sheltered life in England to work alongside him in his effort to aid the refugee camps. She travels to Ethiopia.As Sarah's work takes her to these volatile areas, where few people have traveled and even fewer have survived, she discovers that the harsh realities she encounters, and her growing romantic attraction to the charismatic, unpredictable doctor, ignite in her a passion for saving lives, while risking her own in the process. She works for humanitarian and human rights organizations for ten years after she first travels to Ethiopia, and eventually works for the U.N.H.C.R. and acts as a regional representative for the United Kingdom.","language":"English","Reception":"Beyond Borders received negative reviews from critics, as the movie currently holds a 14% rating on Rotten Tomatoes based on 103 reviews. Critical consensus on the film has it that \"Beyond Borders is good-intentioned, but the use of human suffering as a backdrop for a romance comes across as sanctimonious and exploitative.\"It was nominated for the Political Film Society Award for Peace, losing to Sandstorm. Angelina Jolie received a Golden Raspberry Award for Worst Actress nomination for her performances in this and Lara Croft Tomb Raider: The Cradle of Life, but lost to Jennifer Lopez for Gigli.[citation needed]","box_office":"$11,705,002 (worldwide)","cinematography":"Philip Meheux","production_company":"Mandalay Pictures","directed_by":"Martin Campbell","release_dates":"October 24, 2003 (2003-10-24) (U.S.)|||||","Production":"The film was shot on location in Thailand, Namibia and Canada.","produced_by":"Dan Halsted Lloyd Phillips","starring":"Angelina Jolie Clive Owen Teri Polo Kate Ashfield","running_time":"127 minutes","music_by":"James Horner","edited_by":"Nicholas Beauman","written_by":"Caspian Tredwell-Owen","budget":"$35 million"}