{"directed_by":"Madhur Bhandarkar","Awards":"The film won four National Awards. Tabu also received Best Actress nominations at the Filmfare Awards and Bollywood Awards. Atul Kulkarni also received a Best Supporting Actor nomination at the Star Screen Awards. Madhur Bhandarkar was nominated for Best Director in several venues, but did not win.2002 National Film Awards (India)2002 IIFA Awards (India)2002 Star Screen Awards (India)2002 Zee Cine Awards (India)","Soundtrack":"The film does not feature any of original tracks of its own. But many Bollywood Hindi songs feature many times in various scenes in the dancing bar. The theme music is a classical aalap rendered by Shubha Mudgal.","release_dates":"28 September 2001","produced_by":"Lata Mohan","starring":"Tabu, Atul Kulkarni, Rajpal Yadav, Ananya Khare, Vishal Thakkar, Minakshi Sahani","running_time":"150 min","language":"Hindi","music_by":"Raju Singh","Synopsis":"Mumtaz (Tabu) is a young village woman whose family is killed in communal riots. She moves to Mumbai with her uncle, the only family member she has left. They are desperately poor and her uncle persuades her to become a bar girl at Chandni Bar. This is merely temporary, he promises, until he gets a job. Mumtaz is shy and loathes the work, but she forces herself to dance and flirt. However, the uncle doesn't keep his promise; he lives on her earnings, drinking them away, and never gets a job. He adds one final, unforgivable crime to the list when he gets drunk and rapes her.By this time she has caught the eye of a gangster called Pottya Sawant (Atul Kulkarni). When she tells Pottya what her uncle did to her, Pottya decides to \"defend her honor.\" Pottya kills the uncle and marries her. She lives with him for several years and gives birth to a son, Abhay, and daughter, Payal. She wants Abhay and Payal to be educated and stay far away from her world of dancing girls and Pottya's gangsters.Pottya gets in the bad books of other gangsters, loses his connections, becomes a target for the police, and is killed in a planned \"encounter,\" leaving Mumtaz to return to Chandni Bar.Years pass and Abhay and Payal are in their teens and attending school. Mumtaz still works at Chandni Bar, not as a dancer, but as a waitress. Then the unexpected happens — Abhay is arrested by the police for extortion and held in a juvenile home for the crime he had not committed. At the home, Abhay is raped by a couple of inmates.Mumtaz attempts to talk to the police, to no avail. She then meets with some influential people, who agree to help her out for a price, which she must bring to them in less than two days. Mumtaz hustles and sells her body to obtain the money but is still short. Seeing her mother's plight, Payal takes up dancing at Chandni Bar and brings the rest of the money to her troubled mother.With the money turned over to release Abhay, the family heaves a sigh of relief — until Mumtaz notices that it is not the same Abhay she had known two days earlier. This one is cold, ruthless, and has only purpose in life: vengeance. Abhay takes his revenge and shoots the inmates who raped him. It is implied that Payal is following in her mother's footsteps, and Abhay is set to be another Pottya.","written_by":"Mohan Azaad (screenplay & dialogues) Masud Mirza (dialogues)","cinematography":"Rajeev Ravi"}