{"country":"Brazil France Italy","distributed_by":"Lopert Pictures","Plot":"A marble Greek bas relief explodes to reveal black men dancing the samba to drums in a favela. Eurydice (Marpessa Dawn) arrives in Rio de Janeiro, and takes a trolley driven by Orfeu (Breno Mello). New to the city, she rides to the end of the line, where Orfeu introduces her to the station guard, Hermes (Alexandro Constantino), who gives her directions to the home of her cousin Serafina (Léa Garcia).Although engaged to Mira (Lourdes de Oliveira), Orfeu is not very enthusiastic about the upcoming marriage. The couple go to get a marriage license. When the clerk at the courthouse hears Orfeu's name, he jokingly asks if Mira is Eurydice, annoying her. Afterward, Mira insists on getting an engagement ring. Though Orfeu has just been paid, he would rather use his money to get his guitar out of the pawn shop for the carnival. Mira finally offers to loan Orfeu the money to buy her ring.When Orfeu goes home, he is pleased to find Eurydice staying next door with Serafina. Eurydice has run away to Rio to hide from a strange man who she believes wants to kill her. The man – Death dressed in a stylized skeleton costume – finds her, but Orfeu gallantly chases him away. Orfeu and Eurydice fall in love, yet are constantly on the run from both Mira and Death. When Serafina's sailor boyfriend Chico (Waldemar De Souza) shows up, Orfeu offers to let Eurydice sleep in his home, while he takes the hammock outside. Eurydice invites him to her bed.Orfeu, Mira, and Serafina are the principal members of a samba school, one of many parading during Carnival. Serafina decides to have Eurydice dress in her costume so that she can spend more time with her sailor. A veil conceals Eurydice's face; only Orfeu is told of the deception. During the parade, Orfeu dances with Eurydice rather than Mira.Eventually, Mira spots Serafina among the spectators and rips off Eurydice’s veil. Eurydice is forced once again to run for her life first from Mira, then from Death. Trapped in Orfeu's own trolley station, she hangs from a power line to get away from Death and is killed accidentally by Orfeu when he turns the power on and electrocutes her. Death tells Orfeu \"Now she's mine,\" before knocking him out.Distraught, Orfeu looks for Eurydice at the Office of Missing Persons, although Hermes has told him she is dead. The building is deserted at night, with only a janitor sweeping up. He tells Orfeu that the place holds only papers and that no people can be found there. Taking pity on Orfeu, the janitor takes him down a large darkened spiral staircase – a reference to the mythical Orpheus' descent into the underworld – to a Macumba ritual, a regional form of the Afro-Brazilian religion Candomblé.At the gate, there is a dog named Cerberus, after the three-headed dog of Hades in Greek mythology. During the ritual, the janitor tells Orfeu to call to his beloved by singing. The spirit of Eurydice inhabits the body of an old woman and speaks to him. Orfeu wants to gaze upon her, but Eurydice begs him not to lest he lose her forever. When he turns and looks anyway, he sees the old woman, and Eurydice's spirit departs, as in the Greek myth.Orfeu wanders in mourning. He retrieves Eurydice's body from the city morgue and carries her in his arms across town and up the hill toward his home, where his shack is burning. A vengeful Mira, running amok, flings a stone that hits him in the head and knocks him over a cliff to his death.Two children, Benedito and Zeca – who have followed Orfeu throughout the film – believe Orfeu's tale that his guitar playing causes the sun to rise every morning. After Orfeu's death, Benedito insists that Zeca pick up the guitar and play so that the sun will rise. Zeca plays, and the sun comes up. A little girl appears, gives Zeca a single flower, and the three children dance.","language":"Portuguese","box_office":"$750,000 (gross US)[1]","cinematography":"Jean Bourgoin","production_company":"Dispat Films (FR) Gemma (IT) Tupan Filmes (BR)","directed_by":"Marcel Camus","Awards and honors":"Black Orpheus won the Palme d'Or at the 1959 Cannes Film Festival,[9] the 1960 Academy Award for Best Foreign Language Film,[10] the 1960 Golden Globe Award for Best Foreign Film and the 1961 BAFTA Award for Best Foreign Language Film. In the last case, Brazil was credited together with France and Italy.","release_dates":"12 June 1959 (1959-06-12) (France)|||||","produced_by":"Sacha Gordine","starring":"Marpessa Dawn Breno Mello","running_time":"107 minutes","Influence":"Black Orpheus was cited by Jean-Michel Basquiat as one of his early musical influences,[11] while Barack Obama notes in his memoir Dreams from My Father (1995) that it was his mother's favorite film.[12][13]Obama, however, did not share his mother's preferences upon first watching the film during his first years at Columbia University: \"I suddenly realized that the depiction of the childlike blacks I was now seeing on the screen, the reverse image of Conrad's dark savages, was what my mother had carried with her to Hawaii all those years before, a reflection of the simple fantasies that had been forbidden to a white, middle-class girl from Kansas, the promise of another life: warm, sensual, exotic, different.\"[14]","black_orpheus_(orfeu_negro)":"Original film poster","music_by":"Luiz Bonfá Antônio Carlos Jobim João Gilberto","edited_by":"Andrée Feix","written_by":"Marcel Camus Vinicius de Moraes Jacques Viot"}