{"Cast":"Cameos (playing themselves)","country":"United states","distributed_by":"Paramount Pictures","Plot":"Pete Bell (Nolte), a college basketball coach for the fictional Western University Dolphins in Los Angeles, is under a lot of pressure. His team isn't winning as often as it once did and his successful program needs to attract new star players and fast. But the brightest stars of the future — the so-called \"blue-chip\" prospects — are secretly being paid by other schools.This practice is forbidden in the college game, but Pete is desperate after a losing season. A school booster, greedy \"friend of the program\" Happy (J. T. Walsh), will stop at nothing to land these star high school players for Western's next season and gets the OK from the coach to do so. This includes giving a Lexus to the gigantic Neon Boudeaux (O'Neal), a house and job to the mother of Butch McRae (Hardaway) and a tractor to the father of farmboy Ricky Roe (Matt Nover), as well as a bag filled with cash.With sportswriter Ed (Ed O'Neill) suspecting a scandal, Pete continues to be contaminated by selfish demands from the players and a dirty association with the booster. His estranged wife (Mary McDonnell), a former guidance counselor, agrees to tutor Neon, who has below average grades, but she feels betrayed when Pete lies to her about the new athletes receiving illegal inducements to attend the school.Pete comes to realize that one of his senior players, Tony, a personal favorite, had \"shaved points\" in a game his freshman season, conspiring to beat a gambling point spread. Pete is disgusted at what he and his program have become.Western University has a big nationally televised game coming up versus Indiana, the #1 team in the country, coached by Bob Knight. After winning the game, Pete cannot bear the guilt of having cheated. At a press conference, he confesses to the entire scandal and resigns as head coach. Leaving the press conference and the arena, Pete walks past a small playground with kids playing basketball—he approaches, then helps coaching them.An epilogue later reveals that the university would be suspended from tournament play for three years. Pete did continue to coach, but at the high school level; Tony graduated and played pro ball in Europe; Ricky Roe got injured and returned home to run the family farm, and Neon and Butch dropped out of college, but both now play in the NBA.","language":"English","Reception":"The film earned mixed reviews from critics.[3][4] Hal Hinson of The Washington Post panned the film, writing, \"The ostensible subject here is the big business of college athletics, and, just as The Program tried to do with college football, the film's purpose is to expose the corruption behind the scenes of so-called amateur athletics that have transformed the sport into a desperate money grab. But, like The Program, this strident, unconvincing bit of movie muckraking uses our national sports mania to decoy us into sitting through a dreary lecture about ethics and moral corner-cutting. What's most surprising here is that the assembled talent—from the worlds of basketball and movies—is so impressive and, still, the work is so tired. As the coach who exchanges his soul for a winning program, Nick Nolte struts and bellows in a desperate attempt to bring his character to life, and though he works up quite a lather, all he gets for the effort is sweat stains.\"[5] Blue Chips currently holds a 37% rating on Rotten Tomatoes based on 27 reviews. Shaquille O'Neal was nominated for a Razzie Award for \"Worst New Star\". The film ranked #6 on Complex Magazine's Best Basketball Movies list.The movie debuted at No. 3[6]Friedkin later admitted the film was \"weak at the box office. It's hard to capture in a sports film the excitement of a real game, with its own unpredictable dramatic structure and suspense. I couldn't overcome that.\"[7]","box_office":"$23 million","cinematography":"Tom Priestly Jr.","directed_by":"William Friedkin","References":"http://m.nwitimes.com/sports/basketball/college/indiana-university/chesterton-s-nover-plays-the-chips-that-were-dealt-him/article_4fadc80f-df0b-5c6f-a8c5-dd7fbf81c9a5.html?mobile_touch=true","release_dates":"February 18, 1994","Production":"This movie was filmed in Frankfort, Indiana (arena interior) and French Lick, Indiana, as well as in Chicago and New Orleans and in Los Angeles on the campus of the University of Southern California.[1]Nolte actually shadowed Bob Knight during many games in 1992 to research the role. Knight appears in the film as himself but has no scripted lines.[1]French Lick is the hometown of Larry Bird, who plays a scene with Nolte at the outdoor court of Bird's home.Blue Chips features several famous players and coaches playing themselves, Jerry Tarkanian, Matt Painter, and Jim Boeheim among them. Professional basketball Hall of Fame member Bob Cousy has a role as the athletic director of the college where Pete Bell is coach.O'Neal was so impressed by the play of Hardaway that he strongly encouraged the Orlando Magic to draft him the following year. The Magic completed a trade for Hardaway and the two played together for three seasons, including the Magic's first NBA Finals appearance in 1995.It was Friedkin's first film for Paramount Pictures since 1977's Sorcerer, the production of which had strained his relationship with the studio for years. His next three films would also be released by Paramount. Some attributed this to his relationship with the head of Paramount Sherry Lansing.[2]","blue_chips":"Theatrical release poster","produced_by":"Ron Shelton","starring":"Nick Nolte Shaquille O'Neal Mary McDonnell J. T. Walsh Alfre Woodard Ed O'Neill","running_time":"108 minutes","music_by":"Jeff Beck Nile Rodgers","edited_by":"Robert K. Lambert","written_by":"Ron Shelton","budget":"$35 million"}