{"based_on":"the novel, The Brick Foxhole  by Richard Brooks","country":"United States","distributed_by":"RKO Radio Pictures","screenplay_by":"John Paxton","crossfire":"Theatrical release poster","Plot":"After he's called in to investigate the brutal killing of Joseph Samuels (Sam Levene), who was found dead at his home, police investigator Finlay (Robert Young) discovers there may be a murderer among a group of demobilized soldiers, who had been seen with Samuels and his female friend at a hotel bar that night.Meanwhile, Sergeant Keeley (Robert Mitchum), concerned that his friend Mitch (George Cooper) may be the prime suspect, decides to investigate the murder to clear his friend's name. To both investigators, each suspected soldier relays his version of that night through flashback. The first to step up is Montgomery (Robert Ryan) and the rest are Floyd (Steve Brodie), Mitch, and a possible witness Ginny (Gloria Grahame).As Finlay and Keeley slowly piece together the fragments of that night, they realize there is one possible motive that may have driven the killer to beat an innocent to death, which prompts Finlay to set up a trap to expose the killer.","language":"English","Reception":"When first released, the staff at Variety magazine gave the film a positive review, writing, \"Crossfire is a frank spotlight on anti-Semitism. Producer Dore Schary, in association with Adrian Scott, has pulled no punches. There is no skirting such relative fol-de-rol as intermarriage or clubs that exclude Jews. Here is a hard-hitting film [based on Richard Brooks' novel, The Brick Foxhole] whose whodunit aspects are fundamentally incidental to the overall thesis of bigotry and race prejudice...Director Edward Dmytryk has drawn gripping portraitures. The flashback technique is effective as it shades and colors the sundry attitudes of the heavy, as seen or recalled by the rest of the cast.\"[13]The New York Times film critic, Bosley Crowther, lauded the acting in the drama, and wrote, \"Mr. Dmytryk has handled most excellently a superlative cast which plays the drama. Robert Ryan is frighteningly real as the hard, sinewy, loud-mouthed, intolerant and vicious murderer, and Robert Mitchum, Steve Brodie and George Cooper are variously revealing as his pals. Robert Young gives a fine taut performance as the patiently questing D. A., whose mind and sensibilities are revolted—and eloquently expressed—by what he finds. Sam Levene is affectingly gentle in his brief bit as the Jewish victim, and Gloria Grahame is believably brazen and pathetic as a girl of the streets.\"[14]Critic Dennis Schwartz questioned the noir aspects of the film and discussed the cinematography in his review. He wrote, \"This is more of a message film than a noir thriller, but has been classified by most cinephiles in the noir category...J. Roy Hunt, the 70-year-old cinematographer, who goes back to the earliest days of Hollywood, shot the film using the style of low-key lighting, providing dark shots of Monty, contrasted with ghost-like shots of Mary Mitchell (Jacqueline) as she angelically goes to help her troubled husband Arthur.\"[15]The review aggregator Rotten Tomatoes reported that 83% of critics gave the film a positive review, based on twelve reviews.\"[16]The film made a profit of $1,270,000.[17][18]WinsNominations, 20th Academy AwardsOther nominations","Premiere and U.S. military distribution notes":"The film premiered at the Rivoli Theatre in New York City on July 22, 1947.[12]The U.S. Army only showed the film at its U.S. bases. The U.S. Navy would not exhibit the film at all.[12]","box_office":"$2.5 million (US rentals)[4]","cinematography":"J. Roy Hunt","production_company":"RKO Radio Pictures","directed_by":"Edward Dmytryk","release_dates":"July 22, 1947 (1947-07-22) (New York City)[1]|August 15, 1947 (1947-08-15) (U.S.)[1]||||","Production":"The film's screenplay, written by John Paxton, was based on director and screenwriter Richard Brooks's 1945 novel The Brick Foxhole. Brooks wrote his novel while he was a sergeant in the U.S. Marine Corps making training films at Quantico, Virginia and Camp Pendleton, California. In the novel, the victim was a homosexual. As told in the film The Celluloid Closet and in the documentary included on the DVD edition of the Crossfire film, the Hollywood Hays Code prohibited any mention of homosexuality because it was seen as a sexual perversion. Hence, the book's theme of homophobia was changed to one about racism and anti-semitism. The book was published while Brooks was serving in the Marine Corps. A fellow Marine by the name of Robert Ryan met Brooks and told him he was determined to play in a version of the book on screen.[10][11]","produced_by":"Adrian Scott","starring":"Robert Young Robert Mitchum Robert Ryan Gloria Grahame","running_time":"86 minutes","music_by":"Roy Webb","edited_by":"Harry Gerstad","budget":"$678,000[2][3]"}