{"country":"United States","distributed_by":"Miramax Films","Plot":"Ashtray (Shawn Wayans), Tray for short, is sent to the inner city to live with his father. Tray gets an education about life on the streets from his psychotic, gun-toting cousin Loc Dog (Marlon Wayans), Preach (Chris Spencer), and Crazy Legs (Suli McCullough). At a picnic Tray falls for the infamous Dashiki (Tracey Cherelle Jones) much to the distaste of ex-convict Toothpick (Darrell Heath). While Ashtray and Loc Dog head to buy some snacks, Toothpick and his posse confront Ashtray and hold him at gunpoint, until Loc Dog threatens them and they flee. Loc Dog and Ashtray get harassed in a Korean store by the owners and Loc Dog shoots at the owners when a remark is made about his mother. The two are then confronted by 'The Man' (a mysterious white, government figure) who kills the Koreans and tosses them his gun to frame them and leaves.Meanwhile, Ashtray and Loc-Dog's Grandma ride to church and another elderly woman disses her, resulting in a breakdancing contest that Grandma wins.Ashtray visits Dashiki where they engage in sexual intercourse and Tray impregnates Dashiki. Feeling like he's not responsible enough to be the father, Dashiki kicks him out. Someone from Toothpicks posse threatens Ashtray, Loc Dog, Preach, and Crazy Legs. Loc Dog knocks him out as he and Preach proceed to stomp him, flattening him (literally). The quartet decides to get protection from their friend Old School (Antonio Fargas). This tactic fails as Toothpick performs another drive-by and Crazy Legs is injured. With Crazy Legs hospitalized, himself and Loc Dog being arrested, and the Korean store shooting, Tray decides to confront Dashiki and be the father. Dashiki agrees to give Tray another try and they decide to leave the hood as planned. Ashtray and Loc Dog talk about Ashtray's departure as Toothpick and his posse prepare for another drive-by and he and Loc Dog clash as Ashtray flees and trips and is knocked out as Loc and Toothpick continue to shoot at each other. They are saved when Grandma pops out of the dumpster and shoots Toothpick's car as Toothpick is flung out and he lands on a cop car. Preach and Dashiki find Ashtray hurt and he regains consciousness and kisses Dashiki. A woman finds Toothpick (who turns out to be his mother) and beats him with his shoe for stealing from her in the past.Afterwards, everyone goes their separate ways: Ashtray and Dashiki marry and enjoy their lives, Loc Dog becomes a host and introduces himself with extreme profanity, Preach and his crush settle down and perform sexual intercourse, Crazy Legs becomes a dancer as he had dreamed of, and Grandma is, as Ashtray puts it, \"still Grandma\" (showing her smoking marijuana).","language":"English","Reception":"Don't Be a Menace to South Central While Drinking Your Juice in the Hood collected $8,112,884 from 1,010 theatres its opening weekend, opening at #2 at the box office, averaging $8,032 per theatre.[2] By the end of its theatrical run, the film domestically grossed $20,109,115.[1]The movie was met with a negative response from critics.[3][4][5][6] Rotten Tomatoes gives the film a score of 29% based on 24 reviews.[7]","don't_be_a_menace_to_south_central_while_drinking_your_juice_in_the_hood":"Theatrical release poster","box_office":"$20,949,601[1]","cinematography":"Russ Brandt","production_company":"Island Pictures Ivory Way Productions","directed_by":"Paris Barclay","Soundtrack":"The soundtrack was released on January 30, 1996 by Island Records. It peaked at #18 on the Billboard 200 and #3 on the Top R&B/Hip-Hop Albums. Allmusic rated this soundtrack three out of five stars.[8] On March 14, 1996, The RIAA certified the album Gold for selling over 500,000 copies in the United States of America.","release_dates":"January 12, 1996 (1996-01-12)|||||","produced_by":"Keenen Ivory Wayans Eric L. Gold","starring":"Shawn Wayans Vivica A. Fox Lahmard Tate Marlon Wayans Helen Martin Chris Spencer Suli McCullough Tracey Cherelle Jones","running_time":"89 minutes 94 minutes (Unrated)","music_by":"John Barnes","edited_by":"Marshall Harvey William Young","written_by":"Shawn Wayans Marlon Wayans Phil Beauman","budget":"$3.8 million"}