{"country":"Spain","belle_époque":"Theatrical release poster","distributed_by":"Sony Pictures Classics","Plot":"The year is 1931. Spain is politically divided between Republicans and Traditionalists and on the verge of the Spanish Second Republic. Fernando, a young soldier, deserts. He befriends Manolo (Fernando Fernán Gómez), an old man with a large house in the country. Fernando meets and is enchanted by Manolo's four daughters. As he meets each of the first three one by one, he falls in love and has sex with each of them, determining to marry but with each one a complication arises: Clara (Miriam Díaz-Aroca), a widow who only recently lost her husband and who seeks solace with Fernando; Violeta (Ariadna Gil), a lesbian who is only attracted to Fernando when he is dressed as a woman for a costume ball and Rocío (Maribel Verdú), a social climber who is about to marry into a royalist family for the security it would provide and who only momentarily succumbs to Fernando's charms. Heartbroken each time, the father of the girls encourages him to have patience. Each of the daughters is beautiful and represents a different aspect of feminine sexuality. The youngest of the family, Luz (Penélope Cruz), represents naïveté. While Fernando is pursuing her sisters, Luz gets progressively angry and jealous but eventually Fernando realizes that she is the best one of the four to marry.","language":"Spanish","Critical reception":"Belle Epoque received positive reviews getting a 93% on rottentomatoes.com. The film is mentioned in the 2010 American film The Fighter.","box_office":"$5.4 million (United States)[1]","cinematography":"José Luis Alcaine","directed_by":"Fernando Trueba","release_dates":"4 December 1992 (1992-12-04)|||||","produced_by":"Fernando Trueba","starring":"Jorge Sanz Penélope Cruz Fernando Fernán Gómez Miriam Díaz Aroca Ariadna Gil Maribel Verdú","running_time":"109 minutes","music_by":"Antoine Duhamel Guillermo Fernández-Shaw Federico Romero","edited_by":"Carmen Frías","written_by":"Rafael Azcona José Luis García Sánchez Fernando Trueba"}