{"based_on":"James Bond  by Ian Fleming","Cast":"Maud Adams is said to be visible as an extra in one of the Fisherman's Wharf scenes. In the DVD documentary Inside A View to a Kill, Adams explains that she was visiting her friend Moore on location and ended up in the crowd, but admits she is unable to actually see herself in the film; in the same documentary, director John Glen confirms that Adams appears as an extra, but does not specify where she is visible.[3] The appearance remained a mystery for years until she was identified as standing in the background during one of the Fisherman's Wharf scenes.[4] As a result, Adams is confirmed to have appeared in this and two other Bond films, The Man with the Golden Gun in 1974 and Octopussy in 1983.","country":"United Kingdom","distributed_by":"MGM/UA Entertainment Company (US) United International Pictures (International)[1]","screenplay_by":"Michael G. Wilson Richard Maibaum","Plot":"MI6 agent James Bond is sent to Siberia to locate the body of 003 and recover a microchip originating from the Soviet Union. Upon his return Q analyses the microchip, establishing it to be a copy of one designed to withstand an electromagnetic pulse and made by government contractor Zorin Industries.Bond visits Ascot Racecourse to observe the company's owner, Max Zorin. Zorin's horse wins a race but proves hard to control. Sir Godfrey Tibbett, a racehorse trainer and MI6 agent, believes Zorin's horse was drugged, although tests proved negative. Through Tibbett, Bond meets with French private detective Achille Aubergine who informs Bond that Zorin is holding a horse sale later in the month. During their dinner at the Eiffel Tower, Aubergine is assassinated by Zorin's bodyguard May Day, who subsequently escapes, despite being chased by Bond.Bond and Tibbett travel to Zorin's estate for the horse sale. Bond is puzzled by a woman who rebuffs him and finds out that Zorin has written her a cheque for $5 million. At night, Bond and Tibbett break into Zorin's laboratory learning that he is implanting adrenaline-releasing devices in his horses. Zorin identifies Bond as an agent, has May Day assassinate Tibbett, and attempts to have Bond killed too.General Gogol of the KGB confronts Zorin for killing Bond without permission revealing that Zorin was initially trained and financed by the KGB, but has now gone rogue. Later, Zorin unveils to a group of investors his plan to destroy Silicon Valley which will give him—and the potential investors—a monopoly over microchip manufacture.Bond goes to San Francisco where he learns from CIA agent Chuck Lee that Zorin could be the product of medical experimentation with steroids performed by a Nazi scientist, now Zorin's physician Dr. Carl Mortner. He then investigates a nearby oil rig owned by Zorin and while there finds KGB agent Pola Ivanova recording conversations and her partner placing explosives on the rig. Ivanova's partner is caught and killed, but Ivanova and Bond escape. Later Ivanova takes the recording, but finds that Bond had switched tapes, leaving her with a recording of Japanese music. Bond tracks down the woman Zorin attempted to pay off, State Geologist Stacey Sutton, and discovers that Zorin is trying to buy her family oil business.The two travel to San Francisco City Hall to check Zorin's submitted plans. However, Zorin is alerted to their presence and arrives, killing the Chief Geologist with Bond's pistol and setting fire to the building to both frame Bond for the murder and kill him at the same time. Bond and Sutton escape from the fire, but when the police try to arrest Bond, he and Sutton escape in a fire engine.Bond and Sutton infiltrate Zorin's mine, discovering his plot to detonate explosives beneath the lakes along the Hayward and San Andreas faults, which will cause them to flood, causing Silicon Valley and everything within to be submerged underwater forever. A larger bomb is also in the mine to destroy a \"geological lock\" that prevents the two faults from moving at the same time. Once in place, Zorin and his security chief Scarpine flood the mines and kill the mine workers. Sutton escapes while Bond fights May Day; when she realises Zorin abandoned her, she helps Bond remove the larger bomb, putting the device onto a handcar and pushing it out of the mine, where it explodes, killing her.Zorin, who had escaped in his airship with Scarpine and Mortner, abducts Sutton as Bond grabs hold of the airship's mooring rope. Zorin tries to knock Bond off the rope, but he manages to moor the airship to the framework of the Golden Gate Bridge. Sutton attacks Zorin and in the fracas, Mortner and Scarpine are temporarily knocked out. Sutton flees and joins Bond out on the bridge, but Zorin follows them out with an axe. The ensuing fight between Zorin and Bond culminates with Zorin falling to his death, whereupon an enraged Mortner attacks Bond using sticks of dynamite, but Bond cuts the airship free, causing Mortner to drop the dynamite in the cabin, blowing up the airship and killing himself and Scarpine. General Gogol awards Bond the Order of Lenin for foiling Zorin's scheme.","Appearances in other media":"This film was adapted into two video games in 1985. The first, titled A View to a Kill, was published by Domark. It was available for the ZX Spectrum, Amstrad CPC, Commodore 64, Oric 1 and Oric Atmos, and MSX. The second, titled James Bond 007: A View to a Kill was a text-based video game for DOS and Apple II computers. It was developed by Angelsoft, Inc. and published by Mindscape Inc.The film was loosely adapted into a series of four Find Your Fate adventure game books, Win, Place, or Die, Strike it Deadly, Programmed for Danger, and Barracuda Run, which were released in 1985.[41]May Day was a playable multiplayer character in the 1997 and 2000 video games GoldenEye 007 and The World Is Not Enough, for the Nintendo 64 and both N64 and PlayStation respectively. In the 2002 game Nightfire, May Day and Max Zorin also appears as bots.[42] Other references include Nikolai Diavolo, a character in the 2004 game James Bond 007: Everything or Nothing, claiming Zorin to be his mentor and friend.[43] In GoldenEye: Rogue Agent, a multiplayer level is the summit of the Golden Gate Bridge, including the Zorin blimp, which would fire on players when activated. Players are also able to climb the suspension cables (similar to the events of the film).[44]","language":"English","Release and reception":"This was the first Bond film with a premiere outside the UK, opening on 22 May 1985 at San Francisco’s Palace of Fine Arts.[22] The British premiere was held on 12 June 1985 at the Odeon Leicester Square Cinema in London.[10] The film was first broadcast on British television on 31 January 1990. It achieved a box office collection of US$152.4 million worldwide with $50.3 million in the United States alone.[23][24] On its opening weekend in the US it earned $10.6 million.[24] Although its box office reception was excellent, the film's critical response was mostly negative. Rotten Tomatoes currently gives A View to a Kill a 36% \"Rotten\" rating,[25] which is the lowest rating for the Eon-produced Bond films on the website.[26]One of the most common criticisms was that Roger Moore was 57 at the time of filming – and had visibly aged in the two years that had passed since Octopussy. The Washington Post critic said \"Moore isn't just long in the tooth – he's got tusks, and what looks like an eye job has given him the pie-eyed blankness of a zombie. He's not believable anymore in the action sequences, even less so in the romantic scenes – it's like watching women fall all over Gabby Hayes.\"[27] Sean Connery declared that \"Bond should be played by an actor 35, 33 years old. I'm too old. Roger's too old, too!\"[28] In a December 2007 interview, Roger Moore remarked, \"I was only about four hundred years too old for the part.\"[29]Moore also stated that, at the time, A View to a Kill was his least favourite Bond film, and mentioned that he was mortified to find out that he was older than his female co-star's mother. He was quoted saying \"I was horrified on the last Bond I did. Whole slews of sequences where Christopher Walken was machine-gunning hundreds of people. I said 'That wasn't Bond, those weren't Bond films.' It stopped being what they were all about. You didn't dwell on the blood and the brains spewing all over the place\".[30]Pauline Kael of The New Yorker said \"The James Bond series has had its bummers, but nothing before in the class of A View to a Kill. You go to a Bond picture expecting some style or, at least, some flash, some lift; you don't expect the dumb police-car crashes you get here. You do see some ingenious daredevil feats, but they're crowded together and, the way they're set up, they don't give you the irresponsible, giddy tingle you're hoping for.\" Kael also singled out the dispirited direction and the hopeless script. \"Director John Glen stages the slaughter scenes so apathetically that the picture itself seems dissociated. (I don't think I've ever seen another movie in which race horses were mistreated and the director failed to work up any indignation. If Glen has any emotions about what he puts on the screen, he keeps them to himself.)\"[31]Lawrence O'Toole of Maclean's believed it was one of the series' best entries. \"Of all the modern formulas in the movie industry, the James Bond series is among the most pleasurable and durable. Lavish with their budgets, the producers also bring a great deal of craft, wit and a sense of fun to the films. Agent 007 is like an old friend whom an audience meets for drinks every two years or so; he regales them with tall tales, winking all the time. The 14th and newest Bond epic, A View to a Kill, is an especially satisfying encounter. Opening with a breathtaking ski chase in Siberia, A View to a Kill is the fastest Bond picture yet. Its pace has the precision of a Swiss watch and the momentum of a greyhound on the track. There is a spectacular chase up and down the Eiffel Tower and through Paris streets, which Bond finishes in a severed car on just two wheels. But none of the action prepares the viewer for the heart-stopping climax with Zorin's dirigible tangled in the cables on top of San Francisco's Golden Gate Bridge.\" And although O'Toole believed that Moore was showing his age in the role, \"there are plenty of tunes left in his violin. James Bond is still a virtuoso, with a licence to thrill.\"[32]Brian J. Arthurs of The Beach Reporter said it was the worst film of the Bond series.[25] C. Pea of the Time Out Film Guide said, \"Grace Jones is badly wasted.\"[33] Norman Wilner of MSN chose it as the worst Bond film,[34] while IGN picked as the fourth worst,[35] and Entertainment Weekly as the fifth worst.[36]Bond historian John Brosnan believed A View to a Kill was Moore's best Bond entry. He said Moore looked in better shape than the previous Bond film, Octopussy. Brosnan especially admired the dirigible finale.[37]Danny Peary had mixed feelings about A View to a Kill but was generally complimentary: \"Despite what reviewers automatically reported, [Moore] looks trimmer and more energetic than in some of the previous efforts ... I wish Bond had a few more of his famous gadgets on hand, but his actions scenes are exciting and some of the stunt work is spectacular. Walken's the first Bond villain who is not so much an evil person as a crazed neurotic. I find him more memorable than some of the more recent Bond foes ... Unfortunately, the filmmakers – who ruined villain Jaws by making him a nice guy in Moonraker – make the mistake of switching Mayday at the end from Bond's nemesis to his accomplice, depriving us of a slam-bang fight to the finish between the two (I suppose gentleman Bond isn't allowed to kill women, even a monster like Mayday) ... [The film] lacks the flamboyance of earlier Bond films, and has a terrible slapstick chase sequence in San Francisco, but overall it's fast-paced, fairly enjoyable, and a worthy entry in the series.\".[38]Also among the more positive reviews was Movie Freaks 365's Kyle Bell: \"Good ol' Roger gave it his best. ... Whether you can get past the absurdity of the storyline, you can't really deny that it has stunning stunt work and lots of action. It's an entertaining movie that could have been better.\"[39]Roberts was nominated for a Golden Raspberry Award as Worst Actress, but she lost the trophy to Linda Blair for her performance in Night Patrol, Savage Island and Savage Streets.[40]","box_office":"$152.4 million","cinematography":"Alan Hume","production_company":"Eon Productions","directed_by":"John Glen","release_dates":"22 May 1985 (1985-05-22) (San Francisco, premiere)|13 June 1985 (1985-06-13) (United Kingdom)||||","Production":"A View to a Kill was produced by Albert R. Broccoli and Michael G. Wilson. Wilson also co-authored the screenplay along with Richard Maibaum. At the end of Octopussy during the \"James Bond Will Return\" sequence, it listed the next film as \"From a View to a Kill\", the name of the original short story; however, the title was later changed.[5] When a company with a name similar to Zorin (the Zoran Corporation) was discovered in the United States, a disclaimer was added to the start of the film affirming that Zorin was not related to any real-life company. This is the first Bond film to have a disclaimer (The Living Daylights had a disclaimer about the use of the Red Cross).[6]Early publicity for the film in 1984 included an announcement that David Bowie would play Zorin. He turned it down, saying, \"I didn't want to spend five months watching my stunt double fall off cliffs.\" The role was offered to Sting and finally to Christopher Walken.[7]Dolph Lundgren has a brief appearance as one of General Gogol's KGB agents. Lundgren, who was dating Grace Jones at the time, was visiting her on set when one day an extra was missing so the director John Glen then asked him if he wanted to get a shot at it. Lundgren appears during the confrontation between Gogol and Zorin at the racetrack, standing several steps below Gogol.[8]The film was shot at Pinewood Studios in London, Iceland, Switzerland, France and the United States. Several French landmarks such as the Eiffel Tower, its Jules Verne Restaurant and the Château de Chantilly were filmed. The rest of the major filming was done at Fisherman's Wharf and the Golden Gate Bridge in San Francisco. The Lefty O'Doul Bridge was featured in the fire engine chase scene. The horse racing scenes were shot at Ascot Racecourse.[9]Production of the film began on 23 June 1984 in Iceland, where the second unit filmed the pre-title sequence.[10] On 27 June 1984, several leftover canisters of petrol used during filming of Ridley Scott's Legend caused Pinewood Studios' \"007 Stage\" to burn to the ground. The stage was rebuilt, and reopened in January 1985[11] (renamed as \"Albert R. Broccoli's 007 Stage\") for filming of A View to a Kill. Work had continued on other stages at Pinewood when Roger Moore rejoined the main unit there on 1 August 1984. The crew then departed for shooting the horse-racing scenes at Royal Ascot Racecourse. The scene in which Bond and Sutton enter the mineshaft was then filmed in a waterlogged quarry near Staines and the Amberley Chalk Pits Museum in West Sussex.[12]On 6 October 1984, the fourth unit, headed by special effects supervisor John Richardson, began its work on the climactic fight sequence. At first, only a few plates constructed to resemble the Golden Gate Bridge were used. Later that night, shooting of the burning San Francisco City Hall commenced. The first actual scenes atop the bridge were filmed on 7 October 1984.[13]In Paris it was planned that two stunt men, B.J. Worth and Don Caldvedt, would help film two takes of a parachute drop off a (clearly visible) platform that extended from a top edge of the Eiffel Tower. However, sufficient footage was obtained from Worth's jump, so Caldvedt was told he would not be performing his own jump. Caldvedt, unhappy at not being able to perform the jump, parachuted off the tower without authorisation from the City of Paris. He was subsequently sacked by the production team for jeopardising the continuation of filming in the city.[3]Airship Industries managed a major marketing coup with the inclusion of their Skyship 500 series blimp in the film. At the time Airship Industries were producing a fleet of blimps which were recognisable over many capitals of the world offering tours, or advertising sponsorship deals. As all Bond films have included the most current technology, this included the lighter than air interest.[14]The blimp seen in the climax, was then on a promotional tour of Los Angeles after its participation in the opening ceremony of the 1984 Olympic Games. At that time, it had \"WELCOME\" painted across the side of the gasbag, but was replaced by \"ZORIN INDUSTRIES\" for the film. During the summer of 1984, the bliimp was used to advertise Fujifilm. In real life, inflating the airship would take up to 24 hours, but during the film it was shown to take two minutes.[14]The soundtrack was composed by John Barry, and published by EMI/Capitol.[15] The theme song, \"A View to a Kill\", was written by Barry and Duran Duran, and performed by the band. \"May Day Jumps\" is the only track that uses the James Bond theme. Barry's composition from On Her Majesty's Secret Service was modified for use in the songs \"Snow Job\", \"He's Dangerous\" and \"Golden Gate Fight\" of A View to a Kill.[16] \"A View to a Kill\" was second in the British charts and first in the American charts, thus becoming the peak song in the James Bond series.[17] The 2015 track Writing's On The Wall later out performed the song in the UK by reaching number one.[18]Duran Duran was chosen to do the song after bassist John Taylor (a lifelong Bond fan) approached producer Cubby Broccoli at a party, and somewhat drunkenly asked \"When are you going to get someone decent to do one of your theme songs?\"[19][20]During the opening sequence, a cover version of the 1965 Beach Boys song \"California Girls\", performed by Gidea Park with Adrian Baker (a tribute band), is used during a chase in which Bond snowboards; it has been suggested that this teaser sequence helped initiate interest in snowboarding.[21]","produced_by":"Albert R. Broccoli Michael G. Wilson","starring":"Roger Moore|Tanya Roberts|Grace Jones|Patrick Macnee|Christopher Walken|","running_time":"131 minutes","a_view_to_a_kill":"British cinema poster for A View to a Kill, illustrated by Dan Gouzee","music_by":"John Barry","edited_by":"Peter Davies","budget":"$30 million"}