{"country":"New Zealand","distributed_by":"Trimark Pictures (US/Canada)|PolyGram Filmed Entertainment (UK)|","screenplay_by":"Stephen Sinclair|Peter Jackson|Fran Walsh|","story_by":"Stephen Sinclair","braindead":"Release poster","Plot":"The Sumatran Rat-Monkey is a hybrid creature that resulted from the rape of tree monkeys on Skull Island by plague-carrying rats. In 1957, the explorer Stewart McAlden (Bill Ralston), leads his team out of the island with a captured Sumatran Rat-Monkey. They are stopped by warrior natives, who demand the return of the creature. The groups escape to a waiting jeep, but Stewart gets bitten by the Rat-Monkey. Seeing the mark of the monkey's bite on his right hand, Stewart's men hold down the explorer and amputate it. A bite mark is then seen on his left arm, which results in the removal of that limb. They see a set of bloody scratches on Stewart's forehead and kill him. The captured Rat-Monkey is shipped to Wellington Zoo in New Zealand.Lionel Cosgrove (Timothy Balme) lives with his domineering mother, Vera (Elizabeth Moody). To Vera's dismay, Lionel falls in love with a shopkeeper's daughter, Paquita María Sánchez (Diana Peñalver). While snooping on the two during a visit to the zoo, Vera is bitten by the rat-monkey. The animal's bite turns her into a ravenous zombie. Lionel tries keeping her locked in the basement while simultaneously trying to maintain his relationship with the oblivious Paquita. Vera escapes and is hit by a tram.As the townspeople assume she is dead, Lionel tranquilizes her to keep her still for the funeral. After she is buried, he returns to the graveyard to administer more anesthetic, but encounters a gang of hoodlums. Vera bursts from her grave, and kills the hoodlums, creating more zombies. As their numbers grow, Lionel conceals them in his house, and struggles to keep them under relative control with tranquilizer injections. Lionel's uncle Les (Ian Watkin) arrives to wrangle with Lionel over Vera's estate. Discovering the \"corpses\", Les blackmails his nephew into giving up his inheritance.Lionel reluctantly administers poison to the zombies to \"kill\" them, and buries them. However, the poison turns out to be an animal stimulant, which makes the zombies more active, since they came from the bite of an animal. Meanwhile, Les invites his friends over for a housewarming party. The zombies burst from the ground to attack the party guests. Lionel informs Paquita and Les of the zombie outbreak. Les escapes through a window while Lionel distracts the zombies from Paquita. Les goes into the basement, where he encounters Vera, who has turned into a giant zombie. She kills Les.Lionel kills most of the zombies with a running lawnmower. He and Paquita fight dozens of zombies and animated body parts. During the conflict, an open gas pipe ignites, setting the house ablaze. Lionel manages to kill all of the zombies in the house. Vera, who has become a gargantuan monster with a grossly distorted head and huge breasts, emerges and pursues Lionel and Paquita to the rooftop. Paquita is left hanging onto the edge of the roof while Lionel confronts his mother. During the confrontation, it is revealed that Lionel witnessed Vera killing his father and his father's lover. Vera causes Lionel to fall towards her as she opens her womb, engulfing him. Vera then tries to kill Paquita by removing her hands from the roof. Lionel cuts his way out of his mother's body, causing her to fall into the burning house. Lionel and Paquita escape the building and walk away arm-in-arm as the fire department arrives.","language":"English","box_office":"$242,623 (US)[2]","cinematography":"Murray Milne","production_company":"WingNut Films Avalon Studios Limited The New Zealand Film Commission","directed_by":"Peter Jackson","Home media":"The film has had several releases on VHS and DVD around the world. It was released on Blu-ray with the US 97-minute cut for the first time on 4 October 2011 by Lions Gate Entertainment.[9]","release_dates":"13 August 1992 (1992-08-13) (New Zealand)|12 February 1993 (1993-02-12) (United States)||||","Production":"Principal photography took place over eleven weeks on location in and around Wellington, New Zealand on a reputed budget of around $3 million. The nighttime cemetery scene was filmed at the Karori Cemetery in the Karori neighbourhood of Wellington.Jackson reused the song played on the organ as the mourners wait to enter the church prior to the embalming scene. It is Sodomy from his previous film Meet the Feebles (1989).The first scene to be shot and the opening scene, filmed on \"Skull Island\", was filmed at Putangirua Pinnacles, the same location he would later use for the Paths of the Dead in the film The Lord of the Rings: The Return of the King.Bob McCarron, recently known for his on-screen appearances as Dr Bob from the UK television show I'm a Celebrity Get Me Out of Here! and its German version Ich bin ein Star – Holt mich hier raus!, designed the special prosthetic makeup. He was awarded at Sitges - Catalonian International Film Festival and nominated for Saturn Award (see below for all awards).The final scene to be shot was the section in the park with Lionel and the zombie baby Selwyn. The film was finished one week ahead of schedule and with NZ$45,000 remaining, so Jackson used all this remaining budget to film the park scene over the course of two days. He has gone on to say that this is his favourite scene and the funniest in the whole film.The film was subject to a lawsuit: In Bradley v WingNut Films Ltd [1993] 1 NZLR 415, it was alleged that the comedy horror film Braindead had infringed the privacy of the plaintiffs by containing pictures of the plaintiff's family tombstone. After reviewing the New Zealand judicial authorities on privacy, Gallen J stated: \"the present situation in New Zealand ... is that there are three strong statements in the High Court in favour of the existence of such a tort in this country and an acceptance by the Court of Appeal that the concept is at least arguable.\" This case became one of a series of cases which contributed to the introduction of tort invasions of privacy in New Zealand.[3]","produced_by":"Jim Booth","starring":"Timothy Balme|Diana Peñalver|Elizabeth Moody|Ian Watkin|","running_time":"104 minutes[1]","music_by":"Peter Dasent","edited_by":"Jamie Selkirk","Release":"The film was released in a number of different versions:Although Braindead did not receive much critical attention at the time of its release, Jackson's fame with The Lord of the Rings led to more interest in his earlier films.[citation needed] The contemporary response to the film was positive: the film received an 86% rating of positive reviews based on 28 reviews on Rotten Tomatoes. The website's consensus is: \"The delightfully gonzo tale of a lovestruck teen and his zombified mother, Dead Alive is extremely gory and exceedingly good fun, thanks to Peter Jackson's affection for the tastelessly sublime.\"[4] Metacritic rated it 54 out of 100 based on 7 reviews.[5]At the time of its release, David Stratton of Variety gave a positive review, calling it \"Jackson's best film to date\" and praising its humour, acting, and technical qualities (gore effects, makeup). He stated \"Kiwi gore specialist Peter Jackson, who goes for broke with an orgy of bad taste and splatter humor. Some will recoil from the gore, but Braindead wasn't made for them.\"[6]In the early 2010s, Time Out conducted a poll with several authors, directors, actors and critics who have worked within the horror genre to vote for their top horror films.[7] Braindead placed at number 99 on their top 100 list.[8]","budget":"$3 million[2]"}