{"country":"United Kingdom Japan","distributed_by":"Warner Bros.","Plot":"In the first incarnation, which appears to be a caveman, a man's family is taken from him by raiders due to his cowardice and hesitation. Before his wife is taken away, she says, \"Don't lose the children!\"The next incarnation is in Ancient Rome in which he, Hector, is a slave to a \"foolish master\" who loses his fortune and is compelled to kill himself by his creditors and orders Hector to join him. Hector longs to be free to find the children and wife he had before he became a slave, but he has fallen in love with another slave and forgets his waiting family.Third incarnation: He is a Scottish crusader on his way home to his children. The master from his life in Rome as a slave is now a crusader trying to decide whether to become a priest. They travel together until Hector finds his soul mate from the life in Rome. She is a widow and wishes Hector to join her family, but his duties to the children in Scotland pull at him.Fourth incarnation: Hector is finally forced to confront his capacity for cowardly indecision. He is a Portuguese man in The Renaissance shipwrecked on the coast of Africa. He is the master in this life, his wife from the first incarnation shipwrecked with him as his spurned lover, and the raider who spirited her away is her steadfast friend.Fifth incarnation: He is a modern man in New York, paying the consequences of cowardly indecision and gaining the strength to address the children he lost lifetimes ago. He is joined in this life by his master/slave/friend/soul mate, and former wife Janet and her husband/raider from lifetimes past. They support him but are people who are trying to find their own way, just as in the past lives.","being_human":"Theatrical release poster","language":"English Gaelic Friulian","Reception":"Despite the changes, the film was still not well-received on release. The film currently holds a 50% rating on review aggregate Rotten Tomatoes.[3] Owen Gleiberman of Entertainment Weekly gave the film an 'F' and said that the film \"demonstrates what can happen when a director with a gossamer comic touch tries to become commercial—the movie is so flat and banal it's like a Mel Brooks parody in which someone forgot to put in the jokes.\"[4] Janet Maslin of The New York Times was more positive, declaring \"Aiming high and falling short of his own mark, Mr. Forsyth remains a film maker of vivid, unpredictable imagination.\"[5]","box_office":"$1,519,366","cinematography":"Michael Coulter","directed_by":"Bill Forsyth","narrated_by":"Theresa Russell","release_dates":"6 May 1994 (1994-05-06)|||||","Production":"The film had a very problematic production, mainly down to monetary issues and the ambition of Forsyth's screenplay. Later, after poor test screenings, Warner Bros. instructed Bill Forsyth to trim 40 minutes from the film, as well as add narration and a happy ending. Forsyth subsequently disowned the film.[1][2]","produced_by":"Robert F. Colesberry David Puttnam","starring":"Robin Williams John Turturro Bill Nighy","running_time":"122 min.","music_by":"Michael Gibbs","edited_by":"Michael Ellis","written_by":"Bill Forsyth","budget":"$40,000,000"}