{"country":"United States","distributed_by":"Fox Searchlight Pictures","Plot":"Naive and idealistic insurance agent Tim Lippe welcomes a former teacher into his home, addressing her as Mrs. Vanderhei. After having sex with her, he reminisces about his experiences as her student. In his position as an insurance agent, he is sent to represent his company, Brownstar Insurance, at a regional conference in Cedar Rapids, Iowa, as a replacement for his co-worker, Roger Lemke, who died in an auto-erotic asphyxiation accident. Tim idolized Roger, believing that his death was merely an unfortunate accident, and that he embodied all it was to be a moral Christian, the key criterion used to judge the winner of the coveted \"Two Diamonds\" award, which Roger had won three years in a row.Tim's boss, Bill, pressures him to win again to ensure they keep the company afloat. At the conference, Lippe meets fellow insurance agents Ronald \"Ronimal\" Wilkes, Dean \"Dean-Z\" Ziegler, and Joan \"O-Fox\" Ostrowski-Fox. He also meets Bree, a sex worker who works the parking lot in front of the hotel. She affectionately calls him \"Butterscotch\" after he offers her candy. Initially wary of the conference-goers, he spends more time with Ron, Dean, and Joan, and develops genuine friendships, including a crush on Joan. All the insurance agents participate in a scavenger hunt. Tim is paired with Joan, and, after they win, they become intoxicated with Dean in the hotel swimming pool. Tim and Joan's sexual tension builds to a head and, after making out in the pool, they have sex in Joan's hotel room. They were all seen in the pool by ASMI president Orin Helgesson.The next morning, Tim is guilt-ridden and calls Vanderhei to confess, before desperately asking her to marry him. After explaining she has been sleeping with other people and desires freedom, she suggests he take the opportunity to start a new life. Tim returns to Joan, who attempts to comfort him by telling him what Lemke was really like: she was his lover but left him after his sexual appetites became too twisted for her, and he bribed Helgesson for each one of his awards. Tim refuses to believe this and flees Joan's room, accusing her of being a \"prostitute\" sent to destroy his life.He runs into Dean and accidentally lets slip Lemke's bribery. As his friend, Dean swears to not tell anyone. After receiving advice from Dean, Tim goes to Helgesson for his assessment; it does not go well, and under the pressure he ends up also bribing Helgesson for the award, leaving him penniless and ashamed. Tim later comes across Bree and accompanies her to a party, where he gets high on crystal methamphetamine and inadvertently starts a fight. Ron, Joan, and Dean show up just in time to rescue him and Bree, who says she is in love with Tim.The night ends as Bill appears at Tim's door to inform him that with the successful acquisition of another Two Diamond award, he has received a generous offer for the company; despite meaning the branch's closure, he has chosen to sell. While Bill formally announces the sale, Tim bursts in, takes over the podium, and reveals that his company has unethically acquired the award every year by bribing Helgesson and confesses to doing so himself. Helgesson flees the room, his reputation in tatters, and a furious Bill confronts Tim, his revelations having cost Bill the sale of his company. Tim responds by announcing his intention to leave the company and start another with his clients from Brownstar, 17 of which have agreed to stay with him. Bill storms off, dumbfounded.As the four friends say their goodbyes and prepare to see each other next year, Joan and Tim are shown happy as friends, and Dean invites Ron and Tim to stay at a wealthy friend's cabin in Canada for the summer; both of them surprise Dean by gleefully accepting. The three of them go on to start their own company together called Top Notch, with Joan involved, too.","language":"English","Reception":"Reviews for Cedar Rapids have been mostly positive. Rotten Tomatoes reports that 86% of critics had given the film a positive review based on reviews from 152 critics and reports a rating average of 6.7 out of 10. The critical \"consensus\" is: \"It's as conventional as its Midwestern setting, but Cedar Rapids boasts a terrific cast and a script that deftly blends R-rated raunch and endearing sweetness.\"[6] At NoobMovies, the film has a score of a 9/10.[7]At Metacritic, which assigns a weighted average score out of 100 to reviews from mainstream critics, the film received an average score of 70% based on 38 reviews.[8]As of August 22, 2011, the film grossed a total of $6,861,102 in the US.[9]","box_office":"$6,861,102 (US)[1]","cinematography":"Chuy Chávez","production_company":"Ad Hominem Enterprises","directed_by":"Miguel Arteta","cedar_rapids":"Theatrical release poster","release_dates":"January 23, 2011 (2011-01-23) (Sundance)|February 11, 2011 (2011-02-11) (United States)||||","Production":"The failure of an Iowa film production tax credit reportedly is the reason that the film was shot in Ann Arbor, Michigan, rather than on location in Cedar Rapids, Iowa, itself.[3] Michigan provided a 42% tax rebate to movies filmed in specified \"core communities\" in the state (such as Ann Arbor).[3]In the film, Ronald Wilkes (Isiah Whitlock, Jr.) is a self-described fan of the television series The Wire and does an impersonation of one of its most popular characters, Omar Little. Whitlock was involved in the HBO series portraying character Clay Davis, but has said the references to the show were written in before he was cast as Wilkes.[4] Whitlock filmed a separate promotion for the film, where Wilkes is seen in an insurance office reading lines from The Wire.[5]","produced_by":"Jim Burke|Alexander Payne|Jim Taylor|Brian Bell|Ed Helms|","starring":"Ed Helms|John C. Reilly|Anne Heche|Isiah Whitlock Jr.|Sigourney Weaver|","running_time":"87 minutes","music_by":"Christophe Beck","edited_by":"Eric Kissack","written_by":"Phil Johnston"}