{"based_on":"the novel Once Too Often  by Whitman Chambers","country":"United States","distributed_by":"Film Classics","screenplay_by":"Kenneth Gamet","Plot":"Claire (Leslie Brooks) is a society reporter who will do whatever she has to for a story. Claire manages to keep herself in the headlines by marrying and romancing a series of wealthy men, all of whom die under mysterious circumstances. To deflect suspicion from herself, Claire frames her former boyfriend, sportswriter Les Burns.","language":"English","Reception":"Film critic Dennis Schwartz called the film a \"minor film noir.\" He wrote, \"A minor film noir about a cold-hearted femme fatale who is capable of not only deceit but of murder. It's a precursor to the more hardboiled neonoir films of today. Jack Bernhard directs a film that is based on a Whitney Chambers story, and allows the storyline to remain an oddity because of how ruthlessly cold and insane the femme fatale character played by Leslie Brooks is presented.\"[3]Critic Gary Johnson discussed the production and the story line in his review, \"The acting is merely adequate and the direction is severely hampered by the low budget (although director Jack Bernhard and cameraman George Robinson do manage a few surprising camera angles). But the screenplay is a deliciously nasty and audacious exposé on the twisted psyche of a truly lethal femme fatale. Claire Cummings is a gold digger with no conscience whatsoever. She's out for herself and if anyone gets in the way, well ... she packs a revolver and a sharp knife. Claire Cummings is one of the most deadly femme fatales is the history of film noir, easily fitting alongside such other brutal dames as Phyllis Dietrichson from Double Indemnity, Kathie Moffat from Out of the Past, Annie Laurie Starr from Gun Crazy, and Vera from Edgar G. Ulmer's own Detour.[4]","cinematography":"George Robinson","production_company":"Martin Mooney Productions","directed_by":"Jack Bernhard","release_dates":"July 24, 1948 (1948-07-24) (United States)|||||","produced_by":"Martin Mooney","starring":"Leslie Brooks Robert Paige","running_time":"73 minutes","blonde_ice":"Theatrical release poster","music_by":"Irving Gertz","edited_by":"W.L. Bagier Jason H. Bernie"}