{"country":"United States","distributed_by":"United Artists (1981, original) MGM (2002, DVD) Olive Films (under license from MGM) (2015, Blu-Ray DVD)","Plot":"Atouk (Starr) is a bullied and scrawny caveman living in \"One Zillion BC – October 9th\".[1] He lusts after the beautiful but shallow Lana (Bach), who is the mate of Tonda (Matuszak), their tribe's physically imposing bullying leader. After being banished along with his friend Lar (Quaid), Atouk falls in with a band of assorted misfits, among them the comely Tala (Long) and the elderly blind man Gog (Gilford). The group has ongoing encounters with hungry dinosaurs, and rescues Lar from a \"nearby ice age\", where they encounter an abominable snowman. In the course of these adventures they discover sedative drugs, fire, invent cooking, music, weapons, and learn how to walk fully upright. Atouk uses these advancements to lead an attack on Tonda, overthrowing him and becoming the tribe's new leader. He rejects Lana and takes Tala as his mate, and they live happily ever after.","language":"English","box_office":"$15,965,924","cinematography":"Alan Hume","production_company":"Turman-Foster Company","caveman":"Movie poster","directed_by":"Carl Gottlieb","release_dates":"April 17, 1981 (1981-04-17)|||||","Production":"Filming was mostly done in a protected ecological research area named \"sierra de organos\" in the town of Sombrerete in the state of Zacatecas, México. The river and fishing lake scene was shot in the Mexican state of Durango, and some scenes were filmed at the Churubusco Studios in México City. The film features stop-motion animated dinosaurs constructed by Jim Danforth,[2] including a Tyrannosaurus Rex which in one scene becomes intoxicated by a Cannabis-type drug, animated by Randall W. Cook.[3] Danforth was a major participant in the special effects sequences, but left the film \"about two-thirds of the way\" (his words) through the work because the Directors Guild of America prohibited his contracted on-screen credit, co-direction with Carl Gottlieb. Consequently, Danforth's name does not appear on the film.[4]The film's dialog is almost entirely in \"caveman\" language, such as:At some showings audiences were issued a translation pamphlet for 30 \"caveman words.\"[5] The only English dialog present is used for comedic effect, when it is spoken by a caveman played by Evan Kim who speaks modern English but is understood by none of the other characters. Being a Korean caveman, by speaking English, he appears to be more advanced than the rest. At her audition, Long said she did not speak any English, but responded to everything with grunts.[5]Barbara Bach and Ringo Starr first met on the set of Caveman, and they married just over a year later.[6]","produced_by":"David Foster Lawrence Turman","starring":"Ringo Starr Dennis Quaid Shelley Long Barbara Bach","running_time":"91 min.","music_by":"Lalo Schifrin","edited_by":"Gene Fowler, Jr.","Release":"The film was released on February 17, 2015 on Blu-ray Disc over Olive Films.[7] It was previously released to DVD by MGM Home Entertainment on June 4, 2002 as a Region 1 widescreen DVD.","written_by":"Rudy De Luca Carl Gottlieb"}