{"country":"United States","distributed_by":"Gramercy Pictures","bound":"Theatrical release poster","Plot":"Corky (Gina Gershon), an ex-con who has just finished a five-year jail sentence, arrives at an apartment building to start work as a painter and plumber. On her way up to the apartment, she encounters the couple who live next-door, Violet (Jennifer Tilly) and Caesar (Joe Pantoliano). After Caesar has gone out, Violet flirts with Corky and asks her to help retrieve an earring that has fallen down her sink. After Corky extracts the earring, Violet admits she lost it on purpose in order to get closer to Corky, and starts to seduce her. They are interrupted by the arrival of Caesar and Corky goes back to work. When she leaves for the day, Violet follows her to her truck. They go to Corky's apartment and have sex. The next morning, Violet tells Corky that Caesar is a money launderer for the Mafia and they have been together for five years.Later, Violet overhears Caesar and his Mafia associates beating and torturing Shelly (Barry Kivel), a man who has been skimming money from the business. Upset by the violence and cruelty, Violet seeks solace from Corky. She tells Corky that she wants to make a new life for herself, but that she needs her help. Knowing that Caesar will find the nearly $2 million Shelly took and count it in their apartment, the two women hatch a scheme to steal the money. Corky, already wary of Violet's intentions, is unsure whether to trust her.Shelly is shot and killed by Johnnie (Christopher Meloni), the son of Mafia boss Gino Marzzone (Richard C. Sarafian), and Caesar returns to the apartment with a bag of bloody money. Angry at Johnnie for killing Shelly in a fit of rage and splattering blood everywhere, Caesar proceeds to wash, iron and hang the money to dry.Violet explains to Corky that Caesar and Johnnie hate each other, and that Gino and Johnnie will be coming to pick up the money from Caesar. The plan is as follows: When Caesar has finished counting the money, Violet will get him a drink to relax him before he showers. Corky will be next-door, waiting until she hears Caesar turn on the shower. When he does, Violet will drop the bottle of Scotch that is for Gino and tell Caesar that she is going to buy more. As she leaves the apartment, she will let Corky in, who will steal the money from a briefcase and leave. Violet will then return with the Scotch and tell Caesar that she just saw Johnnie leaving, but that Gino was not with him. Suspicious, Caesar will check the briefcase, find the money gone, and assume Johnnie has taken it. Corky and Violet think Caesar will be forced to skip town because Gino will assume he has been robbed by Caesar, not his son.Everything goes as planned until Caesar finds the money gone. He realizes that if he runs, Gino will think he took the money. He decides he has to get the money back from Johnnie. Panicking, Violet threatens to leave. Caesar pulls out his gun and forces her to stay, thinking that maybe she and Johnnie have stolen the money and framed him.Corky waits next-door with the money while Gino and Johnnie arrive. After watching Johnnie flirt with Violet and taunt him, Caesar pulls out a gun and tells Gino that his son stole the money. In an angry panic, he kills both Gino and Johnnie, and Gino's bodyguard Roy. He tells Violet that they have to find the money, dispose of the bodies, and pretend Gino and Johnnie never arrived, lest their Mafia pals find the money or men missing. Unable to find the money at Johnnie's apartment, Caesar telephones Mickey (John P. Ryan), a Mafia friend, telling him that Gino has yet to arrive.After discovering Corky and Violet stole the money, Caesar ties them up, gags them, threatens to torture them, and demands to know where it is. When Mickey arrives to see what is going on, Caesar, panicked, makes a deal with Violet to help him stall. As he prepares to kill Mickey, Violet calls the landline from Johnnie's cell phone and quickly convinces Caesar to pretend that he's on the phone with Gino, who's calling from a hospital to explain that he and Johnnie were in a car accident. Mickey is convinced and leaves for the hospital. Corky tells Caesar where she has hidden the money, and he goes next-door to find it. Violet escapes and makes a phone call to Mickey, telling him that Caesar stole the money and forced her to keep quiet. In the meantime, Corky tries to stop Caesar from taking the money, but he beats her to the ground. Just as he is about to kill her, Violet arrives and pulls a gun on Caesar, telling him that Mickey is on his way and that he should run while he can. Caesar tells Violet that he knows she will not shoot him, to which she replies, \"Caesar, you don't know shit\", before killing him.Later, Mickey, who believes Violet's story, tells her that he will find Caesar, and that there is no need to involve the police. Mickey wants Violet to be his girlfriend, but she tells him that she needs a clean break—which she makes by driving off hand-in-hand with Corky.","language":"English","Themes":"The Wachowskis describe several themes present in Bound. They say that the film is about \"the boxes people make of their lives\", that it is not only gay people who \"live in closets\". They wanted to define all of Bound's characters by the \"sort of trap that they were making out of their lives\".[6] Violet is trapped in her life with Caesar, and in the first scene, Corky is literally inside Violet's closet, bound and gagged by Caesar.[7] This scene is echoed later in the film when Violet says \"I had this image of you inside of me...\"[7] This theme of being trapped is exacerbated by the claustrophobic feeling created by the fact that most of the film takes place in Corky's apartment, Violet and Casear's apartment, or the apartment next door where Corky is working.[7]Susie Bright described some of the specifically lesbian themes of the film. One is the concept of the hand as a sex organ, highlighted by lingering camera shots of Corky and Violet's hands.[7] Another is the repeated use of water as a symbolic motif to represent women, present for example when Corky is retrieving Violet's earring from the sink.[7] Bright describes it as a movie that is \"wet\" (feminine) as opposed to \"hard\" (masculine).[7] She says the scene where Corky and Violet have their first conversation is full of \"lesbian signs\". She highlights the fact that Violet, away from Caesar, is wearing jeans and able to be less overtly feminine. Jennifer Tilly says that whenever Violet is talking to men, her voice becomes high-pitched and \"girly\"—making her seem vulnerable and ensuring she is taken care of. Joe Pantoliano agrees, saying that the result is that \"everyone in the film wants to be with Violet\".[7] When she is with Corky, Violet can drop the act and talk at a more natural pitch. According to Bright, the more subtle lesbian themes of the film were noticed and appreciated at the LGBT film festival screenings.[7]","box_office":"$3.8 million[3]","Background and production":"Film producer Joel Silver has said that after working as scriptwriters on Assassins, the Wachowskis made Bound as an \"audition piece\" to prove that they knew what to do on a movie set.[2] Conversely, Lana Wachowski has said Joel \"made that up.\" The Wachowskis themselves claim they \"decided simply to focus on making their own directorial debut.\"[4] They had the idea to write a story about how one might see a woman on the street and make assumptions about her sexuality, but how those assumptions might be wrong.[5] They wanted to play with stereotypes and make an entertaining film that contained sex and violence, because those are the kinds of films that they like to watch.[2][5] Seeing film noir as a genre within which they could tell a contained story and twist conventions, they described Billy Wilder as a big influence.[5]When executives at some studios read the script, they told the Wachowskis that if they changed the character of Corky to that of a man, they would be interested. The siblings declined, saying \"that movie's been made a million times, so we're really not interested in it.\"[6] Dino De Laurentiis, the executive producer on Assassins, offered to finance Bound and his company produced it, giving them \"free rein\" with regard to the story.[7] The film's budget was $6 million.[2]The Wachowskis struggled to cast the roles of Violet and Corky, seemingly because of the lesbian content of the film. Few actresses were interested.[6] The part of Violet was expected to go to Linda Hamilton, and Jennifer Tilly read for the part of Corky. She loved the role and was looking forward to playing a character very different from previous parts in her career.[8] When the part of Violet became available, and Gina Gershon came in to read for Corky, Tilly agreed that Gershon would make a better Corky.[9] She realized that she identified with the character of Violet, a woman \"underestimated by all the men around her\" who has to \"play the game\".[8][10] She describes it as the best role she had ever had.[8] Gina Gershon suggested Joe Pantoliano to the Wachowskis for the part of Caesar. His first lead role in a film, he describes it as his favorite.[11]Bound was shot in thirty-eight days in Santa Monica, California.[6][7] The Wachowskis' original director of photography resigned on the grounds that he could not do the film with the limited budget he had available, nor did he know anyone he believed could. Subsequently cinematographer Bill Pope was hired, who knew \"a bunch of cheap guys\".[12] Pope became heavily involved in creating the visual noir style of the film. He and the Wachowskis drew from their love of comics and were influenced by Frank Miller's neo-noir Sin City series in particular.[2] Pope's sound counterpart was sound director Dane Davis. One of his ideas was to give Corky a cat-like quality by making a \"swishing\" sound every time she walks past the camera in the scene where she and Violet plan the theft.[7]The Wachowskis asked Joe Pantoliano to watch John Huston's The Treasure of the Sierra Madre and to focus on Humphrey Bogart's character in order to prepare the paranoia of Caesar.[7] Gershon's influences for her role were James Dean, Marlon Brando and Clint Eastwood.[7] Both Gershon and Tilly were nervous about filming the sex scenes and prepared by drinking tequila.[10]Very little improvisation took place during the filming due to the directors' extensive planning and clear vision for the film.[7] Not everything went as expected, however, as the physical exchanges in the script caused some injuries. Barry Kivel, whose character Shelly was violently beaten in Caesar's bathroom, received a head injury from his head being banged against the toilet. In the scenes between Corky and Caesar near the end of the film, Gina Gershon hit her hand so hard when she knocked a gun from Joe Pantoliano's hand that she required stitches.[7]The sex scenes were choreographed by feminist writer and sex educator Susie Bright. The Wachowskis were fans of Bright and sent her a copy of the script with a letter asking her to be an extra in the film. When she read the script she loved it, particularly as it was about women enjoying having sex and not apologizing for it. Disappointed that they never described exactly what was happening in the sex scenes, she asked if she could be a sex consultant for the film and they agreed.[7] The main sex scene set in Corky's apartment was filmed in one long shot. The Wachowskis believed that this would look more realistic than several shots edited together.[7] Although it should have been a closed set, there were actually many people present, moving the walls of the set in order to allow full movement of the camera around the actors.[7]Bright appeared as Jesse, the woman Corky tries to talk to in the bar. Comedian Margaret Smith played Jesse's girlfriend and the extras in the bar scene were Bright's friends—\"real life San Francisco dykes\".[7]","cinematography":"Bill Pope","production_company":"Dino De Laurentiis Company Spelling Group","directed_by":"The Wachowskis","Music":"The score, composed by Don Davis, was given a promotional release on November 25, 1997 by Super Tracks Music Group, but has never been released commercially.[42] Having her character Corky play a jaw harp was Gina Gershon's idea.[7] The directors' budget for songs was small; they had wanted to use \"The Girl from Ipanema\" and Frank Sinatra songs, but could not afford to.[7] The four songs used in the film were not included on the score release.[43]","release_dates":"August 31, 1996 (1996-08-31) (Venice Film Festival)|October 4, 1996 (1996-10-04) (US)||||","produced_by":"Stuart Boros|Andrew Lazar|","starring":"Jennifer Tilly|Gina Gershon|Joe Pantoliano|","running_time":"108 minutes[1]","music_by":"Don Davis","edited_by":"Zach Staenberg","Release":"Bound was rated by the Motion Picture Association of America (MPAA) as R for \"strong sexuality, violence and language.\" To achieve that rating, the directors had to cut part of the first sex scene between Corky and Violet.[7] The MPAA were most concerned with the images of what Lana Wachowski called \"hand-sex\".[13] It was rated R in Australia, R18 in New Zealand and 18 in the United Kingdom. In Canada it was rated as R in Manitoba and Ontario, 18 in Nova Scotia and 16+ in Quebec.The film premiered on August 31, 1996, at the Venice Film Festival and in September went on to play at the Toronto International Film Festival. It opened in U.S. theaters on October 4, 1996 distributed by Gramercy Pictures, showing in 261 theaters.[3] It closed after three weeks. It opened in the United Kingdom on February 28, 1997.[14]Bound grossed $3,802,260 in the United States. In its opening weekend, showing at 261 theaters, it earned $900,902, which was 23.7% of its total gross.[3] According to Box Office Mojo, it ranked at 161 for all films released in the United States in 1996, and at 74 for R-rated films released that year. As of July 2012, its all-time ranking for LGBT-related films is 59.[3]The review aggregator website Rotten Tomatoes gave it a \"fresh\" rating of 92% based on 37 reviews, while Metacritic gave it a score of 61/100 based on 19 reviews.[15][16] The Wachowskis' direction was praised, being described as clever, sophisticated and stylish.[17][18][19] Roger Ebert said that their skillful film making showed virtuosity and confidence.[20] Marjorie Baumgarten writing for The Austin Chronicle called it an impressive debut saying that the Wachowskis have \"style to burn\".[21] James Kendrick called it a darkly comical and stunning film, saying it signalled the arrival of the Wachowskis on the film scene.[22] Detractors of the film included Todd McCarthy for Variety, who said that the directors had no sense of humor and lacked depth, that the film was pretentious, superficial and heavy-handed.[23]On the release of Bound, the Wachowskis were compared by many to the Coen Brothers.[22][24] Rita Kempley for The Washington Post went so far as to call them \"Coen Brothers clones\".[17] In particular, similarities were drawn between Bound and the Coen Brothers' first film, 1984 neo-noir Blood Simple.[25][26] Bryant Frazer for Deep Focus called it an \"obvious precursor\".[27] Critics noted resemblances to the films of Quentin Tarantino and Alfred Hitchcock.[22][28][29]Janet Maslin for The New York Times said that the grisly violence in Bound would likely limit its audience and Ebert said that its shocking violence would offend some audiences.[20][24] Some critics said that the violent behavior of the characters had no moral justification. Rita Kempley for The Washington Post called it \"well-nigh unwatchable cruelty for its own sake\".[17] McCarthy, who called the central relationship between the two women unbelievable and unsympathetic, said \"just because Violet and Corky fall for each other doesn't mean they somehow fall into a privileged state of grace in which vile behavior can be forgiven.\"[23] Other critics were less concerned, calling the violence \"comically excessive\" and \"Tarantino-like\".[19][28]Bound was praised for being perhaps the first mainstream film to have a lesbian relationship at its heart without homosexuality being central to the plot.[29][30] Despite the presence of \"unapologetically gay\" lead character Corky, it is not commonly considered a \"lesbian movie\".[25][31] Emanuel Levy said that this is a weakness, that mainstream films with broadening storylines \"do not necessarily represent a positive development in the making of gay and lesbian films\" and that Bound has \"little, if anything, to do with lesbian cinema\".[19] Jonathan Rosenbaum for the Chicago Reader called it a \"welcome change\" to have a lesbian couple as the main characters in a mainstream film.[32] Sarah Warn for AfterEllen.com called Corky \"the closest thing to a realistic and sympathetic butch lesbian we've seen in a mainstream movie\".[30] Barry Walters for the San Francisco Chronicle praised the film for showing gay characters that have an active sex life.[33] The sex scenes, described as explicit and steamy, were admired for being tasteful, discreet and realistic.[31][33] Warn called them \"some of the best lesbian sex scenes to date in a mainstream movie\".[30]The three lead actors were complimented for their performances. Ebert said that Gershon and Tilly were electric together, and Frazer said that he would have liked to have seen more of their love story.[20][27] Some critics, however, described their onscreen relationship as unbelievable and unsympathetic.[18][23] Gershon was seen to have made a comeback after her role in the less well received 1995 film Showgirls.[20] Tilly's performance was compared to her Academy Award-nominated part in Bullets Over Broadway.[26] Pantoliano was described as \"a lot of fun\" and having the \"trickiest scenes in the movie\".[20][34]Bound won the Grand Jury Award—Honorable Mention at the 1996 L.A. Outfest, and in the same year won an Honorable Mention at the Stockholm International Film Festival.[35][36] At the 1997 Fantasporto festival in Portugal, the Wachowskis were awarded the International Fantasy Film Award for best film, and Jennifer Tilly picked up the award for best actress.[37] Bound won the 1997 GLAAD Media Award for Outstanding (wide-release) Film.[16] The film was nominated for the prestigious Grand Prix of the Belgian Syndicate of Cinema Critics.[38]Bound was released on Region 1 DVD on November 12, 1997 by Republic Pictures. It featured the original theatrical trailer and an audio commentary by the directors and stars.[39] It was released on Region 2 DVD on August 25, 2003, by Pathé featuring original theatrical trailers, audio commentary by the directors and stars, cast and crew biographies and a production featurette.[40] Its Region 4 DVD release, distributed by Reel and featuring an audio commentary, came on August 14, 2006.[41]","written_by":"The Wachowskis","budget":"$6 million[2]"}