{"based_on":"Dark Water  by Hideo Nakata","distributed_by":"Buena Vista Pictures","Plot":"Dahlia battles her ex-husband Kyle for custody of their daughter Cecilia. Kyle wants Cecilia to live closer to his apartment in Jersey City, but Dahlia wants to move to the cheaper Roosevelt Island, where she has found a good school.Dahlia and Cecilia view an apartment in a dilapidated complex on Roosevelt Island, a few blocks from Cecilia's new school. Cecilia sneaks to the roof and finds a Hello Kitty backpack near the building's water tower; the manager, Murray, promises Cecilia that she can have it if no one claims it. Cecilia, who had disliked the apartment, now wants to live there. Dahlia makes an offer the same day.Shortly after they move in, the bedroom ceiling begins to leak dark water. Dahlia finds the apartment above, 10F, flooded from every faucet. She finds a family portrait of the former tenants, the Rimsky family: a mother, father, and a girl Cecilia's age. Dahlia complains to Murray and the superintendent Veeck about the water, but Veeck insists that he is not a plumber and blames teenage vandals. The ceiling, shoddily patched by Veeck, leaks again. Dahlia is intimidated by teenagers in the apartment, and sees the face of a screaming girl in a washing machine.Cecilia's teacher is troubled by Cecilia's imaginary friend, Natasha. Cecilia appears to argue with Natasha and lose control of her hand as she paints. In the bathroom, she passes out as dark water gushes from the toilets and sinks. Dahlia is busy meeting her lawyer, Jeff Platzer, so Kyle takes Cecilia to his apartment.That night, Dahlia follows footsteps to the roof and sees that water is spilling from the water tower. Inside she finds Natasha's body. Veeck is arrested for negligence; he was aware of her body, which was why he refused to fix the complex's plumbing problems. Dahlia and Platzer discover that Natasha's parents had left her behind, each believing she was with the other. Natasha was left to fend for herself, and fell into the water tower and drowned.Dahlia agrees to move closer to Kyle so shared custody will be easier. As she packs, a girl in a hooded bathrobe asks her to read to her. When Dahlia hears Cecilia in the bathroom, she realizes that the girl is Natasha. Natasha begs Dahlia not to leave her, but Dahlia rushes into the bathroom to save Cecilia. Natasha locks Cecilia in the shower compartment and holds her underwater. Dahlia pleads with Natasha to let her daughter go, promising to be her mother forever. Floods overwhelm the apartment and Natasha and Dahlia's spirits walk the hall as mother and daughter.Weeks later, Kyle and Cecilia pick up the rest of the belongings. In the elevator, Dahlia's ghost braids Cecilia's hair, telling her she will always be with her.","language":"English","Reception":"Reviews of the film are mixed. It currently holds a 46% \"Rotten\" rating at Rotten Tomatoes.[3] William Thomas wrote in Empire the film as \"Interesting and unsettling, but never terrifying. Best viewed as a family drama-cum-Tale Of The Unexpected rather than a full-on horror\".[4]","box_office":"$49,483,352[2]","cinematography":"Affonso Beato","production_company":"Touchstone Pictures Vertigo Entertainment","directed_by":"Walter Salles","Home media":"Dark Water is available on DVD, in two releases. One release is in pan and scan full screen and includes the theatrical cut, which is PG-13 and runs 107 minutes. The other is in widescreen (aspect ratio 2.35:1) and includes an unrated cut, which is actually shorter than the theatrical cut and runs at 103 minutes. Note that exact specifications vary by DVD region. There is also a PlayStation Portable UMD video version of the film. A Blu-ray Disc was released on October 17, 2006 but it only contains the widescreen PG-13 theatrical version and fewer extras than the DVD releases.","release_dates":"July 8, 2005 (2005-07-08)|||||","dark_water":"British Theatrical release poster","produced_by":"Roy Lee Doug Davidson Bill Mechanic","starring":"Jennifer Connelly Tim Roth John C. Reilly Dougray Scott Ariel Gade Pete Postlethwaite Perla Haney-Jardine","running_time":"105 minutes[citation needed]","music_by":"Angelo Badalamenti","edited_by":"Daniel Rezende","written_by":"Rafael Yglesias","budget":"$30 million[1]"}