{"country":"United States","distributed_by":"Warner Bros.","language":"English","Synopsis":"Street corner salesman Daffy tries to make a pitch to reclusive billionaire and \"ailing buzzsaw baron\" J.P. Cubish (a dog)---who has offered wealth to anyone who can make him laugh before he passes on---only to be stymied by Cubish's butler (also a dog). Eventually driving off the butler, Daffy becomes Cubish's jester, taking uncounted pies in the face while Cubish laughs uproariously. After Cubish's death soon afterward (\"Died Laughing,\" reports one newspaper), Daffy inherits the Cubish fortune, under the provision that he will use the money to provide a service to the community and follow Cubish's creed to display honesty in business affairs. The now-wealthy Daffy derides the idea (\"What a rube!\" he says of Cubish), but his deceased benefactor returns as an unseen ghost, with the intention of taking back his fortune until Daffy agrees to uphold the terms. The irked Daffy vows to use the money to wipe out ghosts (à la Ghostbusters) such as Cubish.Setting himself up as a \"Paranormalist at Large,\" Daffy persuades Bugs Bunny to appear in commercials (despite the rabbit's intention of going to Palm Springs), then hires Porky Pig (accompanied by Sylvester) as an underling; Cubish continues to make money vanish whenever Daffy seems to be operating dishonestly.Sylvester has an exploit with Tweety Bird, where Sylvester is mercilessly chased by a monstrous version of Tweety and develops paranoia in front of Daffy and Porky. Daffy assigns Porky to investigate the resort town of Dry Gulch for any suspicious ghost activity. Porky agrees to take the case and takes the now-paranoid Sylvester with him.Although Daffy successfully exorcises the ghosts possessing a lady duck (with Daffy temporarily falling under possession from them himself), he discovers that Cubish has stripped his money down to his last million. He then receives a call from Porky, who is returning with Sylvester from their assignment to Dry Gulch, and Daffy reassigns him to the Superstition Mountains, much to Sylvester's chagrin. Daffy then calls up Bugs, who is leaving following his encounter with Count Blood Count, and together they go up against Hugo the Abominable Snowman, with Hugo repeatedly mistaking Daffy for a rabbit.When the city is swept with reports of a tiny elephant, Daffy, presuming it mere hysteria, hopes to profit by soothing the public with his \"expert\" testimony. However, the elephant turns up on Daffy's television interview on Frightline with Zed Toppel, making him a laughingstock.Daffy decides to blame the debacle on the absent Porky and absent-mindedly remarks that there was \"nothing wrong with a little dishonesty in business affairs.\" But upon realization of what he said, Daffy discovers that Cubish has just taken away the last of the money leaving a note telling Daffy \"you lose.\" A defeated Daffy trudges back to his desk saying, \"I'm finished. Strapped. Kaput.\" Things get worse when Egghead appears as a singing telegram, announcing to Daffy that due to unpaid rent, he is being dispossessed. After the repo crew takes away his belongings, Daffy's building is condemned with him still in it. Before impact, Daffy sadly says to the audience, \"One thing's for sure, I've got nowhere else to go but up!\"In the \"epilogue,\" Bugs is shown enjoying his vacation in Palm Springs (after the encounter with Hugo) and reading about Daffy's downfall (\"Quackbusted\", reports the newspaper Bugs is reading), and Porky and Sylvester are stranded in the Superstition Mountains, with Sylvester as cowardly as ever. A shot of Cubish's grave is shown where it states that Cubish is still dead. It is revealed that Daffy is back where he started, as a street corner salesman, this time, selling supernatural trinkets (including wind-up dolls of Gossamer at one dollar each). Unfortunately, when Daffy earns a dollar bill, it instantly vanishes. The film ends with Daffy angrily shaking his fist at the sky and screaming \"Cubish!\" (implying that Cubish is still haunting Daffy) which cuts to a 'Finis' card.","cinematography":"Tim Whintall","production_company":"Warner Bros. Animation","directed_by":"Greg Ford Terry Lennon","narrated_by":"Rolf Saxon","release_dates":"September 24, 1988 (1988-09-24)|||||","produced_by":"Steven S. Greene Kathleen Helppie-Shipley","starring":"Mel Blanc Julie Bennett Roy Firestone B.J. Ward","running_time":"78 minutes","daffy_duck's_quackbusters":"Theatrical release poster","music_by":"Milt Franklyn William Lava Carl Stalling (majority from old cartoons)","edited_by":"Treg Brown","written_by":"John W. Dunn Michael Maltese Tedd Pierce"}