{"country":"India","distributed_by":"Mak Productions","screenplay_by":"P. R. Nathan","Plot":"This movie revolves around the life of Rajasekharan, Shabari, Devi and Omallur Sadasivan. Omallur Sadasivan, a minister of Kerala Legislative Assembly, is alleged to be involved in a scam relating to dam construction. Vettukuzhi, a political king maker, tries to save Minister Sadasivan and the reputation of the party. A Commission headed by Justice Rajeshekharan Nair is appointed by the Court to investigate into the dam scam. Shabari, a young talented writer, resides at the Kerala Guest House, to complete his new novel. Shabari is forced to vacate the room occupied by him at the Guest House, due to the arrival of Judge and his family consisting of his wife Malathi and beautiful daughter Devi. Shabari and Devi will get acquainted with each other. Eventually, both of them fall in love with each other. Dr. Dinesh, son of Minster Sadasivan, does not appreciate his father's friendship with Vettukuzhi. Dr. Dinesh's and Sunitha's marriage get cancelled due to the allegations faced by the Minister Sadasisvan. Vettukuzhi tries to bribe Rajeshekaran. Rajashekaran, being a honest judge, boldly refuses to accept the money offered by Vettukuzhi. Shabari tells Rajasekharan about his wish to marry Devi. Rajasekharan and Malathi is happy about this union. When Shabari asks Devi whether she is interested in marrying him, she remains silent. When Shabari repeatedly asks Devi for answer, Devi cries. That is when Shabari comes to know about the Devi's inability to speak. Shabari is shocked by this revelation. Shabari's parents does not like this alliance since Devi is mute. Justice Rajasekharan tries to convince Shabari's father who is his childhood friend. But, fails to do so. Commission submits its report about the dam scam which results in the resignation of Minister Omallur Sadasivan. Eventually, Shabari's parents give consent for the marriage of Devi and Shabari. Thus, the duo is united.","language":"Malayalam","cinematography":"Venu CE Babu","production_company":"Mak Productions","directed_by":"A. T. Abu","Soundtrack":"The score and soundtrack for the movie are composed by renowned musician Naushad. It remains as the only Malayalam movie for which Naushad had composed music for. The lyrics are written by poet Yusuf Ali Kechery in Malayalam and Sanskrit. The soundtrack is highly regarded as one of the best and classic songs of all times in Malayalam film music.[6]","Awards":"","release_dates":"25 December 1988 (1988-12-25)|||||","produced_by":"Amjad Ali","starring":"Prem Nazir Jayabharathi Jayaram Shobhana Vaikom Muhammad Basheer Suresh Gopi","music_by":"Naushad","edited_by":"G Venkittaraman","written_by":"P. R. Nathan"}