{"country":"Japan","Plot":"At a medical instrument manufacturing company, timid engineering scientist Michio Hayasaki (Koji Yakusho) struggles to develop a robotic chair that could mobilise a clinically paralysed person. He realises he's not getting anywhere with it. Not while his company keeps making demands and issuing deadlines on him. Highly stressed, he bitterly realises he doesn't have the courage to bite back.Whilst arriving home from work, he's startled to find himself waiting on his doorstep. He soon sees it's not him, but a man who's the splitting image of him. Fearing he's having a mental breakdown, he wonders whether a legend that says one is destined to die soon after seeing own doppelganger may be true. His apparent twin (also Koji Yakusho) smoothly assures him that he has nothing to fear. He's a doppelganger. Bemused, Hayasaki invites him to his home.He eventually notices that while his doppelganger is identical to his looks, mannerisms and speech, the doppelganger's personality and attitude are drastically different from his own. Where he's too timid to get what he wants, his doppelganger has no qualms in getting what it wants. Where he's too afraid to speak out, his doppelganger speaks its mind. Where he's moderate with drinking, the doppelganger indulges heavily. Where he's detail-oriented, it doesn't pay much attention to details as it's more concerned with the end result.As his doppelganger removes all sources of Hayasaki's stress, reorganises his life for better, acquires all things he's yielded for, does rebellious things Hayasaki couldn't do, and assists with building the robotic chair that frustrates him for so long, Hayasaki learns to enjoy his doppelganger's seemingly nihilistic actions.He soon wonders whether his doppelganger has an agenda when he realises he's being dragged into madness.","language":"Japanese","Reception":"Josh Ralske of AllMovie gave the film 3.5 out of 5 stars.[1] Mike Bracken of IGN praised Koji Yakusho's performance for \"the difficult task of playing two characters who are the same on the outside but totally opposite otherwise.\"[2] Todd Brown of Twitch Film felt that the digital composites used to double Yakusho on screen are simply perfect.[3]Tom Mes of Midnight Eye noted that the film has many similarities in particular with Kiyoshi Kurosawa's 1996 V-Cinema Suit Yourself or Shoot Yourself: The Nouveau Riche, saying: \"The cyclical structure of recurring events that formed the basis of that film's plot is reused in the final 30 minutes of Doppelgänger\".[4]","cinematography":"Noriyuki Mizuguchi","directed_by":"Kiyoshi Kurosawa","release_dates":"September 27, 2003","produced_by":"Motoo Kawabata Takayuki Nitta Atsushi Sato Atsuyuki Shimoda","starring":"Koji Yakusho Hiromi Nagasaku Yusuke Santamaria","running_time":"107 minutes","music_by":"Yusuke Hayashi","External links":"","edited_by":"Kiyoshi Kurosawa Masahiro Onaga","written_by":"Takeshi Furusawa Kiyoshi Kurosawa"}