{"country":"United Kingdom","distributed_by":"United International Pictures (UK)","language":"English","Reception":"The film was panned by many critics. Michael Dwyer in The Irish Times described Carry on Columbus as a \"flaccid, feeble comeback effort\" and a \"wretched and pathetic attempt which is singularly unfunny\".[1] However, Carry On Columbus took more money at the UK box office than the two other Columbus films released in 1992, Christopher Columbus: The Discovery and 1492: Conquest of Paradise, although all three films flopped. Carry On Columbus was also shot on a much lower budget than the other two films, a budget of £2.5 million compared to the other two budgets of $45 million and $47 million respectively.[citation needed]In a 2004 poll of British film actors, technicians, writers and directors on British cinema, Carry On Columbus was voted the worst British film ever.[2]","Plotline":"Christopher Columbus (Jim Dale) believes he can find an alternative route to the far East and persuades the King (Leslie Phillips) and Queen of Spain (June Whitfield) to finance his expedition. But the Sultan of Turkey (Rik Mayall), who makes a great deal of money through taxing the merchants who have to pass through his country on the current route, sends his best spy, Fatima (Sara Crowe), to wreck the trip...","cinematography":"Alan Hume","production_company":"Island World","directed_by":"Gerald Thomas","Casting":"The only main series regulars present are Jim Dale (in his eleventh Carry On), Peter Gilmore (also in his eleventh), Bernard Cribbins (in his third), Leslie Phillips (in his fourth), Jon Pertwee (in his fourth) and June Whitfield (also in her fourth). The only actor to bridge the gap between Carry On Columbus and the previous entry was Jack Douglas, making his eighth appearance in the series.Original Carry On performer Frankie Howerd was signed up to appear, but he died shortly before he was due to film his role. His part as the King of Spain was offered to original series regular Bernard Bresslaw, who turned it down. Leslie Phillips eventually took on the role, playing opposite June Whitfield as the Queen, a role turned down by both Joan Sims and Barbara Windsor.The producers managed to persuade a number of alternative comedians such as Peter Richardson, Alexei Sayle, Rik Mayall, Julian Clary and Nigel Planer, all of whom except Clary are from the Comic Strip, to appear in the film.This was the last film that Gerald Thomas directed, as he died on 9 November 1993.","release_dates":"October 1992","carry_on_columbus":"Original UK quad poster","produced_by":"John Goldstone Peter Rogers (executive producer)","starring":"Jim Dale Bernard Cribbins Maureen Lipman Peter Richardson Alexei Sayle Rik Mayall Charles Fleischer Larry Miller Leslie Phillips Julian Clary Sara Crowe Rebecca Lacey Nigel Planer June Whitfield Richard Wilson","running_time":"91 minutes","Filming and locations":"Interiors:Exteriors:","music_by":"John Du Prez","edited_by":"Chris Blunden","written_by":"Dave Freeman John Antrobus","budget":"£2,500,000"}