{"based_on":"Cool Hand Luke  by Donn Pearce","country":"United States","distributed_by":"Warner Bros.-Seven Arts","screenplay_by":"Donn Pearce|Frank R. Pierson|","Plot":"Decorated World War II veteran Lucas \"Luke\" Jackson (Paul Newman), is arrested for cutting the \"heads\" off of parking meters one drunken night. He is sentenced to two years in prison and sent to a Florida chain gang prison run by a stern warden, the Captain (Strother Martin), and a stoic rifleman, Walking Boss Godfrey (Morgan Woodward), whose eyes are always covered by a pair of mirrored sunglasses. Carr (Clifton James) the floorwalker, tells the rules to the new set of prisoners, with any violations resulting in spending the night in “the box,” a small squared room with limited air and very little room to move.Luke refuses to observe the established pecking order among the prisoners and quickly runs afoul of the prisoners' leader, Dragline (George Kennedy). When the pair have a boxing match, the prisoners and guards watch with interest. Although Luke is severely outmatched by his larger opponent, he refuses to acquiesce. Eventually, Dragline refuses to continue the fight. Luke's tenacity earns the prisoners' respect. Later, Luke wins a poker game by bluffing with a hand worth nothing. Luke comments that \"sometimes nothing can be a real cool hand,\" prompting Dragline to nickname him \"Cool Hand Luke\".After a visit from his sick mother Arletta (Jo Van Fleet), Luke becomes more optimistic about his situation. He continually confronts the Captain and the guards, and his sense of humor and independence prove to be both contagious and inspiring to the other prisoners. Luke's struggle for supremacy peaks when he leads a work crew in a seemingly impossible but successful effort to complete a road-paving job in less than one day. The other prisoners start to idolize him after he makes and wins a spur-of-the moment bet that he can eat fifty hard-boiled eggs in one hour.One day Luke picks up a deadly rattlesnake from the grassy ditch and holds it up for Boss Godfrey to shoot with his rifle. Luke tosses the snake to the boss as a joke, before he hands him his walking cane. Dragline advises Luke to be more careful about his actions pertaining to the \"man with no eyes.\" A rainstorm causes everyone to prematurely end their work. Before he joins the other prisoners in the truck, Luke shouts to God, testing him. On that same evening, Luke receives a letter stating that his mother has died.After news of his mother's death reaches Luke, the Captain, anticipating that Luke might attempt to escape in order to attend his mother's funeral, has him locked in the prison punishment box. After being released from the box, receiving word that his mother's burial is completed, and being told to forget about her, Luke is determined to escape. Under the cover of a Fourth of July celebration, he makes his initial escape attempt. He is later recaptured by local police and returned to the chain gang, but not before one of the blood hounds sent after him dies from strain caused by struggling through barbed-wire fences. After his capture and return, the Captain has Luke fitted with leg-irons and delivers a warning speech to the other inmates, explaining, \"What we've got here is failure to communicate. Some men you just can't reach. So you get what we had here last week, which is the way he wants it. Well, he gets it. I don't like it any more than you men.\"A short time later, Luke escapes again by using string to shake a bush and distract the guards, visiting a nearby house where he uses an axe to remove his shackles. To keep the guard dogs from following his scent, he spreads curry powder and chili powder across the ground to send them into sneezing fits and overload their sensitive sense of smell. While free, Luke mails Dragline a magazine that includes a photograph of him with two beautiful women. He is soon recaptured, beaten, returned to the prison camp and fitted with two sets of leg irons. Luke is warned by the Captain that if he ever attempts to escape again, he will be killed on the spot. Luke is now annoyed by the other prisoners fawning over the magazine photo and reveals it to be a fake. At first, the other prisoners are angry, but after a long stay in the box, when Luke is forced to eat a huge serving of rice, they come to help him finish it.As punishment for his escape, he is forced to repeatedly dig a grave-sized hole in the prison camp yard, fill it back in, then be beaten. The prisoners observe his persecution, singing spirituals. Finally, as the other prisoners watch from the windows of the bunkhouse, an exhausted Luke collapses in the hole, begging God for mercy and pleads with the bosses not to hit him again. Believing Luke is finally broken, the Captain stops the punishment. Boss Paul warns Luke that he will be killed if ever he runs away again, which Luke promises in tears not to do. The prisoners begin to lose their idealized image of Luke, and one tears up the photograph of Luke with the women.Seemingly broken, and again working on the chain gang, Luke stops working to give water to a prisoner. Watched by the disappointed prisoners, he runs to one of the trucks to take Boss Godfrey's rifle to him. After Boss Godfrey shoots a snapping turtle, Luke retrieves it from a slough for him, complimenting the boss for his shot. Luke takes one last stab at freedom when he is ordered to take the turtle to the truck. He steals the dump truck, as well as the keys to the other trucks. In the excitement of the moment, Dragline jumps in the dump truck and joins Luke in his escape. Later, after abandoning the truck, Luke tells Dragline that they should part ways. Drag agrees and leaves. Luke enters a church, where he talks to God and blames Him for sabotaging him so he cannot win in life. Moments later, police cars arrive. Dragline walks in and tells Luke that the police and bosses have promised not to hurt Luke if he surrenders peacefully. But Luke, feeling that his life is no longer worth living, walks to a window facing the police and mocks the Captain by repeating the first part of his speech (\"What we've got here is a failure to communicate.\"). He is immediately shot in the neck by Boss Godfrey. Dragline carries Luke outside, then charges at Boss Godfrey and attempts to strangle him until he is beaten and subdued by the other guards. In tears, Dragline implores Luke to live. The local police want to take Luke to a nearby hospital, but the Captain tells them to take him to the prison hospital instead, a long enough distance that Luke's chances of survival are slim. As the captain's car drives away, it crushes Boss Godfrey's glasses. After Luke's implied death, Dragline and the other prisoners reminisce about him. In the final scene, the prison crew is seen working near a rural intersection close to where Luke was shot. Dragline is now wearing leg irons, and there is a new Walking Boss. As the camera zooms out, the torn photograph of Luke grinning with the two women is superimposed on a bird's eye view of the cross-shaped road junction.","language":"English","Themes":"Pierson included in his draft explicit religious symbolism.[3] The film contains several elements based on Christian themes, including the concept of Luke as a Saint who wins over the crowds and is ultimately sacrificed.[23] Newman's character of Luke is portrayed as a \"Jesus-like redeemer figure.\"[24] After winning the egg-eating bet, Luke lies exhausted on the table in the position of Jesus as depicted on his crucifixion. After learning about the death of his mother, Luke sings \"Plastic Jesus.\"[25] Greg Garrett also compares Luke to Jesus, in that like Jesus, he was not physically threatening to society because of his actions, and like Jesus' crucifixion, his punishment was \"out of all proportion.\"[26]Luke challenges God during the rainstorm on the road, telling him to do anything to him. Later, while he is digging and filling trenches and confronted by the guards, an inmate performs the spiritual \"No Grave Gonna Keep my Body Down.\"[26] Toward the end of the film, Luke speaks to God, evoking the conversation between God and Jesus at the Garden of Gethsemane, depicted in the Gospel of Luke.[26] Following Luke's talk, the film depicts Dragline as a Judas, who delivers Luke to the authorities, trying to convince him to surrender.[27] In the final scene, Dragline eulogizes Luke. He explains that despite Luke's death, his actions succeeded in defeating the system.[23] The closing shot shows inmates working on crossroads with the repaired photo of Luke and the two women superimposed.[25][28]Different traffic signs are used throughout the film, complementing the actions of the characters during the scenes. At the beginning, while Luke cuts the heads off the parking meters, the word \"Violation\" appears. Stop signs are also seen. Instances include the road-paving scene and the last scene, where the road meets at a cross section. Traffic lights turn from green to red in the background at the time Luke is arrested, while at the end, when he is fatally wounded, a green light in the background turns to red.[29]After writing the line, Pierson worried that the phrase was too complex for the warden. To explain its origin, he created a backstory that was included in the stage directions. Pierson explained that in order to advance in the Florida prison system, officers had to take criminology and penology courses at the state university, showing how the warden might know such words.[31] Strother Martin later clarified that he felt the line was the kind that his character would very likely have heard or read from some \"pointy-headed intellectuals\" who had begun to infiltrate his character's world under the general rubric of a new, enlightened approach to incarceration.[32] Some authors believe that the quotation was a metaphor for the ongoing Vietnam War conflict which was taking place during the filming,[33] and others have applied it towards corporations and even teenagers.[34] The quotation was listed at number 11 on the American Film Institute's list of the 100 most memorable movie lines.[35] An audio sample of the line is included in the Guns N' Roses songs \"Civil War\" and \"Madagascar.\"[36]","Release and reception":"Cool Hand Luke opened on November 1, 1967 at Loew's State Theatre in New York City. The proceeds of the premiere went to charities.[37] The film became a box-office success,[38] grossing US$16,217,773 in domestic screenings.[39] Kennedy won the Academy Award for Best Supporting Actor. Newman was nominated for the Academy Award for Best Actor, while Pearce and Pierson were nominated for the Academy Award for Best Adapted Screenplay and Schiffrin was nominated for the Academy Award for Best Original Score.[40]Rosenberg was nominated for best director by the Writers Guild of America and Conrad Hall was nominated for best cinematography by the National Society of Film Critics.Variety described Newman's performance as \"excellent,\" noting the supporting cast as \"versatile and competent.\"[41] The New York Times praised the film, remarking that Pearce and Pierson's \"sharp script,\" Rosenberg's \"ruthlessly realistic and plausible\" staging and direction and Newman's \"splendid\" performance with an \"unfaultable\" cast, \"elevates\" it among other prison films.[42] On review aggregator Rotten Tomatoes, the film holds an overall 100% \"Certified Fresh\" approval rating based on 45 reviews, with an average of 8.8 out of 10. The site's consensus is that \"Though hampered by Stuart Rosenberg's direction, Cool Hand Luke is held aloft by a stellar script and one of Paul Newman's most indelible performances.\"[43] Empire rated it five stars out of five, declaring the movie one of Newman's best performances.[44] Slant rated the film three stars out of four. It described Newman's role as \"iconic,\" also praising its cinematography and sound score.[45] Allmovie praised Newman's performance as \"one of the most indelible anti-authoritarian heroes in movie history.\"[46]Critic Roger Ebert included the film in his review collection The Great Movies, rating it four stars out of four.[16] Ebert stated that it was a \"great\" film and also an anti-establishment one during the time of the Vietnam War. He believed that the film was a product of its time and that no major film company would be interested in producing a film of such \"physical punishment, psychological cruelty, hopelessness and equal parts of sadism and masochism\" today. He praised the cinematography, capturing the \"punishing heat\" of the location, and stated that \"the physical presence of Paul Newman is the reason this movie works: The smile, the innocent blue eyes, the lack of strutting,\" which no other actor could have produced as effectively.[47]Contrary to the general consensus, Newman's biographer Lawrence J. Quirk thought that it was one of Newman's weaker performances, stating \"For once, even Newman's famed charisma fails him, for in Cool Hand Luke he completely lacks the charm that, say, Al Pacino in Scarecrow effortlessly exhibits when he plays a screw-up who also winds up (briefly) incarcerated.\"[48] However, Quirk added that Newman's performance was stronger in the second half and said that \"to be fair to Newman, he was trying his damnedest to play an impossible part, since Luke is a convict's rationalization fantasy and never a real character.\"[49] Some authors have criticized the film's depiction of prison life at the time. In a review entitled \"Sheer Beauty in the Wrong Place,\" Life, while praising the film's photography, criticized the influence of the visual styles in the depictions of the prison camp. The magazine declared that the landscapes turned it into \"a rest camp (in which) the men are getting plenty of sleep, food and healthy outdoor exercise,\" that despite the presence of the guards showed that there were \"worse ways to pay one's debt with society.\"[50] Ron Clooney also remarked that prisons \"were not hotels and certainly not the stuff of Cool Hand Luke movies.\"[51]In 2003, AFI's 100 Years...100 Heroes & Villains rated Luke as the number 30 greatest hero in American cinema,[52] and three years later, AFI's 100 Years...100 Cheers: America's Most Inspiring Movies rated Cool Hand Luke number 71.[53] Cool Hand Luke was included in the United States National Film Registry in 2005. In 2006, Luke was ranked 53rd in Empire magazine's \"The 100 Greatest Movie Characters.\"[54] The movie solidified Newman's status as a box-office star, while the film is considered a touchstone of the era.[55] In 2005, the United States Library of Congress deemed Cool Hand Luke to be \"culturally, historically, or aesthetically significant\" and selected it for preservation in the National Film Registry.[56]An episode of the TV show The Dukes of Hazzard entitled \"Cool Hands Luke and Bo\" was shown with Morgan Woodward playing \"Colonel Cassius Claiborne\" the boss of a neighboring county and warden of its prison farm. He wears the trademark shades of Boss Godfrey throughout the episode.The book was adapted into a West End play by Emma Reeves. It opened at London's Aldwych Theatre starring Marc Warren, but closed after less than two months, following poor reviews.[57] The show was chosen by The Times both as \"Critic's Choice\" and \"What the Critics Would Pay To See.\"[58] Nashville-based Christian alternative rock band Cool Hand Luke is named after the film.","cool_hand_luke":"Theatrical release poster by Bill Gold","box_office":"$16.2 million (North America)[1]","cinematography":"Conrad Hall","directed_by":"Stuart Rosenberg","release_dates":"November 1, 1967 (1967-11-01)|||||","Production":"Pearce, a merchant seaman who later became a counterfeiter and safe cracker, wrote the novel Cool Hand Luke, about his experiences working on a chain gang while serving in a Florida prison. He sold the story to Warner Bros. for US$80,000 and received another US$15,000 to write the screenplay.[3] After working in television for over a decade, Rosenberg chose it to make it his directorial debut in cinema. He took the idea to Jalem Productions, owned by Jack Lemmon.[4] Since Pearce had no experience writing screenplays, his draft was reworked by Frank Pierson. Conrad Hall was hired as the cinematographer,[5] while Paul Newman's brother, Arthur, was hired as the unit production manager.[6] Newman's biographer Marie Edelman Borden states that the \"tough, honest\" script drew together threads from earlier movies, especially Hombre, Newman's earlier film of 1967.[7] Director Stuart Rosenberg altered the original ending in the script, adding \"an upbeat ending that would reprise the protagonist's (and Paul Newman's) trademark smile.\"[8]Paul Newman's character, Luke, is a decorated war veteran who is sentenced to serve two years in a Florida rural prison. He constantly defies the authorities of the facility, becoming a leader among the prisoners, as well as escaping multiple times.[9] While the script was being developed, the leading role was initially considered for Jack Lemmon or Telly Savalas. Newman asked to play the leading role after hearing about the project. In order to develop his character, he traveled to West Virginia, where he recorded local accents and surveyed people's behavior.[5] George Kennedy turned in an Academy Award-winning performance as the leader of the prisoners, Dragline, who fights Luke, and comes to respect him.[10] During the nomination process, worried about the box office success of Camelot and Bonnie and Clyde, Kennedy invested US$5,000 in trade advertising to promote himself. Kennedy later stated that thanks to the award his salary was \"multiplied by ten the minute (he) won,\" also adding \"the happiest part was that I didn't have to play only villains anymore.\"[11]Strother Martin, known for his appearances in westerns,[12] was cast as the Captain, a prison warden who is depicted as a cruel and insensitive leader, severely punishing Luke for his escapes.[13] The role of Luke's dying mother, Arletta, who visits him in prison, was passed to Jo Van Fleet after it was rejected by Bette Davis.[14] Morgan Woodward was cast as Boss Godfrey, a laconic, cruel and remorseless prison officer who Woodward described as a \"walking Mephistopheles.\"[15] He was dubbed \"the man with no eyes\" by the inmates for his mirrored sunglasses.[16] The blonde Joy Harmon was cast for the scene where she teases the prisoners in washing her car after her manager, Leon Lance, contacted the producers. She auditioned in front of Rosenberg and Newman wearing a bikini, without speaking.[17]Filming took place on the San Joaquin River Delta.[6] The set, imitating a southern prison farm, was built in Stockton, California.[5] The filmmakers sent a crew to Tavares Road Prison in Tavares, Florida to take photographs and measurements, where Pearce had served his time.[18] The structures that were built in Stockton included barracks, a mess hall, the warden's quarters, a guard shack and dog kennels. The trees on the set were decorated with spanish moss that the producers took to the area.[6] The construction soon attracted the attention of a county building inspector who confused it with migrant worker housing and ordered it \"condemned for code violations.\"[5] The opening scene where Newman cuts the parking meters was filmed in Lodi, California.[6] Meanwhile, the scene in which Luke is chased by bloodhounds and other exteriors were shot in Jacksonville, Florida, at Callahan Road Prison. Luke was played by a stunt actor, using dogs from the Florida Department of Corrections.[18]Rosenberg wanted the cast to internalize life on a chain gang and banned the presence of wives on set. After Joy Harmon arrived on location, she remained for two days in her hotel room, and wasn't seen by the rest of the cast until shooting commenced.[19] Despite the directors' intentions, the scene was ultimately filmed separately.[6] Rosenberg instructed an unaware Harmon of the different movements and expressions he wanted.[19] Originally planned to be shot in half a day, Harmon's scene took three. For the part of the scene featuring the chain gang, Rosenberg substituted a teenage cheerleader, who wore an overcoat.[6]The Academy Award nominated original score was composed by Lalo Schifrin, who created tunes with a background in popular music and jazz.[20] While some of the tracks include the use of guitars, banjos and harmonicas, others include trumpets, violins, flutes and piano.[21]An edited version of the musical cue from the Tar Sequence (where the inmates are energetically paving the road) has been used for years as the theme music for local television stations' news programs around the world, mostly those owned and operated by ABC in the United States. Although the music was written for the film, it became more familiar for its association with television news, in part because its staccato melody resembles the sound of a telegraph.[22]","produced_by":"Gordon Carroll","starring":"Paul Newman|George Kennedy|J. D. Cannon|Robert Drivas|Lou Antonio|Strother Martin|Jo Van Fleet|","running_time":"126 minutes","music_by":"Lalo Schifrin","edited_by":"Sam O'Steen"}