{"based_on":"The Talking Cure  by Christopher Hampton (play) A Most Dangerous Method by John Kerr (non-fiction)","country":"Germany Canada United Kingdom","distributed_by":"Sony Pictures Classics","screenplay_by":"Christopher Hampton","Plot":"Sabina Spielrein arrives at the Burghölzli, the pre-eminent psychiatric hospital in Zurich, with a typical case of hysteria and begins a new course of treatment with the young Swiss doctor, Carl Jung. He is using word association and dream interpretation as part of his approach to Freud's radical new science of psychoanalysis, and finds that Spielrein's condition was triggered by the humiliation and sexual arousal she felt as a child due to her short-tempered father's habit of spanking her naked. These conflicting feelings were compounded by her instinctive knowledge (imparted by an angel's voice that speaks in German) that she had done nothing to deserve such a punishment and in fact that she may have been a stand-in for her mother in her father's abuse (since her mother was unfaithful). Also, her affluent Russian Jewish family afforded her an exceptional education in preparation for university study, although not on the subject of sex, and she was a virgin.Her intelligence and energy were immediately recognized and encouraged by Jung and Eugen Bleuler, the head of the hospital, and since she plans to study medicine they allow her to assist them in their experiments, including measuring the physical reactions of subjects during word association, to provide empirical data as a scientific basis for psychoanalysis and ameliorate the more sensational aspects of Freud's theories, which contend that all mental illness is rooted in childhood sexual experience, be it real or fantasy. She soon learns that much of this new science is founded on the doctors' observations of themselves, each other, and their families, not just their patients. The doctors correspond at length before they meet, and begin sharing their dreams and analysing each other, and Freud adopts Jung as his heir and agent.Jung finds in Sabina a kindred spirit with a unique perspective as her self-awareness sharpens, and their attraction deepens in what was already well known at the time as transference. Jung's resistance to the idea of infidelity, and breaking the taboo of sex with a patient, is undercut by the wild and unrepentant confidences of another brilliant, philandering, unstable psychoanalyst who comes under his care, Otto Gross. He decries monogamy in general and suggests that resistance to transference is symptomatic of the repression of normal, healthy sexual impulses, exhorting Jung to indulge himself with abandon.Jung finally begins their affair, which in the film includes rudimentary bondage and spanking Sabina at times. Things become even more tangled as he becomes her advisor to her dissertation; he publishes not only his studies of her as a patient but eventually her treatise as well. Her original ideas are rooted not only in her insights into her childhood trauma, but the intensity and conflicts in their relationship. Spielrein's thesis suggests that truly heroic, original creations can only emerge from the crucible of great conflict, such as the attraction of opposites and the breaking of taboos, and thus the instinct for creation is inextricably tied to a drive to destruction, and that these feelings and ideas are not restricted to sexual expression despite their roots in the biological drive to reproduce. This includes, finally, his refusal to give her a love child, which is the story behind the reference to Wagner's Der Ring des Nibelungen operas: they see themselves in the legend of Siegfried, the archetypal Teutonic hero born from a forbidden union. After his attempt to confine their relationship again to doctor and patient, she appeals to Freud for his professional help, and forces Jung to tell Freud the truth about their relationship, reminding him that she could have publicly damaged him but did not want to.Jung and Freud journey to America. However, cracks appear in their friendship as they begin to disagree more frequently on matters of psychoanalysis. Jung and Spielrein meet to work on her dissertation in Switzerland, and begin their sexual relationship once more. However, after Jung refuses to leave his wife for her, Spielrein decides to go to Vienna. She meets Freud, and expresses that although she sides with him, she believes he and Jung need to reconcile for psychoanalysis to continue to develop.Following Freud's collapse at an academic conference, Jung and Freud continue correspondence via letters, through which they decide to end their relationship, after increasing hostilities and accusations regarding the differences in their conceptualisation of psychoanalysis. Spielrein marries a Russian doctor and, while pregnant, visits Jung and his wife. They discuss psychoanalysis and Jung's new mistress. Jung confides that his love for Spielrein made him a better person.The film's footnote reveals that Otto Gross starved to death in Berlin in 1919, that Freud died of cancer in London in 1939 after being driven out of Vienna by the Nazis, that Spielrein trained a number of analysts in the new Soviet Union, before she, along with her two daughters, was shot by Nazis in 1942, and that Jung emerged from a nervous breakdown to become the world's leading psychologist before dying peacefully in 1961.","language":"English","Reception":"As of 27 March 2012, the review aggregator Rotten Tomatoes reported that 77% of critics gave the film positive reviews, based on 168 reviews.[14]Louise Keller reports from Urban Cinephile, \"The best scenes are those between Mortensen and Fassbender...the tension between the two men mounts as their views conflict: Freud insists that sex is an underlying factor in every neurosis while Jung, interested in spiritualism and the occult, is disappointed by what he considers to be Freud's 'rigid pragmatism.'\"[15]Andrew O'Hehir's review on Salon notes that on the one hand Freud's \"single-minded focus on sexual repression as the source of neurosis led to the creation of psychiatry as a legitimate medical and scientific field—one that was often resistant to change and dominated by authoritarian father figures.\" On the other hand, Sabina's effect on Jung, and \"the discoveries they had made together, both in the office and the bedroom,\" including the potential in \"a creative fusion of opposites—doctor and patient, man and woman, dark and light, Jew and Aryan,\" led to a falling out between the two men \"over a variety of issues, most notably the scientific limits of psychiatric inquiry.\"[16]In contrast, despite its exploration of \"the way our subconscious works, the way we repress, and suppress, natural urges—the constant battle between the rational and the instinctive, the civilized and the wild\", amid scenes of Jung's passionate affair with Sabina, the film \"feels distant, and clinical, in ways you wished it did not,\" according to Steven Rea of The Philadelphia Inquirer.[17] In an interview with The Daily Beast's Marlow Stern, Cronenberg himself is quoted as saying that those scenes were \"quite clinical. These were people who, even when they were having sex, they were observing themselves having sex because they were so interested in their reactions to things.\"[10]The film was listed at number 5 on Film Comment magazine's Best Films of 2011 list.[18]A Dangerous Method was listed on many critics' top ten lists.[19]","box_office":"$27,462,041[2]","a_dangerous_method":"Theatrical release poster","cinematography":"Peter Suschitzky","production_company":"Recorded Picture Company Telefilm Canada","directed_by":"David Cronenberg","release_dates":"2 September 2011 (2011-09-02) (68th Venice International Film Festival)|10 February 2012 (2012-02-10) (United Kingdom)||||","Production":"Hampton's earliest version of the screenplay, dating back to the 1990s, was written for Julia Roberts in the role of Sabina Spielrein, but the film was never realized. Hampton re-wrote the screenplay for the stage, before producer Jeremy Thomas acquired the rights for both the earlier script and the stage version.[6]The film was produced by Britain's Recorded Picture Company, with Germany's Lago Film and Canada's Prospero Film acting as co-producers.[7] Additional funding was provided by Medienboard Berlin-Brandenburg, MFG Baden-Württemberg, Filmstiftung NRW, the German Federal Film Board (de) and Film Fund, Ontario Media Development Corp and Millbrook Pictures.[8]Christoph Waltz was initially cast as Sigmund Freud, but was replaced by Viggo Mortensen due to a scheduling conflict.[9] Christian Bale had been in talks to play Carl Jung, but he too had to drop out because of scheduling conflicts.[10]Filming began on 26 May and ended on 24 July 2010.[8]A noted feature of the film is the extensive use in the musical score of leitmotifs from Wagner's third Ring opera Siegfried, mostly in piano transcription. In fact the composer Howard Shore has said that the structure of the film is based on the structure of the Siegfried opera.[11]","produced_by":"Jeremy Thomas Tiana Alexandra","starring":"Keira Knightley Viggo Mortensen Michael Fassbender Vincent Cassel","running_time":"99 minutes","music_by":"Howard Shore","edited_by":"Ronald Sanders","Release":"Universal Pictures released the film in German-speaking territories, while Lionsgate took rights to the United Kingdom[12] and Sony Pictures Classics distributed the film in the United States.[13] The film debuted at the Venice Film Festival in Italy on 2 September 2011.","budget":"$18 million[1]"}