{"country":"United States","distributed_by":"Universal Pictures (2011-present)","Plot summary":"Three men, previously unknown to each other, are arrested in New Orleans and placed in the same cell. Both Zack (Waits), a disc jockey, and Jack (Lurie), a pimp, have been set up, neither having committed the crime for which they have been arrested. Their cellmate Bob (Benigni, in his first international role[2]), an Italian tourist who understands minimal English, was imprisoned for manslaughter.Zack and Jack soon come to blows and thereafter avoid speaking to each other. Bob has an irrepressible need for conversation. He hatches a plan to escape, and before long the three are on the run through the swamp surrounding the prison. Hopelessly lost and with a simmering hatred between Jack and Zack almost causing the party to split up, they are brought together by Bob's ability to provide food. The trio eventually chance across a house in the forest, the residence of Nicoletta (Braschi). Bob and Nicoletta instantly fall in love, and Bob decides to stay with her in the forest. Zack and Jack go their separate ways—an unspoken, begrudging friendship hanging between them as they part.","down_by_law":"Promotional poster","language":"English","box_office":"$1,435,668[1]","cinematography":"Robby Müller","production_company":"PolyGram Pictures Island Pictures Black Snake","directed_by":"Jim Jarmusch","Release and reviews":"Down by Law was entered into the 1986 Cannes Film Festival.[3] It was dedicated to Pascale Ogier and Enzo Ungari.The film has a 90% positive rating on Rotten Tomatoes based on 29 reviews.[4] A reviewer for The New York Times called it a \"fable of poetic density\", with \"extraordinary performances\" by the three main actors.[5]","release_dates":"September 20, 1986 (1986-09-20) (Limited)|||||","Production":"The cinematography is by Robby Müller, who subsequently worked with Jarmusch on Mystery Train (1989), Dead Man (1995), and Ghost Dog: The Way of the Samurai (1999). The film stars musician Tom Waits, along with Jarmusch regulars John Lurie and Roberto Benigni. Benigni and Nicoletta Braschi, whose characters fall in love in the movie, later got married in real life. The music for the film was written by Lurie, and the songs \"Jockey Full of Bourbon\" and \"Tango Till They're Sore\" from Waits' Rain Dogs album are also featured.","produced_by":"Alan Kleinberg","starring":"Tom Waits John Lurie Roberto Benigni","running_time":"107 minutes","music_by":"John Lurie Tom Waits","edited_by":"Melody London","written_by":"Jim Jarmusch"}