{"country":"United States","distributed_by":"Artisan Entertainment","Plot":"Newlyweds, Mitch (Kip Pardue) and Julianne (Tara Reid), escape their normal lives and travel to a deserted island for a romantic and adventurous honeymoon, staying for two weeks at an old cottage in the middle of a secluded lake. They discover the area has no electricity or phone coverage, as Julianne tries to settle in despite her fear of water and inability to swim. Mitch enjoys the country life, and when Julianne wants to go into town to call her parents, to confirm her safety, he gets overprotective of her.While the two weeks go by, Julianne is eager to return home to start their new lives, but Mitch refuses to go back to that life, wanting them to stay put in his ideal setting, even when Julianne cannot find her birth control pills to prevent her pregnancy. When Julianne finds out Mitch had stalked her before they met and got married, she attempts to leave, and she sees a grave in the woods across the lake before Mitch brings her back. To ensure that she does not attempt to escape again, Mitch disposes of their boat.One night as Mitch is asleep, Julianne takes the key worn around his neck to open his safe box, having grown suspicious of it. She finds a property deed and learns he inherited the land from his deceased father and that he had often visited the property with his dad. Using a raft to head across the lake, she tries to escape again in Mitch's pick-up truck, only for Mitch to find her there, and knock her unconscious. Chained to an anchor and a tree, Julianne realizes how psychotic Mitch is, and that he knew everything about her, including her fear of water, using it to hold her at their location.Determined to leave, Julianne burns their matches, forcing Mitch to go into town to buy new ones. While he is gone, she gets an axe and breaks free from the chain. He comes back unexpectedly early, and she is almost discovered in her act of escape. When he finds out about it, Mitch begins physically abusing her. After he steps into a bear trap that she had buried, Julianne counterattacks and uses the shotgun he brought back to shoot him in the arm. Mitch remains alive, but he can barely move, as Julianne frees herself and leaves him for dead, with the shotgun. Overcoming her fear of water, she swims across the lake to the other side and later hears a gunshot, indicating that Mitch has killed himself. The last images show Julianne leaving her wedding ring in Mitch's disabled truck and walking away freely down a country road, to an unknown fate.","language":"English","cinematography":"Matthew Jensen","production_company":"Davis Entertainment Filmworks Splendid Pictures","directed_by":"Joel Viertel","release_dates":"December 16, 2003 (2003-12-16)|||||","devil's_pond":"Movie poster","produced_by":"Jed Baron Bill Block John Davis","starring":"Kip Pardue Tara Reid","running_time":"92 minutes","music_by":"Louis Febre","edited_by":"Jeff Wood","written_by":"Alek Friedman Mora Stephens Joel Viertel","budget":"$5,000,000"}