{"country":"United States","distributed_by":"Fine Line Features","Background":"The film received considerable attention at the 1993 Sundance Film Festival and opened in New York City in July. Weiss grew up in Baldwin, New York, close to the Five Towns, and lived with his father in Lawrence for a period of time. While emphasizing that the characters in the film are fictional, Weiss acknowledged that \"I'm going to try to hide during the Five Towns screening.\"[1]","Plot":"Andy, Trevor, and Billy are childhood friends. As young adults, Billy sells drugs and Andy does deliveries for him. One night, Trevor delivers instead and gets busted by narcs.5 years later, Trevor is released from jail and learns his girlfriend Laura is now with Billy. Trevor gets back with her and decides to rob a local mobster. Trevor wants some cash to buy Laura some gifts and Andy was told by some local mobsters that they are investing money with huge profits and he wants some cash to buy in. However, their robbery is very sloppy and the head mobster quickly figures out what happened. However, he and Andy's grandfather were good friends, so he tells Andy and Trevor that they can work off what they owe by smuggling stolen diamonds.Billy finds out what is going on and is mildly amused by it until he realizes that Trevor has gotten back together with Laura behind his back. He retaliates by convincing the mobsters that Trevor is a junkie and is stealing the diamonds that he is supposed to be delivering to supply his habit. He also convinces the diamond dealer that Trevor cannot be trusted with real diamonds and he gives him fake diamonds instead. When he delivers them to the mob, they quickly spot them as fakes and assume Trevor switched them.Billy figured by doing this, the mobsters would send a goon to kill Trevor and with him out of the picture, he could have Laura back with no blood on his hands. However, since he was the one to notify the mobsters, they tell him if he wants Trevor dead he has to do the killing himself.He finds Trevor at Laura's house having just made love and kidnaps him at gunpoint. He takes Trevor to a field to kill him. Even though Trevor begs for his life and Billy struggles with his conscience for the briefest of moments, he pulls the trigger anyway, killing Trevor in cold blood.It doesn't take long for Andy and Laura to notice Trevor missing and they get worried. Andy asks the local mobsters who are investing his money if they've seen Trevor and not knowing they are friends, they proudly tell him about how Billy became a made mobster by killing him. Andy sadly informs Laura that Trevor is gone and they privately mourn his death. Then Andy goes to Billy's house and asks him how he could do that to their friend. Without waiting for an answer, Andy pulls out a gun and points it at Billy. Billy tries to talk Andy into putting down the gun by reminding Andy that he is a made mobster and hurting him could get Andy killed. However, Andy decides to take his chances and shoots Billy anyway.Andy goes back to the local mobsters investing his money and convinces them that he has incurred some debt with some loan sharks and he needs his money returned to him to pay them off. They quickly get it for him and he pays off the head mobster in full what he owes.With his debt settled, he takes Trevor's motorcycle and leaves the city. Earlier Trevor had mentioned going to California on his motorcycle to start a new life and it is now implied that Andy will be following that advice.","language":"English","box_office":"$265,000","cinematography":"Michael Bonvillain","directed_by":"Rob Weiss","Reviews":"Peter Travers in Rolling Stone gave the film three stars, stating that Weiss made \"a sensational debut as writer and director\", despite the lack of stars or a big budget in a film written with the \"pitch-perfect eloquence about the mean streets he knows.\"[4]","Soundtrack":"A soundtrack containing hip hop and alternative rock was released on August 31, 1993 by Atlantic Records.","amongst_friends":"DVD cover","release_dates":"July 23, 1993 (1993-07-23) (U.S.)|November 26, 1993 (1993-11-26) (UK)||||","Production":"The film was produced for $900,000, most of which was raised from friends and family, and was shot on location in the Five Towns. With finances tight, a scene in which Weiss opens a bag of Doritos was filmed using yellow cardboard triangles.[1] The film was distributed by Fine Line Features, a division of New Line Cinema.Mira Sorvino was hired to work on the film in pre-production as third assistant director, then was promoted to casting director, then to assistant producer, and was finally offered a lead role. Positive reviews received for her role in the film helped jump start her career. Her grandfather, Ford Sorvino, appears in the film, providing comic relief.[2][3]","produced_by":"Matt Blumberg","starring":"Greg Bernardi Lou Bernardi","running_time":"86 minutes","Storyline":"The film portrays the conspicuous consumption and aggressive upward mobility among the mobsters and drug dealers living among the affluent communities in the Five Towns in southwestern Nassau County, New York. Weiss's voiceover introduces the film citing the contrasts in a community where \"you got judges living next to gamblers next to rabbis living next to dentists\" and \"16-year-old kids thinking and acting like they're Flavor Flav.\" The film tells the story of three boys — Billy (Joseph Lindsey), Trevor (Patrick McGaw) and Andy (Steve Parlavecchio) — who stray from their parents' professional careers to become low-level gangsters and end up involved in drug running and murder.","music_by":"Mick Jones","edited_by":"Leo Trombetta","written_by":"Rob Weiss","budget":"$1 million"}