{"air_bud":"Theatrical release poster","based_on":"Air Buddy by Kevin DiCicco","Sequels and spin-offs":"The film generated one theater-released sequel and many direct-to-video sequels and a spin-off film series. In each film, Buddy learns to play a different sport.","country":"Canada United States","distributed_by":"Buena Vista Pictures Distribution, Inc. (USA) Warner Bros. Pictures (Worldwide)","Plot":"The film opens with an alcoholic abusive clown, Norm Snively, and his Golden Retriever Old Blue, doing a show at a child's birthday party. Due to Old Blue causing trouble at the birthday party and both being tossed out of the house, Norm angrily takes him in a kennel to a dog pound, until the kennel falls off his truck. Old Blue is homeless until he meets 12 year old Josh Framm. After the death of his father, who died in a plane crash during a test flight, Josh moves with his mom Jackie and two-year-old sister Andrea from Virginia to Fernfield, Washington. Due to heartbreak over his father's passing, he is too shy to try out for his middle school's basketball team and to make any friends. He instead becomes the basketball team's manager, an absurd offer by Coach Barker which he accepts. He practices basketball by himself in a makeshift court that he sets up in a disused allotment, where he first meets Old Blue, renaming him Buddy. Josh soon learns that Buddy has the uncanny ability to play basketball. Josh then decides to take Buddy home with him.Jackie agrees to let him keep Buddy until Christmas and she plans to send him to the pound if his rightful owner isn't found; however, she sees how much Josh loves Buddy and how loyal he is. When Josh wakes up on Christmas and Buddy is not in his room, he goes downstairs and sees Buddy with a bow secured on his head. She gives Buddy to Josh as a present.Following Christmas, Josh finds a tryout invitation in his locker, although he does not know how it got there. Puzzled on what to do, he further discovers Buddy's talent when he learns that he can actually shoot a hoop. These facts together prompt Josh to follow through and try out and he gets a place on the team. At his first game, he befriends teammate Tom Stewart but earns the disdain of star player and team bully Larry Willingham. Meanwhile, Buddy leaves the backyard, goes to the school and shows up while the game is underway. He runs into the court, disrupts the game, and causes mayhem, but the audience loves him after he scores a basket.After the game and once Buddy is caught by Josh, Buddy finds Coach Barker abusing Tom by viciously pelting him with basketballs in an attempt to make him catch better. He leads Josh, Jackie and the school principal Ms. Pepper to the scene. As a result, Coach Barker is fired and later replaced by the school's kind hearted engineer, Arthur Chaney, at Josh's suggestion. Buddy becomes the mascot of Josh's school's basketball team and begins appearing in their halftime shows. After the Timberwolves lose one game the team has subsequent success and qualifies for the State Final.Just before the championship game, Norm appears after seeing Buddy on television. Hoping to profit off of Buddy's newfound fame, he forces Jackie to hand over Buddy as he has papers proving that Buddy legally belongs to him. Knowing that they have no choice, Jackie forces Josh to do the right thing and give Buddy back to Norm. After a period of feeling withdrawn and depressed, Josh then decides to rescue Buddy. He sneaks into Norm's backyard, which is muddy and where Buddy is chained up. Norm, who is on the phone scheduling performances, initially can't see Josh due to a stack of empty beer cans on his windowsill until it falls and Josh is caught in the act. Josh gets the chain from Buddy and both escape. Norm gets into his dilapidated clown truck to pursue Josh and Buddy through a public park in which Norm scatters a small swing set, a couple's picnic, the sign of Fernfield and hitting another car. The chase rages on to a parking lot near a lake, during which Norm's truck falls apart, and both crash into the water, but the latter survives, and swears vengeance. A few minutes after the chase, Josh then decides to set Buddy free in the forest to find a new home. Initially, his team is losing at the next championship to the opposing team until Buddy shows up. When it is discovered that there is no rule that a dog cannot play basketball, Buddy joins the roster to lead the team to a come from behind championship victory.Norm reappears and attempts to sue the Framm family for custody of Buddy despite losing his paperwork of ownership. Upon seeing Buddy, Judge Cranfield is disgusted and initially reluctant on a case over a dog, but agrees only under strict condition of the case being executed seriously. After numerous protests, Arthur walks in and suggests that Buddy chooses his owner. Due to being a fan of Arthur himself, Judge Cranfield accepts his proposal, and moves the court outside to the lawn. The rule is for both parties to call Buddy while staying put on their spots, and one single step towards the dog would result in a loss. During the calling, Norm takes out his roll of newspaper, which he often used as a punishment to hit Buddy, and shouts at him. Buddy angrily charges at Norm, bites him, tearing up the newspaper and runs towards Josh. Judge Cranfield grants legal custody of Buddy to Josh's family while an angry Norm runs at Buddy and Josh in a last ditched effort to try to get Buddy to himself, but he gets dragged away by the police and arrested for animal cruelty, while Josh and the rest of the citizens rejoice and gather around Buddy to welcome him home.","language":"English","Reception":"The film received mixed reviews. It holds a Rotten Tomatoes score of 43% based on 21 reviews.[3]","box_office":"$27,771,629[1]","cinematography":"Mike Southon","production_company":"Walt Disney Pictures Keystone Entertainment","directed_by":"Charles Martin Smith","release_dates":"August 1, 1997","produced_by":"Robert Vince Michael Strange William Vince","starring":"Air Buddy Michael Jeter Kevin Zegers Wendy Makkena Eric Christmas Bill Cobbs","running_time":"99 minutes","Home video release":"Air Bud was released to VHS on December 23, 1997 and to DVD on February 3, 1998 (with an open matte aspect ratio).[3] It was released again on March 3, 2009 in a special edition DVD set, featuring commentary from B-Dawg, Budderball, Rosebud, Buddha, Mudbud, Molly, and Buddy himself and presents the film in its Original Theatrical Aspect Ratio.","music_by":"Brahm Wenger","edited_by":"Alison Grace","written_by":"Paul Tamasy Aaron Mendelsohn","budget":"$3 million"}