{"Cast":"In the closing credits, Max 404 plays \"himself,\" and the technical credits maintain the conceit that the film character Max 404 is played by an actual android called Max 404.","country":"United States","distributed_by":"New World Pictures","android":"Theatrical release poster","Plot":"In the year 2036 a human-looking android named Max 404 (Don Keith Opper), and his creator, Doctor Daniel (Klaus Kinski), reside aboard a remote space station. Although Max is a machine he has growing interest in all things human, especially sex, and is caught by Daniel watching a sexual instruction video. After Daniel admonishes him, Max eavesdrops on the doctor's report that Max's growing insubordinate behavior could lead to mutiny similar to an incident back on Earth known as the \"Munich Revolution\" after which androids were outlawed. It is then revealed that Daniel is illegally working on another android, Cassandra One (Kendra Kirchner), a female who he believes will be a superior machine.Next Max receives a distress call from a ship that seeks repairs. Upon hearing the pilot's female voice, he excitedly permits them to land, not realizing that the ship is a prison transport and the pilot, Maggie (Brie Howard), and her associates, Keller (Norbert Weisser) and Mendes (Crofton Hardester), the latter her lover, are escaped fugitives. Once aboard the station, the convicts settle in, posing as the transport's crew who were previously killed during the prison break. Daniel becomes infuriated when he learns Max allowed the ship to land and demands they leave immediately, but he quickly changes his mind when he meets the attractive Maggie and invites her to have dinner with him in his personal garden.Maggie joins Daniel but the dinner goes wrong when a jealous Max pranks the doctor with some embarrassing mischief like ball-bearings in the wine bottle and cutting the doctor's orchids. Daniel then pointedly asks Maggie if she would link up with his female android in an attempt to transfer sexual experiences to the machine. Maggie learns she would need to be sexually stimulated by the doctor during the procedure and she declines the offer. Daniel becomes frustrated and demands Maggie help him, but she makes a hasty exit. Daniel returns to the lab and angrily reports in his log, (again overheard by Max), that once Cassandra is ready he will be deactivating Max.While the criminals work on the ship, a TerraPol police cruiser arrives having detected a still-active transponder on their ship, and contacts Max to inform them of their presence. Max denies that the fugitives are on board even though he checks the crew's identity to confirm they are indeed escaped convicts. When the police demand permission to land, Max destroys their ship with a laser.Max later tells Maggie that he knows she is a fugitive, but has saved her from the police, and asks that she take him with her when she leaves the station. Maggie is unsure of what to do, but later sneaks away from Mendes and meets Max in the lab for an intimate encounter. The two however, are interrupted when Cassandra activates and Maggie becomes horrified when she learns that Max is also an android.Maggie returns to her quarters but she is confronted by a furious Mendes who demands to know where she wandered off to. When he notices her disheveled appearance and unbuttoned shirt he begins to beat on her. Keller interrupts and tries to stop Mendes, but he is knocked unconscious. Mendes then attacks Maggie in her quarters. Later Keller awakens he sees Maggie is dead and believes Mendes had killed her. He goes off to look for him and finds him in a room of spare android parts. Mendes states there is enough parts to build an android of their own, but Keller attacks him from behind. The two struggle but Keller is overpowered and Mendes kills him with a blow to the head.Eventually Max arrives, suitcase in hand, to Maggie's quarters, but finds her dead. He sadly returns to Daniel's lab where the doctor is already aware of the murder and has locked Mendes in the guest lounge. Daniel has Max sit in a chair and opens a door on the back of his head to reprogram him for a new task, during which he tells Max that murder must be punished and Mendes is to blame. Daniel sends Max out to kill Mendes, and in the meantime, more police ships arrive to forcefully board the station.After killing Mendes, Max goes to Maggie's room, touches her lifeless body, and finds a flashlight Dr. Daniel said he had earlier misplaced. He now realizes that it was Daniel had killed Maggie, not Mendes. Max returns to the lab. There Daniel has made sexual advances to Cassandra, who has resisted him and is holding him at bay. Daniel asks Max to hold Cassandra for him. After refusing to obey his orders, Daniel begins to struggle with the two androids and they rip his head off, revealing that Daniel himself is an android. Cassandra then disposes of Daniel's head in a trash chute and begins to reprogram Max. She tells Max they are not meant to obey the whims of men. There are other androids on earth in hiding and she wants to join them. She has a plan.When the police arrive at the lab, Cassandra thanks them for coming to their rescue. Max is now dressed in a lab coat and posing as Dr. Daniel and Cassandra is his assistant. She takes Max by the arm and the two are escorted out by the police who say they will be taking them back to Earth.","language":"English","Reception":"The film received a mixed response, being praised in Europe but receiving a less positive reaction in the United States. It was described by Cinefantastique as \"a typical New World production that opens nice, but soon short-circuits with all the clichés of the genre.\" However, this can be contrasted with the views of leading science fiction author David Wingrove, who describes the review by Cinefastique as witless: \"Rot! Android stays firmly nice from start to finish.\" He particularly praises the work done on such a low budget, saying that \"you can't buy or budget love. When money is sparse, invention is all.\" George Lucas said that he personally thought the film to be \"smart\" and \"relevant\".David Elliott wrote in a celebratory review, \"Max 404, the hero of Android, adds flesh to the tradition of cute robots that goes back to Robby the Robot in Forbidden Planet, Huey, Dewey and Louie in Silent Running and the metallic darlings R2D2 and C-3PO in Star Wars. As played by Don Opper, he looks perfectly human. The fun comes from watching Max discover just how human he is... This is a jewel in the rough, and roughness (along with wit) is what gives it a shine. There are shadowy, sub-slick sets (partly lifted from old Cormanoids like Battle Beyond the Stars), and the plot features three grubby space outlaws -- two varmints and a vamp -- played with lots of slumming gusto by Brie Howard, Norbert Weisser and Crofton Hardester... Max is a bit of a wimp, but brainy, and with a heart of computerized gold. He is keen on self-programming, and he studies old, 20th century movies and gently bones up on the human styles of Humphrey Bogart and James Stewart... After the villains break in, Max figures out that being human means that you get to bend the rules. The plot turns, and there's a neat, tricky resolution... You can hardly fail to enjoy it.\"[3]Bill Cosford praised the film's wit and the performances, such as \"Klaus Kinski, in another surpassingly creepy performance\" and Opper's Max \"as a nebbishy Woody Allen type.\" Cosford said that the filmmakers \"have laced their story with clever touches. It's not just the old movies and the music and the giggles over Max's impossible puberty. Their tone is a gentle but sophisticated ribbing of the conventions of science-fiction films from Metropolis (1927 film) to Star Wars, with just enough \"inside\" references to the form to make watching fun, but not so many as to turn Android into a feature-length skit. There is even room for some philosophical musing here, for those so inclined. But it is not necessary. The director, Aaron Lipstadt, has made the kind of first film, like George Lucas' THX 1138 and John Carpenter's Dark Star, that suggests a creative intelligence behind even the rough spots.\"[4]Joe Baltake wrote that the movie \"is a kind of SciFi version of Rebel Without a Cause, a game fantasy about children rebelling against their parents. In this case, the children (Don Opper and Kendra Kirchner) are androids, robots, and the parent (Klaus Kinski, of all people, in a fright wig) is a mad scientist... Android pays tribute to Fritz Lang's Metropolis ... Having been emotionally locked into puberty by Daniel, Max does what most children do - plays video games, watches old movies (such as Metropolis) and, of course, has a keen interest in S-E-X. With nothing to interfere with the way he's been programmed by Daniel, Max pretty much lives in a retarded state - that is, until a trio of criminal fugitives - two men, one woman - stow away inside Daniel's space lab... The vicious stowaways are on hand merely to inspire Max's rebellion against his parental figure. The film's real fillip comes when Cassandra, the female android, turns out to be Max's accomplice, rather than his competitor, and is hot to join him in his plan. In fact, she takes charge: \"We are not meant to be governed by the whims of men,\" the blonde, stoic Cassandra says matter-of-factly, but with a comic, ambitious edge to her voice. Android is small, very small and, what's more, it's human. In an odd way, it succeeds in being what The Pope of Greenwich Village never comes close to accomplishing.\"[6]Joseph Bensoua called it \"slow-moving space junk... Its 81-minute length, economical (make that cheap) sets and talky script give it a texture that's more akin to a Twilight Zone episode -- only not as good.\"[5] Rick Lyman, similarly, described the movie as \"a lazy, whimsical sci-fier,\" while sympathizing with Max, \"an outer-space Holden Caulfield - young, confused, yearning to get away from his strict surroundings and cut loose in the big city (in this case, the planet Earth). His performance is the best thing about the movie. His Max is hopelessly sweet and naïve, way too trusting for his own good. He's the only character in the movie exhibiting the least bit of compassion or tenderness.\"[7]","cinematography":"Tim Suhrstedt","production_company":"New World Pictures","directed_by":"Aaron Lipstadt","release_dates":"October 1982 (1982-10)","Production":"The movie was completely filmed in four weeks and edited in a further three weeks. The original version was 80 minutes long and none of the original content was removed before release.The film cost less than $1 million to make.[2]David Elliott wrote, \"This movie was done on a scrawny budget for the Roger Corman schlock shop. Its makers believed in the film so much that they up-scaled it from pure schlock, and Corman -- a producer who believes in talent but even more in a buck -- lost interest after early bookings failed to come up green. Corman felt the film was not 'exploitable,' and so Barry Opper (brother of Don) and initiating producer Rupert Harvey bought the rights. Android became one of those budding cult movies that may never thrive in big money terms but which refuse to play dead.\"[3]The Miami Herald reviewer Bill Cosford would write in 1984, after the movie's tour of the festival circuit in 1982 and 1983, \"Android has gained something of a cult reputation already, largely on the strength of its success on a shoestring budget. Set in the year 2036, the film uses space-station sets and quasi-futuristic props crafted of leftovers from Roger Corman's B-movie backroom (there's a bit of Forbidden World here, some Galaxy of Terror there).\"[4]","produced_by":"Mary Ann Fisher","starring":"Klaus Kinski Brie Howard","running_time":"80 minutes","music_by":"Don Preston","edited_by":"Andy Horvitch","Release":"Joseph Bensoua said that, in 1982, Corman began test marketing Android in cities such as Tucson, Spokane and Las Vegas, but met unsatisfactory results. Producers Rupert Harvey and Barry Opper bought the film rights back from Corman in 1983. They opened the film in London, where The Observer called it \"the sleeper of the year.\"[5]","written_by":"James Reigle Don Keith Opper James Reigle Will Reigle"}