{"based_on":"Bless Me, Ultima  by Rudolfo Anaya","country":"United States","distributed_by":"Arenas Entertainment","screenplay_by":"Carl Franklin","Plot":"A drama set in New Mexico during WWII, centered on the relationship between a young man and an elderly medicine woman who helps him contend with the battle between good and evil that rages in his village.","bless_me,_ultima":"Film poster","language":"English","Reception":"Bless Me, Ultima has a 71% on Rotten Tomatoes based on 34 reviews.[9]","box_office":"$1,553,826[1]","cinematography":"Paula Huidobro","production_company":"Gran Via Productions Monarch Pictures Monkey Hill Films Tenaja Productions","directed_by":"Carl Franklin","release_dates":"February 22, 2013","Production":"Variety reported on March 2, 2009[3] that Christy Walton, heiress to the Walton fortune, had set up Tenaja Productions company solely to finance a film adaptation of Bless Me, Ultima. Monkey Hill Films' Sarah DiLeo is billed as producer with collaboration and support from Mark Johnson (producer) of Gran Via Productions (Rain Man, Chronicles of Narnia) and Jesse B. Franklin of Monarch Pictures. Carl Franklin (One False Move, Devil in a Blue Dress, Out of Time) was tapped as a writer and director. Walton and DiLeo shared a passion for the book, and the latter had succeeded in convincing Anaya to agree to the adaptation over six years back.[4]Shooting was scheduled in the Albuquerque, New Mexico area, and then resumed in Santa Fe for some interiors at Garson Studios on the Santa Fe University of Art and Design campus during the last week in October 2010.[5] Filming wrapped in Santa Fe, New Mexico in late 2010.[6] The film credits thank The College of Santa Fe, Ruby Ranch, The Pecos River Ranch, Santa Cruz Lake Recreational Area, and Albuquerque. Locations include Albuquerque, New Mexico, Rowe, New Mexico, Las Vegas, New Mexico, and Santa Fe, New Mexico.","produced_by":"Jesse Beaton Sarah DiLeo Mark Johnson","starring":"Luke Ganalon Míriam Colón","running_time":"106 minutes","music_by":"Mark Kilian","edited_by":"Alan Heim","Release":"Bless Me, Ultima premiered at the Plaza Theatre in El Paso, Texas on September 17, 2012[7] and received a general release in February 2013.[8]"}