{"based_on":"The story \"The Pentacle\"  by Robert Siodmak Alfred Neumann","country":"United States","distributed_by":"Warner Bros.","screenplay_by":"Arthur T. Horman Dwight Taylor","Plot":"On the surface, Richard (Humphrey Bogart) and Kathryn Mason (Rose Hobart) appear to be a happily married couple. But on their fifth wedding anniversary, Kathryn accuses Richard of having fallen in love with her younger sister, Evelyn Turner (Alexis Smith), who is visiting them. He does not deny it, but has resigned himself to leaving things as they are, since Kathryn certainly would not give him a divorce. At a party celebrating the couple's anniversary, hosted by family friend and psychologist Dr. Mark Hamilton (Sydney Greenstreet), Evelyn meets with Mark's handsome young colleague, Professor Norman Holdsworth (Charles Drake). On the way home, Kathryn suggests to Evelyn that their mother is lonely, so Evelyn decides to move back home. Distracted by this unwelcome news, Richard crashes their car and suffers a broken leg.Richard then decides to take desperate action. He pretends to require a wheelchair, even after his leg has healed. His puzzled physician, Dr. Grant (Grant Mitchell), diagnoses the problem as psychological, not physical, and suggests exercise, so a car trip to a mountain resort is arranged. At the last minute, Richard contrives to have to stay home for one night and finish some work. Going on ahead, Kathryn is blocked on a narrow, deserted mountain road by a parked car. Unexpectedly, Richard walks threateningly out of the fog. The audience is left to imagine him killing her. Next he pushes her car down a steep slope; it dislodges some logs which crash down and hide it. He returns home in time to set up an alibi by meeting with employees he had summoned. In their presence he twice phones the resort to be told she has not arrived; he then notifies the police that she is missing.However, things happen to make Richard wonder if Kathryn somehow survived. First, the police find a pickpocket in possession of a cameo ring that Richard and Evelyn identify as Kathryn's; the man admits to stealing it from a woman matching Kathryn's description after her disappearance. Then Richard smells Kathryn's perfume in their bedroom, finds her key to a home safe, and opens it: her wedding ring is inside.Mark suggests Richard and Evelyn join him on a fishing vacation to relieve the strain. Mark also invites Holdsworth, who takes the opportunity to ask Evelyn to marry him. She is undecided. When she tells Richard, he believes her hesitation is because of him. He tells her he loves her, and that she must feel the same about him, but she strongly denies it. (Later realizing his mistake, he encourages Holdsworth to try again.)Then a pawn shop claim ticket is mailed to Richard, addressed in what appears to be his wife's handwriting. At the pawn shop, he finds Kathryn's locket and her signature in the register, but when he returns with the police, the register is different and there is no locket. Finally, he sees a woman on the street who looks and is dressed like his wife. He follows her to an apartment, only to find that it is vacant, with no one inside.Unable to reconcile these occurrences any longer, Richard returns to the crime scene to see once and for all if Kathryn's body is inside the car. But Hamilton and the police are waiting for him. Kathryn's body had been found and removed long before, and now Richard is arrested. Hamilton reveals that he had been onto Richard since Richard's initial interview with the police, as Richard had mentioned that Kathryn was wearing a rose when he last saw her, but Hamilton had given her the rose after she left her house. Since that detail would have been insufficient to secure a conviction, Hamilton and the police then worked together to stage the events that made Richard suspect Kathryn was still alive, hoping he would return to look for her body, and thus prove that he'd known all along what happened to her.","language":"English","Reception":"Film historians Alain Silver and Elizabeth Ward comment, \"The film is particularly memorable for the use of the song 'Tango of Love' as leitmotif to indicate the putative reappearance of Katherine, with the background strings translating the scent of perfume; the opening trucking shot through the rain-soaked night up to the window of the Mason house, which allows the audience to eavesdrop on the dinner party; and the sinister appearance of Bogart as he steps out of the shadows to murder his wife.\"[1]Film critic Dennis Schwartz gave the film a mixed review, writing, \"Humphrey Bogart plays a wife murderer in this flawed film noir. Director Curtis Bernhardt leaves the plot with too many artificial devices to be effective ... The only thing that can't be faulted was the earnest performances of Bogie as the tortured killer and the supporting cast of Warner Brothers regulars.\"[2]","cinematography":"Merritt B. Gerstad","production_company":"Warner Bros.","directed_by":"Curtis Bernhardt","release_dates":"June 15, 1945 (1945-06-15TUnited States)","Production":"The movie was filmed in 1943, but its release was delayed until 1945 when a dispute over the rights to part of the story had been settled. In the meantime Warner Brothers decided to produce another movie on a similar theme, The Two Mrs. Carrolls, also starring Bogart and Smith, along with Barbara Stanwyck. The release of this film was also delayed, and it appeared in 1947.[citation needed]","produced_by":"William Jacobs","starring":"Humphrey Bogart Alexis Smith Sydney Greenstreet","running_time":"86 minutes","music_by":"Frederick Hollander","edited_by":"David Weisbart","conflict":"Theatrical release poster"}